{
  "id": "necklaces-317",
  "title": "Maharani Diamond and Emerald Haaram with Matching Jhumka Set - A Regal Heirloom",
  "category": "necklaces",
  "original_type": "Necklace & Earrings",
  "materials": [
    "22K Gold setting (916 Hallmark)",
    "Uncut Diamonds (Polki/VVS Clarity)",
    "Natural Emeralds (Zambian)",
    "South Sea Pearls. Exquisite Hyderabadi Polish for a lasting luster."
  ],
  "features": "This majestic Haaram features a graduating design with intricate Polki diamond settings interspersed with vibrant green emeralds. Delicate South Sea pearl drops add a touch of classic elegance. The central pendant boasts a larger emerald centerpiece surrounded by a floral motif of diamonds. The matching Jhumkas echo the necklace design with a similar floral crown and pearl drop. The setting uses traditional nakshi work to create texture and depth.",
  "colors": [
    "Predominantly gold with shimmering white diamonds",
    "complemented by the rich green of the emeralds and the creamy white of the pearls. The ruby red center provides a striking contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand festive occasions like Diwali. Traditionally worn at Muhurtham",
    "Seemantham",
    "and other important Telugu and South Indian ceremonies. Makes a statement at high-end social events."
  ],
  "description": "A truly magnificent Haaram set representing South Indian heritage and craftsmanship. The use of uncut diamonds and natural emeralds signifies opulence and prosperity. The Hyderabadi polish ensures a long-lasting shine. A timeless piece that can be passed down as a family heirloom, carrying cultural significance and sentimental value.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Polki Diamonds",
    "Emeralds",
    "South Sea Pearls",
    "22K Gold",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Thali Bottu",
    "Traditional Jewelry",
    "Bridal Set",
    "Telugu Jewelry",
    "Seemantham",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0406_0603",
  "collection": "diamond"
}