{
  "id": "necklaces-411",
  "title": "Lakshmi Kasu Mala Pendant - A Divine Touch of Heritage",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (approximately)",
    "Brilliant Cut Diamonds (clarity VS)",
    "Natural Emerald Beads. Features a Hyderabadi Polish for a lasting luster."
  ],
  "features": "Exquisitely handcrafted pendant featuring Goddess Lakshmi seated on a lotus. The design incorporates intricate filigree work and is adorned with sparkling diamonds set in a delicate floral pattern. The pendant is finished with a string of smooth, vibrant emerald beads for added elegance. Features temple design, bringing a piece of South Indian heritage.",
  "colors": [
    "Predominantly gold with the vibrant green of emeralds and the dazzling white of diamonds. A traditional and auspicious color combination in South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings",
    "religious ceremonies",
    "festivals like Diwali and Dussehra",
    "Seemantham or any occasion where traditional elegance is desired. Also a meaningful gift for loved ones."
  ],
  "description": "This Lakshmi Kasu Mala Pendant is more than just a piece of jewelry; it's a symbol of prosperity and blessings. The intricate craftsmanship and the use of high-quality materials make it a valuable heirloom. The divine motif and the harmonious blend of gold, diamonds, and emeralds create a timeless piece that will be treasured for generations.",
  "tags": [
    "Pendant",
    "Temple Jewellery",
    "Kasu Mala",
    "Lakshmi",
    "Goddess Lakshmi",
    "Emeralds",
    "Diamonds",
    "Gold",
    "South Indian Jewellery",
    "Hyderabad Jewellery",
    "Nakshi Work",
    "Devotional Jewellery",
    "Traditional Jewellery",
    "Bridal Jewellery",
    "Divine",
    "Hyderabadi Polish",
    "Jewelry",
    "Women's Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-08-26-14-08-17_0852",
  "collection": "diamond"
}