{
  "id": "necklaces-099",
  "title": "Contemporary Diamond and Gemstone Haaram - A Modern Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Faceted Emerald-Green Gemstone Inlays",
    "Rose-Cut Diamonds",
    "Baroque Pearls",
    "and Amethyst Drops. Meticulously crafted with Hyderabadi Polish for a lasting luster."
  ],
  "features": "This modern Haaram reimagines traditional South Indian necklace designs with geometric precision. The square emerald-green gemstone inlays are uniquely carved and interspersed with luminous baroque pearls. Each element is meticulously framed by rows of sparkling rose-cut diamonds. Delicate amethyst drops add a touch of feminine charm and movement. The central pendant echoes the square motif, creating a cohesive and striking design.",
  "colors": [
    "Emerald-Green",
    "White (Baroque Pearls)",
    "Amethyst (Light Purple)",
    "and Gold."
  ],
  "occasions": [
    "Perfect for modern weddings",
    "cocktail parties",
    "and special occasions where you want to make a sophisticated statement. Also suitable for contemporary Seemantham or Half-Saree functions with a modern twist."
  ],
  "description": "This haaram represents a fusion of traditional South Indian aesthetics with contemporary design sensibilities. The exquisite gemstone inlays, combined with the brilliance of rose-cut diamonds and the unique charm of baroque pearls, create a truly unique and eye-catching piece. The Hyderabadi polish ensures lasting beauty and heirloom quality.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Emerald",
    "Amethyst",
    "Baroque Pearls",
    "Diamond",
    "Rose Cut Diamonds",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "Seemantham",
    "Half-Saree",
    "Cocktail Jewelry",
    "Gemstone Necklace"
  ],
  "original_id": "diamond_jewellery_DPNK8-1052_0332",
  "collection": "diamond"
}