{
  "id": "necklaces-348",
  "title": "Diamond Emerald Leaf Haaram with Matching Earrings",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Yellow Gold",
    "High-Quality Diamonds (VVS Clarity",
    "Brilliant Cut)",
    "Natural Emerald Cabochon. Hyderabadi Polish for lasting brilliance."
  ],
  "features": "Delicate leaf-motif design, meticulously set with sparkling diamonds. Features a central Emerald cabochon pendant. The accompanying earrings echo the necklace's design, creating a cohesive and elegant set. The diamonds are set in a prong setting to maximize brilliance and fire. Gold chain with intricate mesh-like construction.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "and Dazzling White (Diamonds)."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "receptions",
    "engagements",
    "or any special occasion where you desire a touch of sophisticated glamour. Perfectly complements traditional silk sarees or modern evening wear."
  ],
  "description": "This stunning necklace set combines timeless elegance with contemporary design. The vibrant emerald accent and the shimmering diamonds create a captivating and luxurious look. Crafted with the highest quality materials and attention to detail, this Haaram is a true heirloom piece, a reflection of your refined taste and appreciation for fine jewelry. The design is lightweight and comfortable for extended wear, and the high-quality materials ensure lasting brilliance.",
  "tags": [
    "Diamond Necklace",
    "Emerald Necklace",
    "Haaram",
    "Addigai",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Fine Jewelry",
    "Diamond Set",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Gold Necklace",
    "Emeralds",
    "VVS Diamonds",
    "Leaf Motif",
    "Contemporary Design",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0462_0644",
  "collection": "diamond"
}