{
  "id": "necklaces-688",
  "title": "Emerald Blossom Neckpiece - A Delicate Floral Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "High-Quality Cubic Zirconia",
    "Faceted Emeralds (estimated 3-4 carats total)",
    "South Sea Pearls (approx. 10mm). Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This necklace features a delicate floral design, intricately set with sparkling Cubic Zirconia. The central pendant showcases a striking emerald surrounded by CZ accents and adorned with lustrous South Sea pearl drops. The chain is designed with alternating heart and floral motifs, blending traditional and modern aesthetics. The setting style provides maximum brilliance for the CZs.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "White (CZs)",
    "Creamy White (Pearls). The contrast between the gold and emeralds creates a rich",
    "royal effect."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "anniversaries",
    "or any special occasion where you want to add a touch of elegance. Suitable for Sangeet or modern Mehendi ceremonies as well."
  ],
  "description": "This necklace offers a modern interpretation of the classic Haaram. The combination of high-quality materials, meticulous craftsmanship, and elegant design makes it a timeless treasure. The emeralds are carefully selected for their vibrant color and clarity. The Hyderabadi polish ensures lasting brilliance, making it a valuable investment.",
  "tags": [
    "Necklace",
    "Haaram",
    "Emerald",
    "Pearls",
    "CZ",
    "Cubic Zirconia",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Engagement Jewelry",
    "Floral Design",
    "Fine Jewelry",
    "Engagement",
    "Wedding",
    "Party wear",
    "Women's fashion"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-50 2_1194",
  "collection": "diamond"
}