{
  "id": "waistbands-032",
  "title": "Diamond & Emerald Vaddanam: The 'Ratna Kanchi' Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "18K Yellow Gold base",
    "meticulously set with brilliant-cut Diamonds (VS Clarity",
    "G-H Color). Adorned with round",
    "faceted Zambian Emeralds. Featuring our signature Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite Vaddanam showcases a geometric diamond pattern, interspersed with emerald detailing. The central pendant features a floral motif, surrounded by a cascading diamond arrangement, with dangling emerald drops. The design blends modern aesthetics with traditional South Indian influences, providing a versatile statement piece.",
  "colors": [
    "Primarily shimmering white (diamonds) and lush green (emeralds) against a warm yellow gold backdrop. The color palette symbolizes prosperity and new beginnings in South Indian culture."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "receptions",
    "pre-wedding events (like Pellikuthuru)",
    "and significant festive occasions like Diwali and Ugadi. Can also be worn for upscale parties and cultural events",
    "adding a touch of timeless elegance."
  ],
  "description": "A harmonious blend of traditional South Indian design and modern sophistication. The high-quality diamonds and emeralds ensure enduring value. The exquisite craftsmanship and Hyderabadi polish make this Vaddanam a true heirloom piece. This piece is not just jewelry; it's a statement of heritage and refined taste.",
  "tags": [
    "Vaddanam",
    "Oddiyanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "ஒட்டியாணம்",
    "ఒడ్డాణం",
    "Kamarband"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-57-22_2167",
  "collection": "sjpl"
}