{
  "id": "necklaces-1487",
  "title": "Manikyam & Pachala Grand Haaram - Diamond and Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish",
    "Fine Quality Diamonds (VS Clarity",
    "G Color)",
    "Natural Emeralds (Pachala) with excellent color saturation",
    "and Rubies (Manikyam). Gold purity certified by BIS hallmark."
  ],
  "features": "A stunning adaptation of the traditional Haaram, this piece features a delicate floral motif throughout. The central pendant showcases an intricately designed cluster of diamonds surrounding a brilliant-cut emerald. The cascading design is further enhanced with emerald drops and ruby accents. Handcrafted by skilled artisans from Hyderabad, this necklace showcases a blend of traditional and contemporary design elements. The setting is meticulously done to maximize the brilliance of each diamond and gemstone.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "Ruby Red",
    "and Sparkling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaahaalu)",
    "engagements (Nischitartham)",
    "reception parties",
    "and other grand celebrations. Also suitable for cultural events (Sankranti",
    "Diwali) and festive occasions. This piece is also a great choice for contemporary formal events",
    "adding a touch of tradition to modern attire."
  ],
  "description": "A timeless heirloom piece combining the elegance of diamonds, the vibrancy of emeralds and rubies, and the richness of 22K gold. Handcrafted by award-winning artisans with decades of experience. The design is both traditional and contemporary, making it versatile for various occasions. Features BIS hallmarked gold ensuring its purity and value. This Haaram embodies the cultural heritage and refined craftsmanship of Hyderabad.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Ruby Necklace",
    "Manikyam",
    "Pachala",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Vivaahaalu",
    "Nischitartham",
    "Temple Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "Grand Haaram",
    "Designer Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-46-45_2105",
  "collection": "sjpl"
}