{
  "id": "earrings-051",
  "title": "Divya Kanakaratna Jhumkas - Exquisite Gold and Ruby Bell Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold)",
    "High-Quality Cubic Zirconia (CZ) stones",
    "Faceted Ruby/Ratna (approximately 1 carat each). Features a brilliant Hyderabadi Polish for enduring shine."
  ],
  "features": "Classic bell-shaped Jhumka design with intricate filigree work adorned with shimmering CZ stones. The top showcases a delicate flower motif with a vibrant ruby center. Finished with traditional dangling gold beads (gundlu) for a melodic sway. The setting style is a pavé setting to highlight the cz stones.",
  "colors": [
    "Predominantly gold with striking ruby red accents and dazzling white CZ stones."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "festive occasions like Diwali and Sankranti",
    "and traditional South Indian ceremonies such as muhurtham",
    "seemantham",
    "and half-saree functions. Also suitable for adding a touch of ethnic elegance to contemporary outfits."
  ],
  "description": "These Jhumkas embody the rich heritage of South Indian jewelry. Crafted with meticulous attention to detail, the piece seamlessly blends traditional aesthetics with modern brilliance. The high-quality materials ensure lasting beauty and value. The ruby accent adds a touch of regal sophistication. A timeless design to be treasured for generations. The CZ stones offer a diamond-like shine at an accessible price point.",
  "tags": [
    "Jhumka",
    "Karnaphoolu",
    "Gold Earrings",
    "Ruby Earrings",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "CZ Earrings",
    "Ratna",
    "Gundlu",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_6f4667a1-c911-4ebc-88b0-58731d25e936_0133",
  "collection": "diamond"
}