{
  "id": "bangles-048",
  "title": "Emerald and Diamond Kada - Pachala Kankaanaalu",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features oval-cut Emeralds of high clarity and brilliant-cut Diamonds. Gold hallmarked for purity."
  ],
  "features": "This intricately designed Kada showcases a classic three-row design. The central row is adorned with vibrant Emeralds, while the flanking rows feature delicate pavé-set diamonds that sparkle brilliantly. The Kada has a smooth, comfortable inner finish, designed for everyday wear. Incorporates a secure clasp for easy wear and removal.",
  "colors": [
    "Lustrous Gold",
    "Deep Green Emeralds",
    "and dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals (like Sankranthi or Ugadi)",
    "Seemantham",
    "or any special occasion where you want to showcase traditional South Indian elegance. Also suitable for contemporary parties and celebrations."
  ],
  "description": "This Emerald and Diamond Kada is a timeless piece that combines traditional South Indian design with modern elegance. The high-quality Emeralds and Diamonds, coupled with the impeccable Hyderabadi craftsmanship, ensure that this piece will be cherished for generations. The secure clasp and smooth finish make it comfortable to wear, while the brilliant sparkle adds a touch of glamour to any outfit. Pachala symbolizes prosperity and well-being, making this Kankaanaalu an auspicious and stylish addition to your jewelry collection.",
  "tags": [
    "Bangles",
    "Kada",
    "Kankaanaalu",
    "Emerald",
    "Pachala",
    "Diamond",
    "22K Gold",
    "Hyderabadi Polish",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Fine Jewelry",
    "Indian Jewelry",
    "Engagement Gift",
    "Birthday Gift",
    "Luxury Jewelry"
  ],
  "original_id": "bangles_IMG-20240902-WA0056_1664",
  "collection": "bangles"
}