{
  "id": "necklaces-1169",
  "title": "Lakshmi Kasu Mala Pendant - Divine Emerald and Diamond Adornment",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (approximately 31.9 grams)",
    "Natural Emerald (2.60 carats)",
    "Natural Rubies (3.95 carats)",
    "Diamonds (4.03 carats)",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite pendant showcases the goddess Lakshmi seated atop a lotus, flanked by meticulously crafted peacocks. Intricate diamond-studded filigree work accentuates the detailing of the goddess and peacocks. A central oval-cut emerald provides a vibrant contrast. The pendant is further embellished with dangling, diamond-studded spherical elements, adding a playful yet elegant touch. Nakshi work is evident in the detailing of Lakshmi's form and attire.",
  "colors": [
    "Primarily gold with shimmering diamond accents",
    "a vibrant green emerald center",
    "and subtle red ruby highlights."
  ],
  "occasions": [
    "Ideal for traditional South Indian weddings (Muhurtham)",
    "Seemantham ceremonies",
    "festivals like Diwali and Ugadi",
    "and family gatherings. Also suitable for upscale modern events",
    "adding a touch of cultural elegance to any outfit."
  ],
  "description": "This Lakshmi Kasu Mala Pendant is a symbol of prosperity, fortune, and grace. The high-quality gemstones and expert craftsmanship ensure lasting beauty and durability. The blend of traditional design with modern diamond accents makes it a timeless piece. Owning this pendant is not just about adorning yourself with beautiful jewelry, but also embracing the rich cultural heritage of South India.",
  "tags": [
    "Lakshmi Pendant",
    "Kasu Mala",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Emerald",
    "Diamond",
    "Ruby",
    "Nakshi Work",
    "Devotional Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Subham Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-08-26-14-08-18 2_1721",
  "collection": "sjpl"
}