{
  "id": "necklaces-266",
  "title": "Exquisite Kundan Jadau Haaram with Emerald & Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Kundan Setting",
    "Emeralds (Panche)",
    "Rubies (Ratna)",
    "Cultured Pearls. Features the signature Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "This magnificent Haaram features a classic Kundan Jadau setting, meticulously handcrafted by skilled artisans. The intricate design incorporates floral motifs and delicate engravings, reflecting the rich heritage of South Indian craftsmanship. A prominent central pendant adds to the grandeur. The design includes gold beads dangling at the bottom",
  "colors": [
    "Primarily gold with brilliant white from the Kundan stones",
    "punctuated by vibrant green Emeralds and deep red Rubies. The combination represents prosperity",
    "health",
    "and auspiciousness in South Indian traditions."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "engagements (Nischitartham)",
    "Seemantham",
    "and other significant celebrations. Also suitable for upscale parties and formal events where you want to make a statement."
  ],
  "description": "This Haaram is not just a piece of jewelry; it's an heirloom. The impeccable Kundan craftsmanship, combined with the brilliance of Emeralds and Rubies, makes it a timeless investment. The rich cultural significance and traditional design add to its value, making it a cherished piece for generations.",
  "tags": [
    "Haaram",
    "Kundan",
    "Jadau",
    "Emerald",
    "Ruby",
    "Panche",
    "Ratna",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Necklace",
    "Heirloom Jewelry",
    "Gold Necklace",
    "Vivaha",
    "Nischitartham",
    "Seemantham",
    "कंठी (Kanti)"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0346_0543",
  "collection": "diamond"
}