{
  "id": "necklaces-1186",
  "title": "Emerald Radiance Grand Haaram - A Timeless Legacy",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (సువర్ణం)",
    "Exquisite Emeralds (పచ్చలు) with excellent clarity",
    "brilliant-cut Diamonds (వజ్రాలు)",
    "and lustrous South Sea Pearls (ముత్యాలు). Crafted with traditional Hyderabadi Polish for a lasting shine."
  ],
  "features": "This majestic Haaram showcases a floral motif arrangement adorned with emeralds and diamonds, exuding regal charm. The intricate diamond work is meticulously handcrafted. Delicate pearl droplets add a touch of grace. The pendant features a larger emerald center stone and is framed by a complex filigree design that blends tradition with contemporary aesthetics.",
  "colors": [
    "Primarily gold with vibrant green emeralds",
    "sparkling white diamonds",
    "and creamy white pearls. This classic color palette is considered auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham (సీమంతం)",
    "and other grand celebrations (వేడుకలు). Also ideal for making a statement at high-end social gatherings or cultural events."
  ],
  "description": "This Grand Haaram is a heirloom-worthy piece, embodying the rich cultural heritage of South India. The combination of precious gemstones and expert craftsmanship ensures lasting beauty and value. The intricate design and traditional motifs make it a truly unique and unforgettable statement piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamonds",
    "Pearls",
    "South Sea Pearls",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "канṭhābharaṇaṁ",
    "పెద్ద హారం",
    "పచ్చలు",
    "వజ్రాలు",
    "ముత్యాలు",
    "వివాహం",
    "నిశ్చితార్థం",
    "సీమంతం",
    "వేడుకలు"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-09-1_1738",
  "collection": "sjpl"
}