{
  "id": "necklaces-782",
  "title": "Divine Emerald & Diamond Chowkdi Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Finest Quality Natural Diamonds (VS Clarity",
    "E-F Color)",
    "Faceted Emeralds (Zambian Origin)",
    "South Sea Pearls (Moti). Hyderabadi Polish for a lasting luster."
  ],
  "features": "This opulent Chowkdi Haaram showcases intricate filigree work (తీగ పని) interspersed with floral motifs and paisley designs (చింత పండు ఆకారం). The collar-style necklace features square-cut emeralds at the top, leading to a cascading design of diamonds. A large, oval-cut emerald is prominently set at the center. Delicate pearl drops (ముత్యాలు) adorn the lower edge, adding a touch of traditional elegance. Features intricate Nakshi work details.",
  "colors": [
    "Gold (yellow)",
    "Emerald (green)",
    "Diamond (white)",
    "Pearl (creamy white)"
  ],
  "occasions": [
    "Ideal for grand occasions such as weddings (పెళ్లి)",
    "receptions",
    "Seemantham (సీమంతం)",
    "and other significant celebrations. A statement piece for the Telugu bride (పెళ్లికూతురు)."
  ],
  "description": "This Haaram is a testament to timeless South Indian craftsmanship and embodies the grandeur of Hyderabadi jewelry. The combination of diamonds, emeralds, and pearls is considered auspicious and traditionally worn by brides. The intricate design and high-quality materials make it a valuable heirloom piece to be cherished for generations. Its significant gold and diamond weight also contributes to its investment value.",
  "tags": [
    "Haaram",
    "Chowkdi",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "పెళ్లి హారం",
    "కంఠాభరణం",
    "ముత్యాలు",
    "వజ్రాలు",
    "పచ్చలు",
    "సంప్రదాయ ఆభరణాలు",
    "Nakshi Work",
    "Filigree",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-24-13-54-20_1317",
  "collection": "diamond"
}