{
  "id": "necklaces-325",
  "title": "Diamond Floral Nakshi Haaram Set with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace and Earrings",
  "materials": [
    "High-quality simulated diamonds meticulously set in gold-plated alloy. Features a central Emerald gemstone and Ruby gemstone",
    "accented with lustrous fresh water pearls. Showcases a fine Hyderabadi Polish."
  ],
  "features": "This exquisite Haaram features a contemporary floral Nakshi design, a modern twist on the traditional South Indian handcrafted jewelry. The delicate floral patterns are intricately studded with high quality simulated diamonds. The necklace culminates in a floral pendant with an eye-catching teardrop Emerald in the center, surrounded by simulated diamonds and pearls. Matching stud earrings echo the necklace's design with a Ruby gemstone and Emerald gemstone.",
  "colors": [
    "Predominantly gold with brilliant white diamonds",
    "vibrant green emerald",
    "and rich red ruby accents. The pearls provide a soft",
    "elegant contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "engagements (Nischitartham)",
    "festive occasions (Dasara",
    "Diwali)",
    "or upscale social gatherings. A sophisticated choice for modern brides and anyone seeking a touch of South Indian heritage with contemporary flair."
  ],
  "description": "This Haaram set is a stunning blend of tradition and modernity. The contemporary design, combined with the traditional nakshi technique, makes it a unique and versatile piece. The brilliant diamonds, emerald and ruby gemstones offer a luxurious sparkle, while the pearls add a touch of understated elegance. This piece is a true statement of refined taste and timeless beauty. The quality materials and craftsmanship ensure its longevity and enduring value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Earrings",
    "South Indian Jewelry",
    "Diamond Jewelry",
    "Nakshi Work",
    "Emerald",
    "Ruby",
    "Pearls",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Vivaha Mahotsavam",
    "Nischitartham",
    "Contemporary Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Haram",
    "Kasulaperu"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0438_0621",
  "collection": "diamond"
}