{
  "id": "earrings-319",
  "title": "Exquisite Kundan Jhumka Earrings with Emerald Accent",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated Alloy",
    "High-Quality Kundan Stones",
    "Simulated Emerald",
    "Cultured Pearls. Hyderabadi Polish applied for lasting luster."
  ],
  "features": "Traditional Jhumka design with intricate Kundan stone settings. Features a floral motif Kundan base, a circular pendant with a central pearl, and a classic bell-shaped Jhumka bottom adorned with hanging pearls. A single emerald stone is set at the top for added elegance. The setting style showcases excellent craftsmanship, providing a seamless blend of traditional and modern aesthetics.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Pearl White",
    "and Sparkling White (Kundan stones)."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals like Diwali and Sankranthi",
    "traditional functions (Muhurtham",
    "Seemantham",
    "Pelli Pandiri)",
    "and any festive occasion where you want to add a touch of South Indian elegance. Equally suitable for modern parties and celebrations."
  ],
  "description": "These Jhumka earrings represent the timeless elegance of South Indian jewelry. The superior Kundan stone setting, complemented by the emerald accent and Hyderabadi polish, ensures both beauty and longevity. The classic design makes them a versatile addition to any jewelry collection. Their cultural significance and inherent beauty make them an ideal heirloom piece.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Kundan",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Traditional Earrings",
    "చెవి దుద్దులు",
    "Bangles",
    "Indian Jewelry",
    "Hyderabadi Polish",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-35 7_1348",
  "collection": "diamond"
}