{
  "id": "necklaces-764",
  "title": "Aadhya Emerald & Diamond Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish",
    "Oval-cut Emeralds (15.93 carats)",
    "Brilliant-cut Diamonds (8.13 carats) with VVS clarity",
    "and genuine South Sea Pearls (21.30 carats)."
  ],
  "features": "This exquisite haaram features a floral design with oval-cut emeralds surrounded by a halo of dazzling diamonds. The intricate diamond work extends upward, creating a graceful collar. The necklace is finished with lustrous South Sea pearls delicately dangling from the lower edge, adding a touch of elegance and movement. Features a secure clasp.",
  "colors": [
    "Vibrant Emerald Green",
    "Sparkling White Diamonds",
    "Creamy White South Sea Pearls",
    "and Warm Yellow Gold."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement ceremonies (nischitartham)",
    "or any grand celebration. Ideal for brides seeking a statement piece with a touch of tradition and contemporary flair. Also suitable for special occasions like seemantham or upscale cultural events."
  ],
  "description": "This breathtaking haaram is a testament to exquisite craftsmanship and timeless elegance. The combination of vibrant emeralds, sparkling diamonds, and lustrous South Sea pearls creates a piece of unparalleled beauty. The traditional design is infused with a modern sensibility, making it a versatile addition to any jewelry collection. The high-quality materials and impeccable craftsmanship ensure that this haaram will be treasured for generations to come. A symbol of prosperity and good fortune, making it a meaningful gift for a loved one.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emeralds",
    "Diamonds",
    "South Sea Pearls",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "22K Gold",
    "Kanthabharanam",
    "Mutyalu",
    "Pachalu",
    "Vairalu",
    "Hyderabadi Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-05_1270",
  "collection": "diamond"
}