{
  "id": "necklaces-1297",
  "title": "Diamond Flower Tikkabindi Pendant - Modern Maang Tikka Accent",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "F Color). Features a durable",
    "high-shine finish."
  ],
  "features": "This exquisite pendant features three interconnected floral motifs, each meticulously set with brilliant-cut diamonds. The central floral design is framed by two leaf designs, adding a touch of natural elegance. Each petal and leaf are pavé set, maximizing the diamond's brilliance. The bottom of the pendant displays a series of dangling diamond clusters, adding movement and sparkle. It's designed as a modern tikkabindi to be added as an accent to a Maang Tikka. The gold is polished to a high shine for a classic look.",
  "colors": [
    "Predominantly gold and white",
    "with the dazzling brilliance of the diamonds creating a vibrant",
    "light-reflecting effect."
  ],
  "occasions": [
    "Perfect as an accent to a Maang Tikka for weddings (muhurtham)",
    "receptions",
    "engagements",
    "or any special occasion where a touch of sophisticated sparkle is desired. Also suitable for upscale parties and celebrations."
  ],
  "description": "This diamond pendant offers a unique blend of contemporary design and timeless elegance. The high-quality diamonds provide exceptional sparkle, while the durable 18K gold ensures lasting beauty. It makes a statement piece.",
  "tags": [
    "Diamond Pendant",
    "Tikkabindi",
    "Maang Tikka Accent",
    "Gold Jewelry",
    "Flower Design",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Engagement Jewelry",
    "South Indian Jewelry",
    "VVS Diamonds",
    "Brilliant Cut",
    "Pavé Setting",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Pendili Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-23 2_1895",
  "collection": "sjpl"
}