{
  "id": "necklaces-228",
  "title": "Mohana Mani Haaram: Emerald and Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features a central oval-cut Emerald (approx. 2 carats",
    "good clarity)",
    "round-cut Rubies (approx. 0.25 carats total weight)",
    "and brilliant-cut Diamonds (VS clarity",
    "G-H color",
    "approx. 3 carats total weight)."
  ],
  "features": "This Haaram showcases a contemporary take on traditional Nakshi craftsmanship. The intricately detailed pendant depicts peacocks facing inwards towards the Emerald, surrounded by floral motifs. Small floral drops with diamond accents hang delicately from the necklace strand. The necklace features a series of diamond-studded circles interspersed with floral motifs. The peacock detailing is reminiscent of classic temple jewelry, blending tradition with modern aesthetics.",
  "colors": [
    "Primary gold tone with vibrant green from the Emerald",
    "contrasting with the fiery red of the Rubies. The Diamonds provide a brilliant white sparkle."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "engagement ceremonies",
    "and other grand celebrations. Can also be worn for high-profile social gatherings where you want to make a statement."
  ],
  "description": "This piece combines the best of both worlds - the timeless elegance of traditional South Indian jewelry with a modern, wearable design. The high-quality gemstones and meticulous craftsmanship ensure lasting beauty and value. The Hyderabadi polish adds a unique luster, making it a true heirloom piece ('Sampradaya Aabharanam'). The use of peacock motifs signifies prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Diamond",
    "Gold",
    "Nakshi",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Vivahaalu",
    "Sampradaya Aabharanam",
    "Hyderabadi Jewelry",
    "Grand Necklace",
    "Peacock Jewelry",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0308_0505",
  "collection": "diamond"
}