{
  "id": "necklaces-951",
  "title": "Raani Haaram: Grandeur in Ruby, Emerald, and Diamond",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Natural Rubies (Cabochon Cut)",
    "Emeralds (Cabochon Cut)",
    "and Sparkling Polki Diamonds. The pearls are of the finest quality",
    "known for their natural luster."
  ],
  "features": "This magnificent Raani Haaram showcases intricate filigree work, reminiscent of traditional Telugu bridal jewelry. The central pendant is designed with layers of cascading motifs, accentuated by vibrant rubies and emeralds. The necklace also features delicate pearl drops that sway gently. The polki diamonds are set in an open setting to maximize their brilliance. This piece has a royal look.",
  "colors": [
    "Gold (yellow)",
    "Ruby (deep red)",
    "Emerald (vibrant green)",
    "Diamond (white)",
    "and Pearl (cream)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham/పెళ్లి)",
    "engagements",
    "Seemantham (సీమంతం)",
    "or other grand celebrations where you want to make a statement. A heirloom piece perfect for passing on generations to come."
  ],
  "description": "This Raani Haaram embodies the rich cultural heritage of South Indian jewelry, meticulously handcrafted by skilled artisans from Hyderabad. It's not just jewelry; it's an investment in art and tradition, representing timeless elegance and prosperity. The combination of rubies, emeralds, and polki diamonds is highly auspicious and adds a touch of regal charm. The Hyderabadi polish guarantees lasting shine and beauty.",
  "tags": [
    "Raani Haaram",
    "Necklace",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Ruby Necklace",
    "Emerald Necklace",
    "Diamond Necklace",
    "Polki Diamonds",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Kantaabharanam",
    "కంఠాభరణం"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0345_2412",
  "collection": "necklace"
}