{
  "id": "necklaces-437",
  "title": "Enchanting Pearl and Emerald Grandeur: A Diamond-Studded Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Brilliant Cut Diamonds (VS Clarity",
    "GH Color)",
    "Burmese Rubies (2.74 ct)",
    "Zambian Emeralds (1.99 ct)",
    "South Sea Pearls (33.30 ct). Features our signature Hyderabadi Polish for lasting brilliance. Locket contains: diamonds",
    "emerald and pearls. Gold weight 7.18 dwt",
    "locket gold weight is 1.56 dwt"
  ],
  "features": "Intricate floral and paisley motifs encrusted with dazzling diamonds create a breathtaking design. Features two Ruby gemstones and two Emerald gemstones. The central pendant showcases a magnificent Zambian Emerald, surrounded by an array of diamonds. Pearl drops delicately dangle along the neckline and on the locket, adding a touch of classic elegance. Masterfully handcrafted by skilled artisans with generations of expertise, this piece exemplifies the timeless beauty of South Indian jewelry.",
  "colors": [
    "Radiant gold",
    "shimmering white diamonds",
    "rich red rubies",
    "lush green emeralds",
    "and creamy white pearls create a luxurious and harmonious color palette."
  ],
  "occasions": [
    "Perfect for a grand Indian wedding (Vivahaalu)",
    "engagement ceremony (Muhurtham)",
    "pre-wedding celebrations (Haldi/Mehendi)",
    "festive occasions like Diwali and Sankranthi",
    "or any special occasion where you want to make a statement. Also suitable for milestone birthday celebrations or anniversaries."
  ],
  "description": "This exquisite Haaram is a true heirloom piece, blending traditional South Indian artistry with modern design sensibilities. The high-quality gemstones, impeccable craftsmanship, and classic pearl accents ensure this necklace will be treasured for generations. Its opulent design and vibrant colors make it a show-stopping piece, perfect for the discerning bride or jewelry collector. The combination of diamonds, emeralds, and pearls is considered highly auspicious in South Indian culture, symbolizing prosperity, fertility, and happiness.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Ruby Jewelry",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Adiga",
    "Mutyala Haram",
    "Pachala Haram",
    "Vaaddanam",
    "VS Diamonds",
    "22K Gold",
    "Muhurtham Jewelry",
    "Vivahaalu",
    "Zambian Emerald",
    "Burmese Ruby",
    "South Sea Pearls",
    "Moti"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-44 2_0900",
  "collection": "diamond"
}