{
  "id": "necklaces-435",
  "title": "The Manoranjani Grand Diamond Haaram with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity gold",
    "meticulously studded with brilliant-cut diamonds (45.27 carats",
    "129 pieces). Features a central emerald gemstone (3.85 carats",
    "1 piece) and a vibrant ruby (2.90 carats",
    "1 piece). Showcases the signature Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "A stunning symphony of traditional and contemporary design, this Haaram features intricate floral motifs embellished with diamonds. Delicate pink bead droppings add a touch of modern elegance. The central pendants showcasing square-cut emeralds evoke a regal aura. The use of floral motifs is a nod to South Indian heritage.",
  "colors": [
    "Predominantly gold and diamond white",
    "with the rich green of the emerald",
    "the passionate red of the ruby",
    "and subtle lilac of tanzanite creating a harmonious and captivating color palette. The pink bead droppings add a gentle",
    "feminine touch."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (muhurtham)",
    "pre-wedding celebrations (seemantham)",
    "or any formal event where you desire to make a statement. Its modern flair also allows it to be worn at upscale galas and receptions."
  ],
  "description": "This Haaram is a masterpiece of craftsmanship, blending the timeless elegance of traditional South Indian jewelry with contemporary design elements. The high-quality diamonds, emerald, and ruby exude luxury and sophistication. A true heirloom piece that symbolizes prosperity and joy, making it an invaluable addition to your jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Emerald",
    "Ruby",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Floral Design",
    "Gold Necklace",
    "Temple Jewelry",
    "Nakshi Work",
    "Manoranjani",
    "statement necklace",
    "grand",
    "regal",
    "heirloom"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-11 3_0876",
  "collection": "diamond"
}