{
  "id": "earrings-089",
  "title": "Lakshmi Kiran Chandbali: A Symphony of Tradition and Sparkle",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Faceted Green Onyx Cabochon",
    "Carnelian Cabochon",
    "Sparkling Cubic Zirconia (CZ) Stones. Features a smooth",
    "Hyderabadi Polish for a rich luster."
  ],
  "features": "Intricately crafted Chandbali design featuring floral and paisley motifs. The central crescent moon shape is embellished with pave-set CZ stones, mimicking the brilliance of diamonds. Above the crescent, a stylized floral crest features a vibrant green onyx cabochon. A dangling carnelian cabochon adds a touch of tradition and auspiciousness. The entire piece is finished with delicate gold bead drops, reminiscent of traditional guttapusalu designs.",
  "colors": [
    "Dominant gold tone complemented by the vivid green of onyx",
    "the warm red of carnelian",
    "and the dazzling white of CZ stones. This classic South Indian color palette exudes regal elegance."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals like Diwali and Ugadi",
    "and traditional ceremonies such as Seemantham or Half-Saree functions (Langa Voni). Also suitable for contemporary evening events where a touch of ethnic elegance is desired."
  ],
  "description": "This Chandbali seamlessly blends traditional South Indian design with modern sensibilities. The high-quality 22K gold ensures lasting value and brilliance. The CZ stones provide a diamond-like sparkle at an accessible price point. The craftsmanship reflects the rich heritage of Hyderabad jewelry, making it a valuable heirloom piece. The color combination is considered auspicious in South Indian culture, bringing good fortune to the wearer.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "CZ Jewelry",
    "Green Onyx",
    "Carnelian",
    "Guttapusalu",
    "Langa Voni",
    "Seemantham",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "22K Gold",
    "916 Gold",
    "Bridal Jewelry",
    "Jhumka"
  ],
  "original_id": "diamond_jewellery_b9d64853-6564-4a19-855f-5d54efae30ea_0187",
  "collection": "diamond"
}