{
  "id": "necklaces-1010",
  "title": "Dazzling Diamond and Pearl Floral Haaram Set with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace & Earrings",
  "materials": [
    "Base metal plated with 22K Gold. Embellished with high-quality Cubic Zirconia (CZ) stones",
    "lustrous imitation pearls",
    "a ruby-colored simulated gemstone at the pendant's base",
    "and an emerald-colored simulated gemstone at the center of the floral motif. Features our signature Hyderabadi Polish for enhanced shine and durability."
  ],
  "features": "Intricately designed floral motifs crafted in a cascading pattern. Features a statement pendant with a Ruby-like stone at the center, surrounded by CZ diamonds. Delicately suspended imitation pearls add a touch of traditional elegance. Includes matching jhumka earrings, replicating the floral design with an emerald stone on top of the jhumka, and a pearl droplet at the bottom of the jhumka, mirrorring the necklace.",
  "colors": [
    "Predominantly gold with dazzling white diamonds (CZ)",
    "ruby red",
    "and emerald green accents. The pearls offer a creamy white contrast",
    "creating a classic and regal color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "and other festive occasions. Ideal for Muhurtham ceremonies (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "or any grand celebration where you want to make a statement."
  ],
  "description": "A stunning blend of traditional South Indian design and modern sparkle. The floral motif symbolizes prosperity and beauty, making it a meaningful and cherished piece. Expert craftsmanship ensures lasting quality and brilliance. This set is a true testament to Hyderabadi jewelry artistry, offering exceptional value and timeless appeal.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace set",
    "South Indian jewelry",
    "Traditional jewelry",
    "Wedding jewelry",
    "CZ jewelry",
    "Pearl jewelry",
    "Hyderabadi jewelry",
    "Indian jewelry",
    "కంఠాభరణం",
    "జుంకాలు",
    "ముహూర్తం",
    "సీమంతం",
    "Floral design",
    "Bridal jewellery",
    "Indian wedding",
    "Party wear jewellery"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0469_2331",
  "collection": "necklace"
}