{
  "id": "necklaces-1529",
  "title": "Gulabi Neelam Kasulaperu Haaram: A Timeless Bridal Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Green Emeralds",
    "Pink Sapphires",
    "and Tapered Blue Sapphires. Features a signature Hyderabadi Polish for exceptional luster and durability."
  ],
  "features": "Intricate filigree work forms a beautiful floral tapestry, highlighted by precious gemstone accents. The design includes delicately crafted diamond-studded floral motifs, interspersed with oval-cut emeralds and pink sapphires. The statement pendant boasts a similar floral design centered with an emerald, complemented by gracefully dangling blue sapphires. The necklace utilizes a secure and comfortable adjustable chain clasp.",
  "colors": [
    "Predominantly Gold with sparkling White Diamonds",
    "Green Emeralds",
    "Pink Sapphires",
    "and striking Blue Sapphires",
    "creating a vibrant and regal color palette."
  ],
  "occasions": [
    "Perfect for bridal occasions",
    "including the muhurtham",
    "reception",
    "and other grand celebrations. Also suitable for significant milestones such as seemantham",
    "half-saree functions",
    "and anniversaries."
  ],
  "description": "A true heirloom piece, this Gulabi Neelam Kasulaperu Haaram represents the pinnacle of South Indian bridal jewelry. The combination of traditional design elements with contemporary gemstone setting techniques results in a timeless and elegant piece. The use of high-quality materials ensures lasting beauty and value. This necklace is not just jewelry; it's an investment in heritage and a symbol of eternal love.",
  "tags": [
    "Haaram",
    "Kasulaperu",
    "Bridal Necklace",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Diamonds",
    "Emeralds",
    "Sapphires",
    "Filigree Jewelry",
    "కంఠాభరణము",
    "పెళ్లి హారం",
    "Vaddanam",
    "Traditional Jewellery",
    "Heirloom Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-06 3_2147",
  "collection": "sjpl"
}