{
  "id": "necklaces-098",
  "title": "Parampara Green Emerald & Pearl Guttapusalu Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Seed Pearls (Basra Pearls)",
    "Faceted Green Emerald Beads",
    "Kundan Setting with Polki Diamonds",
    "Hyderabadi Polish"
  ],
  "features": "A stunning reimagining of the classic Guttapusalu. Features graduated strands of exquisitely faceted emerald beads, meticulously knotted for strength and drape. Separated by lustrous rows of natural seed pearls. The central circular clasps showcase intricate Kundan settings with uncut Polki diamonds, framing a captivating emerald cabochon. The iconic 'gutta' design is subtly incorporated through the graduated emerald strands, creating a refined, contemporary take on tradition. This Haaram is enhanced with Hyderabadi polish to give a long lasting shine and enhance the beauty of the design.",
  "colors": [
    "Gold (Yellow)",
    "Emerald (Green)",
    "Pearl (White)",
    "Diamond (Colorless)"
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "receptions",
    "auspicious occasions (Seemantham)",
    "and grand celebrations. A statement piece to elevate any formal attire."
  ],
  "description": "A modern twist on a timeless classic, blending the traditional Guttapusalu design with contemporary aesthetics. The use of natural pearls and high-quality emeralds adds significant value. The Hyderabadi polish ensures long-lasting luster and enhances the intricate details of the Kundan work. A symbol of prosperity and elegance, this Haaram is a true investment piece.",
  "tags": [
    "Guttapusalu",
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emerald",
    "Pearl",
    "Kundan",
    "Polki",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Muhurtham",
    "Wedding Jewelry",
    "Tradition",
    "Fine Jewelry",
    "Luxury Jewelry",
    "Basra Pearl",
    "ముత్యాల హారం",
    "ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_DPHR8-1814_0327",
  "collection": "diamond"
}