{
  "id": "necklaces-1138",
  "title": "Heera Kanthi Haaram - Timeless Polki Diamond Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds. Features the classic Hyderabadi Polish for a luxurious",
    "antique-inspired gleam. Each diamond is carefully selected for its unique character and brilliance",
    "exhibiting natural inclusions that enhance its vintage charm."
  ],
  "features": "This exquisite two-strand Heera Kanthi Haaram showcases a delicate yet captivating design. The graduating Polki diamonds are meticulously set, creating a shimmering cascade. The tear-drop shaped pendants with intricate detailing add a touch of regality. The necklace embodies the charm of vintage South Indian jewelry, perfect for adding a timeless touch to any outfit.",
  "colors": [
    "Predominantly gold and white/off-white from the Polki diamonds. The Hyderabadi Polish lends a subtle",
    "warm tone to the gold",
    "enhancing its richness."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham",
    "పెళ్లి)",
    "receptions",
    "and other grand celebrations. Also suitable for formal events where a touch of heritage is desired. Makes a stunning heirloom piece for Seemantham (సీమంతం) or Half-Saree Function."
  ],
  "description": "A true embodiment of South Indian heritage, this Heera Kanthi Haaram is a timeless investment. The use of genuine Polki diamonds, combined with expert craftsmanship and the signature Hyderabadi polish, ensures both beauty and lasting value. It's a statement piece that speaks volumes about your appreciation for tradition and luxury.",
  "tags": [
    "Heera Haaram",
    "Kanthi Haaram",
    "Polki Diamonds",
    "Uncut Diamonds",
    "Necklace",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Indian Jewelry",
    "Telugu Jewelry",
    "కంఠి హారం",
    "పెళ్లి",
    "సీమంతం",
    "Heritage Jewelry",
    "Antique Finish"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0041_2557",
  "collection": "radhe"
}