{
  "id": "necklaces-785",
  "title": "Exquisite Diamond and Gemstone Bridal Choker - A Timeless Vaddanam Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High purity Gold (details available upon request). Features brilliant-cut Diamonds (clarity details available upon request) complimented by vibrant Pink Sapphires",
    "Emeralds",
    "and Tanzanite Manya Beads. Detailed craftsmanship exhibits Hyderabadi Polish for exceptional luster and durability."
  ],
  "features": "Elaborate floral and paisley motifs meticulously set with sparkling diamonds. Features an intricate layered design with alternating emeralds and pink sapphires to add color and depth. The gracefully cascading Tanzanite Manya beads provide a touch of regal elegance and movement, leading to a detachable statement pendant echoing the choker's core design.",
  "colors": [
    "Predominantly White (Diamonds) with accents of Green (Emeralds)",
    "Pink (Sapphires)",
    "and Blue (Tanzanite). The gold setting provides a warm",
    "complementary backdrop."
  ],
  "occasions": [
    "Perfect for grand weddings",
    "traditional ceremonies like Muhurtham and Seemantham",
    "celebratory events",
    "or any occasion where a statement piece is desired. Makes a splendid heirloom piece."
  ],
  "description": "A true masterpiece of craftsmanship blending traditional South Indian design with modern elegance. The combination of high-quality diamonds, vibrant gemstones, and intricate detailing makes it a truly unique and valuable piece. Showcases exquisite Hyderabadi craftsmanship. The detachable pendant offers versatility, allowing it to be worn separately as a more subtle piece.",
  "tags": [
    "Diamond Necklace",
    "Bridal Jewelry",
    "Haaram",
    "Vaddanam",
    "Choker",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emerald",
    "Sapphire",
    "Tanzanite",
    "Manya Beads",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Statement Necklace",
    "Fine Jewelry",
    "Tradition",
    "Gemstone Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-24-13-54-28 3_1321",
  "collection": "diamond"
}