{
  "id": "necklaces-1408",
  "title": "Emerald Blossom Diamond Haaram - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Brilliant Cut Diamonds (VS Clarity",
    "G-H Color)",
    "Natural Emeralds (Zambian)",
    "Hyderabadi Polish."
  ],
  "features": "This exquisite Haaram showcases a captivating floral motif, meticulously handcrafted with interspersed diamond and gold filigree. The central floral design features vibrant emeralds, complemented by delicately dangling emerald drops (గుత్తులు). The piece boasts a traditional South Indian design with a modern twist, making it versatile for various occasions. Intricate openwork setting enhances the brilliance of the diamonds. The rope style necklace is also covered in small diamonds in some sections",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emeralds)"
  ],
  "occasions": [
    "Perfect for bridal wear (పెళ్లి)",
    "engagement ceremonies",
    "Seemantham (శ్రీమంతం)",
    "and high-end social gatherings. A treasured heirloom piece for generations."
  ],
  "description": "This Diamond Haaram is more than just jewelry; it is an investment in heritage and artistry. The combination of brilliant diamonds and vivid emeralds creates a captivating visual appeal. The high-quality materials and superior craftsmanship ensure lasting beauty and value. Its versatility allows it to be worn with both traditional and contemporary attire, making it a truly exceptional piece. The use of Zambian Emeralds adds an extra layer of luxury and prestige.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Necklace",
    "Seemantham",
    "కంఠాభరణం",
    "Zambian Emeralds",
    "Temple Jewelry",
    "Indian Jewellery",
    "Traditional Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-19 3_2026",
  "collection": "sjpl"
}