{
  "id": "necklaces-1021",
  "title": "Aaradhya Diamond Haaram: Timeless Elegance with a Modern Twist",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold (916 Gold) with Hyderabadi Polish. Features brilliant-cut Diamonds (VS clarity",
    "G-H color) and lustrous South Sea Pearls. The centerpiece showcases a stunning Ruby gemstone",
    "expertly cut and polished."
  ],
  "features": "This exquisite haaram features an intricate floral design rendered in diamonds. The pendant design elements are traditional, including elaborate filigree work. The cascading design creates a graceful and captivating look. It's a perfect example of modern craftsmanship blended seamlessly with traditional South Indian jewelry aesthetics.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented by the rich red of the Ruby and the creamy white of the Pearls."
  ],
  "occasions": [
    "Ideal for bridal wear",
    "weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "and other special occasions. This haaram will add a touch of regal elegance to any ensemble. Can also be worn for grand functions",
    "festivals",
    "and cultural events."
  ],
  "description": "This Diamond Haaram is a statement piece, representing the rich heritage of South Indian jewelry craftsmanship. The combination of diamonds, rubies, and pearls creates a timeless appeal, suitable for both traditional and modern sensibilities. The Hyderabadi polish enhances the luster of the gold, making it a valuable heirloom to cherish for generations. Each diamond is meticulously set to maximize its brilliance.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "22K Gold",
    "Ruby",
    "Pearls",
    "Hyderabadi Jewelry",
    "Temple Jewellery",
    "Kanthaharam",
    "కంఠహారము",
    "Vivahaalu",
    "Nischitartham",
    "Indian Wedding",
    "Fine Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0480_2342",
  "collection": "necklace"
}