{
  "id": "earrings-558",
  "title": "Aarya Diamond Stud Earrings - Exquisite Floral Vaagai",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K Yellow Gold (7.980g gross wt",
    "7.78g net wt). Featuring brilliant-cut diamonds with VS clarity. Secure post and nut closure."
  ],
  "features": "Delicate floral design meticulously handcrafted with a central cluster of diamonds surrounded by radiating petals. The 'vaagai' or flower-inspired motif is a classic South Indian design element. The openwork setting enhances the brilliance of the diamonds. Modern take on the traditional studs, creating a perfect blend of timeless elegance and contemporary style.",
  "colors": [
    "Predominantly yellow gold with dazzling white diamonds",
    "creating a timeless and sophisticated aesthetic."
  ],
  "occasions": [
    "Ideal for everyday elegance or special occasions such as weddings",
    "receptions",
    "or festivals. A beautiful accessory for the modern woman who appreciates traditional design with a contemporary twist. Perfect as a gift for engagements",
    "anniversaries",
    "or birthdays."
  ],
  "description": "These diamond stud earrings are a statement of understated luxury and timeless elegance. The floral 'vaagai' design holds cultural significance, making them a cherished heirloom. Crafted with meticulous attention to detail and using only the finest materials, they are a testament to the unparalleled craftsmanship of Hyderabad's jewelry artisans. The secure setting ensures durability and lasting brilliance. The perfect way to add a touch of South Indian heritage to your everyday style.",
  "tags": [
    "Diamond Earrings",
    "Stud Earrings",
    "Gold Earrings",
    "Floral Design",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Vaagai",
    "Chevi Pullalu",
    "Diamond Studs",
    "18K Gold",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Gift",
    "Hyderabad Jewelry",
    "Fine Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Modern Indian Jewelry"
  ],
  "original_id": "jewellery_IMG-20241219-WA0028_1607",
  "collection": "jewellery"
}