{
  "id": "necklaces-944",
  "title": "Lakshmi Kasula Haaram with Emerald Accents and Jhumka Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features brilliant-cut Diamonds (VS clarity",
    "G color) and vibrant Emeralds (round cut",
    "natural). The pendant is adorned with cluster pearls."
  ],
  "features": "A stunning reimagining of the classic Kasula Haaram, this piece features an intricately designed choker neckline with chevron patterns paved with diamonds and floral emerald accents. The impressive crescent-shaped pendant, embellished with diamonds, features a Jhumka design suspended within, all culminating in delicate pearl drops. The antique finish enhances the Haaram’s traditional appeal.",
  "colors": [
    "Dominantly gold with sparkling diamond brilliance",
    "accentuated by the rich green of the emeralds and soft",
    "lustrous hues of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "bridal wear",
    "engagement ceremonies (Muhurtham)",
    "and grand receptions. Also suitable for festive occasions like Ugadi",
    "Diwali",
    "and other significant family gatherings."
  ],
  "description": "This Haaram is a fusion of traditional South Indian design and modern elegance. The meticulous craftsmanship, the brilliance of the diamonds, and the rich color of the emeralds make it a statement piece. Its timeless design ensures it will be cherished for generations, making it an heirloom-worthy investment.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Emerald",
    "Diamond",
    "Kasula Haaram",
    "Hyderabadi Jewelry",
    "Muhurtham",
    "Vivaaha",
    "Pearl Drops",
    "Jhumka Pendant",
    "22K Gold",
    "Antique Finish"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0338_2405",
  "collection": "necklace"
}