{
  "id": "waistbands-015",
  "title": "Elegant Diamond Vaddanam with Peacock Motif and South Sea Pearls",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "High-purity Gold base",
    "meticulously set with brilliant-cut Diamonds. Features vibrant Rubies (4.11ct) and Emeralds (7.02ct)",
    "accentuated by lustrous South Sea Pearls (68.88ct). This Vaddanam showcases a Hyderabadi polish for a lasting shine."
  ],
  "features": "This exquisitely crafted Vaddanam features a central peacock (Mayura) motif, a symbol of beauty and prosperity. The delicate diamond-studded patterns are inspired by traditional South Indian designs. The design is further enhanced by Emerald and Ruby embellishments. Lustrous South Sea pearls are elegantly suspended, adding a touch of sophistication. Fine detailing throughout the piece demonstrates exceptional artistry and craftsmanship.",
  "colors": [
    "Predominantly gold with dazzling white diamonds",
    "complemented by the deep green of the Emeralds and the rich red of the Rubies. The South Sea pearls exhibit a creamy white color with subtle iridescence",
    "creating a captivating contrast."
  ],
  "occasions": [
    "Perfect for traditional South Indian weddings",
    "Seemantham ceremonies (baby showers)",
    "and half-saree functions (Langa Voni). This Vaddanam can also elevate your look for grand celebrations and special occasions",
    "adding a touch of regal elegance."
  ],
  "description": "This Vaddanam is more than just a piece of jewelry; it's an heirloom. The combination of diamonds, emeralds, rubies, and South Sea pearls makes it a valuable and timeless investment. The design beautifully blends traditional South Indian aesthetics with modern sensibilities. The intricate craftsmanship ensures its durability and makes it a treasured possession for generations to come.",
  "tags": [
    "Vaddanam",
    "Oddiyanam",
    "Waist Belt",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Temple Jewelry",
    "Peacock Motif",
    "Mayura",
    "Ruby",
    "Emerald",
    "South Sea Pearls",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Langa Voni",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Guttapusalu",
    "Kasulaperu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02 4_1295",
  "collection": "diamond"
}