{
  "id": "necklaces-1213",
  "title": "Emerald and Diamond Floral Cascading Haaram - NEC03006",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in gleaming 18K Gold",
    "this Haaram features brilliant-cut diamonds (4.70 carats total weight) complemented by two vibrant emeralds (2.55 carats total weight)",
    "and twelve lustrous South Sea Pearls (27.60 carats total weight). The gold showcases a radiant Hyderabadi Polish",
    "enhancing its natural luster."
  ],
  "features": "This exquisite Haaram embodies traditional South Indian elegance with a modern twist. The floral motifs are intricately set with diamonds, creating a dazzling effect. The central pendant features a cascading design, culminating in a pear-shaped emerald framed by delicate diamond detailing. Twelve pearls are carefully placed along the lower edge of the necklace, adding a touch of timeless grace. The design reflects nakshi work, albeit with a modern interpretation using diamonds.",
  "colors": [
    "The color palette is a harmonious blend of the white brilliance of diamonds",
    "the rich green of emeralds",
    "the creamy luster of South Sea Pearls",
    "and the warm yellow of the 18K gold."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Vivaha Mahotsavam)",
    "engagements",
    "Seemantham ceremonies",
    "and milestone celebrations. Its sophisticated design also makes it suitable for upscale social gatherings and formal events."
  ],
  "description": "This Haaram is a testament to superior craftsmanship and timeless design. The combination of diamonds, emeralds, and pearls represents prosperity, abundance, and purity, making it a treasured heirloom. The Hyderabadi polish ensures lasting brilliance, while the unique floral design sets it apart from traditional Haaram styles. It’s a symbol of cultural heritage and contemporary sophistication, suitable for the modern Indian woman.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Jewelry",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaha Mahotsavam",
    "Seemantham",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "18K Gold",
    "Nakshi Design",
    "Floral Design"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-50 3_1787",
  "collection": "sjpl"
}