{
  "id": "earrings-672",
  "title": "Emerald Cascade Jhumka - Green Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K Gold plated. Featuring emerald-cut emeralds and brilliant-cut diamonds",
    "intricately set for maximum brilliance. Features Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite Jhumka features a unique cascade design with emeralds and diamonds. The central Emerald is set in a prong setting for an elegant look. The floral design near the top and bottom adds a touch of traditional South Indian jewelry design, reminiscent of classic temple jewelry (Devalayam designs).",
  "colors": [
    "Dominant emerald green is beautifully contrasted with the brilliant white of the diamonds and the subtle gold hue of the gold plating. The combination creates a rich and luxurious appearance",
    "perfect for special occasions."
  ],
  "occasions": [
    "Ideal for weddings (Pendli)",
    "receptions",
    "festivals (Ugadi",
    "Sankranthi)",
    "and upscale evening events. A stunning choice for a half-saree function or any event where you want to make a grand statement."
  ],
  "description": "This Jhumka perfectly blends traditional South Indian aesthetics with modern design principles. The high-quality gemstones and intricate craftsmanship ensure a durable and timeless piece. The use of emeralds, known for their association with prosperity and wisdom, adds symbolic value to the jewelry.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Hyderabad",
    "Pendli",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Fashion Jewelry",
    "Party Wear",
    "Green Jewelry",
    "Dangler Earrings",
    "Statement Earrings",
    "Temple Jewelry",
    "Devalayam",
    "Hyderabadi Polish",
    "Gold Plated"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-43_2260",
  "collection": "sjpl"
}