{
  "id": "necklaces-062",
  "title": "Mayur Haar Pendant - A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Ruby accent. Features a lustrous Hyderabadi Polish for a lasting shine."
  ],
  "features": "This pendant showcases a graceful peacock (Mayur) motif intricately woven with diamond-studded floral vines. The peacock, a symbol of beauty and royalty, features delicate feather detailing. The piece also features a solitaire ruby. Below the peacock, a spherical golden bead adds a touch of playful elegance. The diamond setting accentuates the gold filigree work.",
  "colors": [
    "Primarily yellow gold with brilliant white diamonds and a pop of vibrant red from the ruby."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festive occasions like Sankranthi",
    "or as a statement piece for a special night out. Its versatile design allows it to be paired with both traditional sarees and contemporary outfits."
  ],
  "description": "This Mayur Haar Pendant is a modern heir apparent to traditional South Indian jewelry. The meticulously crafted peacock design, combined with the sparkle of diamonds and the richness of 22K gold, makes this piece a timeless treasure. The Hyderabadi polish ensures enduring luster. It's not just jewelry; it's a work of art and a symbol of elegance and prosperity.",
  "tags": [
    "Pendant",
    "Haar",
    "Peacock",
    "Mayur",
    "22K Gold",
    "Diamonds",
    "Ruby",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Nakshi",
    "Filigree",
    "Contemporary Indian Jewelry",
    "muhurtham",
    "seemantham",
    "haram"
  ],
  "original_id": "diamond_jewellery_a30a9c6a-124c-45ef-9450-1baafd9bb3e2_0171",
  "collection": "diamond"
}