{
  "id": "necklaces-1464",
  "title": "Emerald and Diamond Raasi Necklace - Pancharatna Haram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "Natural Emeralds (faceted cut",
    "vivid green)",
    "Brilliant Cut Diamonds (SI clarity",
    "G-H color). The pendant features a high-quality",
    "centerpiece Emerald."
  ],
  "features": "This exquisitely crafted necklace features a contemporary design inspired by traditional Telugu harams. The gold chain boasts an openwork design, interspersed with Emeralds and Diamond-studded floral motifs. The elaborate pendant is a stunning showcase of diamond pave setting around strategically placed emeralds, culminating in delicate gold bead drops. Features a modern take on the 'Chandbali' design aesthetic. Has a secure S-hook clasp.",
  "colors": [
    "Gold",
    "Vivid Green (Emerald)",
    "White (Diamonds)"
  ],
  "occasions": [
    "Perfect for engagements",
    "weddings (Reception",
    "Sangeet)",
    "festive occasions (Diwali",
    "Dussehra)",
    "and high-end social gatherings. Ideal for contemporary brides looking for a blend of tradition and modernity. Also suitable for events like Seemantham or Half-Saree Function."
  ],
  "description": "This Pancharatna Haram seamlessly blends traditional South Indian aesthetics with contemporary design. The use of high-quality emeralds and diamonds ensures enduring value and brilliance. The Hyderabadi polish imparts a rich, lustrous finish. Its versatile design allows it to be paired with both traditional silk sarees and modern evening wear, making it a treasured heirloom.",
  "tags": [
    "Necklace",
    "Haram",
    "Emerald",
    "Diamond",
    "Gold",
    "Pancharatna",
    "Hyderabad",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Contemporary Jewelry",
    "Chandbali",
    "Raasi",
    "22K Gold",
    "916 Gold",
    "Seemantham",
    "Half Saree"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-55-1_2082",
  "collection": "sjpl"
}