{
  "id": "necklaces-1403",
  "title": "Emerald Bloom Diamond Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Emeralds (Oval & Square Cut",
    "Zambian origin)",
    "Freshwater Pearls."
  ],
  "features": "A delicate and modern take on the classic Haaram, featuring a cascade of floral motifs meticulously set with shimmering diamonds. The centerpiece features a vibrant Zambian emerald, adding a pop of color and regal elegance. Accented with lustrous freshwater pearls for a touch of timeless beauty. Features a delicate and stylish pattern set to give the Haar a lightweight look. The design beautifully marries traditional floral patterns with contemporary aesthetics, creating a versatile piece.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emeralds)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for cocktail parties",
    "weddings",
    "receptions",
    "and other special occasions where you want to make a statement. Also ideal for modern brides looking for a unique take on traditional bridal jewelry",
    "or any milestone events",
    "or even a modern Seemantham."
  ],
  "description": "This necklace is a harmonious blend of tradition and modern design, making it a unique and versatile addition to any jewelry collection. The high-quality diamonds and emeralds guarantee lasting brilliance and value. The intricate craftsmanship and attention to detail reflect the rich heritage of Hyderabadi jewelry, offering a timeless elegance that will be treasured for generations.",
  "tags": [
    "Haar",
    "Necklace",
    "Diamond Necklace",
    "Emerald",
    "Pearl",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Cocktail Jewelry",
    "పతకం (Pathakam)",
    "నెక్లెస్ (Necklace)",
    "వజ్రాల నెక్లెస్ (Vajraala Necklace)"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-14_2021",
  "collection": "sjpl"
}