{
  "id": "necklaces-1145",
  "title": "Lakshmi Kasula Haaram with Polki Diamonds and Coral Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Coral Beads",
    "Emeralds",
    "Rubies",
    "Pearls. Features Hyderabadi Polish for a rich",
    "antique luster."
  ],
  "features": "This exquisite Lakshmi Kasula Haaram showcases a central pendant featuring a beautifully crafted Lakshmi figure. The pendant is intricately detailed, incorporating Nakshi work (నక్షి పని) for a temple jewelry aesthetic.  The Haaram is strung with triple strands of vibrant coral beads, punctuated by layers of dazzling Polki diamonds in a closed setting.  The pendant is framed with rubies and cascading pearl and coral beaded tassels, complemented by faceted emerald drops.  The diamond settings provide exceptional sparkle and brilliance.",
  "colors": [
    "Gold",
    "Red (Rubies)",
    "Green (Emeralds)",
    "Peach (Coral)",
    "White (Diamonds and Pearls)"
  ],
  "occasions": [
    "Ideal for weddings (వివాహం)",
    "bridal wear",
    "Seemantham (సీమంతం)",
    "Voni function (Half-Saree function)",
    "temple visits",
    "and other special occasions where a grand",
    "traditional statement is desired."
  ],
  "description": "This Haaram is a masterpiece of South Indian craftsmanship. The use of uncut Polki diamonds gives it a unique antique charm, while the intricate Nakshi work on the Lakshmi pendant exemplifies timeless temple jewelry design. The combination of vibrant coral and dazzling diamonds creates a striking visual impact. The Hyderabadi polish ensures a lasting rich luster. It is a valuable heirloom piece to be cherished for generations, embodying cultural significance and traditional beauty.",
  "tags": [
    "Haaram",
    "Kasula Haaram",
    "Necklace",
    "Polki Diamonds",
    "Uncut Diamonds",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "కంఠాభరణం",
    "Lakshmi Pendant",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Coral Beads",
    "Emeralds",
    "Rubies",
    "Pearls",
    "Traditional Jewelry",
    "వివాహం",
    "సీమంతం"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0052_2564",
  "collection": "radhe"
}