{
  "id": "necklaces-1544",
  "title": "Divine Diamond Vaddanam with Emerald Accents - Illuminate Your Silhouette",
  "category": "necklaces",
  "original_type": "Waist Belt/Chain",
  "materials": [
    "Crafted in 22K Gold (hallmarked) setting with brilliant-cut diamonds (Dwt: 16.60 carats). Features square-cut Emeralds (Eme: 18.05 carats) and lustrous South Sea Pearls (SW Moti: 31.10 carats). Boasts a luxurious",
    "long-lasting Hyderabadi polish."
  ],
  "features": "This exquisitely designed Vaddanam showcases intricate filigree work adorned with dazzling diamonds. The center is embellished with a larger emerald, creating a focal point of elegance. The delicate pearl drops add a touch of traditional charm and movement. The design incorporates elements reminiscent of temple jewelry, blending tradition with modern aesthetics.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with vibrant green emerald accents and creamy white South Sea pearls."
  ],
  "occasions": [
    "Perfect for traditional South Indian occasions such as weddings (Vivaha)",
    "engagements",
    "Seemantham ceremonies",
    "and half-saree functions (Langa Voni). Also suitable for upscale parties and events where you want to make a statement."
  ],
  "description": "This Vaddanam is a statement piece that combines heritage with contemporary style. The brilliance of the diamonds, coupled with the rich green emeralds and luminous pearls, creates a captivating look. The craftsmanship reflects the superior artistry of Hyderabad's renowned jewelers, ensuring a piece that is both timeless and valuable. Symbolizes prosperity and feminine grace, making it a cherished heirloom.",
  "tags": [
    "Vaddanam",
    "Kamarband",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabad Jewelry",
    "Hyderabadi Polish",
    "Seemantham",
    "Vivaha",
    "Langa Voni",
    "Antique Jewelry",
    "Filigree",
    "Nakshi work",
    "Temple Jewelry",
    "Kamar Patta",
    "Otthiyanam"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-11-18-03 3_2173",
  "collection": "sjpl"
}