{
  "id": "bangles-275",
  "title": "Rajputana Pink Sapphire & Polki Diamond Bangle - 'Sobha' Collection",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "Handcrafted Kundan Setting. Features vibrant Pink Sapphires with excellent clarity. Encrusted with Polki Diamonds in a traditional Hyderabadi setting."
  ],
  "features": "This exquisite bangle features a traditional Kundan setting, meticulously handcrafted by artisans of Hyderabad. The alternating arrangement of square-cut Pink Sapphires and Polki diamonds creates a striking visual balance. The antique gold finish adds a touch of vintage charm and timeless elegance, reminiscent of Mughal artistry.",
  "colors": [
    "Dominant gold with vibrant pink sapphires and the natural",
    "milky white of Polki diamonds. The color palette exudes regality and sophistication."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "and other special occasions like Sangeet",
    "Mehendi",
    "and traditional Telugu ceremonies such as Seemantham and Pelli Choopulu. Also suitable for adding a touch of royal elegance to any modern ensemble."
  ],
  "description": "This bangle is a true statement piece, showcasing the pinnacle of Hyderabadi craftsmanship. The combination of vibrant Pink Sapphires and Polki diamonds creates a captivating sparkle, while the traditional Kundan setting pays homage to India's rich heritage. It is a unique and timeless investment that will be cherished for generations, a 'Samskruti' (cultural heritage) piece.",
  "tags": [
    "Bangle",
    "Kada",
    "Kundan",
    "Polki",
    "Diamond",
    "Sapphire",
    "Pink Sapphire",
    "Gold",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Ethnic Jewelry",
    "Fine Jewelry",
    "Rajputana",
    "Sobha",
    "Samskruti",
    "Pelli",
    "Seemantham",
    "Engagement",
    "Wedding",
    "Reception",
    "Antique Gold"
  ],
  "original_id": "radhe_diam_DPBG8-1455_2441",
  "collection": "radhe"
}