{
  "id": "earrings-145",
  "title": "Vaajra Nethra Kundanalu: Polki Diamond & Emerald Drop Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds",
    "Natural Round Emeralds. Features the signature Hyderabadi Polish for a lasting luster and brilliance. The Polki diamonds exhibit a captivating raw brilliance",
    "reflecting the light with every movement."
  ],
  "features": "These exquisite earrings feature a central oval Polki diamond, surrounded by a halo of smaller diamonds, set in a traditional Kundan setting. A vibrant, round emerald drop dangles gracefully below, adding a pop of color and sophistication. The design reflects a contemporary interpretation of classic South Indian aesthetics, blending traditional craftsmanship with modern sensibilities.",
  "colors": [
    "Gold",
    "White (Polki Diamond)",
    "Emerald Green"
  ],
  "occasions": [
    "Perfect for weddings (Pelli)",
    "receptions",
    "festivals like Sankranthi and Ugadi",
    "or any special occasion. Also suitable for adding a touch of elegance to modern events and celebrations."
  ],
  "description": "These earrings are a timeless investment, handcrafted by skilled artisans using the finest materials. The combination of Polki diamonds and emeralds symbolizes prosperity and good fortune, making them a cherished heirloom piece. The Hyderabadi Polish ensures lasting shine and durability. The unique design effortlessly blends tradition with modern style, making it versatile for various occasions.",
  "tags": [
    "Earrings",
    "Kundanalu",
    "Jhumka",
    "Polki Diamond",
    "Emerald",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Pelli",
    "Uncut Diamond",
    "Indian Jewelry",
    "Ethnic Jewelry",
    "Vaajra",
    "Nethra",
    "Kundan Setting",
    "Hyderabadi Polish"
  ],
  "original_id": "diamond_jewellery_DPER8-1497_0269",
  "collection": "diamond"
}