{
  "id": "necklaces-867",
  "title": "Exquisite Diamond Floral Haaram Set with Matching Earrings",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Yellow Gold",
    "Certified Natural Diamonds (VS Clarity",
    "G Color)",
    "Natural Rubies",
    "Natural Emeralds. Hyderabadi Polish finish."
  ],
  "features": "This stunning Haaram features a three-strand design, meticulously crafted with delicate diamond-studded floral motifs. The intricate floral design represents prosperity and new beginnings. Alternating ruby and emerald accents enhance the piece. The matching Jhumka earrings echo the necklace's floral theme for a cohesive and elegant look. The secure setting ensures the gemstones' longevity. The gold showcases a high-polish Hyderabadi finish, adding brilliance and shine.",
  "colors": [
    "Yellow Gold",
    "White Diamonds",
    "Ruby Red",
    "Emerald Green. A classic South Indian color palette."
  ],
  "occasions": [
    "Perfect for traditional Telugu weddings (Muhurtham)",
    "engagements (Nischitartham)",
    "Seemantham",
    "and grand celebrations. Also suitable for formal events where a touch of regal elegance is desired."
  ],
  "description": "A timeless heirloom piece, this Haaram set embodies the rich cultural heritage of South Indian jewelry. The use of high-quality diamonds and precious gemstones ensures enduring beauty. The three-strand design and floral motifs symbolize abundance and good fortune. Invest in a legacy of craftsmanship and elegance with this exceptional piece. Durability and craftsmanship guarantee it will be cherished for generations. A true statement piece that will leave a lasting impression.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Muhurtham Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Antique Jewelry",
    "Gold Jewelry",
    "Emerald",
    "Ruby",
    "Kanthabharanam",
    "Floral Design",
    "Hyderabadi Jewelry"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0400_1554",
  "collection": "haaram"
}