{
  "id": "necklaces-1129",
  "title": "Regal 'Vaibhavam' Polki Diamond Haaram with Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (approx. 25 carats total weight)",
    "Faceted Rubies. Features the signature Hyderabadi Polish for a rich",
    "antique lustre."
  ],
  "features": "A stunning graduated Haaram featuring intricately crafted floral and crescent moon (chandrama) motifs. Each motif is meticulously set with Polki diamonds and accentuated by vibrant rubies. The graduating design adds depth and dimension, ensuring a captivating presence. The Polki setting showcases the natural beauty of the uncut diamonds.",
  "colors": [
    "Predominantly gold with a warm",
    "antique finish. The Polki diamonds exhibit a subtle shimmer",
    "complemented by the deep red hues of the rubies. The color combination is both regal and auspicious",
    "perfect for bridal wear."
  ],
  "occasions": [
    "Ideal for weddings (Vivaaham)",
    "receptions",
    "and other grand celebrations. This Haaram will make a statement at milestone events such as Seemantham",
    "or a Half-Saree Function (Langa Voni). It is also appropriate for high-profile cultural events and festivals."
  ],
  "description": "This heirloom-worthy Haaram is a testament to exquisite craftsmanship and timeless design. The use of Polki diamonds gives it a unique, antique charm, setting it apart from modern diamond jewelry. A symbol of prosperity and tradition, it's an investment piece that will be cherished for generations. The Hyderabadi polish enhances the gold's natural lustre and offers exceptional durability.",
  "tags": [
    "Polki",
    "Diamond Necklace",
    "Haaram",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Ruby",
    "Hyderabadi Jewelry",
    "Antique Finish",
    "Kundan",
    "కంఠాభరణం",
    "Vivaaham",
    "Seemantham",
    "Langa Voni",
    "Vaibhavam"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0025_2543",
  "collection": "radhe"
}