{
  "id": "necklaces-1195",
  "title": "Emerald & Diamond Floral Haaram with Pearl Drops - Traditional Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold. Features sparkling",
    "pave-set diamonds with VS clarity and round brilliant cut. Two central emeralds (4.14 carats total weight) add a regal touch. Adorned with nine lustrous South Sea pearls (19.80 carats total weight)."
  ],
  "features": "This haaram seamlessly blends traditional floral motifs with a modern design. The intricately crafted gold framework showcases delicate diamond settings. Two prominent floral pendants, each centered with a vibrant emerald, create a focal point. Dainty pearl drops add a touch of traditional charm. The chain is designed with a geometric and floral motif, with diamonds accenting the links.",
  "colors": [
    "Primarily a yellow gold color scheme with the sparkle of white diamonds. The lush green emeralds and creamy white pearls provide a beautiful contrast and balance."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "receptions",
    "and grand celebrations. Also suitable for festive occasions like Diwali and Ugadi",
    "and for adding a touch of South Indian heritage to modern events."
  ],
  "description": "This haaram is a stunning blend of traditional South Indian aesthetics and modern jewelry design. The high-quality diamonds and emeralds are sure to catch the eye, while the pearl drops add a touch of classic elegance. It is a unique statement piece, perfect for the discerning woman who appreciates fine craftsmanship and cultural heritage. It's an investment piece that will become a treasured heirloom, passed down through generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Pearl",
    "South Sea Pearl",
    "Gold",
    "22K Gold",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Vivahaalu",
    "Nischitartham",
    "Antique Finish",
    "Temple Jewelry",
    "Floral Design",
    "Moti",
    "Emeralds",
    "Diamonds"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-44 3_1769",
  "collection": "sjpl"
}