{
  "id": "necklaces-106",
  "title": "Manikyam and Polki Kundan Short Haaram - A Regal Heritage Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Rubies (Manikyam) of high clarity and vibrant red hue",
    "Uncut Polki Diamonds (Kundan)",
    "meticulously set in the traditional Kundan setting. Features a classic Hyderabadi Polish for a lasting lustre."
  ],
  "features": "This exquisite short Haaram showcases the timeless beauty of traditional South Indian jewelry. The design features alternating Ruby cabochons and Polki diamond floral motifs, each intricately handcrafted and set in gold. The Polki diamonds are arranged in a 'patti' (petal) design, a hallmark of Kundan craftsmanship. Each Ruby is bezel-set to maximize its color and brilliance. The necklace also features delicate gold work connecting the stones and flower motifs.",
  "colors": [
    "Rich Red (Manikyam)",
    "Sparkling White/Off-White (Polki)",
    "and Warm Yellow Gold."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "engagement ceremonies",
    "bridal showers",
    "festivals like Diwali and Sankranti",
    "and other significant celebrations. This piece adds a touch of heritage elegance to any special occasion."
  ],
  "description": "This Short Haaram represents the epitome of South Indian jewelry artistry. The combination of vibrant Rubies and the unique shimmer of Polki diamonds creates a captivating visual appeal. The piece is a testament to the enduring legacy of Kundan craftsmanship, handcrafted with meticulous attention to detail. A timeless piece to be treasured for generations, symbolizing prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Gundla Mala",
    "Ruby",
    "Manikyam",
    "Polki",
    "Kundan",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Hyderabadi Jewelry",
    "Indian Jewellery",
    "Traditional Jewellery",
    "Heritage Jewellery",
    "Fine Jewellery"
  ],
  "original_id": "diamond_jewellery_DPNK8-1371_0339",
  "collection": "diamond"
}