{
  "id": "necklaces-422",
  "title": "Stunning Diamond & Gemstone Peacock Haaram - A Royal Telugu Bridal Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "brilliant-cut diamonds (18.28 carats)",
    "Ruby (12.01 carats)",
    "Emeralds (7.92 carats)",
    "Pink Quartz/Manikya stone (105.65 carats). Expertly crafted with Hyderabadi Polish for a lasting sheen."
  ],
  "features": "A magnificent two-layered haaram, exquisitely handcrafted with intricate diamond detailing. Features traditional South Indian 'peacock' motifs symbolizing grace and prosperity. The lower layer features a grand pendant with a central Emerald, surrounded by diamonds and delicate pink quartz drops. The pendant also shows detailed filigree work. This is an exquisite example of traditional Telugu craftsmanship.",
  "colors": [
    "Golden hue from the 22K gold",
    "sparkling white diamonds",
    "vibrant green emeralds",
    "and soft pink quartz creating a luxurious and visually captivating palette."
  ],
  "occasions": [
    "Perfect for bridal wear (పెళ్లి)",
    "traditional ceremonies like Muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "Half-Saree function (లంగా ఓణి వేడుక)",
    "and grand festive occasions. Makes a statement at high-profile social events."
  ],
  "description": "This heirloom-worthy haaram embodies timeless elegance and cultural significance. Its exceptional craftsmanship, the brilliance of the diamonds, and the vibrant gemstones make it a truly unique and valuable piece. The peacock motif is a symbol of beauty and good fortune, making it a cherished possession for generations. A valuable investment and a stunning statement of South Indian heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Ruby",
    "Emerald",
    "Pink Quartz",
    "Manikya",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Peacock Motif",
    "Kanthabharanam",
    "ముహూర్తం",
    "సీమంతం",
    "లంగా ఓణి వేడుక",
    "పెళ్లి"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-02 2_0863",
  "collection": "diamond"
}