{
  "id": "necklaces-1218",
  "title": "Emerald Blossom Diamond Haaram - A Timeless Telugu Tradition",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (estimated)",
    "Two Oval Cut Emeralds (5.72ctw)",
    "Two Round Cut Rubies (8.61ctw)",
    "One South Sea Pearl (7.60mm). Finished with a lustrous Hyderabadi Polish."
  ],
  "features": "This exquisite haaram features a delicate floral motif meticulously crafted with brilliant-cut diamonds. The design showcases a central floral pendant with a larger emerald, mirroring a smaller pendant that culminates in a radiant south sea pearl. The necklace is designed with a high level of intricacy and care, giving it a modern yet timeless traditional feel.",
  "colors": [
    "Yellow Gold",
    "Vibrant Green Emeralds",
    "Deep Red Rubies",
    "and a soft White Pearl create a harmonious and luxurious color palette."
  ],
  "occasions": [
    "Perfect for weddings (kalyanam)",
    "engagements (nischitartham)",
    "milestone celebrations",
    "or any special occasion where you want to make a statement. Ideal for a Seemantham or Half-Saree function."
  ],
  "description": "This haaram is a unique blend of contemporary design and traditional South Indian aesthetics. The combination of the brilliance of diamonds, the rich colour of rubies and emeralds, and the soft elegance of the south sea pearl makes it a truly special piece. Crafted with meticulous detail and finished with a Hyderabadi polish, it promises durability and lasting beauty. A perfect heirloom to cherish for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Diamond",
    "Pearl",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Fine Jewelry",
    "Indian Jewelry",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Contemporary Design",
    "Kalyanam",
    "Nischitartham",
    "Seemantham",
    "Half-Saree Function",
    "Emerald Haaram",
    "Diamond Necklace"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-52-1_1792",
  "collection": "sjpl"
}