{
  "id": "necklaces-184",
  "title": "Rajputana Heirloom: Polki and Ruby Grand Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (GH Color",
    "VS Clarity)",
    "Natural Rubies (Oval Cut",
    "AA Quality)."
  ],
  "features": "This magnificent Haaram features an intricate arrangement of floral motifs, each hand-set with luminous Polki diamonds and accented with rich, red rubies. The centerpiece pendant showcases a classic crescent (చంద్రవంక) design, further embellished with Polki diamonds. The design incorporates the traditional closed setting (కుందన్) technique, typical of Hyderabadi craftsmanship, accentuating the natural beauty of the Polki diamonds.",
  "colors": [
    "Predominantly golden yellow from the high-karat gold",
    "contrasted beautifully with the fiery red of the rubies and the brilliant white of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (వివాహం)",
    "receptions",
    "Seemantham (శ్రీమంతం)",
    "and other important family celebrations. A statement piece for the modern bride looking to embrace her heritage."
  ],
  "description": "This Haaram is a true heirloom piece, reflecting the rich cultural heritage of Hyderabad. The use of high-quality Polki diamonds and natural rubies ensures lasting value and timeless beauty. The meticulous craftsmanship and intricate design make it a unique and unforgettable adornment. A true investment in artistry and tradition. Experience the opulence of Nizami jewelry with this masterpiece.",
  "tags": [
    "Haaram",
    "Polki Necklace",
    "Ruby Necklace",
    "Kundan Jewelry",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "కంఠాభరణం",
    "వివాహం",
    "శ్రీమంతం",
    "Chandravanka",
    "కుందన్",
    "Nizami Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0025_0433",
  "collection": "diamond"
}