{
  "id": "necklaces-1181",
  "title": "Magnificent Mayura Haaram with Emerald Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "featuring 8.43 carats of Emeralds (11 stones) and 4.07 carats of Rubies (13 stones). Total Gold Weight: 164.400 grams. Diamond Weight: 18.62 carats (3748 stones). Features a fine Hyderabadi Polish for a lasting lustre."
  ],
  "features": "This majestic Haaram showcases the timeless beauty of South Indian design. The intricate peacock (Mayura) motifs, meticulously crafted in gold and studded with diamonds, add a touch of regal elegance. Each floral and peacock element is individually handcrafted using traditional Nakshi work techniques. The pendant culminates in dangling Jhumka-style drops, enhancing its traditional appeal.",
  "colors": [
    "Predominantly gold with vibrant emerald green accents and subtle ruby highlights. The diamonds provide a brilliant white sparkle",
    "creating a captivating contrast."
  ],
  "occasions": [
    "Perfect for bridal wear (pellikuturu)",
    "grand celebrations like weddings (vivaham)",
    "Seemantham ceremonies",
    "and significant cultural events. Can also be styled for upscale modern gatherings."
  ],
  "description": "This Haaram is a masterpiece of craftsmanship, representing the pinnacle of South Indian jewelry design. The use of high-quality emeralds and diamonds, combined with the traditional peacock motif, makes it a valuable heirloom piece. The exquisite detailing and durable construction ensure that it will be cherished for generations. A true statement piece that reflects cultural heritage and refined taste.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Mayura",
    "Peacock",
    "Emerald",
    "Ruby",
    "Diamond",
    "22K Gold",
    "Hyderabadi Polish",
    "Vivaham",
    "Pellikuthuru",
    "kanthabharanam",
    "Traditional Jewelry",
    "Jhumka"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-07 2_1733",
  "collection": "sjpl"
}