{
  "id": "necklaces-242",
  "title": "Chandrika Kempu Stone Haaram - A Timeless Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-quality mixed alloy with Gold Electroplating",
    "adorned with Cubic Zirconia (CZ) stones",
    "Kempu (Ruby) stones",
    "Emerald accents",
    "and faux Pearls. Features a smooth",
    "durable finish."
  ],
  "features": "A stunning floral motif runs along the length of the Haaram, each element intricately embellished with sparkling CZ stones. The floral pattern is interspersed with Emeralds, adding depth and color. A prominent central pendant features a stylized floral design with a central Kempu stone, surrounded by CZ stones and accented with smaller hanging Kempu and Emerald drops. This piece beautifully blends traditional Telugu design elements with modern aesthetics. Antique finish is done on the metal. The setting style gives brilliance to each stone.",
  "colors": [
    "Primarily Gold with vibrant Ruby Red (Kempu) and Emerald Green accents. The shimmering CZ stones provide a brilliant",
    "white sparkle",
    "complemented by the soft luster of the faux Pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "engagements (Nischitartham)",
    "festive occasions",
    "and special celebrations. Its elegant design also makes it suitable for formal events where you want to make a sophisticated statement. Ideal for Bharatanatyam performances and other cultural events."
  ],
  "description": "This Chandrika Kempu Stone Haaram is a modern interpretation of a classic South Indian design. The combination of CZ stones, Kempu, and Emeralds creates a rich and luxurious look. The high-quality finish ensures durability, while the intricate detailing showcases exceptional craftsmanship. Its timeless design makes it a valuable addition to any jewelry collection. It's a piece that honors tradition while embracing contemporary style.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kempu",
    "Ruby",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Vivaaha",
    "Nischitartham",
    "Floral Design",
    "Gold Plated",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Chandrika",
    "Bridal Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0322_0519",
  "collection": "diamond"
}