{
  "id": "earrings-601",
  "title": "Enchanting Pushpa Jhumkas: Diamond and Gemstone Floral Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Finely crafted in [Assume 18K] Gold",
    "adorned with meticulously selected Diamonds (3.60ct)",
    "Pink Tourmaline",
    "Citrine",
    "and various other gemstones (12.06ct total). The setting features a secure prong setting and subtle filigree detailing. Hyderabadi Polish for lasting brilliance."
  ],
  "features": "These exquisite jhumkas feature a cascading floral design, reminiscent of blooming jasmine and lotus flowers. Each petal is encrusted with sparkling diamonds and vibrant gemstones. The design incorporates a modern aesthetic while retaining a touch of traditional South Indian elegance, mirroring temple jewelry motifs in a contemporary manner. The floral arrangement showcases exceptional detail and craftsmanship.",
  "colors": [
    "Rose Gold hue complementing the soft pinks of the Tourmaline",
    "sunny yellow of Citrine",
    "and the dazzling white of the diamonds. A harmonious blend of pastel shades creates a delicate and captivating look",
    "representative of traditional South Indian color palettes."
  ],
  "occasions": [
    "Perfect for grand celebrations",
    "weddings (especially Sangeet",
    "Reception)",
    "or as a statement piece for upscale events. These jhumkas add a touch of sophistication to both traditional attire like sarees and lehengas",
    "and modern outfits. Also suitable for gifting during Voni Function or as a treasured family heirloom."
  ],
  "description": "A stunning fusion of traditional South Indian craftsmanship and modern design. The high-quality diamonds and gemstones ensure lasting brilliance, while the intricate floral design adds a touch of timeless elegance. These jhumkas are not just jewelry; they are a statement of exquisite taste and cultural appreciation.",
  "tags": [
    "Jhumka",
    "Kammalu",
    "Earrings",
    "Diamond Earrings",
    "Gemstone Earrings",
    "Floral Jewelry",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Pushpa Kammalu",
    "Tourmaline",
    "Citrine",
    "Rose Gold",
    "Statement Earrings",
    "Indian Wedding"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-30-45 2_1820",
  "collection": "sjpl"
}