{
  "id": "necklaces-1074",
  "title": "Vaidoorya & Kundan Haar: An Enchanting Emerald and Ruby Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "High-Quality Zambian Emeralds (Vaidooryam)",
    "Rose Cut Polki Diamonds (Kundan)",
    "Cabochon Ruby Pendant. Hyderabadi Polish for lasting luster."
  ],
  "features": "A contemporary take on the classic Haar. This necklace showcases a stunning arrangement of oval-shaped Zambian emeralds, each nestled within a delicate Polki diamond (Kundan) surround. The floral motif, reminiscent of traditional South Indian 'poola jada', adds a touch of femininity. A striking teardrop cabochon ruby pendant, also surrounded by Polki diamonds, completes this piece. The setting is expertly crafted for durability and optimal gemstone visibility.",
  "colors": [
    "Emerald Green",
    "Ruby Red",
    "and Gold with shimmering Polki diamonds."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "receptions",
    "festivals (like Sankranti and Ugadi)",
    "and special occasions. This piece adds a touch of regal elegance to both traditional and contemporary attire."
  ],
  "description": "This exquisite Haar seamlessly blends tradition with contemporary aesthetics. The Zambian Emeralds, known for their vibrant color, are paired with the timeless charm of Polki diamonds, creating a statement piece that's both elegant and eye-catching. The high-quality craftsmanship ensures durability, making it a treasured heirloom for generations. Its the perfect statement piece for someone to elevate their wedding day look.",
  "tags": [
    "Haar",
    "Necklace",
    "Emerald",
    "Ruby",
    "Polki Diamonds",
    "Kundan",
    "Vaidooryam",
    "Zambian Emerald",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Indian Wedding",
    "Telangana Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "kantaabharanam"
  ],
  "original_id": "radhe_diam_DPNK8-1606_2487",
  "collection": "radhe"
}