{
  "id": "necklaces-416",
  "title": "Exquisite Floral Grand Haaram with Emerald Pendant and Pearl Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-purity Gold (estimated 22K)",
    "Fine Quality Rubies (2.25ct total weight)",
    "Single Emerald (1.65ct) in the pendant",
    "Freshwater Pearls (Moti - 44.23ct for the necklace and 20.22ct for the locket). Features a brilliant Hyderabadi Polish for lasting shine."
  ],
  "features": "The Haaram showcases an intricate floral design, meticulously crafted with delicate gold filigree work. Each flower is studded with sparkling rubies. The central pendant features a beautiful emerald, surrounded by a halo of shimmering gems and dangling pearls. The pendant connects to the floral necklace which contains a series of pearl droplets.",
  "colors": [
    "Predominantly gold with the vibrant red of the rubies",
    "the rich green of the emerald",
    "and the soft white of the pearls. A classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagements",
    "traditional ceremonies like Seemantham or Half-Saree functions",
    "and other grand celebrations. Also suitable for sophisticated evening events where you want to make a statement."
  ],
  "description": "This Grand Haaram embodies traditional South Indian elegance with a modern touch. The floral design and gemstone combinations are timeless, signifying prosperity and good fortune. The exceptional craftsmanship and high-quality materials ensure this piece will be treasured for generations. Own a piece of Hyderabad's rich jewelry heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Gold Jewelry",
    "Ruby Necklace",
    "Emerald Pendant",
    "Pearl Necklace",
    "Moti Mala",
    "Telugu Jewelry",
    "Muhurtham Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "కంఠాభరణం",
    "ముత్యాల హారం"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-57-59 2_0857",
  "collection": "diamond"
}