{
  "id": "necklaces-476",
  "title": "Vaibhavam Necklace: Exquisite Diamond and Gemstone Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in radiant 22K Gold (approx. 88.310 gms gross weight)",
    "this Haaram showcases a dazzling display of ethically sourced diamonds (approx. 10.21 carats total weight for neckpiece",
    "1.64 carats for pendant)",
    "a central",
    "high-quality Emerald (Eme: 2.31 carats total for neckpiece",
    "3.42 carats in the pendant)",
    "fiery Rubies (Ruby: 3.42 carats total for neckpiece",
    "3.42 carats in pendant)",
    "and lustrous South Sea Pearls (Moti: 8.57 carats",
    "2 pearls",
    "and 4.14 carats",
    "1 pearl",
    "in the pendant). Finished with a signature Hyderabadi polish for a lasting shine."
  ],
  "features": "This traditional Haaram features a floral and paisley-inspired design intricately studded with diamonds. The central pendant showcases a pear-shaped Emerald, surrounded by diamonds and rubies, culminating in a single, drop-shaped South Sea pearl (Moti). The neckpiece design incorporates delicate floral motifs, each meticulously detailed with diamonds. It is a modern interpretation of the classic guttapusalu design.",
  "colors": [
    "The color palette features the rich",
    "warm tones of 22K gold",
    "the vibrant red of rubies",
    "the lush green of the Emerald",
    "the brilliant white of diamonds",
    "and the creamy iridescence of South Sea pearls."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "engagement ceremonies",
    "Seemantham (baby shower)",
    "bridal showers",
    "and upscale festive events. An heirloom piece",
    "worthy of passing down generations."
  ],
  "description": "This Vaibhavam Necklace is a statement piece embodying South Indian heritage and luxury. The combination of precious gemstones, exquisite craftsmanship, and traditional design makes it a timeless treasure. Its substantial weight and exceptional quality ensure both durability and lasting value. The use of ethically sourced diamonds and high-quality gemstones speaks to our commitment to responsible luxury.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Diamond Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "Moti",
    "Guttapusalu",
    "Gold Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Set",
    "Nakshi",
    "Temple Jewelry",
    "Vaibhavam",
    "Grand Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-57 3_0939",
  "collection": "diamond"
}