{
  "id": "necklaces-1681",
  "title": "Emerald and Ruby Kundan Pendant Haaram - 'Pachala Manikyam Haram'",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Emeralds (faceted oval cut)",
    "Ruby (teardrop cabochon)",
    "Kundan setting (uncut diamonds - Polki)",
    "Hyderabadi Polish."
  ],
  "features": "This exquisite Haaram showcases a classic South Indian design, meticulously handcrafted by skilled artisans. The design features a continuous strand of lush green emeralds, each paired with a cluster of dazzling Kundan set uncut diamonds in a floral motif. The centerpiece is a striking teardrop cabochon ruby pendant, surrounded by a Kundan diamond halo, creating a captivating focal point. The gold is finished with a traditional Hyderabadi polish, enhancing its rich luster and antique appeal.",
  "colors": [
    "Predominantly green (emeralds) and deep red (ruby)",
    "with a warm yellow gold setting and the sparkling white of the uncut diamonds."
  ],
  "occasions": [
    "Ideal for weddings (Vivaaham)",
    "engagements (Nischitartham)",
    "traditional ceremonies (Pujas)",
    "Seemantham (baby shower)",
    "half-saree function (Langa Voni function)",
    "and other auspicious celebrations. Also suitable for high-end social events where a touch of regal elegance is desired."
  ],
  "description": "This 'Pachala Manikyam Haram' is a timeless investment piece that blends traditional craftsmanship with exceptional gemstone quality. The combination of emeralds and rubies is considered highly auspicious in South Indian culture. The Kundan setting adds a touch of royal grandeur, while the Hyderabadi polish ensures lasting brilliance. This Haaram is a statement of elegance, tradition, and enduring value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan",
    "Emerald",
    "Ruby",
    "Pachala",
    "Manikyam",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Gold Necklace",
    "Uncut Diamonds",
    "Polki Diamonds",
    "Seemantham",
    "Vivaaham",
    "Langa Voni",
    "Heirloom Jewelry",
    "Gemstone Necklace"
  ],
  "original_id": "stock_in_india_IMG-20241218-WA0018_2863",
  "collection": "stock"
}