{
  "id": "necklaces-417",
  "title": "Emerald Radiance Haaram: A Timeless Legacy",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted with 22K Gold (approximately 108.360 grams gross weight)",
    "adorned with dazzling Brilliant Cut Diamonds (approximately 15.69 carats diamond weight) and vibrant square-cut Emeralds (approximately 12.60 carats emerald weight). Features a rich Hyderabadi Polish for enduring luster."
  ],
  "features": "This Haaram showcases intricate floral motifs meticulously handcrafted with a delicate lace-like diamond setting. Emeralds are embedded as centerpieces within square bezels, juxtaposing the softness of the diamonds. The design subtly evokes traditional South Indian artistry, blending it with modern aesthetics.",
  "colors": [
    "The color palette is a harmonious blend of warm gold",
    "sparkling white diamonds",
    "and vivid green emeralds",
    "representing prosperity and growth in South Indian tradition."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "receptions",
    "and significant family celebrations like Seemantham",
    "Half-Saree Function (Langa Voni Function)",
    "or even upscale modern galas."
  ],
  "description": "This Emerald Radiance Haaram is more than just jewelry; it's an heirloom piece. The combination of precious metals, genuine gemstones, and skilled craftsmanship guarantees lasting value and timeless beauty. Its design seamlessly bridges the gap between traditional South Indian aesthetics and contemporary sensibilities, making it a versatile and cherished addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Addigai",
    "Vivaha",
    "Seemantham",
    "Langa Voni",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-00 3_0858",
  "collection": "diamond"
}