{
  "id": "necklaces-1414",
  "title": "Elegant Emerald and Diamond Antique Finish Haaram - పచ్చల మరియు వజ్రాల హారం",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously studded with brilliant-cut Diamonds and vibrant",
    "high-quality Emeralds. Features a lustrous Hyderabadi Polish for a timeless sheen."
  ],
  "features": "Intricately designed with delicate filigree work and floral motifs, characteristic of traditional South Indian jewelry. The Haaram features a central pendant adorned with a large Emerald, surrounded by shimmering Diamonds. Graceful emerald drops enhance the overall design. The setting style ensures maximum brilliance for both the diamonds and emeralds.",
  "colors": [
    "Classic combination of rich Gold",
    "sparkling White (Diamonds)",
    "and deep Green (Emeralds). This traditional color palette symbolizes prosperity and growth."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaham/పెళ్లి)",
    "Seemantham (శ్రీమంతం)",
    "or any festive occasion where you wish to make a statement. Also suitable for upscale modern events and receptions."
  ],
  "description": "This Haaram seamlessly blends traditional South Indian design with contemporary elegance. The exceptional craftsmanship, combined with the brilliance of the diamonds and the vibrant color of the emeralds, make it a true investment piece. The Hyderabadi polish adds a touch of regal sophistication. Symbolizes prosperity and heritage, making it a cherished heirloom.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Vivaham",
    "Pelli",
    "SriMantham",
    "పచ్చల హారం",
    "వజ్రాల హారం",
    "పెళ్లి నెక్లెస్",
    "బంగారు ఆభరణాలు",
    "Temple Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-22_2032",
  "collection": "sjpl"
}