{
  "id": "necklaces-745",
  "title": "Emerald & Diamond Satlada Haaram - A Verdant Symphony",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features meticulously selected Emerald beads and brilliant-cut Diamonds. Diamond clarity: VS1-VS2. Gold purity certified. Embellished with natural Emeralds."
  ],
  "features": "This Satlada Haaram boasts a breathtaking design, featuring five layers of intricately woven Emeralds and Diamonds. The centerpiece showcases a geometric pendant with floral motif, secured within a dazzling framework of diamonds. The pendant also features a diamond encrusted paisley drop. Expert craftsmanship in the traditional Hyderabadi style.",
  "colors": [
    "Predominantly Gold",
    "Emerald Green and White (Diamonds). The contrasting colors create a vibrant and luxurious aesthetic."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "receptions",
    "Seemantham",
    "or any event where you want to make a regal statement. Its timeless elegance makes it suitable for both traditional Telugu ceremonies and modern celebrations."
  ],
  "description": "This Satlada Haaram is a testament to the rich heritage of South Indian jewelry. Its intricate craftsmanship, combined with the vibrant Emeralds and sparkling Diamonds, makes it a truly unique and valuable piece. A stunning investment piece, it embodies both traditional charm and contemporary elegance.",
  "tags": [
    "Satlada",
    "Haaram",
    "Necklace",
    "Emeralds",
    "Diamonds",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaha Mahotsavam",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Green",
    "Diamond Necklace",
    "సత్లడ హారం",
    "Jewels"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-37 3_1251",
  "collection": "diamond"
}