{
  "id": "necklaces-292",
  "title": "Divine Lakshmi Diamond Haaram Set with Ruby and Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace & Earrings",
  "materials": [
    "22K Gold",
    "VVS Clarity Diamonds",
    "Natural Rubies",
    "Natural Emeralds",
    "South Sea Pearls. Features our signature Hyderabadi Polish for lasting brilliance."
  ],
  "features": "Intricately designed Haaram featuring a delicate floral and paisley (manga malai) motif studded with sparkling diamonds. The central pendant showcases a Lakshmi design, symbolising prosperity and good fortune. Accented with cabochon-cut Rubies and Emeralds for added vibrancy and antique feel. The matching Jhumkas echo the Haaram's design, featuring a delicate paisley top and a pearl-drop base.",
  "colors": [
    "Predominantly gold and white (diamonds) with striking accents of red (rubies) and green (emeralds). The pearls add a touch of creamy elegance."
  ],
  "occasions": [
    "Perfect for traditional South Indian weddings (vivaham/పెళ్లి)",
    "receptions",
    "Seemantham (శీమంతం)",
    "Half-Saree Functions (Padaharu Sammbaralu/పదహారు సంబరాలు)",
    "and other auspicious occasions. Also a stunning statement piece for high-end social gatherings."
  ],
  "description": "This Lakshmi Diamond Haaram set is a testament to the artistry of South Indian craftsmanship. The use of high-quality diamonds, natural gemstones, and the intricate design make it a valuable heirloom piece. The combination of traditional design and modern aesthetics ensures it will be cherished for generations. The Hyderabadi polish guarantees lasting shine and durability. A symbol of prosperity and elegance.",
  "tags": [
    "Diamond Haaram",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Lakshmi Pendant",
    "Jhumkas",
    "Ruby Emerald Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Manga Malai",
    "Kanthabharanam",
    "Vivaham",
    "Padaharu Sammbaralu",
    "శీమంతం",
    "పెళ్లి",
    "కంఠాభరణం",
    "జుంకాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0381_0578",
  "collection": "diamond"
}