{
  "id": "necklaces-928",
  "title": "Elegant Kundan Polki Long Haaram with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal with Gold Plating. High-quality Kundan Polki stones",
    "Emeralds (Pachala రాళ్ళు)",
    "and Rubies (రత్నాలు). Features faux pearls (ముత్యాలు). Expert craftsmanship with Hyderabadi Polish."
  ],
  "features": "This stunning long haaram features a classic design with alternating floral and circular motifs, each intricately embedded with sparkling Kundan Polki stones. Genuine-look emeralds and rubies are strategically placed to add pops of color and enhance the overall grandeur. The centerpiece is a larger pendant with floral details, a ruby center stone, and cascading emerald and ruby accents. The Kundan work is of superior quality, ensuring a brilliant sparkle.",
  "colors": [
    "Gold",
    "White (Polki)",
    "Green (Emeralds)",
    "Red (Rubies)",
    "Light Cream (faux Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "festivals (పండుగలు)",
    "and other special occasions. This haaram will add a touch of elegance to bridal looks (పెళ్లికూతురు) and traditional attire. Suitable for Seemantham (సీమంతం)",
    "Half-Saree function (సగం చీర ఫంక్షన్)",
    "and other celebratory events."
  ],
  "description": "A timeless piece with traditional South Indian design, crafted with high-quality materials. The Kundan Polki setting provides unmatched brilliance and sparkle. This haaram is a statement piece that will be treasured for generations. Its intricate design and gemstone accents make it a perfect blend of tradition and elegance, making it a valuable addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Long Necklace",
    "Kundan Polki",
    "Emerald",
    "Ruby",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "పెళ్లి ఆభరణాలు",
    "రత్నాలు",
    "ముత్యాలు",
    "కంఠాభరణం"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0322_2389",
  "collection": "necklace"
}