{
  "id": "necklaces-044",
  "title": "Divyamani Diamond Jhumka Pendant - Exquisite Bridal Shobha",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds",
    "Hyderabadi Polish"
  ],
  "features": "Intricate filigree work forming a delicate floral pattern studded with meticulously set brilliant cut diamonds. The Jhumka design features cascading gold beads, reminiscent of temple architecture and South Indian heritage. The pendant is crafted with a modern twist on the traditional Jhumka, making it a versatile piece. The gold has a rich Hyderabadi polish that enhances the depth of the gold’s natural hue.",
  "colors": [
    "Yellow Gold",
    "White Diamonds"
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "baby showers (Seemantham)",
    "half-saree functions (Langa Voni function)",
    "and festive occasions such as Diwali and Sankranti. Also suitable for upscale social gatherings and evening events."
  ],
  "description": "This exquisite pendant is a harmonious blend of tradition and contemporary design. The Jhumka design holds deep cultural significance in South Indian jewelry, symbolizing auspiciousness and feminine grace. The high-quality diamonds add a touch of modern glamour, making this piece a timeless investment that can be passed down through generations. The craftsmanship is impeccable, ensuring lasting beauty and durability.",
  "tags": [
    "Pendant",
    "Jhumka",
    "Locket",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Ethnic Jewelry",
    "Filigree",
    "Temple Jewelry",
    "Vivaha",
    "Nischitartham",
    "Seemantham",
    "Langa Voni",
    "శుభం (Shubham - Auspicious)",
    "నగలు (Nagalu - Jewelry)"
  ],
  "original_id": "diamond_jewellery_42acdb48-d384-42ed-9182-5092f0cf31a7_0108",
  "collection": "diamond"
}