{
  "id": "waistbands-024",
  "title": "Devasena's Delight: Diamond & Gemstone Elephant Vaddanam",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold (approx. 14.86 grams)",
    "Polki Diamonds (approx. 13.74 carats)",
    "Natural Rubies (approx. 4.90 carats - 13 stones)",
    "Natural Emeralds (approx. 4.82 carats - 7 stones). Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This stunning Vaddanam showcases exquisite craftsmanship with intricate floral motifs and elephant (Gaja) designs, symbolizing prosperity and royalty. The central hexagonal motif is adorned with a large emerald, surrounded by meticulously set polki diamonds. The design incorporates traditional South Indian elements while maintaining a contemporary elegance, ideal for the modern bride. The flexible design allows for comfortable wear.",
  "colors": [
    "Primarily gold with a dazzling white from the polki diamonds. Accents of deep red from the rubies and vibrant green from the emeralds create a rich",
    "auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings (vivaha)",
    "Seemantham ceremonies",
    "Bharatanatyam performances",
    "or any grand celebration where a statement piece is desired. Adds a touch of regality to bridal attire or traditional sarees."
  ],
  "description": "A true heirloom piece, this Vaddanam combines traditional South Indian artistry with the brilliance of polki diamonds, rubies, and emeralds. The elephant motifs symbolize strength and good fortune, making it a meaningful gift for a bride. The piece is crafted with high-quality materials and exceptional attention to detail, ensuring its beauty and durability for generations to come.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Kamarband",
    "Gold Jewelry",
    "Polki Diamonds",
    "Rubies",
    "Emeralds",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Gaja",
    "Elephant Motif",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Vivaha",
    "Seemantham",
    "Kuncham",
    "Oddiyanam"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-24-14-02-26 5_1323",
  "collection": "diamond"
}