{
  "id": "earrings-333",
  "title": "Emerald Radiance Jhumka - పచ్చల కాంతులు దిద్దుబాటు",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Platinum-plated alloy. Features meticulously cut",
    "high-clarity Cubic Zirconia (CZ) stones and vivid green Emerald imitations. Each stone is selected for its brilliance and likeness to precious emeralds."
  ],
  "features": "Inspired by traditional South Indian Jhumka designs with a contemporary twist. The earrings feature a cascading floral pattern, with pear-shaped and oval-cut Emerald imitations surrounded by intricate CZ pavé settings. The platinum finish gives it a sleek, modern appeal.",
  "colors": [
    "Predominantly green and white. The vibrant green Emerald imitations contrast beautifully with the sparkling white of the CZ stones and the cool tone of the platinum-plated alloy",
    "creating a striking visual effect."
  ],
  "occasions": [
    "Perfect for adding a touch of elegance to weddings",
    "receptions",
    "and festive gatherings. Can also be worn for contemporary events where a statement piece is desired. Suitable for brides",
    "wedding guests",
    "and anyone seeking to elevate their look."
  ],
  "description": "This Jhumka offers the allure of fine jewelry at an accessible price point. Its blend of traditional design and modern materials makes it versatile and durable. The carefully selected Emerald imitations give it an expensive look. Ideal for anyone looking for statement jewel without the price tag.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Emerald",
    "CZ",
    "Platinum",
    "South Indian Jewelry",
    "Statement Earrings",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Festive Jewelry",
    "Party Wear",
    "Fashion Jewelry",
    "దిద్దుబాటు",
    "కమ్మలు",
    "పచ్చ",
    "పండుగ నగలు",
    "పెళ్ళి నగలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-39_1373",
  "collection": "diamond"
}