{
  "id": "necklaces-1236",
  "title": "Exquisite Emerald & Diamond Antique Finish Haaram - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Sparkling Diamonds (12.88 Dwt)",
    "Premium Quality Emeralds (5.15 carat",
    "3 pieces + 39.70 carat)",
    "Rubies (7.25 Carat",
    "5 pieces). Showcases our signature Hyderabadi Polish for a lasting brilliance."
  ],
  "features": "This Haaram features intricate filigree work adorned with sparkling diamonds. The floral motifs and peacock accents reflect traditional South Indian artistry. The central pendant is detachable and can be worn separately. The vibrant emerald droplets add a touch of royalty. Showcases Nakshi work elements within the gold setting.",
  "colors": [
    "Predominantly gold with vibrant emerald green and subtle ruby red accents. The diamonds provide a brilliant white sparkle",
    "creating a stunning contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "muhurtham",
    "seemantham",
    "and other grand celebrations. Also suitable for high-end parties and special occasions where you want to make a statement."
  ],
  "description": "This Haaram embodies the rich heritage of South Indian jewelry. The exceptional craftsmanship, combined with the timeless design and high-quality gemstones, makes it a valuable heirloom piece. The detachable pendant provides versatility, while the classic design ensures it will remain a cherished treasure for generations. Possesses cultural value and symbolizes prosperity.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "Ruby",
    "22K Gold",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Filigree",
    "Nakshi Work",
    "Addigai",
    "Kasulaperu"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-58 3_1810",
  "collection": "sjpl"
}