{
  "id": "necklaces-347",
  "title": "Aadrika Diamond Haaram Set with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace and Earrings",
  "materials": [
    "Finest 18K Gold",
    "meticulously studded with brilliant-cut Cubic Zirconia (CZ) diamonds. Features high-quality Ruby cabochons",
    "Emerald cabochons",
    "and lustrous freshwater pearls. Finished with a radiant Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite Haaram showcases a modern floral design with intricate filigree detailing. The central ruby cabochon and surrounding emerald accents add a touch of traditional South Indian elegance. The accompanying jhumkas feature a matching floral motif and delicate pearl drops, completing the set. The necklace features a flexible mesh-style band for comfort and style.",
  "colors": [
    "Predominantly gold with dazzling white diamonds. The rich red of the rubies and vibrant green of the emeralds create a stunning contrast. The white pearls add a soft",
    "elegant touch."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and festive occasions. Its elegant design also makes it suitable for contemporary parties and special events. A versatile piece for both traditional 'Muhurtham' and modern celebrations."
  ],
  "description": "This Aadrika Haaram set offers a perfect blend of tradition and contemporary style. The high-quality Cubic Zirconia (CZ) diamonds provide a brilliant sparkle, rivaling that of natural diamonds, at a fraction of the cost. The intricate design and Hyderabadi polish showcase exceptional craftsmanship, making this a truly remarkable piece. It's a statement of sophistication and elegance.",
  "tags": [
    "Diamond Haaram",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Fine Jewelry",
    "CZ Diamonds",
    "Ruby",
    "Emerald",
    "Pearls",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Muhurtham Jewelry",
    "Hyderabadi Polish",
    "Necklace Set",
    "Bridal Jewelry",
    "Mogal Design",
    "Floral Design"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0461_0643",
  "collection": "diamond"
}