{
  "id": "necklaces-174",
  "title": "Neelakamalam Kundan Choker - A Royal Statement",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated Alloy",
    "High-Quality Kundan Stones",
    "Natural Pearls",
    "Enamel Work",
    "Hyderabadi Polish."
  ],
  "features": "This exquisite choker showcases a blend of traditional Kundan craftsmanship and a modern design aesthetic. The top layer features floral motifs intricately set with Kundan stones and framed with royal blue enamel. The Kundan stones are arranged in the traditional 'Pakhi' (bird) motif, symbolizing beauty and grace. Dangling teardrop-shaped Kundan pendants and strings of lustrous pearls add movement and elegance. The choker sits comfortably on the neck and secured with an adjustable dori.",
  "colors": [
    "Gold",
    "Royal Blue",
    "White (Pearls)",
    "Clear (Kundan). This combination is reminiscent of traditional South Indian wedding jewelry and adds a touch of regality."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "festive celebrations (like Sankranti",
    "Ugadi)",
    "and special occasions where you want to make a statement. Its modern design also allows it to be worn with contemporary Indian outfits for a chic",
    "fusion look."
  ],
  "description": "Handcrafted by skilled artisans with generations of experience in Kundan jewelry making. The high-quality Kundan stones are carefully selected for their brilliance and clarity. The Hyderabadi polish ensures a long-lasting shine and resistance to tarnish. A timeless piece that can be passed down as a family heirloom (parampara vastraalu).",
  "tags": [
    "Kundan Choker",
    "Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Neelakamalam",
    "Bridal Jewelry",
    "Haaram",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Pearls",
    "Enamel"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0014_0423",
  "collection": "diamond"
}