{
  "id": "earrings-028",
  "title": "Devasena Kundan Earrings - A Timeless Adornment",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "High-Quality Kundan Setting",
    "Oval Emerald",
    "Round Rubies",
    "Cubic Zirconia. Features our signature Hyderabadi polish for a lasting sheen."
  ],
  "features": "Intricate Kundan setting with a traditional floral motif. The central oval emerald is surrounded by sparkling rubies and shimmering Cubic Zirconia, creating a captivating contrast. These earrings showcase the artistry of South Indian craftsmanship, blending heritage with modern elegance.The design is light, comfortable, and ideal for all-day wear.",
  "colors": [
    "Predominantly gold with vibrant green (emerald) and red (ruby) accents",
    "complemented by the dazzling white of the Cubic Zirconia. This classic tricolor combination is considered auspicious in South Indian culture."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "festivals (పండుగలు)",
    "and family functions. Ideal for occasions like Seemantham",
    "Voni function (half-saree function)",
    "or as a cherished gift for a loved one. Also suitable for modern formal events where you want to add a touch of ethnic elegance."
  ],
  "description": "Embrace the timeless beauty of South Indian tradition with these exquisite Kundan Butta earrings. The meticulous craftsmanship ensures lasting beauty and durability. The classic design makes them a versatile addition to any jewelry collection, suitable for both traditional and contemporary styles. The combination of precious and semi-precious stones creates a harmonious balance of luxury and value.",
  "tags": [
    "Kundan Jewelry",
    "Earrings",
    "Butta",
    "Chevi Duddulu",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Emerald",
    "Ruby",
    "Cubic Zirconia",
    "Festive Jewelry",
    "Indian Earrings",
    "పెళ్లి",
    "పండుగలు",
    "చెవి దుద్దులు"
  ],
  "original_id": "diamond_jewellery_36786c4c-0616-4c52-9a9a-f1f46aa9eec8_0099",
  "collection": "diamond"
}