{
  "id": "earrings-328",
  "title": "Floral Emerald, Ruby, Diamond, and Pearl Jhumka Earrings - A Symphony of Tradition and Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in Fine Gold (FG). Adorned with brilliant-cut diamonds totaling 1.50 carats",
    "vibrant Ruby beads (3.53 carats)",
    "lush Emerald beads (4.46 carats) and Emerald many beads (5.04 carats) and lustrous South Sea Pearls (6.93 carats). Featuring a Hyderabadi polish for a lasting shine."
  ],
  "features": "These exquisite Jhumka earrings showcase a captivating floral design. The emerald clustered stud transitions into a delicate flower design. The floral motif, enhanced by sparkling diamonds, adds a touch of modern sophistication. Pearl accents add a touch of timeless grace, while a single emerald bead dangles delicately for a playful touch.",
  "colors": [
    "The earrings feature a rich color palette of gold",
    "emerald green",
    "ruby red",
    "pearl white",
    "and the dazzling sparkle of diamonds. The vibrant combination is reminiscent of traditional South Indian jewelry",
    "infused with contemporary aesthetics."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Vivahaalu)",
    "receptions",
    "engagement ceremonies",
    "festivals (Pandagalu)",
    "and other celebratory events. Their elegant design also makes them suitable for upscale parties and modern gatherings."
  ],
  "description": "These Jhumka earrings offer a harmonious blend of traditional South Indian design and contemporary style. They are meticulously handcrafted with high-quality materials, ensuring both beauty and durability. The vibrant colors and floral motif symbolize prosperity and happiness, making them a meaningful addition to any jewelry collection.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "Ruby",
    "Emerald",
    "Pearl",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Bharatanatyam Jewelry",
    "Vivahaalu",
    "Pandagalu",
    "Moti",
    "Gold"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-37_1368",
  "collection": "diamond"
}