{
  "id": "necklaces-005",
  "title": "The 'Anahita' Diamond Grandeur: Rose Gold Necklace Set with Matching Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "18K Rose Gold",
    "brilliant-cut diamonds",
    "meticulously set. The diamonds are of VS clarity and exhibit exceptional brilliance. Finished with a durable",
    "radiant Hyderabadi polish for lasting luster."
  ],
  "features": "This stunning set features a layered, cascading design reminiscent of traditional South Indian temple architecture. The necklace displays a graduating array of diamond-studded leaf and teardrop motifs. The matching Jhumkas echo the necklace design. Delicate filigree work adds a touch of vintage charm, while the rose gold provides a modern twist.",
  "colors": [
    "Primarily rose gold with the sparkling white brilliance of diamonds."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "receptions",
    "Seemantham",
    "and other celebratory events. Also suitable for upscale social gatherings and red carpet events where you want to make a statement."
  ],
  "description": "This set epitomizes timeless elegance and modern sophistication. The intricate diamond setting highlights the exceptional craftsmanship, making it a true heirloom piece. The Rose Gold is a contemporary take on classic South Indian Jewelry. The Hyderabadi polish guarantees a long-lasting, radiant shine.",
  "tags": [
    "Necklace",
    "Haaram",
    "Earrings",
    "Jhumka",
    "Rose Gold",
    "Diamonds",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Wedding",
    "Vivaha Mahotsavam",
    "Seemantham",
    "Diamond Necklace Set",
    "Contemporary Jewelry",
    "Diamond Jhumkas",
    "Grand Necklace",
    "Statement Jewelry"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0011_0040",
  "collection": "choker"
}