{
  "id": "necklaces-1585",
  "title": "Emerald Grandeur: Diamond and Emerald Bridal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 139.470 grams)",
    "Natural Emeralds (approximately 73.34 carats)",
    "Brilliant Cut Diamonds (approximately 4.80 carats). Features meticulously set Panadi diamonds and marquise cut diamonds. Hyderabadi Polish for lasting luster."
  ],
  "features": "A breathtaking layered Haaram featuring floral motifs intricately crafted with brilliant-cut diamonds. Lush, oval-cut and pear-shaped emeralds are meticulously bezel set and prong set creating a stunning contrast. The design embodies both traditional South Indian aesthetics and contemporary sophistication. The graduated emeralds and diamond arrangement creates a mesmerizing cascade effect, ideal for a bride.",
  "colors": [
    "Vibrant green emeralds",
    "dazzling white diamonds",
    "and warm yellow gold create a rich and captivating color palette."
  ],
  "occasions": [
    "Ideal for a bridal ensemble",
    "Muhurtham",
    "Seemantham",
    "engagement ceremonies",
    "or any grand celebration where you desire to make a statement."
  ],
  "description": "This Haaram is a testament to timeless elegance and superior craftsmanship. The combination of high-quality emeralds and diamonds ensures a dazzling display of light and color. Its exquisite design and enduring value make it a treasured heirloom to be cherished for generations. The piece embodies the opulence of Hyderabadi jewelry tradition. ",
  "tags": [
    "Haaram",
    "Emerald Necklace",
    "Diamond Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Pula Haaram",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Grand Necklace",
    "Gold Necklace",
    "Emeralds",
    "Diamonds",
    "Indian Wedding Jewelry",
    "Traditional Jewelry",
    "Jadau"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-47 2_2290",
  "collection": "sjpl"
}