{
  "id": "earrings-334",
  "title": "Enchanting Blossom Cascade Jhumkas: A Symphony of Tradition and Modernity",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base Metal with Gold Plating",
    "Diamonds MQ (0.31ct)",
    "Fancy Diamonds (1.34ct)",
    "Emerald Beads (11.68ct)",
    "Rice Pearls (2.48ct)",
    "Blue Chalcedony (2.37ct)",
    "Pink Morganite (1.65ct). Showcasing meticulous Hyderabadi Polish for a lasting gleam."
  ],
  "features": "These exquisitely crafted jhumkas feature a cascading floral design, blending traditional South Indian aesthetics with modern sensibilities. The design incorporates a delicate floral motif at the base, crowned with rice pearls, emerald beads, and morganite accent, culminating in a striking chalcedony drop. The entire piece is adorned with shimmering diamonds adding a touch of opulence. Each component is meticulously hand-set for enduring quality and aesthetic appeal.",
  "colors": [
    "Pastel color scheme with hues of blush pink",
    "verdant green",
    "ethereal blue and pearly white. The gold plating adds a warm undertone",
    "creating a harmonious blend of colors."
  ],
  "occasions": [
    "Perfect for a modern bride",
    "reception",
    "sangeet",
    "cocktail party",
    "or festive occasions. These jhumkas also beautifully complement a half-saree function or other significant family celebrations."
  ],
  "description": "A captivating blend of contemporary design and classic South Indian aesthetics. These earrings capture the essence of Hyderabadi craftsmanship, radiating sophistication and elegance. The variety of gemstones adds visual interest and luxury. Lightweight and comfortable to wear, the design ensures lasting wear. An heirloom-worthy piece that transcends time and trends.",
  "tags": [
    "Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Diamond Earrings",
    "Gemstone Earrings",
    "Indian Wedding Jewelry",
    "Traditional Jewelry",
    "Modern Indian Jewelry",
    "Party Wear Earrings",
    "Bridal Jewelry",
    "Half Saree Function",
    "Festive Jewelry",
    "Pearls",
    "Emeralds",
    "Chalcedony",
    "Morganite",
    "பூச்ச காதணிகள்",
    "Jhumkaalu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-40 2_1374",
  "collection": "diamond"
}