{
  "id": "earrings-495",
  "title": "Emerald Polki Diamond Drop Earrings - \"Pachala Vaajra Jhumka\"",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold setting (91.6% purity)",
    "High-quality Polki Diamonds with an antique finish",
    "Natural Pear-Shaped Emerald with excellent luster and vivid green color. Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "This elegant earring features a classic jhumka design with a modern twist. The top portion showcases a floral motif crafted with four Polki diamonds set in a unique arrangement. The pear-shaped emerald is cradled within a delicate, openwork frame adorned with shimmering diamonds, creating a captivating teardrop effect. Handcrafted by skilled artisans, this piece showcases impeccable attention to detail.",
  "colors": [
    "Vibrant green emerald contrasted with the warm",
    "golden hue of the 22K gold and the sparkling white of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for weddings (kalyanam)",
    "receptions",
    "anniversaries",
    "and special occasions. Also suitable for contemporary parties and festive celebrations."
  ],
  "description": "This exquisite jhumka earring flawlessly blends traditional South Indian aesthetics with a modern sensibility. The exceptional craftsmanship, combined with the use of precious materials like genuine Polki diamonds and a vibrant emerald, makes this a timeless investment piece. Its versatility allows you to wear it with both traditional sarees and contemporary ensembles. The natural emerald carries symbolic meaning, representing prosperity and good fortune.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Polki Diamonds",
    "Emerald",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Pachala Jhumka",
    "Vaajraalu",
    "Kalyanm",
    "Anniversaries"
  ],
  "original_id": "ear_rings_DPER8-1601_2622",
  "collection": "ear"
}