{
  "id": "necklaces-308",
  "title": "Manohari Mayura Haaram Set: Diamond Peacock Long Necklace with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "22K Gold base with Hyderabadi Polish. Features brilliant-cut diamonds of VS clarity",
    "interspersed with natural emeralds and rubies. Adorned with South Sea pearls."
  ],
  "features": "This exquisite Haaram showcases a classic peacock (Mayura) design, a symbol of beauty and grace. The intricate filigree work and pave setting of the diamonds highlight the detailed craftsmanship. The central ruby and emerald accents add a touch of traditional color. Matching Jhumkas echo the peacock motif and pearl drops for a cohesive look. Nakshi work detailing is evident in the peacock's feathers.",
  "colors": [
    "Predominantly gold and diamond white",
    "complemented by the rich red of the rubies and the vibrant green of the emeralds. The pearls add a soft",
    "creamy white hue."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "grand receptions",
    "and traditional ceremonies like Seemantham",
    "half-saree functions (Voni Function)",
    "and Muhurtham. A statement piece for any special occasion."
  ],
  "description": "This Manohari Mayura Haaram is a testament to timeless South Indian elegance. The superior diamond quality, intricate craftsmanship, and symbolic peacock design make it a valuable heirloom piece. The Hyderabadi Polish ensures lasting shine and durability. This set will not only enhance your beauty but also reflect your appreciation for tradition and artistry.",
  "tags": [
    "Haaram",
    "Long Necklace",
    "Diamond Necklace",
    "Peacock Jewelry",
    "Mayura",
    "Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Bridal Set",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Emeralds",
    "Rubies",
    "Pearls",
    "చెవి దిద్దులు",
    "Haaralu",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Voni Function"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0397_0594",
  "collection": "diamond"
}