{
  "id": "necklaces-365",
  "title": "Rajasi Haaram: Emerald and Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "Natural Emeralds (Colombian",
    "Round & Pear Cut",
    "VS Clarity)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "EF Color)",
    "South Sea Pearls. Features Hyderabadi Polish for lasting brilliance."
  ],
  "features": "Intricate filigree work inspired by traditional South Indian motifs, meticulously handcrafted by skilled artisans. The necklace features a cascading design with a central floral motif studded with emeralds. The lower pendant showcases a stunning pear-cut emerald surrounded by pavé-set diamonds and accented with delicate South Sea pearl drops. The necklace's chain has a contemporary mesh-like design for comfort and modern appeal.",
  "colors": [
    "Predominantly Gold and White (Diamonds) with striking Emerald Green accents and the soft luster of South Sea pearls."
  ],
  "occasions": [
    "Ideal for weddings",
    "engagements",
    "muhurtham ceremonies",
    "grand receptions",
    "and special occasions. Perfect for pairing with Kanjeevaram sarees or contemporary Indian attire. Also suitable as a statement piece for formal events."
  ],
  "description": "A timeless heirloom piece, blending traditional Telugu craftsmanship with modern design sensibilities. The use of high-quality materials ensures lasting beauty and value. The emeralds symbolize prosperity and good fortune, making it an auspicious choice for significant life events. Handcrafted by artisans from Hyderabad, known for their exquisite jewelry making traditions.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Pearl",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "Gold Jewelry",
    "22K Gold",
    "Muhurtham",
    "Engagement",
    "filigree work",
    "pavé setting",
    "Colombian Emerald",
    "VVS diamonds",
    "Rajasi",
    "Kasulaperu",
    "Addigai",
    "Kante",
    "Gundu mala"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0479_0661",
  "collection": "diamond"
}