{
  "id": "necklaces-349",
  "title": "Diamond Floral Haaram Set - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "18K Yellow Gold setting showcasing brilliant-cut Diamonds. Certified VVS clarity",
    "E color diamonds. Hyderabadi Polish for enduring luster. The chain is a woven gold mesh."
  ],
  "features": "Intricately designed floral motif with cascading diamond 'buttas'. Each flower is meticulously set with multiple diamonds. Jhumki style earrings complement the Haaram design. The necklace design features a modern take on the traditional Haarams, featuring delicate flowers that are arranged in rows. The settings are designed to maximize the sparkle and brilliance of each diamond. The delicate and refined design make the piece extremely special and unique.",
  "colors": [
    "Dominantly Gold and White (Diamond)"
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement ceremonies (Nischitartham)",
    "or upscale events. A stunning statement piece for the modern bride",
    "it also works beautifully for Seemantham and other special occasions. A great addition to high fashion occasions as well as for a high-end party."
  ],
  "description": "A contemporary interpretation of a classic South Indian design. Features high-quality diamonds that provide exceptional sparkle. A beautiful blend of tradition and modern aesthetics, ideal for the discerning woman. A truly special Haaram set that is sure to turn heads. The set is incredibly durable as a high-end material are used and the setting are incredibly secure.",
  "tags": [
    "Diamond Necklace",
    "Diamond Haaram",
    "Gold Necklace",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Jhumka Earrings",
    "Floral Design",
    "VVS Diamonds",
    "Fine Jewelry",
    "Nischitartham",
    "Seemantham",
    "Reception",
    "Haaram"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0463_0645",
  "collection": "diamond"
}