{
  "id": "necklaces-1015",
  "title": "Enchanting Pearl & Diamond Cascade Haaram Set",
  "category": "necklaces",
  "original_type": "Necklace & Earrings",
  "materials": [
    "18K Yellow Gold",
    "High-Quality Cubic Zirconia (CZ) Diamonds",
    "Natural Pearls. Features a lustrous Hyderabadi polish for enhanced brilliance."
  ],
  "features": "This exquisite set features a floral-inspired design, meticulously crafted with intricately set CZ diamonds that mimic the brilliance of real diamonds. The necklace boasts a cascading design with pearl drops, echoing the same graceful pattern in the accompanying jhumka-style earrings. The intricate filigree work captures the essence of traditional South Indian craftsmanship, blending seamlessly with a modern aesthetic. The necklace's chain is a sleek and flexible mesh-style design.",
  "colors": [
    "Primarily gold with dazzling white CZ diamonds and creamy white pearls."
  ],
  "occasions": [
    "Perfect for engagements",
    "weddings (sangeet",
    "reception)",
    "festive occasions",
    "cocktail parties",
    "and formal gatherings. Can also add a touch of elegance to contemporary outfits."
  ],
  "description": "This dazzling set offers the look of fine diamond jewelry at an accessible price point. The classic Haaram style gets a contemporary update with the lightweight CZ diamonds and pearl accents. The set is versatile enough to be worn with both traditional Indian attire and modern evening wear. High-quality materials ensure durability and lasting shine. The Hyderabadi polish provides a rich, luxurious gleam that sets this piece apart.",
  "tags": [
    "Haaram",
    "Necklace",
    "Earrings",
    "Jhumka",
    "CZ Diamond",
    "Pearls",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Engagement Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Gold Necklace",
    "Pearl Necklace",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "கல்யாண நகை",
    "ఆభరణాలు"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0474_2336",
  "collection": "necklace"
}