{
  "id": "bangles-317",
  "title": "Divine Vine Bangles - Kanganam",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold",
    "meticulously crafted with a Hyderabadi polish to enhance its luster. Adorned with high-quality Cubic Zirconia (CZ) stones",
    "offering the brilliance of diamonds at an accessible price point. The gold has a rich",
    "warm tone that complements the sparkle of the CZ stones."
  ],
  "features": "These bangles feature a delicate vine design, with intricately detailed leaves crafted from gold. The CZ stones are set in a channel setting, allowing maximum light reflection and creating a continuous line of sparkle. The design blends traditional motifs with a modern aesthetic. Includes a secure clasp for ease of wear and removal.",
  "colors": [
    "Warm Yellow Gold and Sparkling Clear White CZ stones."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "festive occasions like Sankranti",
    "Ugadi",
    "or Diwali",
    "and special events. These bangles can also be gifted during weddings",
    "baby showers",
    "or anniversaries. Great for a half-saree function (Langa Voni function)."
  ],
  "description": "These bangles are a beautiful fusion of traditional South Indian design and modern elegance. The high-quality gold and brilliant CZ stones provide a luxurious look and feel without the hefty price tag. The vine design symbolizes growth and prosperity, making it a meaningful gift. Crafted with the renowned Hyderabadi polish, ensuring long-lasting shine and durability. An affordable luxury that doesn't compromise on style or quality.",
  "tags": [
    "Bangles",
    "Kanganam",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Gold Bangles",
    "CZ Bangles",
    "Vine Design",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Festive Jewelry",
    "Wedding Jewelry",
    "Affordable Luxury",
    "Hyderabadi Polish",
    "Langa Voni",
    "Sankranti",
    "Ugadi",
    "Diwali"
  ],
  "original_id": "stock_in_india_IMG-20241130-WA0005_2764",
  "collection": "stock"
}