{
  "id": "necklaces-501",
  "title": "Pearl Embellished Floral Haar with Aqua and Coral Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (BIS Hallmarked). Features lustrous South Sea Pearls (Moti)",
    "faceted Aqua Carvin stones",
    "and vibrant Coral beads. Enhanced with shimmering Diamond Polki."
  ],
  "features": "A modern take on the traditional Haaram, featuring a stunning floral pendant centerpiece intricately embellished with pearls and delicate diamond Polki setting. The necklace strand showcases a unique pattern of alternating pearls, corals, and aqua beads, creating a vibrant and captivating design. The lower portion features a jhumka-inspired dangle, adding a touch of traditional South Indian charm.",
  "colors": [
    "Predominantly gold with the creamy white of the pearls",
    "the blue of the aqua gemstones",
    "and the orange hue of the corals create a captivating contrast. The diamond Polki adds a touch of sparkle and elegance."
  ],
  "occasions": [
    "Perfect for special occasions",
    "receptions",
    "and modern celebrations. A statement piece that complements both traditional attire like sarees and lehengas",
    "as well as contemporary ensembles."
  ],
  "description": "A unique fusion of traditional South Indian design and contemporary aesthetics. The high-quality South Sea Pearls and vibrant gemstones are meticulously set in 22K gold, ensuring lasting beauty and value. This piece is a perfect blend of heritage and modern style, making it a treasured addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Pearl Jewelry",
    "South Sea Pearls",
    "Moti",
    "Diamond Polki",
    "Coral Beads",
    "Aqua Stone",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-31_0981",
  "collection": "diamond"
}