{
  "id": "necklaces-447",
  "title": "Emerald Blossom Haaram: A Touch of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (గుండు బంగారం) with Hyderabadi Polish. Features brilliant-cut diamonds and vibrant",
    "natural emerald gemstones. Gold weight: 35.360 grams",
    "Diamond weight: 3.53 carats (882 pieces)",
    "Emerald Weight: 1.30 carats (12 pieces)"
  ],
  "features": "This exquisite two-layered haaram showcases a delicate floral design. The lower layer features emeralds nestled within intricately crafted golden flower motifs, surrounded by dazzling diamonds. The upper layer boasts a single strand of diamonds, creating a graceful cascade effect. The necklace embodies a harmonious blend of traditional South Indian artistry and modern design sensibilities.",
  "colors": [
    "Lustrous yellow gold",
    "vibrant emerald green",
    "and dazzling white diamonds create a rich and captivating color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "festive occasions (పండుగలు)",
    "and special celebrations. Its elegant design also makes it suitable for contemporary events and formal gatherings."
  ],
  "description": "A stunning testament to Hyderabadi craftsmanship, this Emerald Blossom Haaram is a timeless heirloom. The combination of emeralds and diamonds is considered auspicious, symbolizing prosperity and longevity. The intricate floral design reflects traditional South Indian aesthetics, making it a perfect blend of cultural heritage and modern elegance. The high-quality materials and expert craftsmanship ensure lasting beauty and value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Pelli Jewelry",
    "Kantaabharanam",
    "Gundubangaram",
    "Emerald Necklace",
    "Diamond Necklace",
    "Festive Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-47 3_0910",
  "collection": "diamond"
}