{
  "id": "necklaces-028",
  "title": "Radiant Diamond Floral Haaram and Jhumka Set - A Touch of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Crafted in a dual-tone of 18K Rose and White Gold",
    "adorned with brilliant-cut diamonds. The diamonds are of VS clarity and GH color",
    "ensuring exceptional sparkle. Features the signature Hyderabadi Polish for a lasting luster and smooth finish."
  ],
  "features": "This set features a contemporary take on the traditional Haaram and Jhumka. The necklace showcases a geometric floral design interlinked with delicate flower motifs, culminating in a striking pendant featuring teardrop outlines. The Jhumkas echo the necklace's design, creating a harmonious and balanced look. The setting is meticulously done to maximize the diamonds' brilliance.",
  "colors": [
    "Dual-tone: Rose Gold and White Gold",
    "creating a warm and sophisticated contrast. The diamonds provide a dazzling white sparkle."
  ],
  "occasions": [
    "Perfect for modern brides",
    "receptions",
    "sangeet ceremonies",
    "and upscale parties. A stunning statement piece that adds a touch of glamour to any occasion."
  ],
  "description": "This necklace set blends the timeless elegance of South Indian jewelry with a modern sensibility. The dual-tone gold adds a unique dimension, while the sparkling diamonds ensure a captivating presence. Meticulously crafted by skilled artisans, this set is a testament to quality and enduring style. This would make a perfect Gift for loved ones as a symbol of enduring love and appreciation.",
  "tags": [
    "Diamond Necklace",
    "Jhumka",
    "Haaram",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Rose Gold Jewelry",
    "White Gold Jewelry",
    "Hyderabadi Jewelry",
    "Modern Haaram",
    "Contemporary Jhumka",
    "VS Clarity Diamonds",
    "Bridal Set",
    "Fine Jewelry",
    "Indian Wedding"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0034_0063",
  "collection": "choker"
}