{
  "id": "earrings-142",
  "title": "Enchanting Polki Diamond and Emerald Chandbali Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Polki Diamonds (పొల్కి వజ్రాలు)",
    "Emeralds (పచ్చ)",
    "Seed Pearls (చిన్న ముత్యాలు). Features Hyderabadi Polish for a rich luster."
  ],
  "features": "These Chandbali earrings boast a classic floral design, meticulously handcrafted by artisans from Hyderabad. The Polki diamonds are set in a traditional uncut style, surrounded by vibrant Emeralds. Dainty seed pearls add a touch of elegance, enhancing the overall antique charm. Design inspiration taken from traditional Telugu jewellery.",
  "colors": [
    "Predominantly Gold",
    "with contrasting hues of Green (Emeralds) and sparkling White (Polki Diamonds). The seed pearls add a subtle",
    "creamy white accent."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (వివాహం)",
    "festivals (పండుగలు)",
    "receptions (సన్మానాలు)",
    "or any event where you want to make a statement. Ideal for Muhurtham",
    "Sangeet",
    "or even a sophisticated evening event."
  ],
  "description": "These Chandbali earrings are a true testament to Hyderabadi craftsmanship. The unique combination of Polki diamonds and emeralds creates a mesmerizing effect. The earrings exude heritage and sophistication, making them a valuable addition to any jewelry collection. It's a versatile piece that perfectly blends tradition with contemporary aesthetics.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Jhumka",
    "Polki",
    "Diamonds",
    "Emeralds",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "చెవి దుద్దులు",
    "చందబలి",
    "వజ్రాలు",
    "పచ్చ",
    "పండుగ",
    "వివాహం",
    "Ethnic",
    "Indian Wedding",
    "Antique Finish",
    "Uncut Diamonds"
  ],
  "original_id": "diamond_jewellery_DPER8-1451_0266",
  "collection": "diamond"
}