{
  "id": "necklaces-192",
  "title": "Vanashree Polki and Emerald Haar: A Verdant Symphony of Tradition",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Natural Zambian Emeralds",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite haar features a floral motif design, meticulously handcrafted using traditional Nakshi work. The Polki diamonds are set in a Kundan setting, accentuating their raw brilliance. Lustrous, round Zambian emeralds punctuate the design, adding a touch of vibrant color. The setting features a traditional, layered flower petal design, reminiscent of vintage Nizam jewelry.",
  "colors": [
    "Predominantly gold and green",
    "with the dazzling white brilliance of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagement ceremonies (Muhurtham)",
    "festive celebrations like Sankranti",
    "Ugadi",
    "and Diwali",
    "or any special occasion where you want to make a grand statement. Also suitable for formal events and elegant gatherings."
  ],
  "description": "This Vanashree Haar is a testament to Hyderabadi craftsmanship. The unique combination of Polki diamonds and Zambian emeralds creates a visually stunning and luxurious piece. Its traditional design elements are steeped in cultural significance, making it an heirloom-worthy investment. The rich Hyderabadi polish ensures lasting luster and durability. Wearing this Haar is a statement of refined taste and cultural pride (సంస్కృతి గర్వకారణం).",
  "tags": [
    "Haar",
    "Necklace",
    "Polki",
    "Diamonds",
    "Emeralds",
    "Zambian Emeralds",
    "Gold",
    "22K Gold",
    "Kundan",
    "Nakshi Work",
    "Temple Jewelry",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Vivaham",
    "Muhurtham",
    "Hyderabad Jewelry",
    "Kantaabharanam",
    "కంఠాభరణం",
    "polki diamond necklace",
    "emerald necklace",
    "indian bridal necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0037_0445",
  "collection": "diamond"
}