{
  "id": "necklaces-372",
  "title": "Rajeshwari Ruby & Diamond Collar Necklace - Jadau Kundan Inspired Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color)",
    "Natural Ruby Cabochons. Meticulously crafted with Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite necklace features a delicate collar design inspired by traditional Jadau Kundan craftsmanship. The floral motifs are intricately set with dazzling brilliant-cut diamonds, creating a breathtaking sparkle. The piece is anchored by two striking ruby cabochons in a floral design, adding a touch of regal elegance and traditional South Indian charm. The back chain is made of a mesh design.",
  "colors": [
    "Yellow Gold",
    "Fiery Red Rubies",
    "and Sparkling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "engagement ceremonies (Nischitartham)",
    "or high-end festive occasions. Makes a stunning statement piece for contemporary evening wear or a special anniversary."
  ],
  "description": "A harmonious blend of traditional Telugu jewelry artistry and contemporary design sensibilities. The stunning Ruby and Diamond combination symbolizes prosperity and enduring love, making it a meaningful heirloom piece. The brilliant diamonds ensure an unforgettable sparkle, while the rich gold provides a timeless look. The craftsmanship ensures durability and lasting value. A true 'Varalakshmi Vratam' worthy piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Ruby",
    "Diamond",
    "Jadau Kundan",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Varalakshmi Vratam",
    "Vivaham",
    "Nischitartham",
    "collar necklace",
    "statement necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0486_0668",
  "collection": "diamond"
}