{
  "id": "necklaces-1231",
  "title": "The Emerald Empress: Exquisite Diamond and Emerald Addigai Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Purity) with Hyderabadi Polish. Features brilliant-cut Diamonds (estimated VS clarity)",
    "complemented by vibrant",
    "pear-shaped Emeralds (Panna/పచ్చ). Locket details include: Ruby: 2.48(1)",
    "Emerald: 1.56(1). Necklace details include Ruby: 3.64(8)",
    "Emerald: 3.52(4)"
  ],
  "features": "This Addigai Haaram showcases a classic South Indian design with a modern flair. The close-set diamonds create a dazzling effect across the entire necklace, while the emerald accents add a touch of regal elegance. The intricate pendant features a detailed floral design, further enhancing the beauty of the center Emerald. The delicate diamond and ruby drops provide a touch of movement and sparkle.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with striking emerald green accents. The subtle ruby accents add warmth to the overall color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha/వివాహము)",
    "engagements (Nischitartham/నిశ్చితార్థం)",
    "or grand celebrations. Also suitable for significant cultural events like Seemantham (సీమంతం) or Half-Saree functions."
  ],
  "description": "This Addigai Haaram is a true heirloom piece, blending traditional South Indian design with modern sensibilities. The high-quality materials and meticulous craftsmanship ensure its lasting value and beauty. The Emeralds symbolize prosperity and good fortune, making it a meaningful and cherished addition to any jewelry collection. A true statement piece that exudes grace and sophistication.",
  "tags": [
    "Addigai",
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "కంఠాభరణము",
    "పచ్చ",
    "వివాహము",
    "నిశ్చితార్థం",
    "సీమంతం",
    "Panna",
    "Emerald",
    "Diamonds",
    "Ruby"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-56_1805",
  "collection": "sjpl"
}