{
  "id": "bangles-119",
  "title": "Celestial Vine Diamond Vanki - Baju Bandh with Emerald & Ruby Accents",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Yellow Gold",
    "Natural Diamonds (SI Clarity",
    "G-H Color)",
    "Emerald (Cabochon Cut)",
    "Ruby (Cabochon Cut). Hyderabadi Polish enhances the gold's luster."
  ],
  "features": "This stunning Vanki design draws inspiration from celestial vines, meticulously crafted with intricate filigree detailing. The design culminates in a central, ornate motif featuring a pave setting of brilliant-cut diamonds. An emerald and ruby serve as focal points. The bracelet's tapered band echoes the vine motif, ensuring a comfortable and secure fit. The antique gold finish lends a timeless elegance.",
  "colors": [
    "Gold (Yellow)",
    "Diamond (White)",
    "Emerald (Green)",
    "Ruby (Red)"
  ],
  "occasions": [
    "Ideal for weddings",
    "engagements",
    "receptions",
    "and festive celebrations like Diwali",
    "Sankranti",
    "and Ugadi. Also perfect for a sophisticated modern look",
    "complementing traditional silk sarees or contemporary Indian attire."
  ],
  "description": "This Vanki embodies the perfect fusion of tradition and contemporary design. The brilliant diamonds, combined with the classic emerald and ruby, radiate luxury. The expert craftsmanship ensures exceptional durability, making it a cherished heirloom. Its adjustable design provides a comfortable fit for various wrist sizes. A statement piece that embodies elegance and cultural richness.",
  "tags": [
    "Vanki",
    "Baju Bandh",
    "Armlet",
    "Diamond Bracelet",
    "Gold Bracelet",
    "Emerald",
    "Ruby",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Celestial Design",
    "Telugu Jewelry",
    "Baahubali Bracelet",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0271_0470",
  "collection": "diamond"
}