{
  "id": "necklaces-947",
  "title": "Manohari Kundan Haaram: Regal Brilliance for Your Special Day",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "High-quality Kundan setting with meticulously placed cubic zirconia (CZ) stones",
    "Ruby (Padmaraga) center stone",
    "Emerald (Marakata) accents. Features a delicate Hyderabadi Polish for lasting luster."
  ],
  "features": "Intricate Kundan setting showcasing traditional South Indian 'Mogra' (jasmine flower) and 'Mayur' (peacock) motifs. The centerpiece features a striking rectangular Ruby surrounded by CZs, flanked by graceful peacocks and Emerald accents on either side. The pendant below replicates the floral patterns, and culminates in an exquisite Emerald drop. The necklace is finished with delicate pearl-like drops or 'gundlu' (గుండ్లు) that sway beautifully.",
  "colors": [
    "Predominantly Gold",
    "with the brilliance of White CZs. Accents of rich Red (Ruby) and vibrant Green (Emerald) create a captivating color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham/పెళ్లి)",
    "engagements ( நிச்சயதார்த்தம்)",
    "Seemantham (శ్రీమంతం)",
    "half-saree functions (Langa Voni/లంగా ఓణి)",
    "and other grand celebrations. Also suitable for upscale modern events where you want to make a statement."
  ],
  "description": "This Kundan Haaram epitomizes Hyderabadi craftsmanship and South Indian heritage. Its timeless design makes it a valuable heirloom piece. The brilliance of the CZ stones combined with the richness of the gold and the vivid colors of the gemstones create a stunning visual impact. Comfortable to wear and exceptionally durable due to its high-quality materials and construction.",
  "tags": [
    "Kundan Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Indian Bridal Jewelry",
    "Wedding Necklace",
    "22K Gold",
    "Ruby",
    "Emerald",
    "CZ",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Mogra",
    "Mayur",
    "Gundlu",
    "కంఠాభరణం",
    "పెళ్లి",
    "Vivaaham",
    "கல்யாணம்",
    "நிச்சயதார்த்தம்"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0341_2408",
  "collection": "necklace"
}