{
  "id": "bangles-108",
  "title": "Lakshmi Devi Temple Design Cufflinks - A Touch of Divine Elegance",
  "category": "bangles",
  "original_type": "Cufflinks",
  "materials": [
    "22K Yellow Gold",
    "embellished with high-quality Cubic Zirconia (CZ) stones and delicate Ruby accents. Features Hyderabadi polish for a lasting luster and brilliance."
  ],
  "features": "Intricately crafted with a miniature depiction of Goddess Lakshmi seated on a lotus, reflecting traditional temple architecture (Devalayam). The openwork design enhances the intricate Nakshi work, and the bezel setting of the stones highlights their brilliance. The square-shaped frame adds a touch of modern sophistication.",
  "colors": [
    "Predominantly yellow gold",
    "complemented by the sparkle of white CZ stones and pops of red from the Ruby accents. A timeless and auspicious color palette."
  ],
  "occasions": [
    "Perfect for formal events",
    "weddings",
    "religious ceremonies",
    "or as a meaningful gift for occasions like housewarmings or birthdays. A sophisticated way to express your faith and heritage."
  ],
  "description": "A harmonious blend of traditional South Indian artistry and modern design. The Lakshmi motif brings blessings and prosperity, while the sparkling stones add a touch of luxury. Meticulously handcrafted by skilled artisans in Hyderabad, ensuring exceptional quality and durability. A conversation starter and a valuable addition to any discerning gentleman's wardrobe.",
  "tags": [
    "Cufflinks",
    "Temple Jewelry",
    "Lakshmi",
    "Goddess Lakshmi",
    "Devalayam",
    "Nakshi work",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Gift for Men",
    "Cubic Zirconia",
    "Ruby",
    "22K Gold",
    "Gold Jewelry",
    "Hindu God",
    "Festival Jewelry",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_1d9d1a52-a29a-4088-aeef-37ceb0a9a4fa_0083",
  "collection": "diamond"
}