{
  "id": "rings-053",
  "title": "Peacock Motif Vanki Armlet - Traditional Andhra Baju Bandh",
  "category": "rings",
  "original_type": "Armlet/Baju Bandh",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds",
    "Ruby",
    "Emerald. Features a Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "Intricately designed armlet showcasing a peacock motif at the center. Embellished with brilliant-cut diamonds in a delicate floral pattern on the sides. The center features a traditional peacock design with inlaid ruby and emerald gemstones. Handcrafted with exquisite detail and a meticulous attention to symmetry, reflecting the artistry of South Indian craftsmanship. The traditional ‘vanki’ design is elevated with a touch of modern elegance through the diamond accents.",
  "colors": [
    "Yellow Gold",
    "White (Diamonds)",
    "Red (Ruby)",
    "Green (Emerald)"
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "bridal wear",
    "or any festive occasion. A stunning addition to a Bharatnatyam or Kuchipudi performance ensemble. Ideal for Muhurtham",
    "Seemantham",
    "or any traditional Telugu function."
  ],
  "description": "This Vanki armlet is more than just jewelry; it's a piece of art. The peacock motif symbolizes beauty, prosperity, and grace, making it an auspicious adornment for special occasions. The combination of traditional design and sparkling diamonds creates a timeless appeal. Handcrafted by skilled artisans, it showcases the rich heritage of South Indian jewelry making. The Hyderabadi polish ensures long-lasting shine and durability, making it an heirloom piece to be cherished for generations. The adjustable design offers a comfortable and secure fit.",
  "tags": [
    "Vanki",
    "Baju Bandh",
    "Armlet",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Peacock Jewelry",
    "Gold Jewelry",
    "Diamond Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Polish",
    "Temple Jewelry",
    "Andhra Jewelry",
    "వంకీ",
    "బాజు బంద్",
    "దక్షిణ భారత ఆభరణాలు",
    "పెళ్లి ఆభరణాలు"
  ],
  "original_id": "tanmanya_diamonds_open-close_IMG-20241114-WA0004_2866",
  "collection": "tanmanya"
}