{
  "id": "necklaces-473",
  "title": "Exquisite Diamond & Emerald Chandramukhi Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal plated in 22K Gold. Features meticulously set sparkling diamonds (1059) weighing 12.16 dwt. Adorned with two vibrant rubies weighing 3.47 (2) and emeralds weighing 1.90 (2) and locket details",
    "with 124 diamonds weighing 1.63 dwt",
    "one ruby weighing 2.23 and one emerald weighing 1.20. Exceptional Hyderabadi Polish for a lasting radiant finish."
  ],
  "features": "This stunning Haaram presents a contemporary take on the traditional Chandramukhi design. The layered design is accentuated by a center locket featuring intricate filigree work and a pear-shaped emerald. The necklace design gives a floating effect with small emerald drops at the bottom giving it an ethereal and feminine touch.",
  "colors": [
    "Radiant gold finish complemented by the fiery red of rubies and the lush green of emeralds",
    "creating a classic and auspicious South Indian palette."
  ],
  "occasions": [
    "Perfect for a grand wedding reception",
    "Sangeet",
    "or a formal party. Also appropriate for other festive occasions."
  ],
  "description": "This Haaram is a statement piece that seamlessly blends traditional design elements with modern sensibilities. The high-quality diamonds and vibrant gemstones make it a valuable heirloom piece to be treasured for generations. The craftsmanship reflects the rich jewelry-making heritage of Hyderabad, known for its exquisite stone settings and polished finish. Its beauty and durability make it the perfect addition to your bridal jewellery.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Chandramukhi",
    "Diamond Necklace",
    "Emeralds",
    "Rubies",
    "22K Gold Plated",
    "Hyderabadi Jewelry",
    "Muhurtham Jewelry",
    "Reception Jewelry",
    "kantaabharanam",
    "కంఠాభరణం",
    "ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-56 3_0936",
  "collection": "diamond"
}