{
  "id": "waistbands-019",
  "title": "The Emerald Glory Vaddanam: A Timeless Bridal Statement",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "Crafted in high-purity gold",
    "intricately embellished with 14.30 carats of sparkling diamonds. Features a striking 4.70 carat ruby",
    "complemented by 9.23 carats of vibrant emeralds and adorned with 23.95 carats of lustrous South Sea pearls. Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite Vaddanam showcases a stunning floral and paisley design, masterfully crafted by our skilled artisans. The central motif features a large, teardrop-shaped emerald, surrounded by a halo of dazzling diamonds. Delicate pearl drops enhance its elegance and movement. Each element is meticulously set to ensure both beauty and durability.",
  "colors": [
    "Predominantly white (diamonds) and gold",
    "with vibrant green from the emeralds",
    "a touch of red from the ruby",
    "and the soft creamy luster of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu/పెళ్లి)",
    "traditional dance performances (Kuchipudi/కూచిపూడి",
    "Bharatanatyam/భరతనాట్యం)",
    "Seemantham (సీమంతం)",
    "and other auspicious occasions. Also a stunning piece for a grand reception or gala."
  ],
  "description": "This Vaddanam is more than just jewelry; it's a work of art, representing the pinnacle of South Indian craftsmanship. Its classic design and high-quality materials ensure it will be a treasured heirloom for generations. The use of traditional motifs combined with contemporary design principles creates a piece that is both timeless and modern. The intricate detailing and quality of the gemstones elevate this piece to a true investment.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "South Indian Jewelry",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "ఒడ్డాణం",
    "పెళ్లి",
    "Vivahaalu",
    "Seemantham",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-04 2_1300",
  "collection": "diamond"
}