{
  "id": "necklaces-1244",
  "title": "Diamond Floral Cascade Haaram - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in fine gold (FG",
    "weight: 82.73 grams)",
    "this haaram is adorned with meticulously set diamonds. Features a brilliant array of Pear-shaped and Marquise-cut diamonds with exceptional clarity. Total diamond weight is 2.377 carats (473 stones)."
  ],
  "features": "This stunning necklace features a cascading three-layer design, with each layer showcasing intricate floral motifs. The diamonds are expertly set in a modern prong setting to maximize their brilliance and fire. The floral clusters transition into elegant Pear-shaped diamond drops in some places, adding a touch of sophistication. Contemporary design inspired by traditional Telugu artistry.",
  "colors": [
    "Predominantly white due to the diamonds",
    "contrasted by the underlying gold's subtle sheen."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha Mahotsavam)",
    "receptions",
    "and high-profile parties. This statement piece will add a regal touch to any bridal ensemble or formal attire. Also suitable for Sangeeth and other celebratory events."
  ],
  "description": "A modern take on the classic Haaram, this necklace combines traditional South Indian aesthetics with contemporary design sensibilities. The exceptional craftsmanship and high-quality diamonds make it a timeless heirloom piece. Its intricate floral design symbolizes prosperity and new beginnings, making it an auspicious gift. The cascading design creates a flattering and elegant silhouette.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Contemporary Jewelry",
    "Floral Design",
    "Pear Shaped Diamonds",
    "Marquise Diamonds",
    "Hyderabadi Jewellery",
    "Vivaha Mahotsavam",
    "Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-45-08 3-1_1838",
  "collection": "sjpl"
}