{
  "id": "necklaces-260",
  "title": "Navaratan Kundan Antique Finish Haaram - A Royal Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "featuring high-quality Kundan setting",
    "natural Rubies (Manikyam)",
    "Emeralds (Pachalu)",
    "and uncut Diamonds (Polki)."
  ],
  "features": "This breathtaking Haaram features a stunning Kundan setting meticulously handcrafted by artisans in Hyderabad. The intricate design showcases a central square Ruby, framed by sparkling Polki diamonds. Flanking it are three pendants of emeralds with diamond accents, creating a regal Navaratan effect. The chain features a repetitive wave pattern with diamond settings.",
  "colors": [
    "Predominantly gold",
    "accentuated by the rich red of the Ruby",
    "the vibrant green of the Emeralds",
    "and the dazzling white of the Polki Diamonds. A classic",
    "auspicious color combination."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "festive occasions like Diwali (Deepavali)",
    "and traditional celebrations such as Seemantham or half-saree functions (Voni Karyakramam). Also suitable for high-end social events where you want to make a statement."
  ],
  "description": "This Kundan Haaram is a true heirloom piece, representing the pinnacle of Hyderabadi jewelry craftsmanship. The combination of premium materials, exquisite design, and traditional techniques makes it a valuable investment. The Navaratan design is believed to bring prosperity and good fortune, making it not just beautiful but also auspicious.",
  "tags": [
    "Kundan",
    "Haaram",
    "Navaratan",
    "Ruby",
    "Emerald",
    "Polki",
    "Diamond",
    "Necklace",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Antique Finish",
    "Hyderabadi Jewelry",
    "కంఠాభరణం",
    "Manikyam",
    "Pachalu",
    "Vivahaalu",
    "Seemantham",
    "Polki Diamond",
    "Uncut Diamond",
    "Jadau"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0340_0537",
  "collection": "diamond"
}