{
  "id": "necklaces-656",
  "title": "Aadhya Diamond & Pink Sapphire Kasulaperu Inspired Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Yellow Gold with Hyderabadi Polish. Features brilliant-cut Diamonds (VS Clarity",
    "G-H Color) and oval-shaped Pink Sapphires. Gold-plated rope chain."
  ],
  "features": "This stunning necklace draws inspiration from the traditional Kasulaperu design, reimagined with a modern aesthetic. The intricately designed floral motifs are studded with sparkling diamonds and accented with royal blue enamel detailing. Pink sapphire drops add a touch of feminine elegance. The open-setting allows maximum light to enhance the brilliance of the diamonds. Features floral motifs, delicate filigree details.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented with pink (sapphires) and subtle blue detailing. A regal yet feminine palette perfect for special occasions."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "engagements",
    "and other celebratory events. A perfect statement piece for muhurtham ceremonies",
    "seemantham events",
    "or a sophisticated gala."
  ],
  "description": "A unique fusion of traditional South Indian design and modern jewelry aesthetics. The high-quality diamonds and pink sapphires offer exceptional sparkle and elegance. The Hyderabadi polish ensures a long-lasting, radiant finish. This necklace is a timeless heirloom that can be passed down through generations. The open setting maximizes the sparkle of the diamonds.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond Necklace",
    "Pink Sapphire",
    "South Indian Jewelry",
    "Kasulaperu Inspired",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Modern Traditional",
    "Engagement Jewelry",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Indian Jewelry",
    "Jewellery",
    "कंठी (Kanṭhī)",
    "ہار (Hār)"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-26-1_1162",
  "collection": "diamond"
}