{
  "id": "bangles-298",
  "title": "Elegant Diamond Blossom Bracelet - A Contemporary Wristlet with Timeless Appeal",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "18K Gold (Rose Gold and White Gold) and 1.08ctw Diamonds (80 stones). Featuring meticulously selected diamonds and crafted in 18K gold for lasting brilliance and exceptional quality. The Hyderabadi polish ensures a luxurious finish."
  ],
  "features": "This stunning bracelet features a unique link design with alternating rose gold abstract shapes and white gold diamond-studded blossom motifs. The prong setting showcases the diamonds' brilliance, creating a captivating sparkle. The abstract elements offer a contemporary twist to traditional designs. Features a secure lobster clasp for ease of wear.",
  "colors": [
    "Rose Gold and White Gold with Dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for modern celebrations",
    "upscale parties",
    "and adding a touch of glamour to everyday wear. Also suitable as a thoughtful gift for birthdays",
    "anniversaries",
    "or as a treasured keepsake."
  ],
  "description": "This bracelet is a harmonious blend of contemporary design and timeless elegance. The diamonds are meticulously set to maximize their brilliance, and the combination of rose gold and white gold offers a sophisticated and modern aesthetic. The high-quality craftsmanship and materials ensure durability and lasting value. The design can be paired with a variety of outfits to add a touch of luxury and sparkle.",
  "tags": [
    "Diamond Bracelet",
    "Gold Bracelet",
    "18K Gold",
    "Contemporary Jewelry",
    "Vanki",
    "Modern South Indian Jewelry",
    "Diamond Jewellery",
    "Party Wear",
    "Rose Gold",
    "White Gold",
    "Hyderabadi Jewelry",
    "Gift for Her",
    "Anniversary Gift",
    "Birthday Gift"
  ],
  "original_id": "sjpl_PHOTO-2024-05-09-11-07-53 3_2001",
  "collection": "sjpl"
}