{
  "id": "necklaces-954",
  "title": "Divyam Diamond Chandrani Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold (సువర్ణo) with meticulous attention to detail. Adorned with dazzling",
    "high-quality Cubic Zirconia (CZ) stones. Features Ruby (రత్నం) and Emerald (పచ్చ) accents for a touch of traditional elegance. Finished with a subtle Hyderabadi Polish for lasting shine."
  ],
  "features": "This exquisite Chandrani Haaram boasts a unique, modern interpretation of a classic design. The intricate chevron pattern on the necklace creates a captivating geometric effect. Features a gracefully designed pendant embellished with Ruby and Emerald stones, evoking the charm of temple jewelry (దేవాలయ ఆభరణాలు). Dainty gold beads cascade from the edges, adding a touch of movement and grace.",
  "colors": [
    "Predominantly gold with brilliant white CZ stones. Accents of rich red from the Rubies and vibrant green from the Emeralds create a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "engagements",
    "and other special occasions. An ideal choice for a bride (వధువు) during her muhurtham (ముహూర్తం) or for a sophisticated look at any formal event. Also suitable for traditional Telugu functions such as Seemantham or half-saree function."
  ],
  "description": "This Chandrani Haaram offers a perfect blend of tradition and modern aesthetics. Its brilliant sparkle and intricate design are sure to make a statement. The use of high-quality materials ensures lasting beauty and durability. A true heirloom piece to be cherished for generations. Its contemporary design allows it to be paired with both traditional and modern attire.",
  "tags": [
    "Chandrani Haaram",
    "Necklace",
    "Gold Necklace",
    "CZ Jewelry",
    "Ruby",
    "Emerald",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Kanthabharanam",
    "వివాహం",
    "కంఠాభరణం",
    "సువర్ణo",
    "రత్నం",
    "పచ్చ",
    "దేవాలయ ఆభరణాలు"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0348_2415",
  "collection": "necklace"
}