{
  "id": "necklaces-853",
  "title": "Emerald Enchantment: Diamond and Emerald Haaram with Jhumka Set",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "Finely crafted in 18K Gold",
    "encrusted with brilliant-cut Diamonds. Adorned with vibrant Emeralds of exceptional clarity. Features lustrous South Sea Pearls. Finished with a signature Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This exquisite Haaram showcases intricate floral and paisley motifs in a stunning diamond setting. Emeralds are meticulously placed to enhance the necklace's regal appeal. The centerpiece features a detailed pendant with a prominent ruby accent, complemented by delicate pearl drops. Matching Jhumkas echo the Haaram's design, completing this captivating set.",
  "colors": [
    "Predominantly gold with sparkling white diamonds",
    "lush green emeralds",
    "a vibrant ruby accent",
    "and creamy white pearls",
    "creating a captivating contrast."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (పెళ్లి)",
    "receptions",
    "and traditional Telugu ceremonies like Seemantham (సీమంతం) or half-saree function (బాల సరస్వతి పూజ). Equally stunning for upscale evening events."
  ],
  "description": "A testament to timeless elegance, this Haaram set embodies the rich heritage of South Indian jewelry. The exceptional craftsmanship ensures heirloom quality, while the use of premium materials guarantees lasting beauty and value. This set is not just jewelry; it's an investment in tradition and luxury.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace",
    "Earrings",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Pelli Jewellery",
    "సీమంతం",
    "పెళ్లి",
    "జుంకాలు",
    "కంఠ హారం",
    "Emeralds",
    "Diamonds",
    "Gold"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0385_1540",
  "collection": "haaram"
}