{
  "id": "necklaces-270",
  "title": "Manikyam Pachala Kasulaperu Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Fine-Cut Rubies (Manikyam)",
    "Emeralds (Pachala)",
    "Seed Pearls. Features the signature Hyderabadi Polish for lasting radiance. The diamonds are high-quality Cubic Zirconia giving an elegant look."
  ],
  "features": "This exquisite Kasulaperu Haaram blends tradition with contemporary design. The necklace features alternating circular motifs, each intricately set with Rubies, Emeralds, and glittering Cubic Zirconia. The central pendant showcases a teardrop design, fully encrusted with gems and adorned with delicate pearl drops. The back of the necklace is finely crafted for comfortable wear. Each motif is designed like a coin which is the hallmark of Kasulaperu Haaram.",
  "colors": [
    "Dominant gold with striking contrasts of Ruby red",
    "Emerald green",
    "and the soft luster of Seed Pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivah)",
    "engagements (Nischitartham)",
    "festive celebrations (Sankranthi",
    "Dussehra",
    "Diwali)",
    "and important family gatherings. A stunning choice for a bride or for a traditional half-saree function (Langa Voni function)."
  ],
  "description": "This Kasulaperu Haaram is a heritage piece, reimagined for the modern woman. It carries the cultural significance of traditional South Indian jewelry while incorporating a contemporary flair. The combination of precious gemstones, expert craftsmanship, and the auspicious nature of Kasulaperu makes this necklace a valuable addition to any jewelry collection. The Hyderabadi Polish ensures long-lasting brilliance and durability.",
  "tags": [
    "Kasulaperu",
    "Haaram",
    "Necklace",
    "Manikyam",
    "Pachala",
    "Ruby",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Ethnic Jewelry",
    "Gold Necklace",
    "Telugu Jewelry",
    "Vivah",
    "Nischitartham",
    "Langa Voni",
    "Seemantham"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0350_0547",
  "collection": "diamond"
}