{
  "id": "necklaces-1183",
  "title": "Emerald and Diamond Three-Layer Haaram with Pearl Drops - Nakshi Design",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (గుండు బంగారం) with Hyderabadi Polish",
    "Natural Emeralds (పచ్చ రాయి) – Oval Cut",
    "High Clarity Diamonds (వజ్రాలు) – Brilliant Cut",
    "South Sea Pearls (ముత్యాలు). Ruby accents. Total Gold Weight: 233.700 grams. Diamond Weight: 24.25 carats. Emerald Weight: 16.02 carats. Pearl Weight: 57.38 carats. Ruby Weight: 4.53 carats."
  ],
  "features": "This magnificent three-layer Haaram showcases intricate Nakshi work (నక్షి పని), a traditional South Indian technique that brings the design to life. Each layer features alternating emerald and diamond motifs, all meticulously hand-set. The longest layer culminates in a stunning pendant with a floral design with pearls. Features a delicate leaf-patterned clasp.",
  "colors": [
    "Predominantly gold with vibrant green emeralds",
    "sparkling white diamonds",
    "and lustrous white pearls. The rich green and gold evoke a sense of traditional opulence."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (పెళ్లి)",
    "Muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "and other significant celebrations. Its timeless design also makes it a cherished heirloom piece (వారసత్వపు ఆభరణం) for future generations."
  ],
  "description": "This Haaram is a true masterpiece, showcasing exceptional craftsmanship and exquisite materials. The traditional Nakshi design reflects South Indian heritage, while the generous use of emeralds, diamonds, and pearls exudes elegance and prestige. Its durability ensures it will be a treasured possession for years to come. The vibrant colors and intricate detailing make it a show-stopping statement piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Pearl",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Nakshi Work",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "పెళ్లి",
    "ముహూర్తం",
    "సీమంతం",
    "కంఠాభరణం",
    "పచ్చ రాయి",
    "వజ్రాలు",
    "ముత్యాలు",
    "గుండు బంగారం",
    "వారసత్వపు ఆభరణం",
    "Heirloom Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-08_1735",
  "collection": "sjpl"
}