{
  "id": "necklaces-392",
  "title": "Navaratna Pendant - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "Natural Emerald (4.26 carats)",
    "7 Natural Navaratna Gemstones (15.42 carats total)",
    "Diamonds (1.50 carats). Features a Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite pendant showcases the timeless beauty of the Navaratna design. A vibrant oval-cut Emerald takes center stage, surrounded by seven carefully selected gemstones representing the nine celestial planets (Navagrahas). Delicately set diamonds add sparkle and enhance the beauty of the gemstones. The pendant features a classic floral motif, radiating elegance and charm.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "Ruby Red",
    "Coral Orange",
    "Pearl White",
    "Yellow Sapphire",
    "Hessonite Garnet",
    "Blue Sapphire",
    "Cat's Eye Chrysoberyl. The vibrant and harmonious blend of colors in this pendant is truly captivating."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals",
    "and other special occasions. A meaningful gift for anniversaries",
    "birthdays",
    "or any milestone event. Can be worn for daily wear as well as this is a statement piece."
  ],
  "description": "Embrace the auspicious power of the Navaratnas with this stunning pendant. Crafted with meticulous attention to detail, this piece embodies traditional South Indian artistry. The high-quality gemstones and exquisite design make it a valuable investment and a treasured heirloom. Symbolizing prosperity and good fortune, this pendant is a timeless expression of elegance and grace.",
  "tags": [
    "Navaratna",
    "Pendant",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emerald",
    "Diamond",
    "Gold",
    "Traditional",
    "Auspicious",
    "Gemstone",
    "Andhra Pradesh",
    "Telangana",
    "Wedding Jewelry",
    "Ethnic",
    "Fine Jewelry",
    "Hyderabad",
    "Haaram",
    "Navaratna Haaram"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-04-21-12-34-11 2_0828",
  "collection": "diamond"
}