{
  "id": "necklaces-1104",
  "title": "Maharani Ruby Polki Haaram - A Regal Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approx. 91.6% purity)",
    "Polki Diamonds (uncut diamonds)",
    "Natural Rubies (Burmese Ruby)",
    "Freshwater Pearls",
    "Hyderabadi Polish. Accents feature zircon stones."
  ],
  "features": "A stunning multi-strand Haaram featuring strings of lustrous freshwater pearls and vibrant ruby beads. The centerpiece is an elaborate polki pendant showcasing a central oval-cut ruby surrounded by rose-cut polki diamonds. The pendant design incorporates a pair of peacocks (Mayura) at the top, symbolizing grace and royalty. Delicate pearl drops enhance the pendant's elegance. The metalwork showcases intricate filigree and Nakshi-inspired detailing, providing an antique finish.",
  "colors": [
    "Predominantly gold with the deep red of the ruby",
    "contrasted by the brilliance of the polki diamonds and the soft white of the pearls. The pink rubies add a touch of modern elegance."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli Utasavam)",
    "grand receptions",
    "Seemantham",
    "Half-Saree function (Voni Function)",
    "or any special occasion where you want to make a statement. This piece adds a touch of regal splendor to any outfit."
  ],
  "description": "This Maharani Haaram is a testament to Hyderabad's rich jewelry heritage. The use of high-quality polki diamonds and natural rubies ensures a lasting value. The intricate craftsmanship and traditional design make it a unique heirloom piece. The Hyderabadi polish guarantees a lasting shine. The peacock motif symbolizes beauty, royalty and is considered highly auspicious.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamond",
    "Ruby",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Indian Wedding",
    "Mayura",
    "Peacock Design",
    "Pearl Necklace",
    "Antique Finish",
    "Pelli Utasavam",
    "Seemantham",
    "Voni Function",
    "Nakshi Work",
    "gold jewellery",
    "pachi jewellery"
  ],
  "original_id": "radhe_diam_DPPD8-662_2517",
  "collection": "radhe"
}