{
  "id": "necklaces-830",
  "title": "Manoharam Ruby Emerald Pendant - A Touch of Timeless Grandeur",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Oval-Cut Ruby (approx. 3 carats)",
    "Oval-Cut Emerald (approx. 5 carats)",
    "and High-Quality Polki Diamonds (Uncut Diamonds) with excellent clarity."
  ],
  "features": "A classic pendant showcasing a traditional floral design, reminiscent of temple architecture. Features a vibrant ruby at the top, followed by a sparkling polki diamond accent, leading to a stunning emerald centerpiece. The polki diamonds are meticulously set around both gemstones in a delicate, petal-like arrangement. The piece boasts an antique gold finish achieved with specialized Hyderabadi polishing techniques, giving it a rich, vintage appeal.",
  "colors": [
    "Rich Gold",
    "Deep Red (Ruby)",
    "Vivid Green (Emerald)",
    "and Sparkling White (Polki Diamonds). The color combination is considered auspicious and traditional in South Indian culture."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals (Pandugalu)",
    "and other significant celebrations. This pendant is also suitable for formal events where you want to make a statement with timeless elegance."
  ],
  "description": "This Manoharam Pendant seamlessly blends traditional South Indian craftsmanship with the enduring allure of natural gemstones. The Hyderabadi polish ensures a lasting luster. The auspicious ruby and emerald combination is believed to bring prosperity and good fortune. The intricate polki diamond setting highlights the beauty of the gemstones, creating a truly breathtaking piece.",
  "tags": [
    "Pendant",
    "Addigai",
    "Ruby",
    "Emerald",
    "Polki",
    "Diamond",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Vivahaalu",
    "Pandugalu",
    "Nischitartham",
    "Antique Gold",
    "22K Gold"
  ],
  "original_id": "ear_rings_DPER8-1558_2609",
  "collection": "ear"
}