{
  "id": "necklaces-1146",
  "title": "Maharani Ruby & Diamond Haaram - The Rajalakshmi Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Rubies (Burmese",
    "Oval Cabochon & Round Beads)",
    "Polki Diamonds (Rose Cut",
    "SI Clarity)",
    "South Sea Pearls. Hyderabadi Kundan Setting. Gold spacers separating the beads."
  ],
  "features": "A stunning multi-strand Haaram featuring five strands of finely graduated ruby beads interspersed with lustrous South Sea Pearls. The pendant showcases intricate Kundan craftsmanship with a large, captivating oval cabochon ruby at its heart, surrounded by meticulously set Polki diamonds. Below, ruby and pearl drops provide graceful movement. The top portion has elaborate detailing made of diamonds, set to a gold frame. The entire piece reflects the Mogali Rekulu (floral bud) design, a classic South Indian motif symbolizing prosperity and beauty.",
  "colors": [
    "Rich ruby red",
    "sparkling white diamonds",
    "shimmering white pearls",
    "and warm yellow gold. The contrasting colors create a regal and opulent look."
  ],
  "occasions": [
    "Ideal for weddings",
    "muhurtham ceremonies",
    "seemantham",
    "bridal wear",
    "grand receptions",
    "and other special occasions. This Haaram is perfect for making a statement and celebrating traditional Telugu heritage."
  ],
  "description": "This Maharani Haaram is a true heirloom piece. The use of high-quality Burmese rubies and the intricate Kundan setting demonstrate exceptional craftsmanship. The Mogali Rekulu design carries cultural significance, making it a meaningful and valuable addition to any jewelry collection. This is an investment piece that will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Ruby Necklace",
    "Diamond Necklace",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham Jewelry",
    "Mogali Rekulu",
    "Traditional Jewelry",
    "Antique Jewelry",
    "Polki Diamonds",
    "22K Gold",
    "Seemantham",
    "Vaddanam",
    "Kante",
    "Kasulaperu"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0053_2565",
  "collection": "radhe"
}