{
  "id": "necklaces-1062",
  "title": "Regal Polki and Ruby Cascade Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Uncut Polki Diamonds",
    "Faceted Ruby (మాణిక్యము) Pendant. Features the renowned Hyderabadi Polish for a lasting luster."
  ],
  "features": "This stunning haaram boasts three cascading layers of meticulously set Polki diamonds in a unique triangular floral pattern. The central ruby pendant, cradled in a delicate Polki diamond setting, adds a regal touch. The intricate design reflects the grandeur of Nizam-era jewelry, reimagined for the modern bride. The setting style enhances the brilliance of the diamonds, creating a mesmerizing sparkle.",
  "colors": [
    "Predominantly gold with the fiery red of the ruby pendant and the subtle shimmer of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for weddings (వివాహము)",
    "grand receptions",
    "Seemantham (శ్రీమంతం)",
    "and other special occasions where you want to make a lasting impression. An ideal bridal piece that embodies tradition and elegance."
  ],
  "description": "This haaram is not just jewelry; it's a statement of heritage and timeless beauty. The use of high-quality Polki diamonds and a vibrant ruby pendant ensures a dazzling presence. Its design reflects the rich cultural heritage of Hyderabad and South India. Crafted with precision and care, this piece will be cherished for generations. The multi-layered design makes it a versatile piece that can be paired with various outfits.",
  "tags": [
    "Haaram",
    "Polki",
    "Ruby",
    "Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "కంఠాభరణము",
    "మాణిక్యము",
    "వివాహము",
    "శ్రీమంతం",
    "Polki Diamonds",
    "Bridal Haaram",
    "Nizam Jewelry",
    "22K Gold"
  ],
  "original_id": "radhe_diam_DPNK8-1508_2475",
  "collection": "radhe"
}