{
  "id": "necklaces-484",
  "title": "Navaratan Inspired Gemstone Cascade Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (GH)",
    "Natural Mixed Gemstones including Sapphires",
    "Tourmalines",
    "Citrine",
    "and more",
    "Diamond Simulants. Hyderabadi Polish for lasting luster."
  ],
  "features": "A modern take on the traditional Kasulaperu (coin necklace), this piece features a cascade of organically shaped, bezel-set mixed gemstones encircled by sparkling diamond simulants. Each gemstone is carefully selected and arranged to create a mesmerizing color palette. The necklace is handcrafted for exceptional durability and comfortable wear.",
  "colors": [
    "Gold",
    "Multi-colored (Purple",
    "Blue",
    "Green",
    "Yellow",
    "Brown",
    "Peach)",
    "White (Diamond Simulants). The variety of colors in the gemstones evokes the vibrancy of a South Indian festival."
  ],
  "occasions": [
    "Perfect for cocktail parties",
    "weddings",
    "receptions",
    "or any special occasion where you want to make a statement. Can be worn with both traditional silk sarees and modern dresses."
  ],
  "description": "This necklace is a unique blend of modern design and traditional inspiration, creating a timeless piece that you'll treasure for years to come. The mixed gemstones symbolize prosperity and good fortune, making it a meaningful gift or a valuable addition to your own collection. The Hyderabadi Polish ensures that the gold retains its shine for years to come. The cascade design provides a flattering and eye-catching silhouette.",
  "tags": [
    "Necklace",
    "Haaram",
    "Kasulaperu",
    "Gemstone",
    "Mixed Gemstones",
    "Sapphire",
    "Tourmaline",
    "Citrine",
    "Diamond Simulant",
    "18K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Contemporary Design",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Cocktail Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "Festive Jewelry",
    "Melange Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-45-07 2_0962",
  "collection": "diamond"
}