{
  "id": "necklaces-250",
  "title": "Manikyam Kundan Chandrani Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Premium Kundan Stones",
    "Emeralds (పచ్చ)",
    "Rubies (మాణిక్యం)",
    "High-Quality Pearls. Features a distinctive Hyderabadi Polish for lasting luster."
  ],
  "features": "Exquisite Chandrani Haaram design with intricate Kundan stone settings. The central pendant showcases a meticulously crafted floral motif adorned with a vibrant emerald. The necklace is enhanced with ruby accents and delicate pearl drops, lending a touch of timeless elegance. Traditional `Guttiapusalu` style detailing along the neckline creates a cascading effect. The piece exhibits superior craftsmanship synonymous with Hyderabad's rich jewelry heritage.",
  "colors": [
    "Gold (బంగారు)",
    "Emerald Green",
    "Ruby Red",
    "and Pearl White."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "receptions",
    "engagements (నిశ్చితార్థం)",
    "and other special occasions like Seemantham (సీమంతం) and half-saree functions. Also ideal for adding a touch of traditional splendor to modern celebrations."
  ],
  "description": "A stunning blend of traditional Telugu craftsmanship and timeless design. The use of high-quality materials ensures enduring beauty and value. This Chandrani Haaram is not just a piece of jewelry; it's an heirloom, a symbol of heritage and prosperity. The unique Hyderabadi polish provides a rich, luxurious sheen, setting it apart from ordinary gold jewelry. Make a statement with this magnificent piece, a true reflection of South Indian grace and elegance.",
  "tags": [
    "Haaram",
    "Chandrani",
    "Necklace",
    "Kundan",
    "Emerald",
    "Ruby",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Guttiapusalu",
    "Gold Jewelry",
    "కంఠాభరణం",
    "సువర్ణము",
    "పచ్చ",
    "మాణిక్యం",
    "వివాహం",
    "సీమంతం",
    "నిశ్చితార్థం"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0330_0527",
  "collection": "diamond"
}