{
  "id": "necklaces-213",
  "title": "Exquisite Emerald and CZ Kasu Mala: A Rani Haar Fit for Royalty",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted with a base of high-quality alloy and plated with gold. Adorned with vibrant emerald green stones",
    "sparkling Cubic Zirconia (CZ) stones",
    "and simulated pearls. Features a delicate",
    "Hyderabadi polish for a lasting shine."
  ],
  "features": "This stunning long haram (kasu mala) showcases a classic South Indian design with meticulously set emeralds and CZ stones. The intricate floral motifs along the chain lead to a majestic pendant featuring emeralds and CZ stones in a paisley-inspired design. The cascading simulated pearls add a touch of elegance and movement. This piece blends the grandeur of traditional Rani Haar designs with modern refinement.",
  "colors": [
    "Predominantly gold with vibrant emerald green gemstones",
    "white CZ stones",
    "and creamy white simulated pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "Bharatanatyam performances",
    "and grand festive occasions like Sankranthi or Diwali. It's also a statement piece for special events where you want to showcase your appreciation for South Indian heritage."
  ],
  "description": "This exquisite Kasu Mala combines the timeless allure of South Indian jewelry with a touch of modern elegance. The high-quality materials and craftsmanship ensure lasting beauty, while the vibrant emeralds and sparkling CZ stones capture attention. Its traditional design makes it a valuable addition to any jewelry collection, offering both cultural significance and enduring style. A true heirloom piece! Designed with meticulous detail and fine craftsmanship making this necklace a lasting, beautiful addition to any jewelry collection.",
  "tags": [
    "Kasu Mala",
    "Haram",
    "Long Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Emerald",
    "CZ Stones",
    "Rani Haar",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "muhurtham"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0291_0488",
  "collection": "diamond"
}