{
  "id": "necklaces-1531",
  "title": "Vaibhava Kundan Haar: Emerald & Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated Base. Featuring high-quality Kundan settings",
    "meticulously placed Cubic Zirconia (CZ) diamonds",
    "vibrant Emerald green stones (likely simulated)",
    "and lustrous South Sea Pearls. Exquisite Hyderabadi Polish for a rich",
    "lasting shine."
  ],
  "features": "This regal necklace showcases a classic Kundan design with a modern twist. Intricate floral and paisley motifs are meticulously crafted using the age-old Kundan setting technique. Emerald green stones are strategically placed to add a pop of color and enhance the overall design. Dangling South Sea pearls provide graceful movement and a touch of elegance. The detailed setting highlights the brilliance of each CZ diamond, creating a captivating sparkle.",
  "colors": [
    "Primarily gold with a brilliant white sparkle from the CZ diamonds. The vibrant emerald green stones offer a striking contrast",
    "while the pearls provide a soft",
    "creamy white accent."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaahaalu)",
    "receptions",
    "sangeet ceremonies",
    "and important festivals like Diwali and Sankranthi. This Haaram will also make a striking statement at high-profile events."
  ],
  "description": "A timeless masterpiece that blends traditional Kundan artistry with contemporary elegance. The exceptional craftsmanship and high-quality materials ensure lasting beauty and durability. A true heirloom piece that can be treasured for generations. The grand design and striking color combination will make you the center of attention at any event.",
  "tags": [
    "Kundan Haaram",
    "Emerald Necklace",
    "South Sea Pearls",
    "Indian Wedding Jewelry",
    "Bridal Necklace",
    "Statement Necklace",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Kundan Jewellery",
    "Haram",
    "Vivaaham",
    "Muhurtham",
    "CZ Diamond",
    "Cubic Zirconia",
    "Wedding",
    "Party",
    "Emerald Green"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-07 2_2149",
  "collection": "sjpl"
}