{
  "id": "waistbands-034",
  "title": "Diamond & Emerald Vaddanam - A Regal Waist Belt of Timeless Beauty",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "18K Gold base (188.330 grams)",
    "Adorned with 24.23 carats of brilliant-cut diamonds (4077 stones) with exceptional fire and clarity",
    "24.90 carats of captivating emeralds (7 stones) with vibrant green hues",
    "20.32 carats of fine Rubies (7 stones)",
    "and 42.33 carats of Freshwater Pearls (20 pieces). Features a high-quality Hyderabadi Polish for enhanced luster."
  ],
  "features": "This exquisite Vaddanam features a traditional South Indian design with intricate filigree work and floral motifs. The central emerald is surrounded by a halo of diamonds. Elegant rows of diamond-studded floral patterns connect to the belt and suspend lustrous freshwater pearls. Traditional 'kundan' setting ensures the gemstones are securely and beautifully showcased. The design incorporates elements of 'nakshi' work to enhance the antique feel, blending tradition with contemporary appeal.",
  "colors": [
    "Predominantly gold with a sparkling white from the diamonds. A striking contrast is provided by the deep green of the emeralds",
    "hints of red from the rubies",
    "and the soft white of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "Seemantham (baby shower)",
    "Half-Saree functions (Langa Voni Function)",
    "and other grand celebrations. Makes a statement piece for formal galas and high-profile events",
    "embodying South Indian elegance."
  ],
  "description": "This Vaddanam is a masterpiece of craftsmanship, seamlessly blending traditional South Indian aesthetics with modern diamond-setting techniques. The high-quality diamonds and emeralds ensure lasting brilliance and value. It's not just jewelry; it's an heirloom piece representing cultural heritage and timeless elegance. Its durable construction ensures it can be cherished for generations.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Kundan Setting",
    "Vivaaham",
    "Seemantham",
    "Langa Voni",
    "OTTIYANA",
    "kamarband",
    "Antique Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-11-18-02 3_2169",
  "collection": "sjpl"
}