{
  "id": "necklaces-1677",
  "title": "Vaishnavi Polki Haaram with Emerald Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (approx. 20 carats",
    "Excellent Clarity)",
    "Natural Emerald Drops (Pear Cut",
    "Vivid Green)"
  ],
  "features": "A stunning Polki Haaram featuring large, meticulously set uncut diamonds in a closed setting. Each Polki diamond is surrounded by smaller pave-set diamonds, creating a halo effect. The bottom of the necklace is adorned with vibrant green Emerald drops, adding a touch of regal elegance. The back chain is elegantly crafted for comfortable wear. Design inspired by Nizam era jewelry.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emeralds)"
  ],
  "occasions": [
    "Ideal for weddings (especially Muhurtham)",
    "receptions",
    "grand celebrations",
    "milestone events (like Seemantham or half-saree function)",
    "or any occasion where you want to make a statement."
  ],
  "description": "This Polki Haaram is a timeless investment, showcasing exceptional craftsmanship and the unparalleled beauty of uncut diamonds. The piece is hand-crafted by skilled artisans, embodying the rich heritage of Hyderabadi jewelry making. The combination of Polki diamonds and Emeralds symbolizes prosperity and good fortune, making it a perfect heirloom piece. Its unique design blends traditional aesthetics with a contemporary flair, ensuring it complements both traditional and modern attire. Hyderabadi polish ensures a long-lasting luster and a rich, luxurious look.",
  "tags": [
    "Polki Necklace",
    "Haaram",
    "Uncut Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Nizam Jewelry",
    "Traditional Jewelry",
    "కంఠహారం",
    "Polki",
    "Emerald",
    "muhurtham",
    "seemantham",
    "half saree function",
    "Bridal Jewelry",
    "Statement Necklace"
  ],
  "original_id": "stock_in_india_IMG-20241218-WA0014_2859",
  "collection": "stock"
}