{
  "id": "necklaces-1240",
  "title": "Diamond Emerald Ruby Pearl Haar with Detachable Locket - Bridal Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal 18K Gold Plating",
    "set with brilliant-cut Diamonds (12.46ct)",
    "round Ruby (6.02ct) and Emerald (4.79ct) accents",
    "and South Sea Pearls. The locket has Ruby(3.32ct)",
    "Emerald(1.85ct) and South Sea Pearls(15.55ct). All stones are ethically sourced. Exquisite craftsmanship ensures exceptional clarity and brilliance. Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "This spectacular Haaram showcases a cascading design, featuring a diamond-encrusted collar that transitions into a floral motif centerpiece. Emeralds and Rubies add vibrant pops of color, complemented by delicate South Sea Pearl drops. The detachable locket mirrors the necklace's intricate detailing. The open filigree work enhances the brilliance of the diamonds and reflects traditional South Indian artistry. The total weight is 153 grams",
  "colors": [
    "Predominantly white (diamonds) with highlights of emerald green",
    "ruby red",
    "and the soft luster of white South Sea Pearls. The gold plating adds a warm",
    "classic touch."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Muhurtham)",
    "receptions",
    "and other festive celebrations. Also suitable for Seemantham",
    "and other family gatherings. Its timeless elegance makes it a treasured heirloom."
  ],
  "description": "This Haaram is a true masterpiece, combining the grandeur of traditional South Indian design with modern diamond-setting techniques. The detachable locket adds versatility, while the use of high-quality diamonds, emeralds, rubies, and South Sea pearls guarantees lasting value. A statement piece that exudes opulence and sophistication, reflecting the rich cultural heritage of Hyderabad.",
  "tags": [
    "Diamond Haaram",
    "South Sea Pearl Necklace",
    "Ruby Emerald Jewelry",
    "Bridal Necklace",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Grand Necklace",
    "Locket Necklace",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Diamonds",
    "Emeralds",
    "Rubies",
    "Pearls",
    "Haaram",
    "Kante",
    "Kasulaperu",
    "Guttapusalu",
    "Nakshi"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-59_1814",
  "collection": "sjpl"
}