{
  "id": "earrings-611",
  "title": "Blossom Cascade Earrings - Modern Diamond Jhumka",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in 18K White and Rose Gold",
    "featuring a stunning array of brilliant-cut diamonds and vibrant pink sapphires. The diamonds are of exceptional clarity and fire",
    "while the sapphires showcase a rich",
    "saturated hue. The finish is achieved with a meticulous attention to detail",
    "ensuring a lasting Hyderabadi Polish."
  ],
  "features": "These earrings feature a cascading floral design. The earrings incorporate stylized flower motifs with diamonds and rose gold accents. The rose gold flowers contrast beautifully with the white gold leaves, creating a layered effect. The pink sapphires are arranged in a semi-circular pattern, adding a pop of color and visual interest. The piece blends modern aesthetics with nature-inspired design.",
  "colors": [
    "Predominantly white (diamonds and white gold) with warm rose gold accents and a pop of vibrant pink from the sapphires."
  ],
  "occasions": [
    "Perfect for contemporary events",
    "gala evenings",
    "or special celebrations. Their unique design also makes them suitable for modern brides or as statement jewelry for formal occasions."
  ],
  "description": "These unique drop earrings showcases impeccable craftsmanship and a captivating design. The contrast between the white and rose gold, combined with the brilliance of the diamonds and the rich pink of the sapphires, creates a truly mesmerizing effect. The earrings offers a perfect blend of sophistication and modern artistry, making it a cherished addition to any jewelry collection. The use of high-quality materials ensures durability and lasting beauty.",
  "tags": [
    "Diamond earrings",
    "sapphire earrings",
    "rose gold",
    "white gold",
    "drop earrings",
    "modern jewelry",
    "contemporary design",
    "Hyderabadi jewelry",
    "floral earrings",
    "statement jewelry",
    "engagement jewelry",
    "party wear"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-30-48_1830",
  "collection": "sjpl"
}