{
  "id": "necklaces-791",
  "title": "Floral Symphony Haar - A Regal Diamond and Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold",
    "meticulously set with brilliant-cut diamonds (VS clarity",
    "GH color) and an array of multi-colored Sapphires (Pink",
    "Yellow",
    "Blue",
    "and Green hues). Features a Hyderabadi Polish for exceptional shine and durability."
  ],
  "features": "This exquisite Haaram showcases a floral-inspired design, with each gemstone carefully placed to create a harmonious blend of colors. The intricate lattice framework is adorned with diamonds, enhancing the overall brilliance. Features a modern take on traditional Indian botanical motifs, offering a contemporary yet timeless aesthetic.",
  "colors": [
    "Primarily white (diamonds)",
    "accented by pink",
    "yellow",
    "blue",
    "and green sapphires",
    "creating a vibrant and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "engagements",
    "and special celebrations. A stunning choice for the bride (Vadhuvu) or to elevate any festive occasion (Panduga). Also suitable for high-end parties and formal events."
  ],
  "description": "This haaram represents a fusion of traditional South Indian artistry and modern jewelry design. The use of high-quality diamonds and colorful sapphires ensures a lasting sparkle and enduring value. The Hyderabadi Polish guarantees superior shine and longevity. A statement piece that embodies elegance and cultural richness.",
  "tags": [
    "Necklace",
    "Haaram",
    "Vankipotu",
    "Diamond Jewelry",
    "Sapphire Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Floral Design",
    "Contemporary Jewelry",
    "Festive Jewelry",
    "Engagement Necklace",
    "Vivaha",
    "Panduga",
    "Vadhuvu",
    "Gemstone Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-32 2_1359",
  "collection": "diamond"
}