{
  "id": "rings-009",
  "title": "Enchanting Emerald & Diamond Vanki (Armlet)",
  "category": "rings",
  "original_type": "Armlet",
  "materials": [
    "22K Gold",
    "Natural Emeralds (Oval and Pear-Shaped Cuts)",
    "Polki Diamonds. Hyderabadi Gold Polish for a rich",
    "antique luster."
  ],
  "features": "Features a classic Vanki (armlet) design, inspired by the mango/peacock motif of South Indian tradition. Exquisite arrangement of lush green emeralds and uncut Polki diamonds. The dangling Polki diamonds add movement and a touch of regal elegance. The open setting allows maximum light to illuminate the gemstones, enhancing their brilliance. The gold framework uses a delicate, filigree-inspired design.",
  "colors": [
    "Vibrant Green (Emeralds)",
    "Sparkling White (Polki Diamonds)",
    "Rich Yellow (Gold). A timeless color palette reflecting South Indian opulence."
  ],
  "occasions": [
    "Perfect for traditional South Indian weddings (Vivaha Mahotsavam)",
    "Bharatanatyam performances",
    "Seemantham (baby shower)",
    "housewarmings",
    "or any special occasion where you want to radiate grace and cultural pride. Also suitable for high-end contemporary events where you want to make a statement with a piece of wearable art."
  ],
  "description": "This exquisite Vanki (armlet) is a testament to the unparalleled craftsmanship of Hyderabad's finest artisans. The combination of precious emeralds and natural Polki diamonds makes it a valuable heirloom piece to be treasured for generations. Its unique design seamlessly blends tradition with modern aesthetics, making it a versatile addition to your jewelry collection. Own a piece of South Indian heritage and radiate timeless beauty.",
  "tags": [
    "Vanki",
    "Armlet",
    "Emerald",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Vivaha Mahotsavam",
    "Heritage Jewelry",
    "Antique Finish",
    "22K Gold",
    "Pachala",
    "Polki",
    "Bajubandh"
  ],
  "original_id": "diamond_jewellery_DPER8-1447_0265",
  "collection": "diamond"
}