{
  "id": "necklaces-1140",
  "title": "Divine Ganesha Polki Haaram with Coral Accents - 'Siddhi Vinayaka Anugraha'",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (Rose Cut)",
    "Natural Coral Beads",
    "Emerald accents. Features a prominent Emerald Pear Drop above Ganesha and hanging Emerald and Coral beads. Diamond quality ranges from SI1-SI2 clarity",
    "H-I color."
  ],
  "features": "This exquisite Haaram features a meticulously crafted Ganesha pendant surrounded by a floral arrangement of Polki diamonds. The pendant showcases Nakshi work, depicting the divine form of Lord Ganesha with intricate detailing. The necklace itself is comprised of strings of coral beads intersected by rows of Polki-encrusted gold elements. The arrangement concludes with dangling coral and green agate beads. The antique finish imparts a timeless appeal. The piece is set in the pachega style.",
  "colors": [
    "Warm Gold",
    "Sparkling White (Polki Diamonds)",
    "Vibrant Coral (Red-Orange)",
    "Deep Green (Emeralds and Agate Beads)"
  ],
  "occasions": [
    "Ideal for weddings (Vivaaha)",
    "bridal wear",
    "traditional ceremonies (Pujas",
    "Festival)",
    "auspicious occasions (like Ganesh Chaturthi) and formal events where a statement piece is desired. Perfect for a Muhurtham look."
  ],
  "description": "This Haaram is a symbol of prosperity and good fortune, featuring Lord Ganesha, the remover of obstacles. The combination of Polki diamonds, coral, and gold creates a rich, traditional aesthetic. Handcrafted by skilled artisans in Hyderabad, ensuring exceptional quality and unique character. The antique finish lends a regal and timeless appeal. It showcases the grandeur of Hyderabadi jewelry craftsmanship.",
  "tags": [
    "Haaram",
    "Polki",
    "Ganesha",
    "Necklace",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Ethnic Jewelry",
    "Coral",
    "Emerald",
    "Nakshi",
    "22K Gold",
    "Uncut Diamonds",
    "Vivaaha",
    "Muhurtham",
    "Devotional Jewelry",
    "Pachge"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0043_2559",
  "collection": "radhe"
}