{
  "id": "earrings-503",
  "title": "Elegant Kundan Polki Peacock Jhumka Earrings - Paramparik Shringar",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated Alloy",
    "Authentic Kundan Polki Diamonds (approx. 2 carats)",
    "Emerald Green Cabochons",
    "Ruby Red Enamel Work",
    "Freshwater Pearls. Hyderabadi Zardosi work detailing on the enamel."
  ],
  "features": "Exquisitely handcrafted Jhumka earrings featuring a classic peacock motif. The ear stud showcases a floral design adorned with uncut Kundan Polki diamonds, surrounded by vibrant green emerald cabochons. The dome-shaped Jhumka is intricately decorated with ruby red enamel using Zardosi techniques, forming a textured pattern. Delicate chains of pearls and emerald beads dangle gracefully from the base, adding a touch of traditional charm. Finished with a light antique polish.",
  "colors": [
    "Gold (base metal)",
    "White (Kundan Polki diamonds)",
    "Green (Emerald)",
    "Ruby Red (Enamel)",
    "Pearl White (Pearls)."
  ],
  "occasions": [
    "Ideal for traditional South Indian weddings (vivaham)",
    "bridal wear",
    "festive celebrations like Diwali and Sankranthi",
    "Seemantham",
    "and other special occasions. Can also be paired with modern outfits for a fusion look."
  ],
  "description": "This stunning pair of Jhumka earrings blends the rich heritage of South Indian jewelry with contemporary design. The use of authentic Kundan Polki diamonds and vibrant enamel work showcases superior craftsmanship. The peacock motif symbolizes beauty, prosperity, and grace, making these earrings a treasured possession for generations. The classic design ensures versatility and timeless appeal. A true statement piece that exudes elegance and sophistication.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Kundan Polki",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Peacock Motif",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Earrings",
    "Ethnic Jewelry",
    "Kaampulu",
    "Hyderabadi Jewelry",
    "Zardosi",
    "Emerald",
    "Pearls",
    "Uncut Diamonds",
    "Antique Finish",
    "Indian Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1651_2634",
  "collection": "ear"
}