{
  "id": "earrings-303",
  "title": "Emerald Blossom Jhumka - Exquisite Temple Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated. Adorned with meticulously placed Cubic Zirconia (CZ) stones. Featuring pear-shaped Emerald Hydro and lustrous",
    "freshwater Pearls. Hyderabadi Polish ensures lasting shine and durability."
  ],
  "features": "Classic Jhumka silhouette with intricate floral filigree and pavé settings of CZ stones for maximum brilliance. The top features a pear-shaped Emerald Hydro, complemented by delicate pearl accents. A larger pearl dangles gracefully from the bottom of the jhumka, adding a touch of sophistication. The ornate design reflects the aesthetic influences of South Indian temple jewelry.",
  "colors": [
    "Predominantly gold and white (CZ stones)",
    "with a vibrant green Emerald and creamy white pearls",
    "creating a regal and timeless colour palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి - Pelli)",
    "engagements (నిశ్చితార్థం - Nischitardham)",
    "festivals (పండుగలు - Pandugalu)",
    "traditional ceremonies like Seemantham",
    "or any special occasion where you want to make a statement. Adds elegance to both traditional sarees and contemporary Indian wear."
  ],
  "description": "A stunning blend of traditional South Indian design with modern finesse. The high-quality CZ stones provide a diamond-like sparkle at an accessible price point. Lightweight and comfortable for extended wear. The durable Hyderabadi Polish ensures long-lasting beauty. These jhumkas are a timeless investment piece that will enhance any jewelry collection.",
  "tags": [
    "Jhumka",
    "Temple Jewelry",
    "Earrings",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Gold Plated",
    "Emerald",
    "Pearls",
    "CZ Stones",
    "Bridal Jewelry",
    "Traditional",
    "చెవి దిద్దులు (Chevi Diddulu)",
    "పండుగలు (Pandugalu)",
    "పెళ్ళి (Pelli)"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-35 14_1332",
  "collection": "diamond"
}