{
  "id": "earrings-019",
  "title": "Lakshmi Kamal Kundanalu: Diamond-Accented Lotus Stud Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds (SI clarity",
    "G-H color)",
    "Natural Emerald cabochon",
    "Natural Ruby accent. Features Hyderabadi Polish for a lustrous finish."
  ],
  "features": "Delicately crafted lotus motif representing Goddess Lakshmi, the embodiment of prosperity and auspiciousness. The lotus is adorned with dazzling diamonds, while a striking emerald cabochon forms the center. A small ruby provides a touch of traditional color contrast. The openwork design adds a touch of modernity to this classic design.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "and Sparkling White (Diamonds). The traditional combination of red and green is considered highly auspicious."
  ],
  "occasions": [
    "Perfect for weddings (pellillu)",
    "engagement ceremonies",
    "festive occasions (pandugalu)",
    "or as a statement piece for formal events. Suitable for half-saree functions and other traditional celebrations."
  ],
  "description": "These Lakshmi Kamal Kundanalu are more than just earrings; they are a symbol of prosperity and good fortune. The exceptional craftsmanship, combined with the brilliance of diamonds and the vibrancy of emeralds, makes them a treasured addition to any jewelry collection. The Hyderabadi polish ensures a long-lasting shine, and the push-back closure guarantees a secure and comfortable fit. A timeless heirloom piece to be cherished for generations.",
  "tags": [
    "Earrings",
    "Kundanalu",
    "Stud Earrings",
    "Lakshmi",
    "Lotus",
    "Diamonds",
    "Emerald",
    "Ruby",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Festive Jewelry",
    "Pellillu",
    "Pandugalu",
    "Emerald Cabochon",
    "Divine",
    "auspicious",
    "Lakshmi Kamal"
  ],
  "original_id": "diamond_jewellery_1bc4144d-fc12-4f03-89b0-544bc618ee60_0082",
  "collection": "diamond"
}