{
  "id": "earrings-198",
  "title": "Heera Jhumka: Polki Diamond Teardrop Earring",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Rose-Cut Polki Diamonds (unspecified clarity",
    "antique cut)",
    "Brilliant-Cut Diamonds (SI clarity",
    "G-H color)",
    "Hyderabadi Polish."
  ],
  "features": "This exquisite earring features a classic Jhumka silhouette, reimagined with a modern openwork teardrop design. The top section showcases a cluster of rose-cut Polki diamonds, each uniquely shaped and arranged to maximize their natural brilliance. Below, a delicate gold frame, adorned with brilliant-cut diamonds, surrounds a large, central Polki diamond in a triangular shape, creating a mesmerizing focal point. The openwork grid design adds a contemporary touch while maintaining a traditional feel. Hyderabadi polish adds a unique luster and protection to the gold.",
  "colors": [
    "Predominantly gold with the icy white sparkle of Polki and brilliant-cut diamonds."
  ],
  "occasions": [
    "Ideal for weddings",
    "engagements",
    "and special occasions where a touch of heritage and glamour is desired. Suitable for traditional Telugu ceremonies like muhurtham",
    "seemantham",
    "or any grand celebration where you want to make a statement."
  ],
  "description": "This 'Heera Jhumka' perfectly blends traditional South Indian design with modern aesthetics. The use of rose-cut Polki diamonds, with their unique charm and natural imperfections, adds a touch of antique elegance. The intricate openwork design showcases exceptional craftsmanship and allows light to play beautifully across the diamonds. This piece is not only a stunning accessory but also a valuable heirloom to be cherished for generations.",
  "tags": [
    "Jhumka",
    "Polki",
    "Diamond",
    "Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Heirloom",
    "Rose Cut Diamond",
    "Heera",
    "Kundan"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0031_0439",
  "collection": "diamond"
}