{
  "id": "earrings-061",
  "title": "Mayuri Chandbali - Exquisite Peacock Jhumka Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "set with high-quality Rubies",
    "Emeralds",
    "and dazzling Cubic Zirconia (CZ) stones. The gold boasts a fine Hyderabadi polish for a lasting shine."
  ],
  "features": "These captivating earrings feature a traditional Chandbali design adorned with a beautifully crafted peacock (Mayuri). The peacock motif is intricately designed. The earrings feature a cluster setting for the CZ stones at the top and a delicate bead drop at the bottom for added elegance. The setting is masterfully handcrafted using traditional South Indian techniques.",
  "colors": [
    "The earrings showcase a vibrant color palette with the warm glow of 22K gold",
    "the fiery red of Rubies",
    "the lush green of Emeralds",
    "and the sparkling white of CZ stones. This harmonious blend of colors embodies the richness of South Indian aesthetics."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals like Ugadi and Sankranthi",
    "traditional ceremonies",
    "or to add a touch of regal charm to your everyday attire. They also complement modern ensembles beautifully",
    "making them ideal for cocktail parties and special events."
  ],
  "description": "This piece embodies the rich heritage of South Indian jewelry craftsmanship. The peacock motif is symbolic of beauty, royalty, and prosperity. The use of high-quality materials and the intricate design ensure both durability and timeless elegance, making it a treasured heirloom.",
  "tags": [
    "Jhumka",
    "Chandbali",
    "Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Mayuri",
    "Peacock Design",
    "22K Gold",
    "Ruby",
    "Emerald",
    "CZ",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Bridal Jewelry",
    "Kolatam"
  ],
  "original_id": "diamond_jewellery_8092df8c-2e43-49b6-a452-ab18446fe932_0146",
  "collection": "diamond"
}