{
  "id": "necklaces-1577",
  "title": "Diamond Cascade Haaram - An Exquisite Celebration of Light",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold (estimated)",
    "featuring a spectacular array of brilliant-cut diamonds. Includes Pear and Marquise cut diamonds with excellent clarity (estimated based on image). Total gross weight (G.wt) is approximately 108.910 grams. Total diamond weight (D.wt) is approximately 3.84 carats. Details indicate the presence of various sizes of Pan and Marquise cut diamonds",
    "adding texture and brilliance."
  ],
  "features": "A modern interpretation of the classic Haaram, this piece features a mesmerizing cascade design, resembling delicate branches adorned with diamond leaves. The central motif showcases a floral-inspired arrangement, radiating outwards to create a V-shaped silhouette. The diamonds are meticulously set to maximize their sparkle and create a captivating play of light.",
  "colors": [
    "Predominantly white and silver",
    "with the icy brilliance of white gold complementing the fire of the diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "or any grand event where you want to make a statement. Suitable for formal occasions and upscale parties. A stunning piece for a bride's muhurtham or a special anniversary celebration."
  ],
  "description": "This diamond haaram is a showstopper! Its contemporary design seamlessly blends with the timeless elegance of diamonds, creating a piece that is both modern and sophisticated. The exceptional craftsmanship ensures durability and lasting beauty. This piece will be a treasured heirloom for generations to come. The meticulously curated diamonds maximize brilliance and fire, ensuring you’ll be the center of attention wherever you go.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Bridal Jewelry",
    "White Gold",
    "Contemporary Design",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Statement Piece",
    "కంఠహారము",
    "Vajraalu",
    "Hyderabad Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-43_2282",
  "collection": "sjpl"
}