{
  "id": "necklaces-502",
  "title": "Enchanting Navaratan Haaram with Emerald & Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Grwt: 61.850 GH)",
    "Natural Emerald Cabochon (Eme Mny: 28.25)",
    "South Sea Pearl (Moti: 33.37)",
    "Small Pearls (S Moti: 1.90)",
    "Pink Sapphire Beads (Pink Bds: 38.13)",
    "Pink Sapphire Manikyams (Pink Mny: 5.70)",
    "Pink Carved Sapphires (Pink Carve: 48.15)",
    "Blue Beads (Blue Bds: 2.82)",
    "Polki Diamonds. Features a traditional 'Hyderabadi Polish' for a rich luster."
  ],
  "features": "This exquisite Haaram features a central pendant in a stylized peacock design, adorned with meticulously carved pink sapphires and a vibrant emerald cabochon. The delicate framework is studded with polki diamonds, creating a mesmerizing sparkle. The intricate use of pearl droplets adds a touch of ethereal elegance. The necklace itself is crafted with strings of faceted pink sapphire beads, punctuated by gold separators.",
  "colors": [
    "Dominant colors include the vibrant green of the emerald",
    "the soft pink of the sapphires",
    "the classic white of the pearls",
    "and the warm yellow of the gold. Hints of blue add a subtle contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and other special occasions. A stunning choice for a modern bride",
    "a 'seemantham'",
    "or a festive 'half-saree function'. This piece blends traditional aesthetics with contemporary design",
    "making it versatile for both grand celebrations and elegant gatherings."
  ],
  "description": "This Navaratan Haaram is a harmonious blend of tradition and modernity. The use of high-quality gemstones, including a striking emerald and lustrous pearls, makes it a valuable heirloom piece. The detailed craftsmanship and unique design ensure that it will be a cherished addition to any jewelry collection. The piece is inspired by traditional South Indian temple jewelry, making it culturally significant and highly desirable.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Pearls",
    "Pink Sapphire",
    "Manikyams",
    "Navaratan",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Polki Diamonds",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Seemantham",
    "Half-Saree Function"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-32 2_0982",
  "collection": "diamond"
}