{
  "id": "bangles-306",
  "title": "Sparkling Diamond Vanki Bangle - A Timeless Tradition",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "Crafted in 22K Yellow Gold with Hyderabadi Polish. Adorned with carefully selected brilliant-cut diamonds. Gold has been alloyed for strength and is hallmarked for authenticity. Diamonds are VS clarity and G color."
  ],
  "features": "This exquisite bangle features a continuous row of sparkling diamonds set within a beaded gold framework. The open 'V' shape, characteristic of the classic Vanki design, offers a modern twist on traditional elegance. The individual diamond settings are meticulously crafted for maximum brilliance. Secure clasp closure ensures comfortable wear.",
  "colors": [
    "Warm yellow gold contrasted with the dazzling white of the diamonds creates a visually stunning effect."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "festivals like Diwali and Sankranti",
    "and family celebrations. This vanki also makes a statement when paired with contemporary outfits for upscale parties or formal events."
  ],
  "description": "A sophisticated blend of traditional South Indian design with modern aesthetics. The high-quality materials and meticulous craftsmanship guarantee a durable and treasured heirloom piece. The continuous diamond setting symbolizes enduring love and prosperity. The Hyderabadi polish gives the gold a unique luster, unmatched in its brilliance.",
  "tags": [
    "Bangle",
    "Vanki",
    "Kadiyam",
    "Diamond Bangle",
    "Gold Bangle",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Indian Bangle",
    "Hyderabad Polish",
    "Jewellery",
    "Bangles",
    "Kangan",
    "Hand Ornament",
    "Bridal Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-13-03-48 3_2184",
  "collection": "sjpl"
}