{
  "id": "necklaces-1136",
  "title": "Enchanting Emerald & Polki Necklace - Pancha Ratna Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Emeralds (cabochon cut",
    "excellent clarity)",
    "Uncut Polki Diamonds (Rose Cut",
    "high lustre). Features Hyderabadi Polki setting technique."
  ],
  "features": "This exquisite haaram features a delicate floral motif accentuated with rich emerald cabochons and sparkling Polki diamonds. The Polki diamonds are set in the traditional 'kundan' style, showcasing the natural beauty and uncut charm of the stones. The alternating emerald and diamond arrangement creates a balanced and elegant design. Each floral cluster has meticulously handcrafted petals. Classic South Indian Design with a touch of modern flair.",
  "colors": [
    "Emerald Green",
    "Golden Yellow (Gold)",
    "Sparkling White (Diamonds). A traditional and auspicious color combination in South Indian Jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Venkateshwara Kalyanam)",
    "engagements",
    "bridal wear (pellikuturu)",
    "and other grand celebrations. Also ideal for festive occasions such as Diwali",
    "Sankranthi",
    "Ugadi",
    "Seemantham",
    "and as a statement piece for high-end social gatherings."
  ],
  "description": "This haaram is a true heirloom piece, handcrafted by master artisans using time-honored techniques. The combination of emeralds and Polki diamonds is considered highly auspicious and brings good fortune. The exceptional craftsmanship and high-quality materials ensure that this necklace will be cherished for generations. This is an investment in enduring elegance.",
  "tags": [
    "Haaram",
    "Polki Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Kundan Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Temple Jewelry",
    "Pancha Ratna",
    "Hyderabadi Jewelry",
    "Moghal Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Pellikuturu",
    "Engagement Necklace",
    "Seemantham",
    "Muhurtham",
    "Indian Jewelry",
    "Uncut Diamonds",
    "Pachala Haaram"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0037_2553",
  "collection": "radhe"
}