{
  "id": "necklaces-149",
  "title": "Lakshmi Kasula Haaram with Polki Pendant and Pearl-Ruby Tassel",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (approx. 2ct total weight)",
    "Natural Seed Pearls",
    "Faceted Rubies. Features our signature Hyderabadi Gold Polish for a lasting sheen."
  ],
  "features": "This exquisite Haaram features a central floral pendant meticulously crafted with uncut Polki diamonds, radiating a mesmerizing brilliance. Delicately placed rubies accentuate the Polki work, adding a touch of vibrancy. The necklace strand alternates between lustrous seed pearls and vibrant rubies. A striking pearl and ruby tassel adds a contemporary flair to this traditional piece. The secure clasp is subtly integrated for seamless wear.",
  "colors": [
    "Gold (warm yellow)",
    "White (pearls)",
    "Red (rubies)",
    "Clear (Polki diamonds)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "milestone birthdays",
    "and grand cultural celebrations. A statement piece suitable for both traditional South Indian attire and elegant modern ensembles."
  ],
  "description": "This Haaram beautifully blends the timeless elegance of Polki diamonds with contemporary design. The use of premium materials, combined with meticulous craftsmanship, ensures a piece that will be treasured for generations. The Hyderabadi Gold Polish enhances the gold's luster and durability. A true heirloom piece, embodying the rich heritage of South Indian jewelry.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki",
    "Diamonds",
    "Rubies",
    "Pearls",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Kasula Haaram",
    "Vivaha",
    "Nischitartham",
    "Heirloom",
    "Indian Jewellery",
    "Gold Necklace",
    "Temple Jewelry",
    "Mogappu"
  ],
  "original_id": "diamond_jewellery_DPPD8-1626_0382",
  "collection": "diamond"
}