{
  "id": "necklaces-1217",
  "title": "Exquisite Emerald and Diamond Haaram - The 'Vanamala' Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (67.610 grams)",
    "Natural Emeralds (16.46 carats total weight)",
    "Brilliant Cut Diamonds (6.15 carats total weight",
    "1411 stones). Features the signature Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This contemporary haaram design blends traditional South Indian aesthetics with modern sensibilities. The intricate gold filigree framework showcases clusters of brilliant-cut diamonds, interspersed with vibrant pear-shaped Emeralds. The 'Vanamala' design signifies prosperity and new beginnings, perfect for auspicious occasions. The setting is a combination of prong and pave, ensuring gemstone security and optimal light reflection.",
  "colors": [
    "Primary colors are rich Gold and vibrant Green Emeralds",
    "accentuated by the dazzling white of the Diamonds. This classic color combination is highly auspicious in South Indian traditions."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "receptions",
    "engagement ceremonies",
    "milestone birthdays",
    "and other grand celebrations. It will be a stunning addition to any South Indian bride's 'Pellikuthuru' attire or for a modern gala event."
  ],
  "description": "This haaram represents the pinnacle of South Indian craftsmanship, showcasing a perfect harmony of tradition and modern design. The emeralds are carefully selected for their rich color and clarity, while the diamonds provide unmatched sparkle. Its durable construction ensures it will become a treasured family heirloom (Sampadam). This piece is not only a stunning accessory but also an investment in lasting value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Pellikuthuru",
    "Sampadam",
    "Vanamala",
    "Fine Jewelry",
    "Indian Bridal Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Contemporary Design",
    "Statement Necklace"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-52 2_1791",
  "collection": "sjpl"
}