{
  "id": "rings-041",
  "title": "Exquisite Polki & Ruby Ring - A Timeless Treasure",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Yellow Gold setting",
    "studded with uncut Polki Diamonds (natural",
    "layered diamonds) and vibrant Ruby accents. Features delicate fine diamond accents",
    "Hyderabadi polish for a lasting lustre."
  ],
  "features": "A captivating symmetrical design featuring a central row of Ruby, surrounded by a dazzling array of Polki diamonds. The open setting allows light to permeate the Polki stones, enhancing their natural brilliance. Finely crafted prongs ensure secure gemstone placement. The ring boasts a low profile, making it comfortable for everyday wear or special occasions.",
  "colors": [
    "Warm Yellow Gold",
    "striking Ruby Red",
    "and shimmering",
    "milky White Polki diamonds with subtle flashes of light. A classic and regal color combination."
  ],
  "occasions": [
    "Ideal for weddings (pellilu)",
    "engagements",
    "anniversaries",
    "festive celebrations like Diwali or Sankranthi",
    "or any special occasion where you want to make a statement. Also perfectly suited for adding a touch of understated luxury to evening wear."
  ],
  "description": "This ring is a unique blend of traditional charm and contemporary elegance. The use of Polki diamonds, a hallmark of Indian jewelry, gives it a distinctive and regal appeal. The Hyderabadi polish enhances the gold's natural warmth, ensuring lasting beauty. Crafted with meticulous attention to detail, this ring is a true investment piece that will be treasured for generations.",
  "tags": [
    "Polki Ring",
    "Diamond Ring",
    "Ruby Ring",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Ring",
    "Engagement Ring",
    "Ethnic Jewelry",
    "Statement Ring",
    "Pellilu",
    "Sankranthi",
    "Fine Jewelry",
    "Handcrafted Jewelry",
    "Uncut Diamond",
    "Telugu Jewelry",
    "Dimaond Pittalu"
  ],
  "original_id": "ear_rings_DPER8-962_2655",
  "collection": "ear"
}