{
  "id": "necklaces-334",
  "title": "Lakshmi Kantha Haaram Set: A Diamond & Pearl Symphony",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "Crafted in 22K Gold",
    "set with Sparkling Cubic Zirconia (CZ) diamonds and Freshwater Pearls. The central stone is a synthetic Ruby. The set has a subtle Hyderabadi polish for a timeless look."
  ],
  "features": "This exquisite set blends tradition with modern aesthetics. The necklace features a delicate floral design with CZ diamond clusters, interspersed with lustrous freshwater pearl drops. The central pendant is a traditional South Indian motif, adorned with CZ diamonds and highlighted by a rich synthetic ruby. The accompanying earrings are intricately designed Jhumkas, mirroring the necklace's floral pattern and culminating in a single pearl drop.",
  "colors": [
    "The color palette is a classic combination of gold",
    "white (from the diamonds)",
    "red (from the ruby) and soft ivory (from the pearls). This creates a regal yet understated look."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "receptions",
    "engagement ceremonies",
    "or any grand occasion where you want to exude elegance. Also suitable for modern events and parties."
  ],
  "description": "This set offers a captivating blend of traditional South Indian design and contemporary style. The meticulous craftsmanship, combined with high-quality materials, ensures lasting beauty and a comfortable wear. It's a statement piece that adds a touch of regal grace to any outfit and makes a wonderful heirloom for generations to come.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "CZ Diamonds",
    "Pearls",
    "22K Gold",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Muhurtham",
    "Reception",
    "Engagement",
    "Hyderabadi Polish",
    "Kasulaperu",
    "Addigai"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0448_0630",
  "collection": "diamond"
}