{
  "id": "necklaces-114",
  "title": "Polki & Emerald Guttapusalu Haaram - A Regal Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (High Clarity)",
    "Natural Emerald Beads. Expertly crafted with Hyderabadi Polish for enduring luster."
  ],
  "features": "This exquisite Haaram features a classic Guttapusalu design with cascading strands of lustrous polki diamonds and vibrant green emerald beads. The Polki diamonds are meticulously set in a Kundan style, with intricate detailing around each stone. The emeralds are perfectly spherical and contribute to the piece's overall elegance. The 'Gutta' (cluster) detailing is evident in the arrangement of the emeralds along the lower edge, creating a swaying, pearl-like effect.",
  "colors": [
    "Gold (Yellow)",
    "White (Polki Diamonds)",
    "Green (Emeralds). A harmonious blend of traditional auspicious colors."
  ],
  "occasions": [
    "Ideal for bridal wear (Muhurtham",
    "Reception)",
    "Seemantham",
    "or any grand occasion where a statement piece is desired. Perfect for adding a touch of regal elegance to any formal attire."
  ],
  "description": "A timeless heirloom piece showcasing exceptional craftsmanship. The uncut Polki diamonds offer a unique sparkle and reflect the light beautifully. The combination of gold, polki, and emeralds is a classic South Indian tradition, symbolizing prosperity and good fortune. The Hyderabadi Polish ensures long-lasting brilliance and durability. This Haaram will be treasured for generations.",
  "tags": [
    "Haaram",
    "Guttapusalu",
    "Polki",
    "Kundan",
    "Emerald",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "Statement Necklace",
    "Traditional Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_DPNK8-1496_0347",
  "collection": "diamond"
}