{
  "id": "necklaces-1563",
  "title": "Floral Blossom Haaram with Lustrous Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted with a base metal in rose-gold tone",
    "set with dazzling Cubic Zirconia (CZ) stones",
    "pink and lilac colored gems",
    "complimented by lustrous freshwater pearls (Moti). Hyderabadi polish enhances the shine and brilliance."
  ],
  "features": "A contemporary take on the traditional Haaram, this necklace features a stunning floral design. The arrangement showcases a delicate balance between floral motifs and gemstone settings, accentuated by the elegance of the pearls. The centerpiece is a large floral pendant, adding a focal point of regal beauty. The open setting allows maximum light to reflect from the stones.",
  "colors": [
    "Rose-gold",
    "White (CZ)",
    "Pink",
    "Lilac",
    "and the iridescent white of the freshwater pearls."
  ],
  "occasions": [
    "Perfect for a modern Seemantham",
    "Reception",
    "or a high-end cocktail event. Can also add a touch of glamour to a formal dinner."
  ],
  "description": "This necklace is a harmonious blend of traditional inspiration and contemporary design. The high-quality Cubic Zirconia stones offer a dazzling sparkle comparable to diamonds, while the freshwater pearls add a touch of classic elegance. Its lightweight construction (6.81g) ensures comfortable wear, making it ideal for extended celebrations. The floral design symbolizes prosperity and new beginnings, perfect for special occasions. Own this exquisite piece and radiate timeless beauty at your next gathering.",
  "tags": [
    "Haaram",
    "Necklace",
    "Contemporary",
    "Floral",
    "CZ",
    "Cubic Zirconia",
    "Pearls",
    "Moti",
    "Rose Gold",
    "Hyderabad Jewelry",
    "Seemantham",
    "Reception",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Celebration Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-48 2_2267",
  "collection": "sjpl"
}