{
  "id": "necklaces-865",
  "title": "Exquisite Diamond and Emerald Long Haaram Set with Jhumka Earrings",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "High-quality CZ diamonds (American Diamonds) set in a durable alloy with a radiant gold-tone finish. Features vibrant emerald and ruby gemstones. Pearl accents add a touch of classic elegance. Includes matching Jhumka earrings."
  ],
  "features": "This stunning long haaram showcases a delicate floral design meticulously crafted with sparkling CZ diamonds. Emeralds and rubies are strategically placed to enhance its beauty. The ornate pendant features intricate detailing and pearl drops, reflecting classic South Indian design. The Jhumka earrings mirror the haaram's design, creating a cohesive and elegant set.",
  "colors": [
    "Primarily gold-tone with vibrant green (emerald) and red (ruby) accents. The white CZ diamonds and pearls add a touch of brilliance and contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "or any special occasion where you want to make a statement. Ideal for traditional South Indian ceremonies like muhurtham",
    "seemantham",
    "and half-saree functions. Can also be styled for modern festive events."
  ],
  "description": "This haaram set offers exceptional value, combining the look of real diamonds and precious gemstones with the affordability of high-quality CZ diamonds. The intricate design and classic South Indian style make it a timeless piece that you'll cherish for years to come. Its durability ensures it will last through countless celebrations. The matching Jhumka earrings complete the look, making it a truly special and unforgettable ensemble.",
  "tags": [
    "Haaram",
    "Necklace",
    "Long Necklace",
    "South Indian Jewelry",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "CZ Diamond",
    "Emerald",
    "Ruby",
    "Pearl",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Muhurtham",
    "Seemantham",
    "Half Saree",
    "Telugu Jewelry"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0398_1552",
  "collection": "haaram"
}