{
  "id": "necklaces-389",
  "title": "Aarya Antique Finish Kundan Haaram with Peacock Motif Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (51.100 grams gross weight",
    "48.82 grams chain weight) with Kundan Setting. Features high-quality Kundan stones",
    "Ruby Cabochon center",
    "Emerald accents. Finished with a rich antique 'Hyderabadi Polish' to enhance the vintage appeal."
  ],
  "features": "This exquisite Haaram showcases intricate Kundan craftsmanship, meticulously set to create a stunning floral and peacock design. The necklace features alternating peacock and floral motifs along the neckline, leading to a statement pendant. The pendant is a circular masterpiece with a central peacock motif crafted with Kundan stones. Delicate gold beads dangle gracefully from the necklace and pendant, adding movement and charm. The antique finish highlights the fine detailing and gives it a timeless appeal, reminiscent of royal jewelry.",
  "colors": [
    "Primarily gold with white (Kundan)",
    "complemented by deep red (Ruby) and vibrant green (Emerald) accents. The antique finish gives the gold a warm",
    "aged tone."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaham)",
    "engagement ceremonies (Muhurtham)",
    "festivals (like Diwali or Sankranthi)",
    "and traditional functions (Seemantham",
    "Half-Saree Function). Its elegance also makes it suitable for upscale social events and celebrations."
  ],
  "description": "This Kundan Haaram is a true statement piece that blends traditional South Indian artistry with timeless elegance. The use of high-quality Kundan stones and the skilled craftsmanship make it a valuable heirloom. The antique finish adds character and depth, ensuring that it will be cherished for generations. The peacock motif, a symbol of beauty and royalty, enhances its cultural significance. Experience the luxury of Hyderabadi craftsmanship and make a lasting impression.",
  "tags": [
    "Haaram",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Antique Jewelry",
    "Gold Necklace",
    "Peacock Motif",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Muhurtham",
    "Vivaham",
    "Haaralu",
    "Kundanalu",
    "Pasupu Tadu",
    "South Indian Wedding"
  ],
  "original_id": "diamond_jewellery_IMG-20241219-WA0019_0799",
  "collection": "diamond"
}