{
  "id": "necklaces-004",
  "title": "Regal Rose Gold Diamond Cascade Necklace Set - A Timeless Statement",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Crafted in 18K Rose Gold. Features meticulously hand-set",
    "near colorless diamonds (VS clarity) with brilliant cuts. Hyderabadi polish imparts a lasting sheen and enhances the rose gold's warmth."
  ],
  "features": "This striking set features a cascade necklace design reminiscent of a classic Haaram, updated with a contemporary flair. The necklace showcases three oval-shaped focal points, each intricately embellished with filigree work. Matching Jhumka-inspired earrings echo the necklace's design, creating a cohesive and glamorous look. The use of circular patterns throughout lends the piece a modern geometric aesthetic.",
  "colors": [
    "Primarily Rose Gold with the sparkling white brilliance of diamonds. The rose gold adds warmth and sophistication",
    "complementing all skin tones."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and high-end parties. Also suitable for milestone celebrations like anniversaries or birthdays",
    "adding a touch of regal elegance."
  ],
  "description": "This exquisitely crafted set is a unique blend of traditional design principles and contemporary aesthetics. Its rose gold and diamond combination provides a luxurious and timeless appeal. The intricate filigree work showcases exceptional craftsmanship, making this a truly special heirloom piece. The necklace's unique cascade design ensures it stands out in any crowd.",
  "tags": [
    "Necklace",
    "Earrings",
    "Rose Gold Jewelry",
    "Diamond Jewelry",
    "Haaram",
    "Jhumka",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Statement Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Contemporary Jewelry",
    "Telugu Jewelry",
    "filigree jewellery"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0010_0039",
  "collection": "choker"
}