{
  "id": "necklaces-1242",
  "title": "Emerald Radiance: Statement Diamond & Emerald Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base Metal with GH Polish",
    "Embellished with Diamonds (3.11 carats",
    "285 stones) and Emeralds (18.26 carats",
    "7 stones). The Diamonds are Marquise (+7):0.65(12) and Marquise (-7):-2.05(63). The Diamonds are Pan (+7):-12.77(170) and Pan(-7):-5.20(120)."
  ],
  "features": "A stunning contemporary necklace featuring a floral pattern meticulously crafted with brilliant-cut diamonds and pear-shaped emeralds. The emeralds are set in a prong setting to maximize their brilliance. The necklace is designed with a flexible construction for comfortable wear. The delicate diamond detailing accentuates the vibrant green of the emeralds.",
  "colors": [
    "Primarily white (diamonds) and green (emeralds) with a subtle golden sheen from the GH polished Base Metal."
  ],
  "occasions": [
    "Perfect for modern weddings",
    "reception parties",
    "formal events",
    "and special occasions where you want to make a bold yet elegant statement. It can also be worn during festivals like Diwali or Dussehra for a contemporary take on traditional jewelry."
  ],
  "description": "This necklace combines modern design aesthetics with the timeless elegance of diamonds and emeralds. The intricate floral pattern and vibrant color combination make it a truly unique piece. The piece is perfect for those seeking a modern twist on traditional South Indian jewelry. The high-quality gemstones and precise craftsmanship ensure its durability and lasting beauty.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond",
    "Emerald",
    "Statement Jewelry",
    "Contemporary",
    "Floral Design",
    "Wedding Jewelry",
    "Reception Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Occasion Wear",
    "Modern Traditional"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-45-07_1836",
  "collection": "sjpl"
}