{
  "id": "necklaces-229",
  "title": "Lakshmi Kasu Mala Inspired Necklace with Carnelian Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Faceted Carnelian gemstones",
    "High-quality Cubic Zirconia (CZ) stones",
    "Natural Pearl in Center",
    "meticulously crafted with Hyderabadi Polish for a lasting shine."
  ],
  "features": "This captivating necklace blends traditional South Indian 'Kasu Mala' elements with a modern aesthetic. The design features a central floral motif with CZ stones around a natural pearl and further enhanced by a filigree heart pendant. Carnelian gemstones alternate with floral and heart shape embellishments along the chain, creating a rich contrast. The setting is expertly done to ensure the CZ stones sparkle brilliantly, and the goldwork has a flawless Hyderabadi polish.",
  "colors": [
    "Warm Gold tones complemented by the vibrant reddish-orange hues of the carnelian and sparkling white of CZ stones."
  ],
  "occasions": [
    "Perfect for a Seemantham ceremony",
    "Half-Saree Function",
    "Wedding Reception",
    "or any special occasion where you want to add a touch of traditional elegance with a modern twist. Suitable for formal parties and cultural events as well."
  ],
  "description": "This necklace offers a unique blend of traditional South Indian artistry and contemporary design. The use of Carnelian gems brings a warm, auspicious color. The high-quality materials ensure durability and lasting beauty. The Hyderabadi polish adds a touch of regal sophistication. The heart pendant adds a touch of romance, and the Kasu Mala elements connect you to rich cultural heritage.",
  "tags": [
    "Necklace",
    "Haaram",
    "Kasu Mala",
    "Carnelian",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Seemantham",
    "Half Saree",
    "Gundu Mala",
    "CZ",
    "Cubic Zirconia",
    "Filigree"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0309_0506",
  "collection": "diamond"
}