{
  "id": "earrings-046",
  "title": "Lakshmi Devi Stud Earrings - Divine Grace in Every Detail",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Cultured Pearl",
    "Cubic Zirconia (CZ)",
    "Ruby",
    "Emerald. Gold is meticulously crafted using traditional Nakshi techniques with a Hyderabadi Polish for lasting brilliance."
  ],
  "features": "These exquisite stud earrings feature a finely detailed Lakshmi Devi motif at the center, crafted with traditional Nakshi work. The outer frame is adorned with sparkling Cubic Zirconia (CZ) stones in a delicate floral pattern, accented with vibrant Ruby and Emerald cabochons. A lustrous cultured pearl dangles gracefully from the bottom, completing the divine look. The earring has a sturdy, comfortable stud backing for secure wear.",
  "colors": [
    "Golden Yellow (Gold)",
    "White (CZ)",
    "Red (Ruby)",
    "Green (Emerald)",
    "Creamy White (Pearl)"
  ],
  "occasions": [
    "Perfect for traditional occasions such as weddings (Muhurtham)",
    "festivals (like Diwali",
    "Dussehra)",
    "religious ceremonies",
    "and family gatherings. Can also be worn to add a touch of elegance to contemporary outfits for parties or special events."
  ],
  "description": "These earrings are a stunning blend of traditional South Indian artistry and contemporary design. The Lakshmi Devi motif symbolizes prosperity and good fortune, making them an auspicious and meaningful gift. The high-quality materials and meticulous craftsmanship ensure lasting beauty and durability. The unique design will make you stand out with grace and sophistication.",
  "tags": [
    "Earrings",
    "Studs",
    "Jhumka",
    "Temple Jewelry",
    "Lakshmi Devi",
    "Nakshi Work",
    "22K Gold",
    "Cubic Zirconia",
    "CZ",
    "Ruby",
    "Emerald",
    "Pearl",
    "South Indian Jewelry",
    "Traditional",
    "Wedding Jewelry",
    "Hyderabadi Polish",
    "Karnam",
    "Butti"
  ],
  "original_id": "diamond_jewellery_5b1dc8a3-da53-4aee-8be3-60d0f24a1f22_0127",
  "collection": "diamond"
}