{
  "id": "necklaces-186",
  "title": "Enchanting Polki & Emerald Gulubandhi Haaram - A Timeless Heritage",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features uncut Polki diamonds of exceptional clarity and vibrant Zambian Emeralds. Set with delicate diamond accents."
  ],
  "features": "This exquisite Haaram showcases a classic Gulubandhi design, meticulously handcrafted by skilled artisans in Hyderabad. The Polki diamonds are set in a closed setting to enhance their brilliance. The emeralds are crafted into floral design between the polki stones. The pendant features a larger polki surrounded by diamond accents, adding an extra touch of elegance. It is a perfect blend of regal tradition with a touch of modern minimalism.",
  "colors": [
    "Predominantly gold with contrasting white Polki diamonds and vibrant green Emeralds. The Hyderabadi polish lends a rich",
    "warm tone to the gold."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "engagements (Nischitartham)",
    "and other grand celebrations. Ideal for brides seeking a statement piece that honors their heritage or for special events where you want to showcase exquisite traditional jewelry."
  ],
  "description": "A stunning testament to Hyderabad's rich jewelry-making heritage. This Gulubandhi Haaram is a valuable heirloom piece, showcasing exquisite craftsmanship, exceptional gemstone quality, and timeless design. The combination of Polki diamonds and emeralds is considered highly auspicious and adds a touch of regal elegance. Offers lasting value, both financial and sentimental.",
  "tags": [
    "Haaram",
    "Gulubandhi",
    "Polki",
    "Emerald",
    "Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Vivaaha",
    "Heritage Jewelry",
    "Zambian Emeralds",
    "22K Gold",
    "Heirloom Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0028_0436",
  "collection": "diamond"
}