{
  "id": "necklaces-1261",
  "title": "Manoharam Emerald & Pink Tourmaline Kasulaperu Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Pink Tourmaline beads",
    "Carved Pink Tourmaline",
    "Emerald beads",
    "Emerald cabochon",
    "Seed Pearls (Moti)",
    "Blue Beads",
    "Diamonds (unspecified clarity). Finished with a high-polish Hyderabadi finish."
  ],
  "features": "A modern take on the classic Kasulaperu, this haaram features a striking pendant with a large oval-cut Emerald cabochon. The pendant is adorned with emerald drops, diamonds, and cascading pink tourmaline drops. The neckline comprises pink tourmaline beads interspersed with carved pink tourmaline floral elements. Seed pearls (Moti) are delicately placed to enhance the overall design. A central teardrop pearl adds a touch of traditional elegance.",
  "colors": [
    "Dominant colors are green (Emerald)",
    "pink (Tourmaline)",
    "white (Pearls)",
    "and gold. Subtle blue accents add a touch of contrast."
  ],
  "occasions": [
    "Perfect for contemporary weddings",
    "grand celebrations (like receptions)",
    "Seemantham",
    "or any festive occasion where you want to make a statement. Also suitable for modern parties and high-end events."
  ],
  "description": "This haaram is a beautiful fusion of traditional South Indian jewelry with modern aesthetics. The rare emerald cabochon and the vibrant pink tourmaline create a mesmerizing color combination. The handcrafted details, combined with the high-quality materials, make this piece a valuable and timeless investment. The Hyderabadi polish ensures lasting shine and brilliance.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Emerald",
    "Tourmaline",
    "Pearls",
    "Moti",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Kasulaperu",
    "Contemporary Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Design Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-13-02-32 2_1857",
  "collection": "sjpl"
}