{
  "id": "necklaces-173",
  "title": "Emerald & Diamond Raani Haaram - The 'Indrani' Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (Zambian)",
    "Polki Diamonds. Features the signature Hyderabadi polish for enhanced luster and durability."
  ],
  "features": "This Raani Haaram features a classic two-layer design, meticulously crafted with round Zambian emeralds encircled by Polki diamonds. The central pendant showcases a larger pear-shaped Emerald, also surrounded by Polki diamonds, set in a floral motif reminiscent of traditional Mughal designs. The necklace incorporates traditional 'Gutti Pusalu' elements in the stringing style with intricate diamond spacers, adding to its heritage appeal.",
  "colors": [
    "Emerald Green",
    "Gold",
    "and sparkling White (of the Polki Diamonds). The combination is a timeless classic in South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagement ceremonies",
    "Seemantham (baby shower)",
    "half-saree function (Voni Function)",
    "grand festivals like Diwali and Sankranthi",
    "and other significant celebrations. This is a statement piece ideal for the bride or any woman wanting to showcase traditional elegance."
  ],
  "description": "A true heirloom piece, this Raani Haaram embodies the rich cultural heritage of Hyderabad. The combination of natural emeralds and uncut Polki diamonds creates a mesmerizing sparkle. The 22K gold ensures lasting value and durability. This piece is not just jewelry; it is an investment in tradition and timeless beauty, a treasured addition to any jewelry collection.",
  "tags": [
    "Raani Haaram",
    "Emerald Necklace",
    "Polki Diamond",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Necklace",
    "Hyderabadi Jewelry",
    "Gutti Pusalu",
    "Kantabharanam",
    "Zambian Emerald",
    "22K Gold",
    "Heritage Jewelry",
    "Indian Wedding",
    "Seemantham",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0013_0422",
  "collection": "diamond"
}