{
  "id": "necklaces-740",
  "title": "Emerald & Ruby Stone Haaram - Rani Style with Exquisite Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (Square and Round Cuts)",
    "Natural Rubies (Round Cuts)",
    "High-Quality Cubic Zirconia (CZ) stones. Featuring Hyderabadi Polish for a lasting luster."
  ],
  "features": "This Rani-style Haaram showcases a classic South Indian design. The necklace features alternating round settings with emeralds and rubies at the center, surrounded by CZ stones. The intricately designed pendant features peacock motifs studded with CZ stones and an emerald at the center. The pendant has a bunch of drop hangings at the bottom. The setting is meticulously crafted with attention to detail, reflecting the rich heritage of Hyderabadi jewelry making.",
  "colors": [
    "Gold (warm yellow)",
    "Emerald (green)",
    "Ruby (red)",
    "Cubic Zirconia (white)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "festivals (like Diwali and Ugadi)",
    "and other special occasions. A stunning choice for a bride's muhurtham or a grand reception. It is also suitable for Seemantham ceremonies and half-saree functions."
  ],
  "description": "This Haaram represents a timeless blend of traditional South Indian design and superior craftsmanship. The combination of emeralds, rubies, and high-quality CZ stones offers a brilliant sparkle. The Hyderabadi polish ensures a lasting shine. The peacock motifs in the pendant represent beauty, love, and prosperity, making it a meaningful heirloom piece. The durable construction ensures longevity and enduring value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Rani Haaram",
    "Emerald",
    "Ruby",
    "CZ Stones",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Addigai",
    "Vivaham",
    "Muhurtham",
    "Seemantham",
    "Nischitartham",
    "పెళ్లి నగలు",
    "హారం",
    "ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-35_1246",
  "collection": "diamond"
}