{
  "id": "necklaces-948",
  "title": "Aabharana Kundala: Exquisite Diamond and Gemstone Mango Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal crafted with a fine layer of gold plating",
    "shimmering with high-quality Cubic Zirconia (CZ) stones. Adorned with vibrant",
    "high-luster ruby and emerald gemstones. Showcases intricate Hyderabadi polish for lasting brilliance."
  ],
  "features": "This stunning Haaram features the iconic mango (paisley) design, a timeless symbol of prosperity. Each mango motif is meticulously encrusted with CZ stones, framing vibrant rubies and emeralds in a flower-like setting. The central pendant showcases a grand mango design with elaborate detailing and delicate gemstone drops (gutta pusalu style) for a touch of classic South Indian charm. Delicate floral motifs intertwine to add to the necklace's beauty. This piece also has a modern aesthetic.",
  "colors": [
    "Primarily gold with the dazzling sparkle of clear CZ stones. The rich red of the rubies and the lush green of the emeralds create a captivating and auspicious color palette",
    "quintessential to South Indian jewelry."
  ],
  "occasions": [
    "Perfect for traditional Telugu weddings (Pelli)",
    "engagement ceremonies (Muhurtham)",
    "and other auspicious occasions like Seemantham or Half-Saree functions. Its timeless elegance also makes it suitable for grand parties and festive celebrations."
  ],
  "description": "This Aabharana Kundala Haaram is a testament to exquisite craftsmanship and timeless design. The intricate CZ detailing and vibrant gemstones create a dazzling effect, while the mango motif symbolizes prosperity and good fortune. With Hyderabadi polish, this piece promises lasting brilliance, making it a cherished heirloom for generations. A perfect blend of traditional aesthetics and modern sensibilities.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Mango Haaram",
    "Diamond Necklace",
    "CZ Jewelry",
    "Ruby Emerald",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "కంఠాభరణము",
    "Jewellery",
    "Muhurtham",
    "Seemantham",
    "Half-Saree Function"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0342_2409",
  "collection": "necklace"
}