{
  "id": "bangles-218",
  "title": "Diamond Cascade Kangan Set - Sparkling Elegance",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "Crafted in 18K Rose Gold",
    "meticulously set with brilliant-cut natural diamonds. The diamonds are of VS clarity and GH color",
    "ensuring exceptional sparkle and fire. Features a high-polish finish for enhanced luster."
  ],
  "features": "This Kangan set showcases a timeless cascading design, with diamonds arranged in a continuous flow of brilliance. Each diamond is individually prong-set, maximizing light reflection and creating a dazzling effect. The design seamlessly blends modern aesthetics with traditional Indian bangle styles, suitable for the contemporary woman.",
  "colors": [
    "Predominantly rose gold with the icy white sparkle of diamonds",
    "creating a warm and luxurious aesthetic."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "anniversaries",
    "and festive occasions. Also suitable for adding a touch of sophisticated sparkle to evening wear or formal events. A stunning piece for a bride during the muhurtham or for a special occasion like a seemantham."
  ],
  "description": "Experience the epitome of luxury with this exquisite diamond Kangan set. The exceptional craftsmanship, coupled with the brilliance of the diamonds, makes this a timeless investment. The rose gold setting adds a touch of contemporary elegance, making it a versatile piece that can be cherished for generations. A testament to refined taste and enduring beauty.",
  "tags": [
    "Bangles",
    "Kangan",
    "Diamond Bangles",
    "Rose Gold Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Hyderabad Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0137_0753",
  "collection": "diamond"
}