{
  "id": "necklaces-1120",
  "title": "Emerald Peacock Polki Haaram - A Timeless Telugu Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds",
    "Zambian Emerald. Features a fine Hyderabadi polish for lasting brilliance."
  ],
  "features": "This exquisite Haaram showcases a central rectangular Zambian Emerald pendant, flanked by intricately detailed peacock motifs. The entire necklace is studded with uncut Polki diamonds, each carefully set in a closed setting to enhance their natural luster. The peacock design, a symbol of beauty and grace in South Indian culture, adds a traditional touch. The back of the pendant features delicate filigree work (jali work) for added elegance.",
  "colors": [
    "Predominantly gold with the vibrant green of the emerald. The Polki diamonds exhibit a subtle",
    "milky white hue that complements the gold beautifully. A hint of red in the peacock's eyes adds a touch of detail."
  ],
  "occasions": [
    "Perfect for weddings (Veedhula Function)",
    "engagements",
    "Seemantham (baby shower)",
    "and other auspicious occasions. It can also be styled for high-end parties and cultural events."
  ],
  "description": "This is a truly unique piece that blends traditional craftsmanship with the brilliance of uncut diamonds and the regal appeal of Emeralds. The peacock design adds a touch of South Indian heritage, while the Hyderabadi polish ensures lasting beauty and value. A statement piece that will be treasured for generations.",
  "tags": [
    "Haaram",
    "Polki",
    "Diamond Necklace",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Peacock Design",
    "Traditional Jewelry",
    "Seemantham Jewelry",
    "Veedhula Function",
    "Kante",
    "Antique Finish",
    "Nakshi Work"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0016_2534",
  "collection": "radhe"
}