{
  "id": "necklaces-665",
  "title": "Emerald & Sapphire Blossom Haaram - Royal Telugu Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold",
    "Faceted Sapphires (Blue)",
    "Emerald Cut Emerald (Center Stone)",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color). Hyderabadi Polish for enhanced luster."
  ],
  "features": "A stunning fusion of traditional and contemporary design. Features a central emerald cut emerald framed by intricate diamond-set foliage and cascading sapphire blossoms. The diamond work showcases a delicate filigree technique, reminiscent of traditional nakshi craftsmanship with a modern twist. The back of the haaram is meticulously finished for comfort and durability.",
  "colors": [
    "Rose Gold (base)",
    "Deep Blue (Sapphires)",
    "Vibrant Green (Emerald)",
    "Sparkling White (Diamonds). A classic and regal color palette."
  ],
  "occasions": [
    "Ideal for grand occasions such as weddings (pendli)",
    "receptions",
    "milestone birthdays",
    "and important festivals like Diwali and Sankranti. A show-stopping piece for any special occasion where you want to make a lasting impression."
  ],
  "description": "A unique investment piece blending traditional South Indian aesthetics with modern design sensibilities. The exceptional quality of the gemstones, coupled with the meticulous craftsmanship and Hyderabadi polish, ensures lasting beauty and value. The contrasting colors of the emerald and sapphires create a striking and memorable look. Perfect for the modern woman who appreciates heritage and timeless elegance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Sapphire",
    "Emerald",
    "Diamonds",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Pendli",
    "Kantaabharanam",
    "Nakshi",
    "Fine Jewelry",
    "Statement Necklace",
    "Contemporary Indian Jewelry",
    "Emerald Cut"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-33 3_1171",
  "collection": "diamond"
}