{
  "id": "necklaces-1490",
  "title": "Dazzling Diamond Haar: A Timeless Testament to Telugu Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish",
    "this breathtaking Haaram features a dazzling array of brilliant-cut diamonds. Accented with natural Green Tourmalines (పచ్చ రంగు రత్నములు) and a central Rose Quartz. All gemstones are of VS clarity and excellent cut."
  ],
  "features": "This exquisite piece showcases a blend of traditional and contemporary design. The necklace features a layered diamond setting meticulously handcrafted by skilled artisans. Notice the graceful floral motifs intertwined with elegant peacock (నెమలి) designs. Delicate gold drops (గుండ్లదండ) enhance its grandeur. The pendant showcases a similar floral and diamond pattern, culminating in a single, vibrant Green Tourmaline.",
  "colors": [
    "Primarily a radiant white due to the dazzling diamonds",
    "complemented by the warm yellow of the 22K Gold. The soft pink hue of the Rose Quartz and the vibrant green of the Tourmalines create a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (పెళ్లి)",
    "receptions",
    "and significant family celebrations like seemantham (సీమంతం) or half-saree functions (లంగా ఓణి వేడుక). Its timeless elegance also makes it a statement piece for high-end parties and cultural events."
  ],
  "description": "This Diamond Haaram is more than just jewelry; it's an heirloom piece imbued with cultural significance. The superior craftsmanship ensures durability and lasting beauty. The carefully selected gemstones symbolize prosperity and good fortune. Its unique design, blending tradition with modern sensibilities, makes it a truly coveted piece.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "22K Gold",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Pelli Jewellery",
    "కంఠహారం",
    "గుండ్లదండ",
    "Diamond Haar",
    "Green Tourmaline",
    "Rose Quartz",
    "Necklace",
    "Indian Jewellery",
    "Fine Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-46-46_2108",
  "collection": "sjpl"
}