{
  "id": "earrings-068",
  "title": "Divya Mayura Jhumkas: Exquisite Peacock Design in Radiant Gold",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "brilliant-cut Cubic Zirconia (CZ) stones",
    "and subtle Ruby accent stones. Features a luxurious Hyderabadi Polish for enduring shine."
  ],
  "features": "These Jhumkas showcase a captivating peacock (Mayura) design at the stud, symbolizing grace and beauty. The bell-shaped body features intricate filigree work with floral motifs, studded with sparkling CZ stones. The bottom is adorned with golden bead droplets (gundlu) for added charm. The delicate openwork design allows for optimal light reflection.",
  "colors": [
    "Predominantly radiant yellow gold",
    "accented by the fiery red of the ruby and the pristine white of the CZ stones. This color combination is auspicious and widely favored in South Indian weddings."
  ],
  "occasions": [
    "Perfect for weddings (pellilu)",
    "festivals (pandugalu)",
    "traditional ceremonies like Seemantham or Half-Saree function (Langa Voni function)",
    "and special occasions. Their versatile design also makes them suitable for upscale modern events."
  ],
  "description": "These Jhumkas are a timeless masterpiece, expertly handcrafted by skilled artisans using traditional techniques. The peacock design adds a touch of cultural significance, while the brilliant CZ stones offer a dazzling sparkle. The high-quality gold ensures durability and lasting value, making them a cherished heirloom for generations.",
  "tags": [
    "Jhumka",
    "Jhumki",
    "Earrings",
    "Gold Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Mayura",
    "Peacock",
    "CZ",
    "Cubic Zirconia",
    "Ruby",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "చెవి దుద్దులు",
    "జుంకాలు",
    "పెళ్ళి ఆభరణాలు",
    "బంగారు ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_8e98365e-1e35-419d-b884-1ec2e0518dd9_0157",
  "collection": "diamond"
}