{
  "id": "necklaces-946",
  "title": "Vaishnavi Diamond Grand Necklace - A Dazzling Statement",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Certified Round Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Cushion Cut Ruby",
    "Pear Cut Emeralds. Featuring Hyderabadi Zirconia polish for long-lasting shine."
  ],
  "features": "This meticulously crafted necklace showcases a harmonious blend of traditional and modern design. The centerpiece features a striking cushion-cut Ruby surrounded by a halo of sparkling diamonds, leading to beautifully intricate diamond-studded patterns. The necklace features pear-shaped emerald accents to add a touch of color and elegance. The base of the necklace features the same design studded with tiny diamonds.",
  "colors": [
    "Golden hue of 18K Yellow Gold",
    "Dazzling White Diamonds",
    "Deep Red Ruby",
    "Vibrant Green Emeralds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "grand celebrations",
    "and high-profile social events. A stunning choice for the bride's Muhurtham or Sangeet ceremony."
  ],
  "description": "This necklace is a true masterpiece of South Indian craftsmanship. The use of high-quality diamonds and gemstones, combined with the intricate design, makes it a timeless investment. The Hyderabadi Zirconia polish ensures lasting brilliance. It embodies both traditional values and contemporary aesthetics, making it a versatile piece for any modern woman.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Ruby",
    "Emerald",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Jewelry",
    "Vivaha",
    "Muhurtham",
    "grand necklace",
    "party wear"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0340_2407",
  "collection": "necklace"
}