{
  "id": "earrings-460",
  "title": "Neelam Polki Chandbali: A Regal Symphony of Tradition and Modernity",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Premium Quality Polki Diamonds (Uncut Diamonds)",
    "Faceted Tanzanite Drops",
    "Emeralds",
    "South Sea Pearls."
  ],
  "features": "This exquisite Chandbali design features a central Tanzanite drop embraced by a floral halo of Polki diamonds. The circular frame is adorned with alternating emeralds and polkis. The base showcases lustrous South Sea pearls, each delicately connected with emerald beads for added elegance. The polki settings reflect traditional Hyderabadi craftsmanship, offering a timeless appeal. The central part is an intricate bell design, which carries another tanzanite drop to balance the chandelier's visual weight.",
  "colors": [
    "Gold",
    "Deep Blue (Tanzanite)",
    "Green (Emerald)",
    "White (Pearls)",
    "Sparkling White (Polki Diamonds). A vibrant yet classic South Indian color palette."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivahaalu)",
    "receptions",
    "festive celebrations (Pandugalu)",
    "and high-end parties. A statement piece for the modern bride or any woman who appreciates timeless elegance."
  ],
  "description": "This Chandbali showcases authentic Hyderabadi Polki craftsmanship, combining traditional design with modern sophistication. The use of premium Tanzanite and South Sea pearls elevates its value and appeal. This piece is not just jewelry; it's a heirloom, a symbol of enduring elegance and cultural heritage. Its intricate detailing and vibrant gemstones make it a true conversation starter.",
  "tags": [
    "Chandbali",
    "Polki",
    "Neelam",
    "Tanzanite",
    "Emerald",
    "South Sea Pearl",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "చెవి దిద్దులు",
    "Wedding Jewelry",
    "Vivahaalu",
    "Indian Earrings",
    "Statement Earrings",
    "Fine Jewelry"
  ],
  "original_id": "ear_rings_DPCB8-1658_2576",
  "collection": "ear"
}