{
  "id": "necklaces-710",
  "title": "Emerald and Diamond Bridal Kasulaperu Haaram - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Faceted Emeralds",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color). Features Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite Haaram features a contemporary take on the traditional Kasulaperu design. The neckline is adorned with intricately carved gold bars and alternating diamond-encrusted floral pendants with emerald accents. The central pendant showcases a grand peacock design (Mayura aakruti), meticulously set with diamonds surrounding a stunning emerald center. Delicate gold bead danglers (gundla pothalu) add a touch of traditional charm. Features a hidden clasp for a seamless look.",
  "colors": [
    "Gold (yellow)",
    "Emerald (vibrant green)",
    "and Diamond (sparkling white)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements",
    "Seemantham (baby shower)",
    "half-saree functions",
    "and grand celebrations. Can also elevate a sophisticated evening look."
  ],
  "description": "A stunning blend of tradition and modern design. The brilliant-cut diamonds create unparalleled sparkle, while the vibrant emeralds add a regal touch. Crafted with meticulous detail by skilled artisans, this piece is an heirloom to be treasured for generations. Its timeless design makes it a versatile addition to any jewelry collection. The Hyderabadi polish ensures lasting shine and beauty.",
  "tags": [
    "Haaram",
    "Kasulaperu",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Mayura",
    "Peacock Design",
    "Gundla Pothalu",
    "22K Gold",
    "Kantaabharanam",
    "కంఠాభరణము",
    "పచ్చల హారం",
    "వజ్రాల హారం",
    "పెళ్లి నెక్లెస్",
    "శుభకార్య నెక్లెస్",
    "Traditional",
    "Contemporary",
    "Hyderabadi Polish",
    "Heirloom Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-58 3_1216",
  "collection": "diamond"
}