{
  "id": "necklaces-495",
  "title": "Exquisite Emerald and Ruby Navratna Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base (3.28 dwt)",
    "adorned with a stunning array of gemstones: a central 12.01ct Ruby",
    "16.56ct Emerald beads (13)",
    "6.83ct Rice Pearls (28)",
    "15.73ct Blue Sapphires (14)",
    "13.45ct Carved Emeralds (5)",
    "with additional 23.77ct Ruby melees (56) and 109.05ct Emerald melees. Hyderabadi Polish for a rich",
    "enduring luster."
  ],
  "features": "This magnificent Haaram features a complex floral design with intricate openwork. The central ruby is surrounded by pearl and gemstone studded flower motifs, with descending gemstone accents and a central teardrop style pendant. The necklace is strung with strands of faceted Emerald beads creating a classic and lush look. The design incorporates traditional South Indian craftsmanship.",
  "colors": [
    "The piece boasts a vibrant and rich color palette. The deep red of the ruby contrasts beautifully with the lush green of the emeralds",
    "the brilliant blues of the sapphires",
    "the natural pearlescence of the rice pearls",
    "all complemented by the warm yellow of the 22K gold."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings",
    "muhurtham ceremonies",
    "Seemantham (baby shower)",
    "half-saree functions",
    "and other significant celebrations. Its timeless elegance also makes it a show-stopping piece for high-end parties and red-carpet events."
  ],
  "description": "This Navratna Haaram is not just jewelry; it's an heirloom. The use of genuine gemstones and the meticulous Hyderabadi craftsmanship ensures both beauty and durability. The Navratna setting carries significant cultural value and is believed to bring good fortune. A true statement piece that blends tradition with luxury.",
  "tags": [
    "Haaram",
    "Necklace",
    "Navratna",
    "Ruby",
    "Emerald",
    "Sapphire",
    "Rice Pearls",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Kasulaperu",
    "Addigai",
    "Gutta Pusalu",
    "రత్నాలు",
    "ఆభరణాలు",
    "పెళ్లి నగలు",
    "ముహూర్తం"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-28 3_0975",
  "collection": "diamond"
}