{
  "id": "necklaces-093",
  "title": "Heirloom Polki Pendant with Emerald Drops",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Natural Emeralds. Crafted with traditional Hyderabadi polish for an authentic antique finish."
  ],
  "features": "Features a central large uncut Polki diamond surrounded by smaller Polki diamonds in a floral halo setting. The pendant boasts cascading rows of Polki diamonds culminating in three drop-shaped emeralds, adding a touch of regal elegance. Traditional golusu (chain) detailing complements the pendant's timeless charm.",
  "colors": [
    "The predominant color scheme is a classic combination of golden yellow (from the 22K gold)",
    "sparkling white (from the Polki diamonds)",
    "and vibrant green (from the emeralds). This combination is considered auspicious in Telugu traditions."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals",
    "and special occasions. A stunning statement piece for bridal wear (pellikuturu) or to add a touch of heritage to contemporary ensembles. Ideal for Seemantham",
    "half-saree function or engagement (nischitartham)."
  ],
  "description": "This heirloom-quality pendant is a celebration of South Indian craftsmanship and heritage. The use of uncut Polki diamonds and natural emeralds lends a unique, timeless appeal. Its sturdy construction ensures durability, making it a valuable addition to your jewelry collection for generations to come. Polki jewelry symbolizes prosperity and auspicious beginnings, making it a meaningful gift or personal investment.",
  "tags": [
    "Polki",
    "Pendant",
    "Diamond",
    "Emerald",
    "Gold",
    "South Indian Jewelry",
    "Antique Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Haaram Pendant",
    "Heirloom Jewelry",
    "Golusu",
    "Seemantham",
    "Pellikuturu",
    "Nakshi"
  ],
  "original_id": "diamond_jewellery_DPER8-538_0309",
  "collection": "diamond"
}