{
  "id": "necklaces-1022",
  "title": "Emerald Bloom Diamond Haaram - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) setting",
    "brilliant-cut diamonds (VS clarity",
    "G color)",
    "oval-cut emeralds of fine quality. Hyderabadi Kundan Polish for a lasting luster."
  ],
  "features": "This exquisite Haaram features a floral design intricately set with dazzling diamonds. The focal point is the vibrant green emeralds, adding a touch of regal charm. The delicate filigree work and unique pendant showcases traditional Telugu craftsmanship, making it a statement piece of unparalleled beauty. The Haaram is designed with a graduating floral pattern with emeralds centered in the large floral pendant and center piece.",
  "colors": [
    "Primary color is the warm yellow of 22K gold",
    "contrasted by the sparkling white of the diamonds and the rich green of the emeralds. Traditional South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "and other significant celebrations like Seemantham and half-saree functions (Voni Function). A stunning addition to any special occasion ensemble."
  ],
  "description": "A blend of traditional South Indian design and contemporary elegance, this Haaram is a true masterpiece. The brilliant-cut diamonds capture the light beautifully, while the fine emeralds add a touch of sophistication. Its craftsmanship and enduring design make it a treasured heirloom, passed down through generations. Own a piece of Hyderabad's rich jewelry heritage.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Kundan",
    "Hyderabadi Jewelry",
    "Vivaham",
    "Engagement Jewelry",
    "పచ్చల హారము",
    "కంఠాభరణం",
    "వజ్రాల నెక్లెస్"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0481_2343",
  "collection": "necklace"
}