{
  "id": "bangles-121",
  "title": "Devasena Diamond Kada - Divine Embrace of Tradition",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "F Color)",
    "meticulously crafted with Hyderabadi Polish to enhance its antique luster. The gold weight is approximately 45 grams."
  ],
  "features": "This exquisite Kada showcases intricate filigree work (jali work) adorned with sparkling diamonds. The centerpiece features a beautifully detailed miniature temple motif, meticulously handcrafted using the Nakshi technique, bringing a touch of divine grace. The floral and vine patterns symbolize prosperity and growth, common in South Indian jewelry design. The setting ensures maximum brilliance for each diamond.",
  "colors": [
    "Rich golden hue complemented by the dazzling white sparkle of the brilliant cut diamonds. The antique Hyderabadi polish gives it a warm",
    "timeless feel."
  ],
  "occasions": [
    "Perfect for traditional South Indian ceremonies like weddings (Vivaha Bandhanam)",
    "baby showers (Seemantham)",
    "and festivals (Sankranti",
    "Ugadi). Also suitable for upscale cultural events and family gatherings where a touch of tradition is desired. A timeless gift for anniversaries and milestone birthdays."
  ],
  "description": "This Kada is a harmonious blend of traditional craftsmanship and modern elegance. The Nakshi temple motif adds a sacred and auspicious touch, while the brilliant-cut diamonds lend a contemporary sparkle. It’s a heirloom-quality piece that can be passed down through generations, symbolizing family heritage and timeless beauty. Handcrafted by skilled artisans in Hyderabad, known for their exquisite jewelry traditions. The high-quality materials ensure durability and lasting value.",
  "tags": [
    "Kada",
    "Vanki",
    "Bangle",
    "Diamond Bangle",
    "Gold Bangle",
    "Temple Jewelry",
    "Nakshi Work",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Vivaha Bandhanam",
    "Seemantham",
    "Filigree",
    "Jali Work",
    "Divine Jewelry",
    "Auspicious Jewelry",
    "Heirloom Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0273_0472",
  "collection": "diamond"
}