{
  "id": "earrings-179",
  "title": "Exquisite Polki Diamond Jhumka - A Timeless Telugu Vaibhavam",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (approximate) setting",
    "adorned with Uncut Polki Diamonds. Features a Hyderabadi Polish for a rich",
    "lustrous finish. The Polki diamonds are of excellent clarity",
    "showcasing their natural brilliance."
  ],
  "features": "Features a classic Jhumka silhouette, meticulously handcrafted with intricate openwork detailing. The design incorporates a floral stud, followed by a connecting element, culminating in a larger Jhumka bell. Each element is encrusted with Polki diamonds in a closed setting, reflecting light beautifully. The bottom features delicate pearl drops. Traditional craftsmanship evident in the precision of the setting and the overall design.",
  "colors": [
    "Predominantly gold and white",
    "with the natural white of the Polki diamonds creating a striking contrast against the warm yellow of the gold. The Hyderabadi Polish gives the gold a rich",
    "warm tone."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and other special occasions. Adds a touch of traditional Telugu elegance to any outfit. Ideal for Muhurtham",
    "Seemantham",
    "and half-saree functions. Also suitable for upscale social gatherings and festive celebrations."
  ],
  "description": "This Jhumka embodies timeless Telugu tradition, crafted with authentic Polki diamonds and meticulous attention to detail. The Hyderabadi Polish enhances the gold's natural luster, creating a piece that exudes luxury and sophistication. The use of uncut Polki diamonds ensures that each piece is unique, a testament to the wearer's individuality and refined taste. A true heirloom piece to be treasured for generations.",
  "tags": [
    "Jhumka",
    "Polki",
    "Diamond Earrings",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Traditional Earrings",
    "Karnaphul",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Gold Earrings",
    "Uncut Diamond",
    "Antique Jewelry",
    "Temple Jewelry",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_DPJK8-244_0329",
  "collection": "diamond"
}