{
  "id": "necklaces-680",
  "title": "Diamond Leaf Cascade Necklace - Laavanya Kasula Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold",
    "brilliant-cut diamonds. The gold features a subtle Hyderabadi polish for a rich",
    "warm tone. The diamonds are VS clarity and G color",
    "ensuring maximum brilliance and fire."
  ],
  "features": "This necklace features a delicate leaf cascade design, where each leaf motif is meticulously pave-set with dazzling diamonds. The cascading arrangement creates a graceful, flowing effect. The setting is designed to maximize light reflection, enhancing the diamonds' brilliance. A modern take on the traditional Kasula Haaram, the leaf motifs replace the conventional coin design, offering a refreshing yet elegant aesthetic.",
  "colors": [
    "Rose gold and brilliant white diamonds. This creates a warm and luxurious color combination that complements a wide range of skin tones and outfits."
  ],
  "occasions": [
    "Perfect for a modern bride",
    "engagement ceremonies",
    "or a sophisticated evening gala. Can also be worn for special family occasions and celebrations where you want to add a touch of understated elegance."
  ],
  "description": "A unique blend of traditional South Indian inspiration and contemporary design. The use of high-quality diamonds and expert craftsmanship ensures a piece that is both beautiful and durable. This necklace makes a statement without being ostentatious, perfect for the modern woman who appreciates timeless elegance. The 'Kasula Haaram' design carries the auspiciousness of Lakshmi, the Goddess of wealth and prosperity.",
  "tags": [
    "Diamond Necklace",
    "Rose Gold Necklace",
    "Kasula Haaram",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Hyderabad Jewelry",
    "Leaf Necklace",
    "Contemporary Jewelry",
    "Festive Jewelry",
    "Hyderabadi Polish",
    "Bridal Jewelry",
    "Engagement Necklace",
    "పతకం",
    "ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-47 3_1186",
  "collection": "diamond"
}