{
  "id": "waistbands-037",
  "title": "Diamond Vaddanam with Emerald Accents: A Regal Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "Crafted in 22K Gold and encrusted with brilliant-cut Diamonds and two pear-shaped Rubies totaling 4.52 carats. Features two emeralds totaling 6.01 carats",
    "enhancing the design. Finished with a smooth Hyderabadi polish for a lasting luster."
  ],
  "features": "This stunning Vaddanam showcases a traditional design with intricate floral and paisley motifs. The diamonds are meticulously pave-set to maximize brilliance. Emeralds add a regal touch to the design. It features a secure and adjustable clasp for comfortable wear. The design is reminiscent of classic temple jewelry, lending it an heirloom quality.",
  "colors": [
    "Predominantly white (diamonds) with vibrant green (emeralds) and the warm yellow of 22K gold. A timeless color palette that exudes sophistication."
  ],
  "occasions": [
    "Perfect for weddings (vivahaalu)",
    "bridal wear",
    "special occasions like Seemantham (baby shower)",
    "or half-saree functions (langa voni). Also suitable for grand receptions and cultural events where a statement piece is desired."
  ],
  "description": "This Vaddanam is a true testament to South Indian artistry. Its exquisite craftsmanship, combined with the brilliance of diamonds and the allure of emeralds, makes it a valuable heirloom piece. The classic design ensures it will remain a timeless treasure for generations. It's an investment in both beauty and cultural heritage, offering both security and traditional elegance.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Diamond Jewellery",
    "Emerald Jewelry",
    "22K Gold",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Ottiyanam",
    "ఒడ్డాణం",
    "Seemantham",
    "Muhurtham",
    "Langa Voni",
    "Vivaahaalu",
    "Traditional Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-11-18-03_2174",
  "collection": "sjpl"
}