{
  "id": "necklaces-1390",
  "title": "Diamond & Emerald Lakshmi Haaram with South Sea Pearls - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Diamonds (VVS Clarity",
    "Excellent Cut)",
    "Natural Emeralds (Superior Color & Clarity)",
    "South Sea Pearls. Crafted with a signature Hyderabadi Polish for enduring brilliance."
  ],
  "features": "This exquisite Lakshmi Haaram features a breathtaking array of meticulously set diamonds in a floral and paisley motif. Adorned with captivating emeralds in prong settings to highlight their natural beauty. The design incorporates traditional South Indian elements with a modern flair. Dazzling natural south sea pearls are gracefully suspended creating a stunning look. This haaram is handcrafted in our Hyderabad studio.",
  "colors": [
    "Predominantly gold with a shimmering white diamond sparkle",
    "punctuated by the vibrant green of the emeralds and the soft luster of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "bridal ceremonies (Pendli)",
    "or any special occasion demanding a touch of regal elegance. Also ideal for formal galas and red carpet events."
  ],
  "description": "This Lakshmi Haaram is a true investment piece that embodies timeless beauty and cultural significance. The combination of high-quality diamonds, genuine emeralds, and South Sea pearls ensures exceptional value and enduring appeal. Its meticulous craftsmanship and traditional design make it a treasured heirloom to be passed down through generations. The radiant Hyderabadi polish accentuates its brilliance and ensures a lasting shine.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Lakshmi Haaram",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Vaddanam",
    "Kasulaperu"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-06 2_2008",
  "collection": "sjpl"
}