{
  "id": "necklaces-739",
  "title": "Devasena Ruby & CZ Floral Kasu Mala - Exquisite Bridal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold plated Copper Alloy. Features high-quality Cubic Zirconia (CZ) stones in a brilliant cut and meticulously placed Ruby colored stones. Showcases a Hyderabadi Polish for a lasting shine."
  ],
  "features": "This captivating haaram boasts a unique floral design, interlocked with traditional Kasu (coin) motifs crafted with exquisite detailing and adorned with glistening CZ stones. The ruby colored stones set strategically add a regal touch. Features a secure clasp closure.",
  "colors": [
    "Primarily gold with a vibrant contrast from the red/ruby colored stones and sparkling white CZ stones."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "engagements",
    "receptions",
    "seemantham",
    "half-saree functions",
    "and other grand celebrations. Also suitable for upscale parties and formal events where you want to make a statement."
  ],
  "description": "This haaram combines timeless tradition with modern elegance. The meticulous craftsmanship and attention to detail make it a heirloom piece. The strategic placement of ruby colored stones against the gold and CZ stones gives it a royal, grand appearance. It's durable, comfortable to wear, and a stunning representation of South Indian heritage.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Bridal Necklace",
    "Ruby Necklace",
    "CZ Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Gold Plated",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Grand Necklace",
    "Devotional Jewelry",
    "Indian Bridal Jewelry",
    "Contemporary Indian Jewelry",
    "Kundan Inspired",
    "Nakshi Style"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-35 3_1245",
  "collection": "diamond"
}