{
  "id": "necklaces-367",
  "title": "Enchanting Emerald and Diamond Raasi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold",
    "meticulously embellished with brilliant-cut Diamonds (VVS clarity",
    "G color) and featuring two vibrant Emerald cabochons. Features the signature Hyderabadi Polish for an enduring shine."
  ],
  "features": "This contemporary Haaram showcases a delicate floral motif meticulously set with diamonds, creating a breathtaking symphony of light. The central pendant features an oval-cut Emerald cabochon surrounded by an intricate diamond setting, followed by a larger rounded pendant. The design expertly blends traditional floral elements with a modern, lightweight aesthetic, making it a versatile piece for any occasion.",
  "colors": [
    "Predominantly gold and white (diamond) with vibrant emerald green accents. The contrasting colors enhance the richness and elegance of the piece."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and special occasions like family functions or corporate events. Its modern design also makes it suitable for evening wear and formal gatherings."
  ],
  "description": "This Haaram is a statement piece that seamlessly blends tradition with modern elegance. Its lightweight design ensures comfortable wear, while the brilliant diamonds and vibrant emeralds add a touch of sophistication and timeless appeal. The Hyderabadi Polish guarantees lasting luster and durability. A perfect heirloom piece for generations to come.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Emerald cabochon",
    "Pendant Necklace",
    "Vaddanam",
    "Raasi",
    "Andhra Jewellery",
    "Telugu jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0481_0663",
  "collection": "diamond"
}