{
  "id": "bangles-117",
  "title": "Emerald Radiance Kangan - An Elegant Fusion of Tradition and Modernity",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Square Cut Emerald (approx. 2 Carat)",
    "High-Quality Cubic Zirconia. Features Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "This Kangan showcases a modern bangle design with a traditional twist. The center boasts a striking square-cut emerald, surrounded by a delicate floral filigree design accentuated with shimmering cubic zirconia. The bangle itself features a contemporary chevron pattern set with more CZs. The design incorporates elements reminiscent of Mughal and South Indian artistry, a testament to Hyderabad's rich jewelry heritage.",
  "colors": [
    "Predominantly yellow gold",
    "complemented by the vibrant green of the Emerald and the sparkling white of the cubic zirconia. The contrasting colors create a visually striking and opulent piece."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festive celebrations like Diwali or Sankranti",
    "and even upscale modern events. This Kangan elevates any outfit with its sophisticated design and timeless appeal. Excellent choice for Seemantham."
  ],
  "description": "This Kangan represents a harmonious blend of tradition and modern design, making it a versatile addition to any jewelry collection. The genuine emerald adds a touch of luxury and prestige, while the expert craftsmanship ensures durability and lasting beauty. The Hyderabadi polish provides a unique and enduring shine. A statement piece that is sure to garner compliments.",
  "tags": [
    "Kangan",
    "Bracelet",
    "Emerald",
    "Cubic Zirconia",
    "Gold Jewelry",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Bangle",
    "Pachai Kal Bangaru Gaju"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0269_0468",
  "collection": "diamond"
}