{
  "id": "bangles-184",
  "title": "Celestial Sparkle: Diamond Kada Bangles - మెరిసే వజ్రాల కడా గాజులు",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold with Hyderabadi Polish. Adorned with brilliant-cut Diamonds of VS clarity and G color",
    "totaling 6.88 carats. The gold weight is approximately 40 grams."
  ],
  "features": "These exquisite kada bangles showcase a contemporary design with three rows of meticulously prong-set diamonds. The symmetrical arrangement enhances the sparkle and creates a luxurious feel. The inner edges are smoothly finished for comfortable wear. Classic zig-zag row arrangement for maximal light refraction.",
  "colors": [
    "Warm yellow gold complements the dazzling white diamonds",
    "creating a timeless and elegant aesthetic."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "anniversaries",
    "or any special occasion where you want to add a touch of glamour. Suitable for both traditional South Indian attire and modern ensembles. Ideal for bridal wear during Muhurtham and other wedding ceremonies."
  ],
  "description": "These diamond kada bangles are a timeless investment. The combination of high-quality gold and brilliant-cut diamonds ensures lasting beauty and value. The Hyderabadi polish enhances the gold's luster, while the intricate diamond setting showcases exceptional craftsmanship. A classic design updated with modern flair. Symbol of prosperity and auspiciousness.",
  "tags": [
    "Diamond Bangles",
    "Kada",
    "Vaira Gajulu",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "22K Gold",
    "Bridal Jewelry",
    "വജ്ര വളകള്",
    "వజ్రాల గాజులు",
    "మెరిసే ఆభరణాలు",
    "Authentic Gold",
    "Vaira Kada",
    "Modern Bangles",
    "Traditional Bangles"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0101_0717",
  "collection": "diamond"
}