{
  "id": "earrings-634",
  "title": "Enchanting Emerald & Polki Diamond Jhumkaalu - Divine Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated",
    "Polki Diamonds (Uncut Diamonds)",
    "Emerald",
    "Simulated Pearl. Crafted with high-quality materials and Hyderabadi Polish for a long-lasting luster."
  ],
  "features": "Classic South Indian Jhumka design featuring intricate Polki diamond detailing. The crescent shape connects to a bell-shaped Jhumka bottom, adorned with a pearl drop. The top of the Jhumka features a floral design and a bezel-set Emerald as the central stone. Features an antique finish that highlights the detailed craftsmanship.",
  "colors": [
    "Gold (yellow)",
    "White (diamonds)",
    "Green (emerald)",
    "Pearl White (pearl). A traditional South Indian color palette symbolizing prosperity and auspiciousness."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischithartham)",
    "festive occasions like Diwali and Sankranthi",
    "Seemantham",
    "and even adds a touch of traditional elegance to modern celebrations."
  ],
  "description": "Exquisite craftsmanship combined with traditional South Indian design makes this Jhumka a timeless treasure. The combination of Polki diamonds, emeralds, and simulated pearl exudes luxury and sophistication. A perfect heirloom piece to be passed down through generations. These stunning earrings are also incredibly versatile, transitioning easily from traditional South Indian attire (like a Kanjeevaram saree) to more modern Indo-western outfits. ",
  "tags": [
    "Jhumka",
    "Jhumkaalu",
    "Earrings",
    "Polki Diamonds",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Gold Plated",
    "Hyderabad Jewelry",
    "Temple Jewelry",
    "Ethnic Jewelry",
    "Nischithartham",
    "Vivahaalu",
    "Seemantham",
    "Pearl",
    "Hyderabadi Polish"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 18_2211",
  "collection": "sjpl"
}