{
  "id": "earrings-171",
  "title": "Raani Kundan Polki Jhumka: The Blossom Drop",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Rose Quartz",
    "Emeralds",
    "Freshwater Pearls. Features Hyderabadi Polishing for lasting shine."
  ],
  "features": "Classic Jhumka silhouette adorned with a floral Polki diamond cluster stud. Delicate drops feature Rose Quartz and Emerald beads interspersed with clusters of freshwater pearls, offering a modern twist on traditional design. The Polki setting is handcrafted with intricate detailing, showcasing exceptional Indian craftsmanship.",
  "colors": [
    "Gold",
    "White (Polki diamonds)",
    "Soft Pink (Rose Quartz)",
    "Verdant Green (Emeralds)",
    "Cream (Freshwater Pearls). The combination evokes a sense of delicate femininity and regal charm."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "Sangeet ceremonies",
    "and festive occasions. Also suitable for a modern twist to half-saree functions or cultural celebrations. Perfect for adding a touch of classic elegance to any formal attire."
  ],
  "description": "A stunning fusion of tradition and contemporary style. The uncut Polki diamonds exude a timeless aura, while the Rose Quartz and Emeralds add a touch of refreshing modernity. Handcrafted by skilled artisans in Hyderabad, this Jhumka is a testament to exquisite Indian jewelry making. Durable and captivating, it's a heirloom piece to be treasured for generations.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Polki",
    "Kundan",
    "Diamond",
    "Rose Quartz",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Sangeet",
    "Half Saree",
    "Rani Haaram"
  ],
  "original_id": "diamond_jewellery_DPER8-916_0313",
  "collection": "diamond"
}