{
  "id": "necklaces-1550",
  "title": "Exquisite Navratna and Rice Pearl Floral Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18 Karat Gold (18 KT)",
    "this Haaram features genuine Navratna gemstones (30 stones totaling 20.26 carats)",
    "brilliant-cut diamonds (5 stones totaling 0.25 carats)",
    "and lustrous rice pearls (62 pearls totaling 60.63 carats). Finished with a signature Hyderabadi Polish for enhanced brilliance and lasting shine."
  ],
  "features": "This stunning haaram showcases a contemporary floral design, meticulously handcrafted to highlight the vibrant colors of the Navratna gemstones. The rice pearls are artfully arranged to create delicate floral accents, while the diamonds add a touch of modern sparkle. The design balances tradition with contemporary aesthetics, making it a truly unique piece.",
  "colors": [
    "The color palette is a rich blend of traditional Navratna hues",
    "including ruby red",
    "emerald green",
    "sapphire blue",
    "and pearl white",
    "complemented by the warm glow of 18K gold and the sparkle of brilliant-cut diamonds. The combination of colors creates a vibrant and auspicious appearance."
  ],
  "occasions": [
    "Perfect for both traditional occasions like weddings (Vivaaham)",
    "engagements (Nischithartham)",
    "and festivals",
    "as well as contemporary events and celebrations. This Haaram will add a touch of regal elegance to any ensemble."
  ],
  "description": "This Navratna Haaram is not just a piece of jewelry; it's an investment in tradition and artistry. The Navratnas hold significant cultural value and are believed to bring good fortune. The exquisite craftsmanship and attention to detail make this a truly heirloom-worthy piece that will be cherished for generations. The blend of traditional and contemporary design ensures it remains a timeless classic.",
  "tags": [
    "Haaram",
    "Necklace",
    "Navratna",
    "Nine Gems",
    "Rice Pearls",
    "South Indian Jewelry",
    "Indian Jewelry",
    "18K Gold",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Vivaaham",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Contemporary Design",
    "Floral Design",
    "Pearls",
    "Diamond",
    "Ashta Ratna",
    "రత్నాలు",
    "ముత్యాలు",
    "బంగారు ఆభరణాలు"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-30 2_2229",
  "collection": "sjpl"
}