{
  "id": "waistbands-035",
  "title": "Diamond and Gemstone Vaddanam - The 'Indra' Collection",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "Crafted with 13.70 carats of dazzling diamonds",
    "set in high-purity gold. Features a central arrangement of captivating emeralds totaling 7.07 carats and a delicate line of pink carved gemstones totaling 40.55 carats with a single ruby of 1.90 carats. Boasts a radiant Hyderabadi Polish."
  ],
  "features": "This stunning Vaddanam features a detailed, floral-inspired design meticulously crafted with a brilliant pave setting to maximize diamond sparkle. The central focal point incorporates a classic flower motif with emeralds, reminiscent of traditional temple jewelry (గుడి ఆభరణాలు). The cascading pink carvings add a touch of modern elegance. Features a secure and adjustable clasp for comfortable wear.",
  "colors": [
    "Primarily shimmering white (diamonds)",
    "with vibrant green (emeralds) and delicate pink (carved gemstones) accents",
    "all set against the warm glow of gold."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (పెళ్లి)",
    "receptions",
    "Seemantham (శీమంతం)",
    "and special cultural events. Also suitable for adding a touch of regal elegance to modern Indian attire for upscale parties or celebrations."
  ],
  "description": "A true heirloom piece, this Vaddanam represents a harmonious blend of traditional South Indian artistry and contemporary design. The exquisite craftsmanship and high-quality materials ensure both lasting beauty and value. A statement piece that embodies prosperity, beauty, and cultural heritage.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Indian Jewelry",
    "Diamond Jewelry",
    "Emeralds",
    "Ruby",
    "Pink Carvings",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "గుడి ఆభరణాలు",
    "ఒడ్డాణం",
    "పెళ్లి",
    "Hyderabadi Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-11-18-02_2171",
  "collection": "sjpl"
}