{
  "id": "earrings-047",
  "title": "Mayuri Chandbali Jhumka: Exquisite Peacock Earrings with Coral Accents",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish for lasting luster. Adorned with high-quality Cubic Zirconia (CZ) stones for brilliant sparkle",
    "Genuine Coral beads (Pagadam) with a vibrant orange-red hue and a genuine Ruby in each piece."
  ],
  "features": "Inspired by traditional South Indian designs, these Chandbali Jhumka earrings feature a gracefully crafted peacock (Mayuri) motif encrusted with CZ stones. The earrings display a delicate filigree style that shows modern refinement. The dangling Coral beads add a touch of elegance and tradition. These earrings use a screw mechanism for secure wear.",
  "colors": [
    "Predominantly gold with white Cubic Zirconia. The Coral beads introduce a warm orange-red",
    "creating a striking contrast. A small ruby adding a small touch of dark red."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals",
    "and special occasions like Seemantham or half-saree functions. Their modern yet traditional design also makes them suitable for contemporary parties and events."
  ],
  "description": "These earrings showcase the perfect fusion of tradition and contemporary style. The peacock motif symbolizes beauty and grace, and the coral beads bring prosperity. Crafted by skilled artisans using time-honored techniques, these earrings are durable, comfortable to wear, and a timeless addition to any jewelry collection. The Hyderabadi polish ensures a long-lasting shine, making them a treasured heirloom.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Mayuri",
    "Peacock",
    "Coral",
    "Pagadam",
    "CZ",
    "Cubic Zirconia",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "చెవి దుద్దులు",
    "జుంకా",
    "పెళ్లి నగల"
  ],
  "original_id": "diamond_jewellery_5b4ab18a-335e-4d3d-8565-e25d73c026ca_0128",
  "collection": "diamond"
}