{
  "id": "bangles-216",
  "title": "Emerald & Diamond Kangan Bangle - Pachala Rallu Vaira Kada",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Faceted Oval Emeralds",
    "VS Clarity Diamonds. Crafted with authentic Hyderabadi Kundan setting techniques."
  ],
  "features": "This stunning bangle features a classic open-work design. Rich emeralds are bezel set and separated by diamond clusters, creating a striking visual contrast. The intricate kundan setting around each diamond adds a touch of royal charm. This style is reminiscent of the Nizam era, blending traditional craftsmanship with contemporary flair. It features detailed filigree work around the edges, enhancing its antique appeal.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "and Brilliant White (Diamonds)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "anniversaries",
    "and festive occasions like Sankranti and Ugadi. Also suited for elegant evening wear or special cultural events."
  ],
  "description": "A timeless piece that showcases the best of Hyderabadi jewelry craftsmanship. The combination of rich gold, vibrant emeralds, and sparkling diamonds creates a luxurious and eye-catching effect. Its design balances traditional aesthetics with modern sensibilities, making it a versatile addition to any jewelry collection. A symbol of prosperity and good fortune, this bangle is a treasured heirloom to be passed down through generations. Durability is ensured by using high-quality materials and expert craftsmanship.",
  "tags": [
    "Bangle",
    "Kada",
    "Emerald",
    "Diamond",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Kundan",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Pachala Rallu",
    "Vairaalu",
    "Kangan",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Nizam Jewelry",
    "Fine Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0135_0751",
  "collection": "diamond"
}