{
  "id": "necklaces-065",
  "title": "Enchanting Emerald & Polki Diamond Haaram: A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Emeralds (Zambian origin",
    "oval cut)",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Haaram features three layers of meticulously crafted design. Each layer showcases alternating Emeralds and Polki diamonds, set in a closed setting known as 'Kundhan' to enhance the brilliance of the diamonds. The Polki diamonds are skillfully arranged in a floral motif, radiating outward from the centre. The 'Hyderabadi Polish' gives the gold a unique luster, enhancing the antique feel of the piece. Intricate detailing is evident throughout the piece, emphasizing the craftsmanship of our skilled artisans.",
  "colors": [
    "Gold (warm yellow)",
    "Emerald (vibrant green)",
    "Diamond (translucent white)"
  ],
  "occasions": [
    "Perfect for bridal wear (Muhurtham)",
    "weddings",
    "traditional ceremonies (Seemantham",
    "Half-Saree function)",
    "and grand celebrations. This statement piece will elevate any festive ensemble."
  ],
  "description": "This Haaram is a fusion of tradition and elegance. The Polki diamonds exude a regal charm while the Zambian Emeralds add a touch of vibrant color and value. The Hyderabadi Polish gives the piece a rich, antique look, making it a timeless heirloom. Invest in a piece that embodies cultural heritage and artistic excellence. Each Polki diamond is unique, ensuring that this Haaram is a one-of-a-kind masterpiece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamond",
    "Emerald",
    "Kundhan",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Muhurtham",
    "Vaddanam",
    "Kasulaperu",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_a7cb9cb5-a641-4484-88a5-34ba3f7b6b18_0177",
  "collection": "diamond"
}