{
  "id": "necklaces-1178",
  "title": "The 'Chandrika' Diamond and Emerald Bridal Haaram: A Legacy of Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (G.wt: 184.580 gms)",
    "4681 brilliant-cut Diamonds (D.wt: 20.32 carats)",
    "One Ruby (8.16 carats)",
    "Seven Emeralds (Eme: 6.92 carats)",
    "44 South Sea Pearls (Moti: 120.85 carats). Features a lustrous Hyderabadi polish."
  ],
  "features": "This majestic Haaram boasts intricate filigree work, characteristic of South Indian bridal jewelry. The central pendant features a stunning Emerald centerpiece surrounded by elaborate diamond-studded motifs. Smaller emeralds are dispersed to add to the grandeur of the Haaram. Delicate South Sea pearls dangle gracefully, enhancing the necklace's regal appeal. The design incorporates traditional Telugu craftsmanship with modern diamond setting techniques for enhanced sparkle.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "complemented by the vibrant green of the emeralds and the creamy luster of the pearls. The color palette evokes the classic elegance of South Indian bridal wear."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "Seemantham ceremonies",
    "and other grand celebrations. Its timeless design also lends itself well to upscale modern events and formal gatherings."
  ],
  "description": "This Haaram is a true masterpiece, embodying the rich cultural heritage of Hyderabad and South India. The exceptional quality of the diamonds, emeralds, and pearls ensures lasting beauty and value. The piece is expertly handcrafted and designed to become a treasured heirloom, passed down through generations. A perfect blend of tradition and luxury, guaranteed to make a statement.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "Moti Mala",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Heirloom Jewelry",
    "Indian Jewellery",
    "22K Gold",
    "Fine Jewellery",
    "Traditional Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-01_1730",
  "collection": "sjpl"
}