{
  "id": "necklaces-089",
  "title": "Emerald and Ruby Vanki Pendant with South Sea Pearl - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (approx.)",
    "Natural Emerald (untreated)",
    "Natural Ruby (untreated)",
    "South Sea Pearl",
    "Natural Diamonds (GH Color",
    "VS Clarity). Features the signature Hyderabadi Polish for an enhanced luster and durability."
  ],
  "features": "This exquisite pendant draws inspiration from the traditional Vanki design, a symbol of auspiciousness. It features a central, emerald-cut natural emerald, complemented by a vibrant ruby at the top. Both gemstones are surrounded by multiple rows of sparkling natural diamonds in a pave setting, enhancing their brilliance. A lustrous South Sea pearl dangles gracefully at the bottom, adding a touch of elegance. The meticulous craftsmanship reflects the legacy of Hyderabadi jewelry making.",
  "colors": [
    "Emerald Green",
    "Ruby Red",
    "Diamond White",
    "Golden Yellow (from the gold setting)",
    "Creamy White (from the pearl)"
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagements",
    "Seemantham ceremonies",
    "traditional Telugu celebrations",
    "and special occasions where you want to make a statement. Also suitable for elegant evening wear and modern celebrations."
  ],
  "description": "This Vanki pendant is more than just jewelry; it's a statement piece steeped in South Indian tradition and cultural significance. The use of high-quality natural gemstones, the intricate diamond setting, and the exquisite South Sea pearl make it a true heirloom. The Hyderabadi polish ensures long-lasting brilliance. Own a piece of heritage that blends timeless elegance with contemporary style.",
  "tags": [
    "Vanki",
    "Pendant",
    "Emerald",
    "Ruby",
    "South Sea Pearl",
    "Diamond Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Muhurtham Jewelry",
    "Telugu Jewelry",
    "Seemantham",
    "Heirloom Jewelry",
    "Fine Jewelry",
    "Antique Style",
    "ఆభరణాలు",
    "రత్నాలు",
    "ముత్యాలు"
  ],
  "original_id": "diamond_jewellery_DPER8-1764_0299",
  "collection": "diamond"
}