{
  "id": "necklaces-995",
  "title": "Divine Blossom Diamond Haaram Set with Jhumkas - Adorable Adornment",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "18K Yellow Gold setting",
    "High-quality Faceted Diamonds (VVS Clarity",
    "G Color)",
    "Ruby",
    "Emerald",
    "Freshwater Pearls",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite set features a floral-inspired design, where each petal and curve is delicately adorned with shimmering diamonds. The necklace culminates in a statement pendant, featuring a central pear-shaped Emerald, crowned with a Ruby and framed by intricate diamond settings. Dainty pearls dangle from the pendant and jhumkas, adding a touch of traditional elegance. The matching Jhumkas boast the classic bell shape, also studded with diamonds and a Ruby, and finished with pearl droplets.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Red (Ruby)",
    "Green (Emerald)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "receptions",
    "engagements",
    "bridal showers",
    "festivals like Diwali and Sankranti",
    "and other special occasions. Also suitable for milestone celebrations like seemantham and half-saree function (Langa Voni). Its modern design makes it appropriate for upscale parties and formal events as well."
  ],
  "description": "This haaram set is a true masterpiece, showcasing the pinnacle of Hyderabadi craftsmanship. The combination of sparkling diamonds, vibrant gemstones, and lustrous pearls exudes timeless elegance and unparalleled luxury. It’s a valuable investment, a family heirloom, and a symbol of grace and prosperity.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Pearl Jewelry",
    "Emerald Pendant",
    "Ruby Accents",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Vivaaha",
    "Seemantham",
    "Langa Voni",
    "Festive Jewelry",
    "Statement Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0452_2316",
  "collection": "necklace"
}