{
  "id": "necklaces-847",
  "title": "Vaibhavi Diamond Haaram Set with Emerald Accents and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K White Gold with High-Quality Cubic Zirconia",
    "Emerald Accents",
    "and South Sea Pearls. Meticulously handcrafted with Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite Haaram features an intricate floral design meticulously set with dazzling Cubic Zirconia. Emerald accents punctuate the neckline, adding a touch of regal elegance. Delicate South Sea pearl drops grace the bottom, enhancing its traditional charm. The accompanying Jhumka earrings echo the Haaram's design, creating a perfectly balanced set. The craftsmanship showcases delicate filigree work.",
  "colors": [
    "Primarily white (Cubic Zirconia) and gold (18k White Gold)",
    "with vibrant green (Emeralds) and creamy white (Pearls)."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "Sangeet ceremonies",
    "and other special occasions. Ideal for brides seeking a blend of tradition and modern elegance or for attending a Seemantham (baby shower) or half-saree function with grace and sophistication."
  ],
  "description": "This Diamond Haaram set embodies timeless South Indian elegance. The intricate craftsmanship, combined with the sparkle of Cubic Zirconia and the richness of Emeralds, makes it a statement piece. Its versatility allows it to be worn with both traditional and contemporary attire. The set's durability ensures it will be treasured for generations. The use of high-quality materials and meticulous craftsmanship ensures lasting beauty and value.",
  "tags": [
    "Diamond Haaram",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Cubic Zirconia",
    "Emerald Necklace",
    "Pearl Jewelry",
    "Jhumka Earrings",
    "Hyderabad Jewelry",
    "Telugu Wedding",
    "Tradition Jewelry",
    "Contemporary Jewelry",
    "Seemantham",
    "Half-Saree Function",
    "Vaibhavi"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0379_1534",
  "collection": "haaram"
}