{
  "id": "earrings-108",
  "title": "Navratna Kundanalu: Timeless Gemstone Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Navratna Gemstones (Ruby",
    "Diamond",
    "Pearl",
    "Red Coral",
    "Emerald",
    "Yellow Sapphire",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "White Diamonds. The gold is meticulously crafted to ensure a lasting shine and showcases the brilliance of the gemstones."
  ],
  "features": "These Kundanalu (earrings) feature a traditional floral design embellished with Navratna gemstones in a symmetrical arrangement. The gold filigree work is a modern adaptation of traditional craftsmanship, accented with dazzling white diamonds for a contemporary sparkle. The setting highlights each gemstone's unique color and brilliance. A secure and comfortable screw-back ensures a perfect fit.",
  "colors": [
    "Primary colors from the Navratna gemstones (red",
    "white",
    "green",
    "yellow",
    "blue",
    "orange)",
    "complemented by the warm hue of 22K gold and the brilliant white of the diamonds."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (Vivaaham)",
    "engagements (Nischayathartham)",
    "festivals (Sankranti",
    "Diwali)",
    "or any festive gathering. The Navratna design also makes it auspicious for religious ceremonies and housewarmings (Gruhapravesam). Modern styling makes it suitable for upscale parties and celebrations."
  ],
  "description": "These Kundanalu blend the auspiciousness of Navratna gemstones with contemporary design sensibilities. Each gemstone represents a planet and is believed to bring good fortune and well-being to the wearer. The Hyderabadi polish provides a unique luster and durability to the gold. The intricate filigree work showcases exquisite craftsmanship and ensures this pair stands out. A perfect heirloom piece to pass down through generations.",
  "tags": [
    "Earrings",
    "Kundanalu",
    "Navratna",
    "Gemstone Jewelry",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Nischayathartham",
    "Gruhapravesam",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Indian Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "22K Gold",
    "Fine Jewelry",
    "Contemporary Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_d66484b4-3d67-4dbc-a856-4c70b959c91c_0210",
  "collection": "diamond"
}