{
  "id": "necklaces-763",
  "title": "Enthralling Emerald and Diamond Bridal Kanthabharanam Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Base",
    "Fine-Cut Diamonds (VS Clarity)",
    "Natural Emeralds (Oval and Pear-shaped)",
    "South Sea Pearls. Features Hyderabadi Polish for a lasting shine."
  ],
  "features": "Intricate floral and paisley design inspired by traditional South Indian motifs. The necklace showcases delicate diamond lattice work, complemented by carefully placed emeralds and pearl drops. The central pendant is a showstopper with a large, pear-shaped emerald surrounded by smaller diamonds and emerald accents. Features a secure and adjustable clasp for a comfortable fit.",
  "colors": [
    "Gold",
    "Dazzling White (Diamonds)",
    "Deep Green (Emeralds)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "bridal showers",
    "and significant festive occasions like Deepavali and Dasara. A stunning statement piece for half-saree functions and other grand celebrations."
  ],
  "description": "This Kanthabharanam necklace is a testament to exquisite craftsmanship and timeless elegance. The combination of diamonds and emeralds symbolizes prosperity and new beginnings, making it an ideal bridal piece. Handcrafted by skilled artisans in Hyderabad, this necklace showcases the region's rich jewelry heritage. The Hyderabadi polish ensures long-lasting luster and durability. A true heirloom piece to be cherished for generations.",
  "tags": [
    "Kanthabharanam",
    "Necklace",
    "Choker",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Jewellery",
    "Haram",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Emeralds",
    "Diamonds",
    "22K Gold",
    "Pearls",
    "Telugu Jewellery",
    "Bridal Set",
    "Seemantham"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-05 4_1269",
  "collection": "diamond"
}