{
  "id": "necklaces-1135",
  "title": "Polki Diamond and Ruby Statement Necklace - Amara Kanthabharanam",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Swarna)",
    "Uncut Polki Diamonds (Heera)",
    "Faceted Rubies (Padmaraga). Features a rich Hyderabadi polish for a lasting luster."
  ],
  "features": "This breathtaking necklace showcases the timeless allure of Polki diamonds paired with vibrant rubies. The geometric design features triangle-cut Polki diamonds set within intricate gold frames, interspersed with clusters of ruby flower motifs. The dangling ruby pendants add a touch of playful elegance. The traditional setting is meticulously handcrafted by skilled artisans, ensuring enduring beauty and quality.",
  "colors": [
    "Golden",
    "White (Polki Diamonds)",
    "and Deep Red (Rubies). This classic color combination is considered highly auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "engagement ceremonies",
    "and other grand celebrations. A statement piece for muhurtham",
    "and any occasion where you want to exude timeless elegance and cultural pride."
  ],
  "description": "This necklace is a true investment piece, embodying the rich heritage of South Indian jewelry. The use of high-quality Polki diamonds and vibrant rubies ensures exceptional brilliance and lasting value. Its unique design seamlessly blends traditional craftsmanship with contemporary aesthetics, making it a versatile addition to any jewelry collection. The Hyderabadi polish further enhances the gold's luster, ensuring a regal and radiant appearance. It's a perfect heirloom piece to pass down through generations, carrying with it the stories and traditions of your family.",
  "tags": [
    "Polki Necklace",
    "Diamond Necklace",
    "Ruby Necklace",
    "Kanthabharanam",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Heera",
    "Padmaraga",
    "Hyderabadi Jewelry",
    "Statement Necklace",
    "Indian Jewelry",
    "Ethnic Jewelry",
    "Fine Jewelry",
    "Swarna",
    "Vivaham"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0035_2551",
  "collection": "radhe"
}