{
  "id": "necklaces-1555",
  "title": "Manoharam Sapphire and Diamond Nakshi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold",
    "Natural Sapphires (various hues including Pink",
    "Yellow",
    "Blue",
    "and Grey)",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color). Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "A stunning contemporary Haaram with a delicate floral and foliage design. Features intricate openwork with diamond-studded branches and flower blossoms set with a vibrant mix of multi-colored Sapphires in a bezel and pave setting. The piece blends traditional Indian motifs with a modern, lightweight design. The layout presents a very appealing symmetrical arrangement. Nakshi work is alluded to as well, though the modern design is paramount.",
  "colors": [
    "Primarily White Gold with flashes of diamond sparkle",
    "accented by a rainbow of Sapphire colors - Pink",
    "Yellow",
    "Blue",
    "Grey",
    "creating a vibrant and sophisticated palette."
  ],
  "occasions": [
    "Perfect for a modern bride or for special occasions like engagement parties",
    "wedding receptions",
    "sangeet",
    "cocktail parties",
    "or any event where a statement piece is desired. Can be worn with both traditional South Indian attire and contemporary gowns."
  ],
  "description": "A unique blend of tradition and modernity, this Haaram showcases exceptional craftsmanship and high-quality gemstones. The vibrant Sapphire colors and dazzling diamonds will undoubtedly make you the center of attention. Its lightweight design ensures comfortable wear, making it perfect for extended celebrations. This is a statement piece that will be treasured for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Sapphire Necklace",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Contemporary Jewelry",
    "Floral Jewelry",
    "Nakshi Work",
    "Hyderabadi Jewelry",
    "கல்யாண நகை (Kalyana Nagai)",
    "நகைகள் (Nagaigal)",
    "ஆரம் (Aaram)"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-32 2_2234",
  "collection": "sjpl"
}