{
  "id": "waistbands-027",
  "title": "Diamond Vaddanam with Emerald Centerpiece and Pearl Drops - The 'Lakshmi Kamarband'",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold (approximate)",
    "brilliant-cut Diamonds (VS clarity",
    "G-H color)",
    "Oval-Cut Emerald",
    "South Sea Pearls. Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "Intricate filigree diamond work in a floral pattern. The central piece features a striking oval-cut emerald, adding a regal touch. Delicate South Sea pearl drops adorn the lower edge, enhancing its feminine appeal. Designed with flexible links for a comfortable fit. Handcrafted by skilled artisans from Hyderabad, reflecting generations of expertise.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Emerald Green",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Ideal for weddings (especially Telugu Kalyanam)",
    "Seemantham (baby shower)",
    "and other auspicious occasions. A statement piece for the modern bride who appreciates traditional elegance with a contemporary twist. Perfect for half-saree functions or grand celebrations."
  ],
  "description": "A masterpiece of Hyderabadi craftsmanship, this Vaddanam combines the timeless beauty of diamonds and pearls with a pop of vibrant emerald green. Its flexible design ensures a comfortable and secure fit. The Hyderabadi polish guarantees lasting brilliance and protection against tarnish. Owning this piece means possessing a treasure with both cultural and heirloom value.",
  "tags": [
    "Vaddanam",
    "Oddanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Kamarband",
    "22K Gold",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Nakshi Work",
    "Fine Jewelry",
    "Bridal",
    "Seemantham",
    "Kalyanam",
    "ఒడ్డాణం",
    "బంగారు నగల"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-57-20 2_2161",
  "collection": "sjpl"
}