{
  "id": "necklaces-241",
  "title": "Manohari Kanti Haaram: Exquisite Diamond & Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Rubies",
    "Natural Emeralds. Features Hyderabadi Polish for a lustrous finish."
  ],
  "features": "This delicate Kanti Haaram showcases a floral-inspired design, adorned with sparkling brilliant-cut diamonds. A central teardrop pendant features a vibrant emerald center, surrounded by a ring of meticulously set rubies. The pendant is finished with dainty gold ghungroo-style drops for a touch of traditional flair. The necklace chain consists of interconnected flower-shaped gold elements, each studded with diamonds. The intricate setting highlights the gemstones, creating a captivating play of light.",
  "colors": [
    "Primary: Gold; Gemstones: Red (Rubies)",
    "Green (Emeralds)",
    "White (Diamonds). A classic South Indian color palette known for its auspiciousness."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagements",
    "festive occasions like Diwali and Sankranthi",
    "or a half-saree function. Its delicate design also makes it suitable for elegant evening wear."
  ],
  "description": "A stunning blend of tradition and modern elegance. This Haaram represents the pinnacle of Hyderabadi craftsmanship. The use of high-quality diamonds and natural gemstones ensures enduring beauty and value. Its intricate design and vibrant color combination make it a true statement piece, embodying the rich cultural heritage of South India.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Kanti",
    "Chandrani",
    "Gold Jewelry",
    "22K Gold",
    "Bridal Jewelry",
    "Nakshi Work",
    "Gemstone Jewelry",
    "Indian Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0321_0518",
  "collection": "diamond"
}