{
  "id": "bangles-120",
  "title": "Emerald Blossom Vanki - The Timeless Armlet of Elegance",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Gold (Swarna)",
    "Faceted Emerald (Pachcha)",
    "Brilliant Cut Diamonds (Heera). Features a Hyderabadi polish for a lasting luster."
  ],
  "features": "This Vanki showcases a contemporary floral design with traditional South Indian influences. A vibrant, square-cut emerald is the centerpiece, surrounded by a halo of sparkling diamonds. The openwork design features intricate, filigree-inspired detailing enhanced by delicate diamond accents. The intricate detailing is reminiscent of traditional 'kundan' jewelry without the use of enamel, creating a lighter and more modern feel.",
  "colors": [
    "Predominantly gold (yellow) with the vibrant green of the Emerald and the brilliant white of the Diamonds."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Vivaha)",
    "engagements (Nischitartham)",
    "and festive celebrations (Panduga). Its modern design also makes it suitable for formal gatherings and upscale events."
  ],
  "description": "This Vanki is a fusion of traditional South Indian artistry and contemporary design. The high-quality emerald and diamonds, combined with the meticulous craftsmanship and Hyderabadi polish, make it a valuable heirloom piece. The openwork design ensures comfortable wear while showcasing the exquisite details of the jewelry. It's a statement piece that speaks volumes about your discerning taste and appreciation for timeless elegance.",
  "tags": [
    "Vanki",
    "Armlet",
    "Emerald",
    "Pachcha",
    "Diamond",
    "Heera",
    "22K Gold",
    "Swarna",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Nischitartham",
    "Kundan Inspired",
    "Filigree",
    "Statement Bracelet",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0272_0471",
  "collection": "diamond"
}