{
  "id": "necklaces-262",
  "title": "Manikyam Pachala Kasu Mala - Diamond and Gemstone Long Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Finest Quality Diamonds (VVS Clarity",
    "G Color)",
    "Natural Rubies (Manikyam)",
    "Natural Emeralds (Pachala). Expertly crafted with Hyderabadi polish for lasting brilliance."
  ],
  "features": "This exquisite Kasu Mala showcases the timeless beauty of traditional South Indian design. The necklace features a repeating pattern of meticulously crafted 'Kasu' coins interspersed with floral motifs. The central pendant boasts intricate filigree work (jali) and a captivating arrangement of rubies and emeralds. The stones are set in a closed setting to preserve their natural brilliance and enhance their color. The mango shaped motifs adds the finishing touch.",
  "colors": [
    "Predominantly gold with vibrant accents of red (rubies) and green (emeralds)",
    "complemented by the dazzling white sparkle of the diamonds. The combination of red and green stones in gold setting is considered highly auspicious."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "bridal wear",
    "traditional ceremonies (poojas)",
    "Seemantham",
    "Half-Saree function (Langa Voni Function)",
    "and grand celebrations. This necklace adds a touch of regal elegance to any occasion."
  ],
  "description": "This Kasu Mala is a true investment piece, representing the rich heritage of South Indian jewelry. The use of high-quality materials and expert craftsmanship ensures its lasting beauty and durability. The design seamlessly blends traditional motifs with a touch of modern elegance, making it a versatile piece that can be cherished for generations.",
  "tags": [
    "Kasu Mala",
    "కాసుల పేరు",
    "Long Necklace",
    "Gold Necklace",
    "Diamond Necklace",
    "Ruby",
    "Emerald",
    "Manikyam",
    "Pachala",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Indian Jewelry",
    "filigree"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0342_0539",
  "collection": "diamond"
}