{
  "id": "necklaces-1510",
  "title": "Apsara Diamond Haaram with Emerald Accents - COHAR00030",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Rose Gold",
    "adorned with brilliant-cut diamonds. Features three captivating Emeralds with a notable green hue and good clarity. The diamonds are meticulously set in a prong setting. Finished with our signature Hyderabadi Polish for enduring luster."
  ],
  "features": "This exquisite Haaram showcases a delicate peacock (Mayura) motif design interspersed with floral patterns, all intricately studded with diamonds. The central emeralds add a striking focal point. The design is reminiscent of traditional South Indian temple jewelry, offering a modern twist with a lighter, more wearable feel.",
  "colors": [
    "Rose Gold",
    "brilliant White Diamonds",
    "and deep Green Emeralds create a harmonious and luxurious color palette."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "receptions",
    "engagements (నిశ్చితార్థం)",
    "and other grand celebrations. Equally suitable for modern formal events seeking a touch of South Indian elegance. Ideal for Muhurtham and Seemantham ceremonies."
  ],
  "description": "This Apsara Diamond Haaram seamlessly blends traditional South Indian design with modern sensibilities. The intricate peacock detailing, coupled with the vibrant emeralds, makes it a truly unique and eye-catching piece. The impeccable craftsmanship and high-quality materials ensure lasting beauty and value, making it a cherished heirloom (వారసత్వ సంపద). Its timeless elegance makes it a statement piece for any occasion.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emerald",
    "Peacock Motif",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Hyderabadi Jewelry",
    "18K Gold",
    "Kanthabharanam",
    "Mayura",
    "Vivaham",
    "Nishtitartham",
    "Seemantham"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-38 2_2128",
  "collection": "sjpl"
}