{
  "id": "necklaces-728",
  "title": "Divine Emerald and Diamond Haaram: A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold (916 Hallmark) with meticulous Hyderabadi Polish for lasting luster. Adorned with sparkling CZ diamonds and vibrant Emerald gemstones (unspecified cut",
    "clarity assessed as VS). Base metal is alloy",
    "so it is fashion jewelry."
  ],
  "features": "This exquisite Haaram features a layered design incorporating traditional mango (Paisley) motifs and floral elements. The central pendant showcases intricate detailing with clustered emeralds, surrounded by a halo of shimmering CZ diamonds and two peacocks on the side. The use of alternating floral and mango elements creates a balanced and harmonious design. Bottom dangles accentuates the length and movement.",
  "colors": [
    "The primary colors are rich gold",
    "vibrant green (emeralds)",
    "and dazzling white (diamonds). These colors combine to create a regal and timeless aesthetic."
  ],
  "occasions": [
    "Perfect for weddings",
    "Seemantham ceremonies",
    "and other auspicious occasions. Its elegant design also makes it suitable for formal gatherings and celebrations."
  ],
  "description": "This Haaram blends traditional South Indian craftsmanship with a modern sensibility. The use of high-quality CZ diamonds offers exceptional brilliance at an accessible price point. The design is both timeless and versatile, ensuring that this piece will be cherished for generations. The Hyderabadi Polish guarantees a long-lasting shine, preserving the beauty of this heirloom-worthy necklace. Emerald accents add a touch of sophistication and symbolize prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "CZ Diamonds",
    "Emeralds",
    "22K Gold",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Wedding",
    "Ethnic Jewelry",
    "Paisley",
    "Mango Design",
    "Fashion jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-46-47_1234",
  "collection": "diamond"
}