{
  "id": "necklaces-394",
  "title": "Elegant Ruby & Diamond Chain - A Modern Mangalsutra Alternative",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 37.350 gms)",
    "Round Cut Rubies (approximately 0.29 carats)",
    "Cubic Zirconia / Polki Diamonds (approximately 0.91 carats total diamond weight). Hyderabadi Polish for a lasting sheen."
  ],
  "features": "Delicately crafted gold chain with a modern design. Features two cylindrical embellishments set with rich red rubies. Cascading downwards are spiral bands alternating gold and white diamonds, set in a modern setting for a contemporary appeal. The custom chain design offers a unique alternative to traditional mangalsutra styles.",
  "colors": [
    "Gold (yellow)",
    "Ruby (red)",
    "and Diamond/CZ (white). The classic combination of red and gold exudes prosperity and good fortune."
  ],
  "occasions": [
    "Ideal for daily wear",
    "Anniversary",
    "Engagement",
    "or as a modern and minimalistic Muhurtham (wedding ceremony) necklace. It also suits contemporary celebrations and functions."
  ],
  "description": "A unique and contemporary take on traditional South Indian jewelry. This chain blends the timeless allure of gold and rubies with modern diamond/CZ settings, making it a versatile piece for the modern woman. The high-quality gold and Hyderabadi polish ensure durability and lasting beauty. It's a lightweight and comfortable alternative to heavier traditional necklaces.",
  "tags": [
    "Necklace",
    "Chain",
    "Gold Chain",
    "Ruby Necklace",
    "Diamond Necklace",
    "Modern Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Mangalsutra Alternative",
    "Thali Chain",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Daily Wear",
    "22K Gold",
    "Contemporary Design",
    "Tradition with a Twist",
    "Kante",
    "Gundu Mala"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-05-23-13-13-34 2_0835",
  "collection": "diamond"
}