{
  "id": "necklaces-994",
  "title": "Exquisite Diamond Emerald Ruby Kasulaperu Haaram with Jhumka Set",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish",
    "adorned with brilliant-cut Diamonds (VVS Clarity",
    "G Color)",
    "a central Emerald (Rectangular Cut",
    "Natural)",
    "a vibrant Ruby (Oval Cut",
    "Natural)",
    "and lustrous South Sea Pearls."
  ],
  "features": "This Haaram features a modern interpretation of the classic Kasulaperu design. The necklace is intricately designed with diamond-studded floral and paisley motifs. A captivating emerald center pendant gives way to a larger diamond-encrusted pendant with a ruby center and pearl drops. The Jhumkas echo this design with rubies, diamonds, and pearls. This piece embodies a modern design with traditional South Indian essence.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "with striking accents of green (emerald)",
    "red (ruby)",
    "and creamy white (pearls). This creates a rich and vibrant color palette befitting traditional South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagements",
    "grand receptions",
    "or any special occasion where you want to make a statement. Its modern design also makes it suitable for upscale contemporary events."
  ],
  "description": "This Haaram set showcases exceptional craftsmanship, blending traditional Kasulaperu design with modern aesthetic sensibilities. The use of high-quality diamonds, a natural emerald, and a genuine ruby, combined with Hyderabadi gold polish, ensures both lasting beauty and value. A true heirloom piece that embodies cultural significance with a modern touch. The brilliance of the diamonds offers unparalleled radiance.",
  "tags": [
    "Haaram",
    "Kasulaperu",
    "Necklace Set",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Vaddanam",
    "Kempu",
    "Pachala"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0450_2315",
  "collection": "necklace"
}