{
  "id": "necklaces-1547",
  "title": "Exquisite Diamond and Emerald Bridal Haaram - Har731",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-purity Gold (129.160 gms) with a dazzling array of brilliant-cut Diamonds (17.85 carats",
    "1171 stones) and vibrant Emerald accents (2.37 carats",
    "4 stones). Locket Details: Diamonds (4.44 carats",
    "225 stones) and Ruby (0.01 carats",
    "1 stone). Features a Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This grand Haaram showcases traditional Telugu craftsmanship with meticulously placed diamonds in an elaborate floral motif. Features circular segments that accentuate a center locket, each adorned with delicate floral detailing. Green Emeralds are used strategically to add contrast and visual appeal. The pendant also features round gold beads.",
  "colors": [
    "Predominantly Gold and White (Diamonds) with striking Green Emerald accents. Hints of red due to Rubies."
  ],
  "occasions": [
    "Perfect for grand weddings",
    "bridal ceremonies (muhurtham)",
    "seemantham",
    "or any occasion where you want to make a stunning statement. Also suitable for elaborate half-saree functions and traditional celebrations."
  ],
  "description": "This Haaram is a testament to timeless elegance and exceptional craftsmanship. The generous use of high-quality diamonds and vibrant emeralds ensures a breathtaking sparkle. The traditional design reflects the rich cultural heritage of South India, making it a cherished heirloom. The superior Hyderabadi polish guarantees lasting luster and durability. Ideal for the bride seeking a traditional yet luxurious statement piece. It also blends modern jewelry techniques.",
  "tags": [
    "Haaram",
    "Bridal Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Kantaabharanamu",
    "Traditional Jewelry",
    "Indian Wedding",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-24-13-54-27 2_2193",
  "collection": "sjpl"
}