{
  "id": "necklaces-357",
  "title": "Emerald Dream Raasi Haaram - A Regal Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Finest Quality Emeralds (Oval and Pear Cuts)",
    "Dazzling Polki Diamonds (Uncut Diamonds)",
    "South Sea Pearls. Expertly crafted with Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite haaram features a classic floral motif meticulously adorned with Polki diamonds. The central pendant boasts a stunning pear-shaped emerald, surrounded by intricate diamond lacework. Delicate South Sea pearls gracefully dangle from the pendant, adding a touch of elegance. The overall design incorporates traditional South Indian 'kundan' setting techniques, giving it a timeless appeal.",
  "colors": [
    "Luminous Gold",
    "Vibrant Green (Emeralds)",
    "Sparkling White (Diamonds)",
    "and Iridescent White (Pearls). A classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Perfect for bridal wear (Muhurtham)",
    "Seemantham ceremonies",
    "special religious occasions",
    "grand receptions",
    "and any event where you want to make an unforgettable statement. A true heirloom piece",
    "destined to be treasured for generations."
  ],
  "description": "This Raasi Haaram is a testament to the rich heritage of South Indian jewelry craftsmanship. The use of high-quality emeralds and Polki diamonds ensures exceptional brilliance and value. Its timeless design seamlessly blends tradition with modern sensibilities, making it a versatile piece that can be cherished for years to come. The Hyderabadi polish provides exceptional durability and a luxurious finish. A significant investment in your legacy and a beautiful addition to your jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "Emerald",
    "Polki Diamonds",
    "South Sea Pearls",
    "Kundan",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Muhurtham",
    "Seemantham",
    "Wedding Necklace",
    "Raasi",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Gold Necklace",
    "పచ్చల హారం",
    "పెళ్లి నగలు",
    "ముత్యాల హారం"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0471_0653",
  "collection": "diamond"
}