{
  "id": "earrings-600",
  "title": "Manoharam Pearl Drop Jhumkas - A Fusion of Tradition and Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "High-quality Gold with intricate detailing",
    "adorned with Pink Tourmaline gemstones (గులాబీ రంగు రత్నాలు)",
    "sparkling Cubic Zirconia",
    "and lustrous South Sea Pearls (ముత్యాలు). Features a radiant Hyderabadi Polish for an unparalleled shine."
  ],
  "features": "These exquisite jhumkas boast a unique floral design with a contemporary touch. The floral arrangement is meticulously set with pink tourmalines and shimmering cubic zirconia, creating a stunning visual effect. The delicate South Sea pearls dangle gracefully, adding a touch of classic charm. The intricate detailing showcases the skilled craftsmanship synonymous with Hyderabad's jewelry heritage.",
  "colors": [
    "Rose Gold",
    "Pink Tourmaline",
    "White Cubic Zirconia",
    "and Creamy White Pearls create a harmonious and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "festive celebrations like Diwali (దీపావళి)",
    "and special occasions. These jhumkas will also add a touch of glamour to any modern evening attire."
  ],
  "description": "These Jhumkas represent a perfect blend of South Indian tradition and contemporary design. The high-quality materials ensure lasting beauty and durability. The unique floral design and exquisite color combination make this piece a true statement of style. The lustrous Hyderabadi Polish ensures a dazzling shine that captures attention.",
  "tags": [
    "Jhumka",
    "Pearl Earrings",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Pink Tourmaline",
    "Cubic Zirconia",
    "Wedding Jewelry",
    "Traditional Earrings",
    "గుండ్రాటి కమ్మలు",
    "ముత్యాలు",
    "పెళ్లి",
    "Earrings"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-30-44_1819",
  "collection": "sjpl"
}