{
  "id": "necklaces-1174",
  "title": "Emerald & Diamond Grandeur: A Modern Take on the Traditional Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "featuring brilliant-cut Diamonds and Square-Cut Emeralds. Hyderabadi Polish for a lasting luster. Total Gold Weight: 108.360 grams (GH). Diamond Weight: 15.69 carats (2569 pieces). Emerald Weight: 12.60 carats (21 pieces)."
  ],
  "features": "This exquisite necklace showcases a contemporary interpretation of the classic Haaram. Each diamond-studded floral motif is meticulously crafted and interspersed with vibrant, square-cut Emeralds. The floral patterns have traditional elements, providing a blend of modern and timeless elegance. The diamond settings enhance the brilliance of each stone, creating a captivating sparkle.",
  "colors": [
    "Lustrous Gold",
    "Sparkling White Diamonds",
    "and Vivid Green Emeralds."
  ],
  "occasions": [
    "Perfect for weddings",
    "grand receptions",
    "or any special occasion where you want to make a statement. Ideal for bridal wear",
    "seemantham ceremonies",
    "and other traditional Telugu celebrations",
    "while also sophisticated enough for upscale modern events."
  ],
  "description": "This Haaram embodies the perfect fusion of traditional design and contemporary aesthetics. The use of high-quality diamonds and vivid emeralds ensures a dazzling brilliance. The Hyderabadi polish guarantees a long-lasting shine, making this necklace a cherished heirloom for generations to come. The intricate craftsmanship and unique design make it a truly special and valuable piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Temple Jewelry",
    "Seemantham",
    "Muhurtham",
    "Contemporary Jewelry",
    "22K Gold",
    "Emerald",
    "Diamond",
    "हारम",
    "నెక్లెస్",
    "వజ్రాల నెక్లెస్",
    "పచ్చ నెక్లెస్",
    "దక్షిణ భారత నగల",
    "తెలుగు నగల"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-00 3_1726",
  "collection": "sjpl"
}