{
  "id": "necklaces-958",
  "title": "Divya Peacock Kundan Haaram - A Timeless Statement",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base Metal: Gold Plated; Stones: High-Quality Kundan Stones",
    "Emeralds",
    "and Rubies; Pearls: Seed Pearls. Features a lustrous Hyderabadi Polish."
  ],
  "features": "This exquisite haaram features a contemporary take on the classic kundan design. The intricate open lattice network of the necklace is punctuated with dazzling kundan stones and culminates in a majestic pendant showcasing two beautifully crafted peacocks facing each other. Each peacock is adorned with emeralds and rubies, echoing the traditional South Indian colors. The pendant is further embellished with cascading seed pearls, adding a touch of delicate charm. Superior craftsmanship is evident in the setting of the kundan stones and the detailed work on the peacock motifs.",
  "colors": [
    "Gold (Hyderabadi Polish)",
    "White (Kundan)",
    "Green (Emerald)",
    "Red (Ruby)",
    "Cream (Seed Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (pelliki)",
    "engagements",
    "festivals like Diwali or Sankranthi",
    "and grand celebrations. Also suitable for modern events where you want to make a bold",
    "culturally rich statement."
  ],
  "description": "A harmonious blend of tradition and contemporary design. The use of high-quality kundan stones ensures lasting brilliance. The peacock motif symbolizes beauty, royalty, and love, making it a meaningful gift. Hyderabadi polish ensures a long-lasting, radiant finish. Comfortable to wear and easy to style with both traditional and fusion outfits.",
  "tags": [
    "Haaram",
    "Kundan",
    "Peacock",
    "Mayura",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Pelliki",
    "Emerald",
    "Ruby",
    "Pearls",
    "Indian Jewellery"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0352_2419",
  "collection": "necklace"
}