{
  "id": "necklaces-1113",
  "title": "Regal Kundan and Ruby Antique Choker - Raani Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Antique Finish",
    "High-Quality Kundan Diamonds (Polki)",
    "Faceted Ruby Drops",
    "Freshwater Pearls. Features traditional Hyderabadi Polki setting for maximum brilliance."
  ],
  "features": "Elaborate circular Kundan settings with concentric rows of Polki diamonds. Features a central pear-shaped pendant with cascading Ruby drops and smaller Polki diamonds. The design echoes Mughal-inspired artistry, perfect for a traditional Telugu bride or a lover of timeless elegance. Handcrafted Nakshi work on the reverse side enhances its antique charm.",
  "colors": [
    "Antique Gold",
    "Sparkling White (Polki Diamonds)",
    "Rich Ruby Red",
    "Lustrous White (Pearls). A classically regal color palette",
    "embodying traditional South Indian aesthetics."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "bridal ceremonies",
    "receptions",
    "Seemantham (baby shower)",
    "and special celebrations. A statement piece for both traditional Telugu functions and high-end modern events."
  ],
  "description": "Authentic Kundan craftsmanship passed down through generations. Features an antique finish that enhances the rich historical appeal. The combination of Polki diamonds and Rubies symbolizes prosperity and love. Durable and designed for heirloom quality, making it a cherished family treasure. Showcases Hyderabadi artistry at its finest, representing unparalleled luxury and cultural significance.",
  "tags": [
    "Kundan Necklace",
    "Polki Jewelry",
    "Antique Choker",
    "Bridal Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Ruby Necklace",
    "Raani Haar",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Vivahaabharanalu",
    "Vadanam",
    "Seemantham",
    "Mughal Jewelry",
    "Indian Jewelry",
    "22K Gold"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0008_2526",
  "collection": "radhe"
}