{
  "id": "necklaces-1250",
  "title": "Emerald and Diamond Grandeur: A Contemporary Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Platinum base with 18K Yellow Gold accents. Features natural",
    "vibrant green Emeralds (59.43 carats total) with excellent clarity and brilliant cut. Adorned with D color",
    "internally flawless (IF) diamonds totaling approximately 17 carats (based on the provided weight distribution). Polished to a Hyderabadi sheen."
  ],
  "features": "This contemporary Haaram reimagines traditional South Indian necklace designs. The necklace showcases large, rectangular emeralds surrounded by a cluster of round brilliant diamonds. The diamond floral lattice structure adds a modern, delicate touch. The setting is designed for optimal light reflection, enhancing the brilliance of both the diamonds and emeralds.",
  "colors": [
    "Predominantly white (diamonds) and green (emeralds) with warm yellow gold highlights that perfectly contrast with the platinum",
    "creating a rich and balanced aesthetic."
  ],
  "occasions": [
    "Perfect for grand receptions",
    "milestone anniversaries",
    "or as a statement piece at high-end galas. Also suitable for modern brides seeking a blend of tradition and contemporary style for their wedding day",
    "or any special occasion where sophisticated elegance is desired."
  ],
  "description": "This Haaram is a testament to exquisite craftsmanship and superior quality. The combination of rare emeralds and dazzling diamonds makes it a truly unique and valuable heirloom. The modern design elements add a contemporary flair to a classic South Indian style, ensuring its timeless appeal. Crafted to last generations, and radiates exquisite craftsmanship, it's an investment piece you will be proud to own.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Platinum",
    "Gold",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Contemporary Jewelry",
    "Fine Jewelry",
    "Vaddanam",
    "Kasulaperu"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-45-10-1_1844",
  "collection": "sjpl"
}