{
  "id": "necklaces-1298",
  "title": "Diamond Chakra Pendant - A Timeless Blend of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18K Yellow Gold. Adorned with brilliant-cut diamonds",
    "VS clarity",
    "G-H color. Features a high Hyderabadi polish for lasting brilliance."
  ],
  "features": "This pendant showcases a modern take on the traditional Nagas jewelry style. The top portion features a stylized floral and peacock motif, meticulously set with diamonds. Two lower circular pendants, reminiscent of 'chakra' designs, add balance and movement. The entire piece is crafted with precision and attention to detail.",
  "colors": [
    "Predominantly yellow gold with the bright sparkle of colorless diamonds. The yellow gold enhances the brilliance of the diamonds",
    "creating a warm and luxurious effect."
  ],
  "occasions": [
    "Perfect for everyday wear or to add a touch of elegance to special occasions. Its modern design makes it suitable for cocktail parties",
    "family gatherings",
    "and even as a sophisticated accessory for work attire. It can also be gifted during weddings or anniversaries to celebrate enduring love."
  ],
  "description": "This pendant is a unique blend of traditional South Indian design and contemporary aesthetics. The use of high-quality diamonds and 18K gold ensures lasting beauty and value. The intricate craftsmanship reflects the rich heritage of Hyderabad's jewelry-making tradition. Its versatile design makes it a cherished addition to any jewelry collection.",
  "tags": [
    "Diamond Pendant",
    "Gold Pendant",
    "South Indian Jewelry",
    "Nagas Design",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Chakra Design",
    "Modern Jewelry",
    "Fine Jewelry",
    "Telugu Jewelry",
    "Andhra Jewelry",
    "Floral Pendant",
    "Peacock Pendant"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-23_1896",
  "collection": "sjpl"
}