{
  "id": "necklaces-314",
  "title": "Dazzling Diamond Peacock Haaram Set with Matching Earrings",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Premium Quality Diamonds",
    "22K Gold (సువర్ణము)",
    "Emeralds (పచ్చ)",
    "Rubies (కెంపు)",
    "Cultured Pearls. Meticulously crafted with Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite haaram features intricate peacock motifs, a symbol of beauty and prosperity in Telugu tradition. The design incorporates delicate filigree work and is studded with sparkling diamonds. Emeralds and Rubies accent the piece, adding a touch of regal color. The earrings mirror the haaram's design, creating a cohesive and opulent look. The cascading pearls add a traditional 'guttapusalu' (గుట్టపూసలు) effect.",
  "colors": [
    "Predominantly white (diamonds) with accents of green (emeralds)",
    "red (rubies)",
    "and gold. The pearls offer a soft",
    "luminous contrast."
  ],
  "occasions": [
    "Perfect for bridal wear (పెళ్ళి నగల)",
    "weddings",
    "grand receptions",
    "Seemantham (సీమంతం)",
    "and other significant Telugu and South Indian ceremonies. Also suitable for high-end social events and family celebrations."
  ],
  "description": "This Diamond Peacock Haaram set is a true heirloom piece, embodying the rich cultural heritage of South Indian jewelry. The superior craftsmanship and high-quality materials ensure its durability and lasting beauty. The intricate peacock design symbolizes good fortune and elegance, making it a cherished addition to any jewelry collection. It offers a stunning blend of traditional aesthetics and contemporary appeal.",
  "tags": [
    "Diamond Haaram",
    "Peacock Jewelry",
    "Bridal Necklace",
    "South Indian Jewelry",
    "Telugu Jewellery",
    "Wedding Jewellery",
    "Kempu",
    "Pachi",
    "Gutthapusalu",
    "కంఠాభరణం",
    "చెవిపోగులు",
    "పచ్చ",
    "కెంపు",
    "పెళ్ళి నగల",
    "Hyderabadi Jewelry",
    "Indian Jewellery",
    "Traditional Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0403_0600",
  "collection": "diamond"
}