{
  "id": "earrings-287",
  "title": "Enchanted Blossom Jhumkas - A Symphony of Diamonds and Gemstones",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted from 34.740 grams of exquisite Fine Gold (FG)",
    "these jhumkas showcase a dazzling array of 3.77 carats of brilliant-cut diamonds (498 stones). Accentuated with marquise-cut sapphires",
    "pink tourmalines and citrine adding a spectrum of color. Features intricate diamond settings to ensure maximum brilliance."
  ],
  "features": "These modern jhumkas feature a unique floral-inspired design, where diamond-studded flowers blossom alongside a delicate vine adorned with colorful gemstones. Each gemstone is meticulously set to capture and reflect light, creating a mesmerizing sparkle. The contemporary design blends seamlessly with traditional Jhumka sensibilities.",
  "colors": [
    "The color palette is a harmonious blend of the pristine white of the diamonds",
    "vibrant sapphire blues",
    "blush pinks of the tourmalines and the sun-kissed yellows of the citrine",
    "set against the radiant backdrop of fine gold."
  ],
  "occasions": [
    "Perfect for a modern bride",
    "a special occasion like a reception",
    "or to add a touch of elegance to any ensemble. These Jhumkas will certainly elevate your style quotient."
  ],
  "description": "Experience the allure of contemporary design fused with the timeless charm of gemstones and diamonds. These Jhumkas offer a unique blend of tradition and modernity, making them a treasured addition to any jewelry collection. The high-quality diamonds and intricate craftsmanship ensure lasting beauty and value.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Diamond Earrings",
    "Gemstone Earrings",
    "Floral Design",
    "Modern Jewelry",
    "Hyderabad Jewelry",
    "Indian Jewelry",
    "Fine Gold",
    "Sapphire",
    "Tourmaline",
    "Citrine",
    "Wedding Jewelry",
    "Reception Jewellery",
    "Contemporary Design"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-30-49_0960",
  "collection": "diamond"
}