{
  "id": "necklaces-1000",
  "title": "The Gulabi Diamond Grandeur Haaram - A Timeless Statement",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish for a rich",
    "lasting lustre. Features meticulously set",
    "brilliant-cut Diamonds of VS clarity and a striking Ruby cabochon centerpiece. Gold weight: approx. 60 grams; Diamond weight: approx. 10 carats; Ruby Weight: approx. 3 carats."
  ],
  "features": "This exquisite Haaram showcases a delicate floral motif throughout, meticulously handcrafted by skilled artisans. The central pendant features an intricate openwork design adorned with diamonds, culminating in a regal Ruby. Features a 'U' shaped design with floral and leaf patterns with ruby accents. The delicate filigree and pave setting further enhance the brilliance of the diamonds. Adjustable chain length is provided for a perfect fit.",
  "colors": [
    "The overall color scheme is a warm",
    "radiant Gold enhanced by the dazzling brilliance of the White Diamonds and the deep",
    "luxurious Red of the Ruby."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "Seemantham ceremonies",
    "grand celebrations",
    "or any occasion where you desire to make a lasting impression. This statement piece beautifully complements traditional silk sarees and contemporary gowns alike."
  ],
  "description": "This Diamond Haaram is more than just jewelry; it's a heirloom. The timeless design, superior craftsmanship, and exceptional quality materials ensure it will be treasured for generations. The use of genuine diamonds and gold with Hyderabadi polish ensures lasting value and brilliance. Each stone is hand-selected and carefully set for maximum sparkle.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "కంఠాభరణం",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Indian Bridal Jewelry",
    "Ruby",
    "Hyderabad Jewelry",
    "22K Gold",
    "Fine Jewelry",
    "Traditional Jewelry",
    "Grand Necklace",
    "Statement Piece",
    "Floral Design"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0458_2321",
  "collection": "necklace"
}