{
  "id": "necklaces-753",
  "title": "Emerald Bloom Two-Layer Diamond Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Emeralds (కెంపులు) with excellent green color and clarity",
    "Brilliant Cut Diamonds (వజ్రాలు) with VS clarity and IJ color. Crafted with meticulous detail",
    "finished with a lustrous Hyderabadi Polish."
  ],
  "features": "A breathtaking two-layer Haaram featuring a floral motif design. The piece showcases a delicate interplay of emeralds and brilliant-cut diamonds, expertly set in an open setting to maximize sparkle. The design draws inspiration from traditional South Indian floral patterns, giving it a classic yet contemporary feel. Intricate filigree work (తీగ పని) accentuates the design.",
  "colors": [
    "Lustrous Gold",
    "vibrant Green Emeralds",
    "and dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "engagements",
    "weddings (పెళ్లి)",
    "and other grand celebrations. Ideal for traditional events like muhurtham",
    "seemantham",
    "and half-saree function."
  ],
  "description": "This exquisite Haaram represents the pinnacle of South Indian craftsmanship. The combination of premium quality emeralds and diamonds, set in 22K gold with Hyderabadi Polish, ensures lasting beauty and heirloom quality. It's a timeless piece that blends traditional aesthetics with modern elegance, making it a cherished addition to any jewelry collection. The floral design symbolizes prosperity and new beginnings, making it especially auspicious for bridal wear.",
  "tags": [
    "Haaram",
    "కంఠహారం",
    "Necklace",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emeralds",
    "కెంపులు",
    "Diamonds",
    "వజ్రాలు",
    "22K Gold",
    "Hyderabadi Polish",
    "Floral Design",
    "Traditional Jewelry",
    "Indian Jewelry",
    "engagement",
    "muhurtham",
    "seemantham"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-39_1259",
  "collection": "diamond"
}