{
  "id": "necklaces-1075",
  "title": "Emerald and Diamond Chandrani Haar - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Emeralds (Oval Cut",
    "Zambian Origin)",
    "High-Quality Polki Diamonds (Uncut",
    "Clarity SI1)",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite necklace showcases a unique fusion of traditional and contemporary design. Featuring alternating oval-cut Zambian Emeralds and sparkling Polki diamonds, each meticulously halo-set in 22K gold. The cascading pendant design adds a modern touch while retaining the elegance of a classic Haaram. The 'kundan' setting highlights the natural beauty of the gemstones. The necklace is finished with a rich Hyderabadi polish, providing a luxurious gleam and ensuring its longevity.",
  "colors": [
    "Emerald Green",
    "Diamond White",
    "Yellow Gold"
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "engagement ceremonies",
    "or upscale social gatherings. Also suitable for contemporary parties and events where a touch of South Indian elegance is desired."
  ],
  "description": "This Chandrani Haar perfectly blends tradition with modern aesthetics. The use of high-quality Zambian Emeralds and Polki diamonds ensures lasting brilliance and value. The Hyderabadi polish guarantees the piece's durability and exquisite sheen. The combination of emeralds and diamonds is considered highly auspicious, making it an ideal choice for bridal jewelry or a cherished heirloom piece.",
  "tags": [
    "Emerald Necklace",
    "Diamond Necklace",
    "Haaram",
    "Chandrani Haar",
    "Polki Diamonds",
    "Zambian Emeralds",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Kanthabharanam",
    "Kundan Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "radhe_diam_DPNK8-1608_2488",
  "collection": "radhe"
}