{
  "id": "necklaces-491",
  "title": "Emerald Cascade Haaram: A Symphony of Diamonds and Gemstones",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Premium quality diamonds with Fg color",
    "Emeralds with a rich green hue. Base metal is high quality gold which is coated by Hyderabad polish. Diamond with marquis cut and round cut."
  ],
  "features": "This exquisite Haaram features a mesmerizing cascade design, with three layers of intricately arranged diamond-studded floral and leaf motifs. Each strand gracefully culminates in a captivating emerald pendant, adding a touch of regal elegance. The Hyderabadi polish enhances the brilliance of the diamonds, creating a radiant and luxurious appeal.",
  "colors": [
    "Predominantly brilliant white (diamonds) and vivid green (emeralds)",
    "accented by the warm tones of the gold base."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings",
    "receptions",
    "and milestone anniversaries. Ideal for traditional South Indian events such as muhurtham",
    "seemantham",
    "and half-saree function. Its modern design also makes it suitable for high-end cocktail parties and formal galas."
  ],
  "description": "This Haaram is a testament to exquisite craftsmanship and timeless elegance. The cascade design is a modern take on the traditional Haaram, making it a unique and versatile piece. The combination of diamonds and emeralds is considered auspicious and adds a touch of regal charm. Owning this piece is like owning a piece of Hyderabadi jewelry heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Grand Necklace",
    "Emerald Haaram",
    "Diamond Haaram",
    "Cascade Necklace",
    "Traditional Jewelry",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Half-Saree Function Jewelry",
    "Party Wear",
    "Festive Wear"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-45-09_0969",
  "collection": "diamond"
}