{
  "id": "necklaces-758",
  "title": "The 'Mayuri' Grand Diamond Haaram with Emerald and Sapphire Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features brilliant-cut diamonds (VS clarity",
    "G-H color)",
    "vibrant emerald cabochons",
    "and striking blue sapphire beads. Gold weight approx. 150 grams."
  ],
  "features": "A masterpiece of craftsmanship, this haaram showcases a traditional South Indian design, featuring alternating floral and peacock (Mayuri) motifs. The pendant displays a magnificent emerald cabochon, surrounded by diamonds and intricate filigree work. Sapphire beads add a touch of regal elegance. The setting utilizes a pavé setting for maximum diamond brilliance, enhanced with delicate milgrain detailing.",
  "colors": [
    "Predominantly gold and diamond white",
    "accented with the lush green of emeralds and the deep blue of sapphires. A timeless and auspicious color combination."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaham)",
    "engagement ceremonies (Muhurtham)",
    "bridal showers (Seemantham)",
    "and festive celebrations like Diwali and Sankranthi. Also suitable for high-profile galas and red-carpet events."
  ],
  "description": "This 'Mayuri' Haaram is an heirloom piece that embodies the rich cultural heritage of South India. The combination of exceptional craftsmanship, high-quality gemstones, and traditional design ensures lasting beauty and value. The unique peacock motif symbolizes grace and prosperity. Its timeless elegance will make you the center of attention at any event.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Jewelry",
    "Sapphire Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Kasulaperu",
    "Mayuri",
    "Peacock",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Muhurtham",
    "Seemantham",
    "Indian Jewelry",
    "Fine Jewelry",
    "Grand Haaram",
    "Haaralu",
    "Gundla Mala"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-41_1264",
  "collection": "diamond"
}