{
  "id": "necklaces-659",
  "title": "Rajputana Grandeur: Diamond and Emerald Statement Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "High-Quality Baguette and Round Brilliant Cut Diamonds (VS Clarity",
    "G Color)",
    "Emeralds (Oval Cut",
    "Zambian origin). Features Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "A breathtaking haaram showcasing a modern take on traditional design. The central floral motif is intricately crafted with pave-set diamonds, surrounding a vibrant oval-cut emerald. Baguette diamonds are meticulously set in linear patterns along the necklace, creating a striking geometric contrast. Delicate gold bead accents add a touch of traditional charm. The pendant features a spherical diamond-encrusted element, adding dimension and movement.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented by the rich green of the emeralds. The combination creates a regal and luxurious appearance",
    "reminiscent of South Indian bridal jewelry."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "receptions",
    "and high-profile parties. Also suitable for Seemantham (baby shower) or a special anniversary gift. Its modern design allows it to be worn at contemporary events where a touch of elegance and tradition is desired."
  ],
  "description": "This Haaram seamlessly blends traditional South Indian design principles with modern aesthetics. The use of high-quality diamonds and vibrant emeralds ensures enduring brilliance. The Hyderabadi polish guarantees a long-lasting shine. It's a statement piece that embodies both cultural significance and contemporary style, making it a treasured heirloom for generations to come. The intricate detailing and exceptional craftsmanship make this a truly unique and desirable piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "Zambian Emerald",
    "Pave Setting",
    "Baguette Diamonds",
    "Vivaha",
    "Seemantham",
    "Andhra Jewelry",
    "Telugu Jewelry",
    "Modern Haaram",
    "Traditional Jewelry",
    "Heirlooms"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-28 2_1165",
  "collection": "diamond"
}