{
  "id": "necklaces-050",
  "title": "Mayura-Inspired Emerald & Diamond Haaram - The \"Prakriti Sobha\" Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Natural Emeralds (Zambian Origin",
    "Vivid Green)",
    "Polki Diamonds (Uncut",
    "Rose Cut)",
    "South Sea Pearls."
  ],
  "features": "This exquisite Haaram features a central pendant with two exquisitely crafted peacocks (Mayura) adorned with pave-set polki diamonds and captivating Zambian Emeralds for their eyes. The pendant is further embellished with a floral motif set with polki diamonds. Delicate emerald bead tassels with pearl accents hang elegantly, adding movement and a touch of contemporary flair. The chain is a double strand consisting of alternating natural emerald and pearl beads, intricately strung for a regal yet modern look. This piece showcases a harmonious blend of traditional temple jewelry motifs and contemporary design.",
  "colors": [
    "Primarily gold",
    "vivid green (emeralds)",
    "white (pearls)",
    "and the subtle sparkle of polki diamonds create a vibrant and luxurious color palette."
  ],
  "occasions": [
    "Perfect for weddings (Veedukolu/Muhurtham)",
    "receptions",
    "traditional family gatherings",
    "or any special occasion where you want to make a statement. A striking piece for a Seemantham or Half-Saree function (Langa Voni)."
  ],
  "description": "This haaram is a modern heirloom, a timeless piece that represents the beauty of Indian craftsmanship. The natural emeralds are carefully selected for their vibrant color and clarity. The Hyderabadi polish adds a rich luster, while the intricate design showcases the skill of our master artisans. The symbolic significance of the peacock (beauty, grace, and love) makes it a cherished gift or a meaningful addition to your jewelry collection.",
  "tags": [
    "Haaram",
    "కంఠాభరణం",
    "Necklace",
    "Emerald",
    "Pancha Ratna Haaram",
    "Polki Diamonds",
    "South Sea Pearls",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Mayura",
    "Peacock",
    "Hyderabadi Jewelry",
    "Langa Voni",
    "Half Saree",
    "Veedukolu",
    "Muhurtham",
    "Seemantham",
    "Kundan",
    "Kundan Polki",
    "Hyderabad",
    "India"
  ],
  "original_id": "diamond_jewellery_56407a55-6392-4913-be23-0181c472948a_0123",
  "collection": "diamond"
}