{
  "id": "earrings-056",
  "title": "Divya Muktavali Jhumkas: A Symphony of Tradition and Sparkle",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "embellished with high-quality Cubic Zirconia",
    "lustrous cultured pearls",
    "a striking Ruby accent",
    "and vibrant Emerald gemstones. Features our signature Hyderabadi Polish for a lasting",
    "radiant shine."
  ],
  "features": "Intricate filigree design reminiscent of Mughal architecture. The jhumka's bell shape is handcrafted with floral motifs and meticulously placed Cubic Zirconia for a captivating sparkle. The cascading pearls add a touch of sophistication and movement. The crown of the jhumka features a peacock-inspired design with Emerald and Ruby accents, a quintessential South Indian motif.",
  "colors": [
    "Predominantly gold with dazzling white Cubic Zirconia",
    "complemented by the vibrant green of Emeralds",
    "the rich red of the Ruby",
    "and the soft luster of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals (Sankranthi",
    "Diwali)",
    "and special occasions like Seemantham or half-saree function. Also suitable for modern celebrations where you want to add a touch of ethnic elegance."
  ],
  "description": "A harmonious blend of traditional South Indian design and contemporary appeal. The 22K gold ensures lasting value and a rich, warm glow. The intricate craftsmanship and high-quality materials make this piece a treasured heirloom. The use of Cubic Zirconia provides a brilliant alternative to diamonds, offering exceptional sparkle at an accessible price point. The peacock motif symbolizes beauty, prosperity, and good fortune.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Karna Pathakulu",
    "South Indian Jewelry",
    "Temple Jewelry",
    "22K Gold",
    "Cubic Zirconia",
    "Pearls",
    "Ruby",
    "Emerald",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Ethnic Earrings",
    "Bridal Jewelry",
    "Vivahaalu",
    "Nischitartham"
  ],
  "original_id": "diamond_jewellery_781384ca-2477-40df-af70-2196bcfdc43d_0140",
  "collection": "diamond"
}