{
  "id": "necklaces-1391",
  "title": "Emerald Floral Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with a Hyderabadi Polish. Features brilliant-cut diamonds (VS Clarity",
    "G Color) and vibrant",
    "natural Emeralds (Square cut & Pear cut). Adorned with freshwater pearls."
  ],
  "features": "This exquisite haaram showcases a tiered floral design, meticulously set with dazzling diamonds. Emeralds are gracefully incorporated into the floral motifs, adding a touch of regal elegance. The pendant features a large square-cut Emerald at its center, surrounded by a diamond-encrusted design reminiscent of traditional Hyderabadi craftsmanship. Delicate pearl drops enhance the overall allure.",
  "colors": [
    "Predominantly gold and diamond-white",
    "accentuated by the rich green of the Emeralds and the soft luster of the pearls."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaaham)",
    "receptions",
    "and special celebrations. It's also a stunning statement piece for upscale events and contemporary gatherings."
  ],
  "description": "This haaram seamlessly blends traditional Hyderabadi artistry with modern design sensibilities. The high-quality diamonds and vibrant Emeralds ensure a lasting sparkle and timeless appeal. The meticulous craftsmanship guarantees durability and a luxurious feel, making it a cherished heirloom for generations to come. It is a 'Sarva Sampoorna' piece, symbolizing prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Vivaaham",
    "Emeralds",
    "Diamonds",
    "Pearls",
    "Hyderabadi Polish",
    "22K Gold",
    "Contemporary Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-06 3_2009",
  "collection": "sjpl"
}