{
  "id": "necklaces-1177",
  "title": "The \"Manohari Haaram\": Exquisite Ruby, Emerald, and Pearl Long Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (hallmarked)",
    "Burmese Rubies (21.33 carats",
    "5 stones)",
    "Zambian Emeralds (19.20 carats",
    "27 stones)",
    "South Sea Pearls (36.00 carats",
    "10 pearls in necklace; 31.00 carats",
    "9 pearls in pendant). Finished with traditional Hyderabadi polish for a rich",
    "antique luster."
  ],
  "features": "A stunning three-layered long necklace featuring a cascading design with intricate filigree work and delicate gemstone settings. The focal point is a beautifully crafted pendant adorned with a large central emerald and pearl drops. The Haaram showcases traditional Telugu design elements, including floral motifs (puspala), paisley patterns, and a classic mango design (maangai).",
  "colors": [
    "Rich gold",
    "vibrant ruby red",
    "lush emerald green",
    "and iridescent pearl white. This classic combination is highly auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "engagements (Nischitartham)",
    "bridal showers",
    "Seemantham",
    "half-saree functions",
    "and grand festivals like Diwali and Sankranthi. This statement piece will elevate any formal occasion."
  ],
  "description": "A true heirloom piece, the Manohari Haaram is a symbol of prosperity and grace. The high-quality gemstones and meticulous craftsmanship ensure lasting beauty and value. Its traditional design, blended with modern elegance, makes it a versatile and treasured addition to any jewelry collection. This piece embodies the rich cultural heritage of Hyderabad and its legacy of fine jewelry making.",
  "tags": [
    "Haaram",
    "Long Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Antique Finish",
    "Heirloom Jewelry",
    "కంఠాభరణం",
    "బంగారు నెక్లెస్",
    "రూబీ నెక్లెస్",
    "పచ్చ నెక్లెస్",
    "ముత్యాల నెక్లెస్",
    "పెళ్లి నగలు",
    "సంప్రదాయ నగల"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-01 3_1729",
  "collection": "sjpl"
}