{
  "id": "necklaces-130",
  "title": "Navaratna Vaibhavam Haaram with South Sea Pearls - A Gemstone Symphony",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Multi-colored Tourmalines (Navaratnas)",
    "South Sea Pearls (మత్యాలు)",
    "Brilliant Cut Diamonds. The gold features a radiant Hyderabadi Polish."
  ],
  "features": "This stunning Haaram showcases a cascading design of bezel-set, rectangular-cut tourmalines in an array of vibrant colors. Each gemstone is meticulously surrounded by pavé-set brilliant cut diamonds. The necklace culminates in a magnificent central pendant featuring a large, cushion-cut Tourmaline encased in multiple rows of diamonds. Lustrous South Sea Pearls gracefully dangle from each gemstone cluster, adding a touch of elegance and movement. The piece emphasizes a rich, textured design with subtle modern interpretations of traditional South Indian aesthetics.",
  "colors": [
    "Multicolor - Spectrum of greens",
    "pinks",
    "yellows",
    "and reds from the tourmalines complemented by the bright white sparkle of diamonds and the creamy luster of South Sea pearls. The gold adds a warm",
    "rich tone to the overall palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "anniversaries",
    "and special celebrations. An exquisite piece for Muhurtham",
    "reception",
    "or any grand event where you want to make a lasting impression. Suitable for formal gatherings or upscale parties."
  ],
  "description": "This Navaratna Vaibhavam Haaram is a testament to exceptional craftsmanship. The combination of precious gemstones, radiant diamonds, and lustrous South Sea pearls creates a breathtaking piece that is both timeless and contemporary. Wearing Navaratna jewelry is believed to bring prosperity, good health, and overall well-being, making this Haaram not only beautiful but also auspicious. The Hyderabadi Polish enhances the richness of the gold, while the carefully selected gemstones ensure lasting brilliance. The unique design ensures that this piece will be a cherished heirloom for generations to come.",
  "tags": [
    "Haaram",
    "Necklace",
    "Navaratna",
    "Tourmaline",
    "South Sea Pearls",
    "Diamonds",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "kantaabharanam",
    "ముత్యాల హారం",
    "రత్నాల హారం",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_DPNK8-1763_0363",
  "collection": "diamond"
}