{
  "id": "necklaces-1410",
  "title": "Vaibhavalakshmi Emerald and Diamond Haaram with Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base Metal is 22K Gold Plated. Embellished with high-quality Cubic Zirconia (CZ) stones",
    "Emerald-cut Green CZs",
    "and Freshwater Pearls. Features a Hyderabadi Polish for lasting shine."
  ],
  "features": "Features a classic Haaram design, meticulously crafted with intricate filigree work and delicate paisley (mango) motifs. A central pendant with an Emerald-cut green CZ is linked with a smaller pendant. Dangles of petite freshwater pearls add a touch of grace. The setting style offers maximum brilliance and security for the stones.",
  "colors": [
    "Predominantly Gold and White (Diamond-like) with striking Emerald green accents and the soft luster of pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and traditional South Indian ceremonies like muhurtham",
    "seemantham",
    "and half-saree functions. Adds regal charm to any festive occasion. Also suitable for modern formal events."
  ],
  "description": "This Haaram is a masterpiece of traditional South Indian jewelry craftsmanship. The brilliance of the CZ stones, combined with the vibrancy of the Emerald green CZs and the gentle glow of the pearls, creates a captivating and luxurious look. The Hyderabadi polish ensures longevity and radiance, making it a valuable addition to any jewelry collection. Symbolizes prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Emerald",
    "Diamonds",
    "CZ",
    "Pearls",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Muhurtham",
    "Seemantham",
    "Half-Saree",
    "Mangalsutra",
    "Kasulaperu",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Haram",
    "Bridal Necklace",
    "Emerald Necklace"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-20 2_2028",
  "collection": "sjpl"
}