{
  "id": "earrings-074",
  "title": "Swarna Kundan Jhumkas: A Blossoming Cascade of Tradition",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Suddha Bangaram) with Hyderabadi Polish. Adorned with meticulously set Cubic Zirconia (CZ) simulating Polki Diamonds. Features dangling",
    "lustrous faux Pearls."
  ],
  "features": "Classic bell-shaped Jhumka design with intricate filigree work and floral motifs. The open setting enhances the brilliance of the CZ stones. The cascading pearl drops (gundlu) add a touch of grace and movement. Features a stud closure for secure and comfortable wear.",
  "colors": [
    "Warm yellow gold with dazzling white CZ stones and creamy ivory pearls. The gold provides a rich",
    "traditional contrast to the sparkle of the CZ",
    "reminiscent of traditional South Indian color palettes."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "festivals (Pandugalu)",
    "and other special occasions. Also ideal for a half-saree function (Langa Voni Function) or any event where you want to showcase your traditional style with a touch of modern sparkle."
  ],
  "description": "These Jhumkas are a stunning blend of traditional South Indian design and contemporary elegance. The high-quality gold and meticulous craftsmanship ensure lasting beauty. The CZ stones offer the brilliance of diamonds at an accessible price point. The timeless Jhumka design is a must-have for any South Indian jewelry collection, making it a valuable heirloom piece. The Hyderabadi polish adds a unique luster and richness.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Kundan",
    "Gold",
    "CZ",
    "Pearls",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Karnam",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Festival Jewelry",
    "Ethnic Jewelry",
    "Suddha Bangaram",
    "Vivahaalu",
    "Pandugalu"
  ],
  "original_id": "diamond_jewellery_9da0b217-b531-4e25-a988-bc5b50cfc869_0166",
  "collection": "diamond"
}