{
  "id": "earrings-181",
  "title": "Suryakanthi Diamond Studs - A Touch of Telugu Tradition",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in 18K Yellow Gold with a radiant",
    "high-polish finish. Showcasing brilliant-cut",
    "high-clarity (SI) Diamonds. Gold is sourced ethically and meticulously tested for purity."
  ],
  "features": "These stunning studs feature a delicate, floral design, reminiscent of the 'Suryakanthi' (Sunflower). The diamonds are meticulously set in a prong setting to maximize their brilliance, with paisley details around the perimeter. The design allows light to penetrate the diamonds, enhancing their sparkle and creating a mesmerizing effect. Comfortable and secure push-back closure.",
  "colors": [
    "Warm Yellow Gold contrasting beautifully with the icy white sparkle of the diamonds. A classic and elegant color combination."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "adding a touch of elegance to any outfit. Ideal for special occasions like weddings",
    "parties",
    "or festive celebrations. A thoughtful gift for birthdays",
    "anniversaries",
    "or graduations."
  ],
  "description": "These 'Suryakanthi' inspired studs combine traditional South Indian aesthetics with modern jewelry design. The intricate craftsmanship and high-quality diamonds ensure a timeless piece that can be treasured for generations. Easy to wear and maintain, these studs are a perfect blend of style and comfort. Represents positivity and new beginnings, making it a meaningful gift.",
  "tags": [
    "Diamond Earrings",
    "Stud Earrings",
    "Yellow Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Suryakanthi",
    "Sunflower",
    "Telugu",
    "Diamonds",
    "Bridal Jewelry",
    "Gift for Her",
    "Festive Jewelry",
    "Contemporary Design",
    "Fine Jewelry",
    "Dazzling Diamonds",
    "Everyday Earrings",
    "Indian Jewelry",
    "Hyderabadi Jewelry"
  ],
  "original_id": "diamond_jewellery_e24bfbc0-1370-463a-b54b-7317e0b98136_0392",
  "collection": "diamond"
}