{
  "id": "necklaces-166",
  "title": "Vintage Polki Kundan Haaram with Precious Gemstone Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Kundan setting)",
    "Faceted Green Aquamarine",
    "Faceted Pink Tourmaline",
    "Natural Seed Pearls. Hyderabadi Polish for an Antique Look."
  ],
  "features": "Intricate Kundan setting with floral and geometric motifs. The central pendant features a large oval Aquamarine cabochon surrounded by Polki diamonds. Delicate drops of Aquamarine and Pink Tourmaline, interspersed with seed pearls, add movement and elegance. Antique finish enhances the vintage charm. Nakshi work subtly present around the setting of the stones",
  "colors": [
    "Antique Gold",
    "Green Aquamarine",
    "Pink Tourmaline",
    "White (Polki Diamonds and Seed Pearls)."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and other special occasions. A stunning statement piece for Muhurtham ceremonies",
    "receptions",
    "or even a contemporary cocktail party where you want to showcase heritage with a modern flair."
  ],
  "description": "This Haaram is a true heirloom piece, blending the timeless appeal of Kundan Polki with the delicate beauty of Aquamarine and Tourmaline. The Hyderabadi polish gives it an authentic vintage look, while the contemporary gemstone drops add a touch of modern sophistication. Crafted with exceptional attention to detail and using only the finest materials, this necklace is a testament to superior South Indian craftsmanship. A statement of unparalleled elegance and cultural significance.",
  "tags": [
    "Haaram",
    "Kundan",
    "Polki",
    "Aquamarine",
    "Tourmaline",
    "Seed Pearls",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Antique Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Kante (Telugu)",
    "Kasulaperu"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0005_0414",
  "collection": "diamond"
}