{
  "id": "necklaces-768",
  "title": "Kundan and Emerald Grand Bridal Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality gold plating",
    "this magnificent haar features intricately placed Kundan stones. Adorned with vibrant green emeralds and lustrous South Sea pearls. Exquisite setting with Hyderabadi Polish."
  ],
  "features": "A masterpiece of traditional Indian craftsmanship. The haar showcases a grand design featuring delicate floral motifs and intricate filigree work. The emerald accents add a regal touch, while the pearl drops provide a graceful movement. The pendant is a statement piece with kundan floral design set with central emerald.",
  "colors": [
    "Primarily gold and white (Kundan) with pops of vibrant green (Emeralds) and creamy white (Pearls). A classic South Indian color palette representing prosperity and auspiciousness."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaham/పెళ్లి)",
    "receptions",
    "and other significant celebrations. Ideal for brides seeking to make a statement with traditional yet elegant jewelry. Also suitable for Seemantham (Baby Shower) and other festive events."
  ],
  "description": "This Kundan Haar is a timeless piece of art, blending traditional craftsmanship with modern design sensibilities. The high-quality materials ensure lasting beauty and durability. The emeralds symbolize prosperity and the pearls represent purity, making it a perfect heirloom piece.",
  "tags": [
    "Kundan Haar",
    "Bridal Necklace",
    "South Indian Jewelry",
    "Emerald Necklace",
    "Pearl Necklace",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Vivaham",
    "Kanthabharanam",
    "పెళ్లి",
    "హారం",
    "కుందన్",
    "కంఠాభరణం",
    "Indian Bridal Jewelry",
    "Emerald",
    "South Sea Pearls",
    "Statement Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-07 2_1274",
  "collection": "diamond"
}