{
  "id": "necklaces-1486",
  "title": "The Empress Diamond Haaram with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High Quality Diamonds (VVS Clarity",
    "Excellent Cut)",
    "Natural Emeralds (Round Cut). Features a Hyderabadi Polish for a lasting lustre."
  ],
  "features": "This magnificent Haaram showcases intricate floral motifs encrusted with dazzling diamonds. Central pendants are emphasized by the brilliant pop of Emeralds. The design features graceful teardrop-shaped diamond hangings, and the craftsmanship reflects traditional Telugu artistry with modern refinement. Delicate gold bead accents complete the look.",
  "colors": [
    "Predominantly Gold and Diamond White",
    "punctuated by vibrant Emerald Green."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (Vivahaalu)",
    "Seemantham",
    "and other significant celebrations. A stunning statement piece for bridal wear",
    "it also makes a lasting impression at upscale parties and events."
  ],
  "description": "This is a timeless investment. A statement piece that is not just jewelry, but a heirloom passed down through generations. The brilliant Diamonds are chosen for their superior cut, clarity and carat weight. The Emeralds add an auspicious touch, symbolizing prosperity and new beginnings. The necklace features traditional design with contemporary styling. The diamonds are strategically placed in a pave setting to provide maximum brilliance. Crafted by our artisans, this piece reflects the rich cultural heritage of Andhra Pradesh and Telangana.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kasulaperu",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Fine Jewelry",
    "Statement Necklace",
    "Indian Wedding",
    "Vaddanamu",
    "Bridal Necklace"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-46-45 3_2104",
  "collection": "sjpl"
}