{
  "id": "necklaces-734",
  "title": "Lakshmi Kasu Haaram - Divine Emerald & Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously crafted and finished with Hyderabadi Polish. Adorned with brilliant-cut Diamonds (VS Clarity",
    "G Color) and vibrant Emeralds (natural",
    "round and pear cuts)."
  ],
  "features": "This exquisite Haaram features a cascading design with intricate floral motifs set with diamonds and emeralds. The centerpiece is a grand Lakshmi pendant, depicting the goddess of wealth and prosperity in stunning detail. The pendant showcases Nakshi work and features a temple-inspired design with delicate dangling diamond and emerald clusters. The necklace employs a closed setting for the gemstones to maximize brilliance and protect against wear and tear.",
  "colors": [
    "Gold (22K Yellow)",
    "White (Diamonds)",
    "and Green (Emeralds). The color combination is a classic South Indian palette symbolizing prosperity",
    "purity",
    "and auspicious beginnings."
  ],
  "occasions": [
    "Perfect for traditional South Indian weddings (Muhurtham)",
    "engagement ceremonies (Nischitartham)",
    "half-saree functions (Voni Function)",
    "and other auspicious occasions. Its grand design also makes it suitable for formal events and cultural celebrations."
  ],
  "description": "This Haaram is a testament to exquisite craftsmanship and timeless design. The Lakshmi pendant carries significant cultural and religious value, making it a cherished heirloom piece. The high-quality diamonds and emeralds ensure enduring beauty and value, while the Hyderabadi polish gives the gold a rich, lasting luster. The piece seamlessly blends tradition with modern sensibility, making it a statement piece for the discerning woman.",
  "tags": [
    "Haaram",
    "Necklace",
    "Lakshmi Pendant",
    "Temple Jewelry",
    "South Indian Jewelry",
    "22K Gold",
    "Diamonds",
    "Emeralds",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Muhurtham",
    "Nischitartham",
    "Voni Function",
    "Traditional Jewelry",
    "Nakshi Work",
    "Grand Necklace",
    "Kasu Mala"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-33_1240",
  "collection": "diamond"
}