{
  "id": "earrings-490",
  "title": "Exquisite Polki & Ruby Droplet Earrings - A Touch of Nizam Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold. Features a large Polki diamond with an irregular cut at the top",
    "accented with smaller brilliant-cut diamonds around the frame. A deep red Ruby is centrally placed in a flower-like formation below",
    "surrounded by more brilliant-cut diamonds. Finished with Hyderabadi Polish for a rich luster."
  ],
  "features": "This unique pair of earrings blend traditional Polki diamond craftsmanship with a modern design aesthetic. The Polki diamond is set in a geometric frame, creating a contemporary silhouette. The ruby and diamond cluster adds a touch of traditional South Indian flair, reminiscent of the 'flower motifs' often seen in Temple Jewellery. The settings are meticulously handcrafted, showcasing the skill of our artisans.",
  "colors": [
    "The primary colors are a rich yellow gold",
    "complemented by the translucent shimmer of the Polki diamond",
    "the fiery red of the ruby",
    "and the dazzling white of the smaller diamonds. This combination evokes warmth and opulence."
  ],
  "occasions": [
    "Perfect for special occasions",
    "weddings (vaduve)",
    "receptions",
    "and grand celebrations. These earrings will also add a touch of regal charm to more modern events and evening wear."
  ],
  "description": "This piece is a rare blend of heritage and contemporary design. The use of Polki diamonds, a signature of Mughal and Nizam jewelry, adds significant cultural value. The meticulous craftsmanship and high-quality gemstones ensure both lasting beauty and a valuable investment. Owning these earrings is owning a piece of Hyderabadi history.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Polki",
    "Ruby",
    "Diamond",
    "Gold",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Vaduve",
    "Nizam Style",
    "Contemporary Jewelry",
    "Indian Jewellery",
    "Gemstones",
    "Handcrafted",
    "Traditional",
    "Modern",
    "Bridal Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1582_2616",
  "collection": "ear"
}