{
  "id": "earrings-197",
  "title": "Vaishnavi Polki Diamond Jhumka - Timeless Elegance for the Modern Bride",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Antique Finish",
    "Polki Diamonds (Uncut Diamonds) of varying sizes",
    "Superior Clarity and Luster. Features Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "Exquisitely handcrafted Jhumka featuring a teardrop floral design embellished with Polki diamonds. The tiered design showcases traditional South Indian craftsmanship (nakshi work inspired). The pear-shaped Polki drops add a graceful movement. The setting style ensures maximum light reflection, enhancing the sparkle of the diamonds. Intricate gold filigree work provides a rich, textural contrast.",
  "colors": [
    "Warm gold with the mesmerizing sparkle of colorless Polki diamonds. The antique finish adds depth and character to the piece."
  ],
  "occasions": [
    "Perfect for traditional South Indian weddings (vivaha)",
    "engagement ceremonies (nischitartham)",
    "festive celebrations (panduga)",
    "and grand receptions. Also suitable for adding a touch of regal elegance to formal events."
  ],
  "description": "Authentic South Indian design reflecting rich cultural heritage. Exceptional quality Polki diamonds sourced for their brilliance and clarity. Meticulous craftsmanship ensures durability and lasting beauty. A statement piece that exudes timeless elegance and makes a memorable heirloom. Hyderabadi polish ensures a radiant and enduring shine.",
  "tags": [
    "Jhumka",
    "Kammalu",
    "Polki Diamonds",
    "Uncut Diamonds",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Wedding Earrings",
    "Indian Earrings",
    "Gold Earrings",
    "Antique Finish",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Traditional Jewelry",
    "Vivaha",
    "Nischitartham",
    "Panduga",
    "Heirloom Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0027_0435",
  "collection": "diamond"
}