{
  "id": "earrings-207",
  "title": "Crimson Radiance Earrings - Ruby & Polki Diamond Chandbali",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "High-Quality Ruby Cabochon",
    "Uncut Polki Diamonds (approx. 0.75ct total weight)",
    "Hyderabadi Polish"
  ],
  "features": "A modern take on the classic Chandbali style. Features a striking oval-cut ruby cabochon suspended within a square geometric frame adorned with dazzling Polki diamonds. The ear stud showcases a round Polki diamond within a gold halo, adding a touch of regal elegance. The contemporary design creates a bold and modern statement.",
  "colors": [
    "Crimson red ruby",
    "warm gold",
    "and sparkling white Polki diamonds create a vibrant and luxurious color palette."
  ],
  "occasions": [
    "Perfect for modern celebrations",
    "cocktail parties",
    "evening galas",
    "or adding a touch of South Indian glamour to a contemporary outfit. Suitable for festive occasions and special events. Also a beautiful gift for anniversaries or birthdays."
  ],
  "description": "A harmonious blend of tradition and modernity. The captivating ruby cabochon and shimmering Polki diamonds showcase exceptional craftsmanship. The Hyderabadi polish provides a lustrous finish, enhancing the jewelry's overall appeal. These earrings are lightweight and comfortable to wear, making them perfect for all-day elegance. The geometric design adds a touch of contemporary sophistication, making them a statement piece for the modern woman.",
  "tags": [
    "Earrings",
    "Chandbali",
    "Buggalu",
    "Ruby",
    "Polki Diamonds",
    "Uncut Diamonds",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Geometric Jewelry",
    "Indian Jewelry",
    "Festive Jewelry",
    "Gift",
    "Anniversary",
    "Modern"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0055_0463",
  "collection": "diamond"
}