{
  "id": "earrings-094",
  "title": "Swarna Mandala Kammalu: Diamond & Gemstone Stud Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Swarnam)",
    "Brilliant Cut Diamonds",
    "High-Quality Rubies (Ratnalu)",
    "Emeralds (Pachalu). Features a lustrous Hyderabadi polish for a rich",
    "lasting shine."
  ],
  "features": "Intricately designed circular studs reminiscent of traditional mandala art. The open filigree design allows light to beautifully reflect off the diamonds. A central ruby is surrounded by emeralds, creating a vibrant focal point. The diamonds are set in a pave style, maximizing their brilliance. The back features a sturdy screw-back closure for secure wear.",
  "colors": [
    "Gold (Swarnam) with vibrant Red (Ruby)",
    "Green (Emerald)",
    "and sparkling White (Diamonds). A classic South Indian color palette symbolizing prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "festivals (Pandugalu)",
    "or any special occasion where you want to make a statement. These earrings would also be stunning for a cocktail party or elegant evening event. Can be worn to auspicious occasions like poojas",
    "engagements or Arangetram celebrations."
  ],
  "description": "These earrings are a true work of art, showcasing exceptional craftsmanship and the finest quality gemstones. The mandala design is both beautiful and symbolic, representing harmony and balance. The Hyderabadi polish ensures a luxurious shine that will last for generations. A perfect blend of tradition and modern elegance, these earrings are sure to become a treasured heirloom.",
  "tags": [
    "Earrings",
    "Kammalu",
    "Studs",
    "Gold",
    "22K",
    "Diamonds",
    "Rubies",
    "Emeralds",
    "Hyderabadi",
    "South Indian Jewelry",
    "Traditional",
    "Mandala",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Vivaaham",
    "Pandugalu",
    "Ratnalu",
    "Pachalu",
    "Swarnam"
  ],
  "original_id": "diamond_jewellery_c6adeece-1a78-46f7-8e56-b4b4f2165f73_0193",
  "collection": "diamond"
}