{
  "id": "necklaces-1582",
  "title": "Exquisite Diamond and Emerald Floral Cascade Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality white gold",
    "adorned with dazzling brilliant-cut diamonds and vibrant oval-cut emeralds. Features meticulously selected diamonds with exceptional clarity and fire. Gross Weight: 105.220(Fg)",
    "Diamond Weight: 2.16(82) carats"
  ],
  "features": "This breathtaking necklace showcases a modern floral cascade design, featuring delicate diamond-encrusted floral motifs interspersed with captivating oval-cut emeralds. Each element is carefully set to maximize sparkle and create a stunning visual impact. The flexible links ensure comfortable wear while maintaining the necklace's exquisite form. The overall design blends contemporary aesthetics with timeless elegance, resembling a contemporary 'Addigai' in its close-fitting style.",
  "colors": [
    "Primarily white (diamonds) and green (emeralds)",
    "creating a striking contrast and a refreshing",
    "sophisticated look. The white gold complements the brilliance of the diamonds and enhances the emerald's rich color."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (vivaaham)",
    "receptions",
    "anniversaries",
    "and high-profile social events. Its contemporary design makes it equally suitable for formal galas and upscale gatherings",
    "adding a touch of regal elegance to any ensemble."
  ],
  "description": "This necklace is a statement piece that exudes luxury and sophistication. The combination of high-quality diamonds and vibrant emeralds creates a truly captivating effect. Its unique design blends traditional South Indian aesthetics with a contemporary flair, making it a versatile addition to any jewelry collection. This is a timeless treasure you'll cherish for generations.",
  "tags": [
    "Diamond Necklace",
    "Emerald Necklace",
    "Haaram",
    "Addigai",
    "White Gold",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Vivaaham",
    "Contemporary Design",
    "Floral Necklace",
    "Indian Jewelry",
    "Statement Necklace",
    "luxury jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-46 2_2287",
  "collection": "sjpl"
}