{
  "id": "necklaces-449",
  "title": "Exquisite Diamond Floral Haaram with Emerald Centerpiece & South Sea Pearl Drop",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (4.07 gms of Diamonds)",
    "set with meticulously chosen Diamonds (SI Clarity",
    "G-H Color). Features a captivating Emerald (1.08cts) and lustrous South Sea Pearl (10.00cts)."
  ],
  "features": "This two-tier Haaram showcases a delicate floral motif throughout, expertly crafted with prong-set diamonds to maximize brilliance. The centerpiece features a vibrant Emerald, surrounded by diamond petals, leading to a graceful South Sea Pearl drop. The 'flower' locket weights 0.662 gms, contains 1.38 ct ruby, 1.08ct eme, and 3.95ct moti.",
  "colors": [
    "Predominantly white (diamonds) and gold",
    "with a striking contrast provided by the vibrant green emerald and the soft pearl luminescence. The golden hue accentuates the brilliance of the diamonds and emerald."
  ],
  "occasions": [
    "Perfect for weddings (pellilu)",
    "receptions",
    "and other special occasions. An ideal choice for muhurtham or a grand function. Also suitable for elegant evening events where you want to make a sophisticated statement."
  ],
  "description": "This Haaram is a stunning fusion of traditional design and modern aesthetics. The meticulously set diamonds create a breathtaking sparkle, while the emerald and pearl add a touch of timeless elegance. A testament to fine craftsmanship and enduring style, this piece is sure to become a treasured heirloom.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Emerald Jewelry",
    "Pearl Pendant",
    "South Sea Pearl",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Bridal Necklace",
    "కంఠాభరణం",
    "Hyderabad Jewelry",
    "Floral Design",
    "Fine Jewelry",
    "Reception Jewelry",
    "Grand Function Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-48 2_0912",
  "collection": "diamond"
}