{
  "id": "necklaces-102",
  "title": "Rani Haar Necklace - Polki Diamond & Ruby Chandrika",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Uncut Polki Diamonds (Kundan Setting)",
    "Natural Rubies",
    "Freshwater Pearls. Features traditional Hyderabadi polish for lasting luster."
  ],
  "features": "A breathtaking Chandrika-inspired necklace featuring a floral Polki diamond base with triangular ruby accents. Delicate freshwater pearl and pink bead drops add movement and grace. The intricate Kundan setting showcases the raw beauty of the Polki diamonds. The design echoes traditional Kasu Mala elements while adopting a modern, lightweight construction.",
  "colors": [
    "Gold",
    "Pink",
    "White",
    "and Diamond White (from the Polki). A harmonious blend of traditional auspicious colors."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "engagements",
    "Seemantham (baby shower)",
    "and other grand celebrations. A statement piece for the modern bride or for those looking to add a touch of heritage to their ensemble."
  ],
  "description": "A rare fusion of traditional South Indian design with contemporary sensibility. The use of uncut Polki diamonds gives it an antique charm, while the ruby and pearl accents add a touch of modern elegance. Handcrafted by skilled artisans from Hyderabad, ensuring exceptional quality and lasting value. A timeless heirloom to be cherished for generations.",
  "tags": [
    "Necklace",
    "Haaram",
    "Chandrika",
    "Kasu Mala",
    "Polki Diamonds",
    "Kundan Jewelry",
    "Ruby",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Seemantham",
    "Pink Beads",
    "Gold Necklace",
    "22K Gold",
    "Traditional Jewelry",
    "Rani Haar",
    "Antique Jewelry"
  ],
  "original_id": "diamond_jewellery_DPNK8-1179_0335",
  "collection": "diamond"
}