{
  "id": "necklaces-467",
  "title": "Royal Emerald and Diamond Nakshi Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features a stunning 5.86 carat Emerald center stone and 8.21 carats of brilliant-cut Rubies meticulously set amidst numerous sparkling diamonds. Total gross weight: 75.640 grams",
    "Diamond weight: 8.78 carats."
  ],
  "features": "This exquisite Haaram showcases intricate Nakshi work, a traditional South Indian engraving technique. The design features delicate floral motifs and swirling patterns, creating a sense of opulence and grandeur. It is further enhanced by meticulously placed ruby accents that highlight the emerald center stone. Diamond setting is Pave, allowing maxium light to reach each stone. The necklace concludes with elegant gold bead drops.",
  "colors": [
    "Primarily gold with the vibrant green of the emerald and the fiery red of the rubies. The diamonds add a brilliant white sparkle."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "weddings (Muhurtham)",
    "grand celebrations",
    "Seemantham ceremonies",
    "and significant family gatherings. Its timeless elegance makes it suitable for both traditional and contemporary ensembles."
  ],
  "description": "This Haaram is a testament to exquisite South Indian craftsmanship. The combination of the finest quality emerald, rubies, and diamonds set in 22K gold makes it a valuable heirloom piece. The Nakshi detailing and Hyderabadi polish add a touch of traditional elegance, while the design's overall sophistication ensures it remains a cherished treasure for generations. A true symbol of prosperity and good fortune, embodying the cultural richness of Hyderabad.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Emerald",
    "Ruby",
    "Diamonds",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Kantaabharanam",
    "కంఠాభరణం",
    "Muhurtham",
    "Wedding Jewelry",
    "Indian Jewellery",
    "Heirloom Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-54 3_0930",
  "collection": "diamond"
}