{
  "id": "necklaces-024",
  "title": "Chandrika Diamond Bridal Set: Haaram & Jhumka Symphony",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Crafted in 18K Gold with Hyderabadi Polish. Features brilliant-cut GH/SI diamonds. Necklace uses a combination of rose gold and white gold accents",
    "while earrings are rose gold."
  ],
  "features": "Intricately designed Haaram necklace featuring a cascading diamond floral pattern and a central oval motif. Elaborate, multi-tiered Jhumka earrings echo the necklace's floral design, featuring delicate filigree and diamond embellishments throughout. The openwork design adds a lightness to the pieces, making them comfortable to wear. The design reflects traditional Hyderabadi craftsmanship with a modern touch.",
  "colors": [
    "Primarily gold (rose gold and white gold)",
    "with the sparkle of white diamonds creating a stunning contrast."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "Seemantham (baby shower)",
    "grand celebrations",
    "and any occasion where you want to make a statement. Its timeless design also makes it suitable for modern formal events."
  ],
  "description": "This diamond jewelry set blends traditional South Indian artistry with modern design aesthetics. The Hyderabadi polish enhances the gold's luster, while the high-quality diamonds offer exceptional brilliance. The intricate floral design symbolizes prosperity and joy, making it an ideal bridal heirloom. The set offers excellent craftsmanship and durability, ensuring it will be cherished for generations.",
  "tags": [
    "Diamond Haaram",
    "Diamond Jhumkas",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "Diamond Necklace",
    "Indian Wedding",
    "Muhurtham",
    "Seemantham",
    "Gold Jhumkas",
    "Contemporary Jewelry",
    "Floral Design",
    "filigree",
    "openwork"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0030_0059",
  "collection": "choker"
}