{
  "id": "bangles-276",
  "title": "Emerald and Polki Diamond Kada - \"Paccha Manikyam Kadiyam\"",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Zambian Emeralds (Cabochon Cut)",
    "Uncut Polki Diamonds",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Kada features alternating Emerald and Polki diamond settings in a traditional South Indian design. The Emeralds are meticulously chosen for their vibrant green color and are smoothly cabochon cut. The Polki diamonds, each unique in their natural form, are carefully set in a closed setting, enhancing their brilliance. Delicate filigree work accents the spaces between the gemstones. The 'Hyderabadi Polish' gives the gold a rich, lustrous finish.",
  "colors": [
    "Emerald Green",
    "Golden Yellow (Gold)",
    "and White (Polki Diamonds)"
  ],
  "occasions": [
    "Ideal for weddings",
    "bridal showers",
    "Seemantham (baby shower)",
    "Half-Saree Functions (Langa Voni Celebrations)",
    "and other auspicious occasions. Can also be worn as a statement piece for modern events and festive gatherings."
  ],
  "description": "This Kada is a timeless investment piece, blending traditional South Indian craftsmanship with the natural beauty of Emeralds and Polki diamonds. The use of high-purity gold and natural gemstones ensures lasting value and enduring elegance. The unique design and vibrant colors make it a perfect heirloom piece to be passed down through generations. The 'Paccha Manikyam Kadiyam' symbolizes prosperity, good fortune, and enduring love.",
  "tags": [
    "Kada",
    "Bracelet",
    "Emerald",
    "Polki Diamond",
    "Uncut Diamond",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Paccha Manikyam",
    "Kadiyam",
    "Gold",
    "22K Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Half Saree",
    "Langa Voni"
  ],
  "original_id": "radhe_diam_DPBG8-1456_2442",
  "collection": "radhe"
}