{
  "id": "necklaces-478",
  "title": "Apoorva Kanakaratna Haar: Exquisite Diamond, Ruby, Emerald, and Pearl Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "featuring brilliant-cut diamonds (clarity VVS-VS",
    "color G-H)",
    "ethically sourced Burmese Rubies (3.68ct total",
    "2 stones)",
    "Zambian Emeralds (5.90ct total",
    "5 stones)",
    "and lustrous South Sea Pearls (43.70ct total",
    "16 beads). The necklace boasts a fine Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "This magnificent Haaram features an intricate diamond-studded design interspersed with square-cut Emeralds and oval-cut Rubies. The lower portion of the necklace is adorned with delicate pearl drops, adding a touch of classic elegance. The central pendant echoes the floral motif with larger Rubies and Emeralds, encased in a diamond halo. Classic floral and paisley motifs are delicately woven into the design. The setting is predominantly prong and pave, maximizing the sparkle of the diamonds. Note the detailed filigree work around the gemstone settings.",
  "colors": [
    "Primarily gold with dazzling white diamonds",
    "vibrant green Emeralds",
    "deep red Rubies",
    "and creamy white pearls. This combination reflects traditional South Indian aesthetics."
  ],
  "occasions": [
    "Perfect for bridal wear (పెళ్లి)",
    "traditional ceremonies like Seemantham (సీమంతం)",
    "Upanayanam",
    "or grand celebrations. Equally stunning for high-end gala events and milestone anniversaries."
  ],
  "description": "This Haaram is a masterpiece of South Indian craftsmanship, blending traditional design elements with modern elegance. The use of high-quality gemstones and meticulous detailing makes it a valuable heirloom piece. Its versatile design allows it to be paired with both traditional and contemporary outfits, enhancing its investment appeal and long-term value. The necklace's substantial gold weight and diamond carat ensure enduring value.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Kanakaratna",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "పెళ్లి నగలు",
    "కంఠహారము",
    "ముత్యాల హారం"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-58 2_0941",
  "collection": "diamond"
}