{
  "id": "necklaces-1545",
  "title": "Magnificent Diamond Emerald Moti Haaram - An Imperial Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (G.wt: 199.440)",
    "Brilliant Cut Diamonds (D.wt: 21.87 ct)",
    "Emerald (Eme: 2.81 ct)",
    "South Sea Pearls (Moti: 49.82 ct)"
  ],
  "features": "Intricately handcrafted Haaram featuring a cascading design with delicate diamond-studded floral motifs. The central pendant is adorned with a vibrant green emerald, exuding royalty. Thirteen lustrous South Sea Pearls dangle gracefully, adding a touch of ethereal beauty. Features elaborate filigree work, a hallmark of traditional Hyderabadi craftsmanship.",
  "colors": [
    "Predominantly gold and white (diamonds) with a striking pop of green from the emerald. The pearls offer a soft",
    "creamy luminescence."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha Mahotsavam)",
    "receptions",
    "Seemantham ceremonies",
    "and other significant family events. A timeless heirloom for future generations."
  ],
  "description": "A true masterpiece of South Indian jewelry craftsmanship. The exquisite combination of diamonds, emerald, and South Sea pearls creates a mesmerizing effect. This Haaram is a symbol of opulence, tradition, and timeless elegance, making it a prized possession for any discerning collector. It also has a rare emerald gemstone that enhances the beauty of the Haaram. This is a unique and statement piece that makes you the center of attraction in all events.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Antique Finish",
    "Temple Jewelry",
    "Vivaha Mahotsavam",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Moti",
    "Vaddanam"
  ],
  "original_id": "sjpl_PHOTO-2024-05-24-13-54-20 2_2190",
  "collection": "sjpl"
}