{
  "id": "necklaces-735",
  "title": "Exquisite Mango Mala Haaram with Emerald Pendants",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "High-Quality Cubic Zirconia (CZ) Stones",
    "Emerald Green Cabochons. Featuring a signature Hyderabadi Polish for enduring luster."
  ],
  "features": "A classic Mango Mala design, meticulously crafted with intricate filigree work and studded with sparkling CZ stones. Features two detachable pendants, each centered with a vibrant emerald green cabochon. The mango motifs, or 'paisley' as they are sometimes called, are set in a unique closed setting to maximize brilliance. Traditional 'Lakshmi Kasu' detailing can be added upon request for an additional charge to enhance its auspiciousness.",
  "colors": [
    "Dominantly gold with dazzling white CZ stones",
    "accented by the rich green of the emeralds. This combination is revered as auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for weddings",
    "bridal wear",
    "Seemantham (baby shower)",
    "half-saree functions",
    "and other grand celebrations. Its timeless design also makes it a treasured heirloom for future generations."
  ],
  "description": "This Haaram is a testament to superior craftsmanship and classic South Indian design. The combination of 22K gold, brilliant CZ stones, and genuine emeralds creates a breathtaking effect. The unique closed stone setting enhances the sparkle of the CZ's. It embodies traditional values and adds a touch of regal elegance to any ensemble.",
  "tags": [
    "Haaram",
    "Mango Mala",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "22K Gold",
    "CZ Stones",
    "Emerald",
    "Traditional Jewelry",
    "Telangana",
    "Andhra Pradesh",
    "Hyderabadi Jewelry",
    "Kasulaperu",
    "Gundla Mala",
    "Mogapu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-34 2_1241",
  "collection": "diamond"
}