{
  "id": "bangles-229",
  "title": "Aarya: Exquisite Emerald & Diamond Filigree Vanki Bangles",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold (916 Gold)",
    "Natural Emeralds (Oval Cut",
    "SI Clarity)",
    "Polished Diamonds (Single Cut",
    "GH Color). Features Hyderabadi Polish for enduring brilliance."
  ],
  "features": "Intricate filigree design showcasing floral motifs, accented with vibrant Emeralds and sparkling diamonds. Classic 'Vanki' style bangle, symbolizing protection and prosperity. The delicate openwork allows the gemstones to capture light beautifully. Features a secure hinged clasp for comfortable wear.",
  "colors": [
    "Rich Gold with Emerald Green and Diamond White accents. A traditional South Indian color palette exuding regal elegance."
  ],
  "occasions": [
    "Ideal for traditional South Indian weddings (Vivaha)",
    "Seemantham ceremonies",
    "housewarmings (Gruhapravesam)",
    "and festive occasions like Diwali and Sankranthi. Also a stunning statement piece for upscale gatherings and celebrations."
  ],
  "description": "A timeless heirloom piece crafted with exceptional artistry. The Vanki design holds deep cultural significance in South India, symbolizing prosperity and well-being. The combination of Emeralds and Diamonds elevates the design, creating a luxurious and eye-catching bangle. The durable 22K gold and secure clasp ensure lasting beauty and wearability. Own a piece of Hyderabad's rich jewelry heritage with this stunning creation.",
  "tags": [
    "Vanki",
    "Kadiyam",
    "Bangles",
    "22K Gold",
    "Emerald",
    "Diamonds",
    "Filigree",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Seemantham",
    "Telugu Jewelry",
    "Heirloom Jewelry",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241219-WA0015_0795",
  "collection": "diamond"
}