{
  "id": "bangles-143",
  "title": "The \"Manikyam Kangan\": Exquisite Ruby and Diamond Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold with Hyderabadi Polish; Oval-cut Ruby (approx. 3 carats)",
    "Brilliant-cut Diamonds (GH Color",
    "VS Clarity - approx. 2.5 carats total weight)"
  ],
  "features": "Intricate filigree (jali) work surrounding the central ruby; meticulously handcrafted floral and vine motifs embellished with diamonds; secure pressure-fit opening mechanism integrated into the design for comfortable wear and secure fastening. This bangle beautifully blends traditional Indian aesthetics with a modern open-bangle design.",
  "colors": [
    "Warm yellow gold complements the vibrant red ruby and the sparkling white diamonds",
    "creating a rich and regal color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festive celebrations like Diwali and Sankranthi",
    "special family gatherings",
    "and as a treasured heirloom for future generations. Its timeless elegance makes it also suitable for contemporary high-profile events."
  ],
  "description": "This bangle is a testament to exquisite craftsmanship and timeless design. The Hyderabadi polish gives the gold a lustrous finish, enhancing its richness. The combination of rubies and diamonds symbolizes prosperity, love, and commitment, making it a meaningful and cherished piece. The openable design ensures comfort and ease of wear, while the secure locking mechanism provides peace of mind.",
  "tags": [
    "Bangle",
    "Kada",
    "Ruby",
    "Manikyam",
    "Diamond",
    "Vairaalu",
    "Gold",
    "Bangaru",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Filigree",
    "Jali",
    "Open Bangle",
    "Fine Jewelry",
    "Heirloom Jewelry",
    "Sankranthi",
    "Diwali",
    "Indian Jewelry",
    "Modern Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0413_0610",
  "collection": "diamond"
}