{
  "id": "necklaces-287",
  "title": "Exquisite Nakshi Work Kasu Mala Haaram with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Faceted White CZ Diamonds",
    "Oval Cut Ruby",
    "Pear Cut Emerald",
    "Synthetic Pearls. Handcrafted with Hyderabadi Polish for a lasting luster."
  ],
  "features": "Intricate Nakshi work pendant featuring floral and paisley motifs. The pendant is framed by a double row of sparkling CZ diamonds. Delicate pearl drops adorn the lower edge of the pendant and the necklace chain. The multi-strand chain features interwoven gold links embedded with CZ diamonds, reminiscent of vintage Telugu jewelry.",
  "colors": [
    "Gold (Antique Finish)",
    "White (CZ Diamonds)",
    "Red (Ruby)",
    "Green (Emerald)",
    "Cream (Pearls). Traditional and auspicious color palette often seen in South Indian weddings."
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "engagements",
    "Seemantham (baby shower)",
    "half-saree functions",
    "and other grand celebrations. Also suitable for upscale social gatherings and cultural events."
  ],
  "description": "This Haaram is a testament to the timeless beauty of South Indian jewelry craftsmanship. The intricate Nakshi work, the brilliance of the CZ diamonds, and the vibrant Ruby and Emerald create a stunning statement piece. Its heirloom quality ensures it will be cherished for generations. Features the richness of tradition and the brilliance of modern design.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Nakshi Work",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "22K Gold",
    "Ruby",
    "Emerald",
    "CZ Diamonds",
    "Hyderabad Jewelry",
    "కంఠాభరణం",
    "హారం",
    "దక్షిణ భారత ఆభరణాలు",
    "పెళ్లి నెక్లెస్",
    "సాంప్రదాయ ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0375_0572",
  "collection": "diamond"
}