{
  "id": "necklaces-738",
  "title": "Anagha Emerald & Diamond Bridal Haaram: A Timeless Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Emeralds (Panche Panna) with excellent clarity and vibrant green color",
    "meticulously set with sparkling",
    "brilliant-cut diamonds. Features our signature Hyderabadi polish for a rich",
    "lasting luster."
  ],
  "features": "This exquisite Haaram showcases a classic South Indian floral design, culminating in a stunning peacock pendant. The entire piece is meticulously handcrafted with intricate filigree work, accented by delicate diamond settings around each emerald. The pendant incorporates traditional 'kasu' detailing with subtle gemstone accents, creating depth and dimension. Features a cascading design element which includes tear-drop elements that are decorated with emeralds and diamonds as well.",
  "colors": [
    "Predominantly gold with vibrant green emeralds and the dazzling brilliance of white diamonds."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli Utshavam)",
    "engagements (Nischitartham)",
    "Seemantham",
    "or any grand celebration where you want to make an unforgettable statement. Also suitable for high-profile events and festive occasions such as Ugadi and Sankranthi."
  ],
  "description": "This Anagha Haaram is a true masterpiece of South Indian craftsmanship. The combination of high-quality emeralds and brilliant-cut diamonds creates a captivating sparkle. Its traditional design makes it a timeless heirloom, perfect for passing down through generations. The Hyderabadi polish ensures a long-lasting and luxurious finish. Symbolizes prosperity, good fortune, and eternal love.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Pelli Utshavam",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "कंठाभरणं",
    "Panche Panna",
    "Filigree",
    "Peacock Pendant",
    "Wedding Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-35 2_1244",
  "collection": "diamond"
}