{
  "id": "necklaces-903",
  "title": "Lakshmi Kasu Haaram with Temple Jhumka Pendants - A Divine Adornment",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Cubic Zirconia (CZ)",
    "Emeralds",
    "Rubies",
    "Cultured Pearls. Features a fine Hyderabadi Polish for a lasting sheen."
  ],
  "features": "A classic Kasu Haaram design reimagined with modern elegance. Showcases intricate Lakshmi coin detailing, meticulously crafted Temple Jhumka pendants, and alternating Emerald and CZ accents. Features a central pendant with Goddess Lakshmi seated on a lotus, embellished with delicate filigree work. The peacock design on the bottom enhances its cultural charm.",
  "colors": [
    "Gold (yellow gold)",
    "Emerald (green)",
    "Ruby (red)",
    "White (CZ)",
    "Pearl (golden-hued)."
  ],
  "occasions": [
    "Perfect for weddings (vivah)",
    "engagements",
    "religious ceremonies (poojas)",
    "and significant family functions (seemantham",
    "half-saree function). A statement piece for the modern woman who appreciates timeless tradition."
  ],
  "description": "This exquisite Kasu Haaram is a testament to traditional South Indian craftsmanship with a contemporary twist. The combination of Lakshmi coins, sparkling CZ stones, vibrant Emeralds and the lustrous pearls creates a piece that is both opulent and meaningful. The Goddess Lakshmi motif symbolizes prosperity and good fortune, making it an auspicious addition to your jewelry collection. The Hyderabadi polish ensures a lasting brilliance, making it an heirloom piece for generations.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Lakshmi",
    "Temple Jewelry",
    "Jhumka",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "CZ Jewelry",
    "Emeralds",
    "Pearls",
    "Gold",
    "Vaddanam",
    "Addigai"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0297_2364",
  "collection": "necklace"
}