{
  "id": "necklaces-837",
  "title": "The Vasundhara Pendant: Polki Diamond and Gemstone Divine Adornment",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold with Hyderabadi Polish. Set with Polki Diamonds (uncut diamonds) of varying cuts",
    "showcasing natural inclusions. Accented with fine-quality cabochon Emeralds and natural Coral beads."
  ],
  "features": "Inspired by traditional Telugu temple architecture. The pendant features a floral-motif center design meticulously set with Polki diamonds in a closed setting, creating a vintage allure. Dangles of emeralds and coral add a pop of color. Handmade by skilled artisans using the age-old Kundan technique. The antique finish gives the piece a timeless appeal, reminiscent of heritage jewelry.",
  "colors": [
    "Primarily gold with a warm",
    "antique sheen. The Polki diamonds are predominantly colorless",
    "offering subtle sparkle. The emeralds provide a rich green hue",
    "complemented by the vibrant orange-red of the coral beads. The combination creates a traditional South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (vadhuvu)",
    "festivals (pandugalu)",
    "traditional ceremonies like Seemantham",
    "half-saree function (Pavada Dhaavani)",
    "and grand celebrations. Also suitable as a statement piece for cultural events or to elevate modern attire with a touch of tradition."
  ],
  "description": "A unique fusion of tradition and elegance, handcrafted by master artisans in Hyderabad. The use of Polki diamonds, emeralds, and coral offers a vibrant contrast and showcases exceptional craftsmanship. This pendant holds significant cultural value and symbolizes prosperity and good fortune. The antique finish adds a touch of history and makes it a timeless heirloom piece. The piece boasts intricate details and robust construction ensures durability.",
  "tags": [
    "Polki Diamond",
    "Pendant",
    "Antique Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kundan",
    "Emerald",
    "Coral",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Vadhuvu",
    "Pandugalu",
    "Seemantham",
    "Heirloom Jewelry",
    "Temple Jewelry",
    "Nakshi",
    "Half-Saree Function",
    "Pavada Dhaavani"
  ],
  "original_id": "ear_rings_DPER8-1661_2637",
  "collection": "ear"
}