{
  "id": "necklaces-131",
  "title": "The 'Neelambari' Polki Kundan Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Blue Sapphires",
    "Pink Sapphire",
    "Freshwater Pearls",
    "Green Tourmaline. Features Hyderabadi 'Gundla' setting technique."
  ],
  "features": "This exquisite 'Neelambari' Haaram showcases the regal beauty of Polki diamonds meticulously set in 22K gold using the traditional Kundan technique. The necklace features a central row of antique-finish Polki diamond squares, interspersed with clusters of delicate freshwater pearls and teardrop-shaped green tourmalines. Three prominent gemstones grace the piece: two oval-cut blue sapphires flanking a round, cabochon pink sapphire. The pendant showcases a grand, teardrop-shaped blue sapphire surrounded by Polki diamonds, creating a stunning focal point. Small freshwater pearls and green tourmalines are suspended from the pendant to add a touch of ethereal beauty.",
  "colors": [
    "Antique Gold",
    "White (Polki Diamonds & Pearls)",
    "Blue (Sapphires)",
    "Pink (Sapphire)",
    "Green (Tourmaline)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "receptions",
    "engagement ceremonies",
    "and significant celebrations. Ideal for wearing with traditional silk sarees like Kanjeevaram or Gadwal. Suitable for modern cocktail events where a touch of heritage is desired."
  ],
  "description": "A magnificent blend of traditional Hyderabadi craftsmanship and exquisite gemstones. The 'Neelambari' Haaram is a statement piece that exudes elegance and cultural richness. The use of uncut Polki diamonds ensures a unique sparkle and highlights the natural beauty of each stone. The combination of sapphires, tourmalines, and pearls adds depth and sophistication. A timeless heirloom piece to be cherished for generations.",
  "tags": [
    "Kundan Necklace",
    "Polki Diamonds",
    "Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Necklace",
    "Wedding Jewelry",
    "Sapphire Necklace",
    "Antique Jewelry",
    "Indian Bridal Jewelry",
    "Gundla",
    "Vivaha Mahotsavam",
    "Neelam",
    "Muktalu",
    "Pachalu"
  ],
  "original_id": "diamond_jewellery_DPNK8-1787_0364",
  "collection": "diamond"
}