{
  "id": "necklaces-1232",
  "title": "The Emerald Empress: Diamond and Emerald Grand Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 12.45 DWT/1187 Units)",
    "Premium Quality Diamonds (approximately 2.56 DWT/212 Units on Locket)",
    "Oval-Cut Emeralds (approximately 3.97 carats/2 stones on necklace",
    "and 3.30 carats/1 stone on the locket) and Rubies (approximately 5.64 carats/2 stones on necklace",
    "and 4.65 carats/1 stone on the locket). Features a radiant Hyderabadi Polish."
  ],
  "features": "This magnificent Haaram showcases intricate filigree work embedded with dazzling diamonds, surrounding the center emerald. The contemporary pendant features a bold oval emerald, surrounded by delicate diamond detailing. Classic South Indian design elements are visible in the pendant's floral motifs and the necklace's cascading golden drops (gutta pusalu inspired).",
  "colors": [
    "Radiant Yellow Gold",
    "Brilliant White Diamonds",
    "Lush Green Emeralds",
    "and Deep Red Rubies - a classic South Indian color palette that exudes opulence."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (vivahaalu)",
    "engagements (nischitartham)",
    "Seemantham",
    "or any event where you want to make a statement. Also suitable for contemporary celebrations where a touch of tradition is desired."
  ],
  "description": "This Haaram embodies the perfect blend of traditional Telugu craftsmanship and contemporary design. The high-quality diamonds and vivid emeralds offer exceptional brilliance, while the Hyderabadi polish ensures a lasting shine. A timeless piece that is sure to become a cherished heirloom, representing wealth, prosperity, and timeless elegance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Indian Jewelry",
    "Fine Jewelry",
    "Gold Necklace",
    "Emerald Haaram",
    "Diamond Haaram",
    "Traditional Jewelry",
    "Grand Necklace"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-57 2_1806",
  "collection": "sjpl"
}