{
  "id": "necklaces-891",
  "title": "Lakshmi Kasula Haaram - Ruby & Emerald Peacock Pendant Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximate)",
    "High-quality Cubic Zirconia (CZ)",
    "Faceted Ruby (Square Cut)",
    "Faceted Emerald (Pear & Round Cut). Meticulously handcrafted with Hyderabadi Kundan setting."
  ],
  "features": "This exquisite short Haaram features a delicate chain design adorned with CZ stones, leading to a stunning pendant. The pendant showcases a traditional South Indian peacock (Mayura) design, embellished with a vibrant ruby at the center and emeralds accentuating the peacock's form. The design incorporates intricate filigree work and delicate gold bead hangings (gundla) for added charm.",
  "colors": [
    "Predominantly gold with a warm",
    "antique finish. Features vibrant pops of red (ruby) and green (emerald)",
    "creating a striking contrast. The CZ stones add a dazzling white sparkle."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements",
    "temple visits",
    "festivals (like Diwali and Sankranti)",
    "and other auspicious occasions. An ideal choice for brides or anyone looking to add a touch of traditional elegance to their attire. Suitable for Seemantham ceremonies or as a memorable gift."
  ],
  "description": "This Lakshmi Kasula Haaram embodies the rich cultural heritage of South Indian jewelry design. The intricate peacock motif symbolizes beauty, prosperity, and good fortune. The use of high-quality CZ stones provides a brilliant sparkle at an accessible price point, while the ruby and emerald accents add a touch of royalty. Its short length makes it a versatile piece that can be paired with both traditional and modern outfits.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Kasula",
    "Lakshmi",
    "Peacock",
    "Mayura",
    "Ruby",
    "Emerald",
    "CZ",
    "Kundan",
    "Hyderabadi",
    "Wedding Jewelry",
    "Traditional",
    "Bridal",
    "Seemantham",
    "Engagement",
    "Ethnic",
    "India",
    "Vivaha",
    "Gundu",
    "Gundla",
    "Antique Gold"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0281_2352",
  "collection": "necklace"
}