{
  "id": "necklaces-482",
  "title": "Heirloom Ruby and Emerald Statement Haaram - A Timeless Telugu Bridal Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Premium Quality Rubies (42.84 carats total)",
    "Natural Emeralds (16.59 carats total)",
    "High-Grade Diamonds (12.26 carats total)",
    "Hyderabadi Polish for lasting brilliance. Locket details: Diamonds (1.95 carats total)",
    "Emerald (12.69 carats)",
    "and Ruby beads (14.59 carats total)"
  ],
  "features": "Intricately designed Haaram featuring a central pendant. The necklace showcases a stunning blend of rubies, emeralds, and diamonds in a floral and geometric pattern. Diamond-studded filigree work with Ruby bead accents. The Locket's shape is floral and ornate with Diamond-studded filigree work.",
  "colors": [
    "Rich Ruby Red",
    "Vibrant Emerald Green",
    "and Sparkling White Diamonds set against the warm tone of 22K Gold. A classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham",
    "and other grand celebrations. Also a statement piece for high-profile social events",
    "adding a touch of regal elegance."
  ],
  "description": "This exquisite Haaram is a true investment piece, blending traditional South Indian design with modern craftsmanship. The combination of rubies, emeralds, and diamonds symbolizes prosperity, growth, and enduring love. Its exceptional craftsmanship ensures lasting beauty and makes it a treasured family heirloom. Certified gemstones guarantee value and quality.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Ruby",
    "Emerald",
    "Diamond",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "కంఠాభరణం",
    "పెళ్లి",
    "నిశ్చితార్థం",
    "Seemantham",
    "Heirloom",
    "Investment Piece"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-59 3_0945",
  "collection": "diamond"
}