{
  "id": "necklaces-222",
  "title": "Lakshmi Kasula Haaram with Coral Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము) with Hyderabadi Polish for lasting luster. Adorned with sparkling Cubic Zirconia (CZ) stones",
    "genuine Coral beads (పగడాలు)",
    "Emeralds (పచ్చలు)",
    "and Rubies (కెంపులు)."
  ],
  "features": "Features a central pendant with intricately detailed peacock motif, embellished with CZ stones. The cascading Coral beads add a touch of traditional elegance. The pendant showcases fine craftsmanship with a design that seamlessly blends traditional South Indian artistry with modern sensibilities. The base of the pendant features Emerald cabochons and leads to a dome-shaped jhumka detail. The chain is a delicate floral link.",
  "colors": [
    "Warm gold tone complemented by the vibrant red of the Coral",
    "a hint of green from the Emeralds and the bright sparkle of the CZ stones. The color palette evokes a sense of traditional opulence."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "religious ceremonies",
    "and festive celebrations like Ugadi and Sankranthi. A statement piece for Seemantham (బేబీ షవర్) or Half-Saree function (సగం చీర వేడుక)."
  ],
  "description": "This Haaram is a timeless investment, embodying the rich heritage of South Indian jewelry. The superior craftsmanship and use of high-quality materials ensure durability and lasting beauty. The blend of traditional design with modern elements makes it a versatile piece that can be treasured for generations. The Coral beads are believed to bring prosperity and good fortune, making it a meaningful gift for loved ones.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Kasula Mala",
    "Coral",
    "Emerald",
    "Ruby",
    "CZ",
    "Peacock",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "కంఠాభరణం",
    "పగడాలు",
    "పచ్చలు",
    "కెంపులు",
    "పెళ్లి",
    "నిశ్చితార్థం",
    "బేబీ షవర్",
    "సగం చీర వేడుక",
    "సువర్ణము"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0302_0499",
  "collection": "diamond"
}