{
  "id": "necklaces-1451",
  "title": "Enchanting Kundan-Inspired Emerald and Pearl Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated. Features simulated Kundan-style setting with high-quality Cubic Zirconia (CZ)",
    "Emerald-colored stones",
    "and simulated Pearls. Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "A delicately designed Haaram blending traditional Kundan aesthetics with a contemporary floral motif. The necklace features a series of interwoven floral and heart-shaped units, leading to a central pendant adorned with emerald-colored stones. The pendant is further enhanced with a drop featuring simulated pearls for added elegance. The overall design embodies a balance between tradition and modernity, making it versatile for various occasions.",
  "colors": [
    "Predominantly Gold with accents of Emerald green and Pearl white. The clear sparkle of the CZ adds brilliance to the overall color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement ceremonies (pellikuturu)",
    "sangeet",
    "or any festive occasion. Also suitable for modern Indian events where a touch of traditional elegance is desired."
  ],
  "description": "This Haaram offers the allure of traditional Kundan jewelry without the heavy weight and high cost. The Hyderabadi polish ensures lasting brilliance, while the carefully selected Emerald and CZ stones provide a luxurious sparkle. Its versatile design bridges the gap between traditional and contemporary styles, making it a valuable addition to any jewelry collection. A perfect blend of 'Parampara' (tradition) and 'Adhunikata' (modernity).",
  "tags": [
    "Haaram",
    "Kundan",
    "Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Emerald",
    "Pearl",
    "CZ",
    "Cubic Zirconia",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Festive Jewelry",
    "Pellikuturu",
    "Engagement",
    "Reception",
    "Sangeet"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-50 2_2069",
  "collection": "sjpl"
}