{
  "id": "necklaces-293",
  "title": "Diamond Jadau Haaram with Emerald and Ruby Accents - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base with Hyderabadi Polish",
    "meticulously set with brilliant-cut Diamonds. Features vibrant Emerald (Panna) and Ruby (Manikyam) accents. Adorned with natural South Sea Pearls."
  ],
  "features": "Exquisite Jadau craftsmanship, showcasing intricate floral motifs encrusted with diamonds. The central pendant features a layered design with a prominent Emerald at the core, surrounded by diamond-studded petals. Delicate pearl drops add a touch of classic elegance. Traditional South Indian 'Mango' (Maanga) design elements are subtly incorporated throughout the necklace.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with vibrant pops of green (Emerald) and red (Ruby). The pearls offer a soft",
    "creamy luminescence."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "weddings (Vivaha)",
    "engagements ( நிச்சயதார்த்தம்)",
    "and other special occasions. Also ideal for traditional ceremonies such as Seemantham and half-saree functions."
  ],
  "description": "This Jadau Haaram represents the pinnacle of South Indian jewelry artistry. The combination of high-quality diamonds, vibrant gemstones, and lustrous pearls creates a breathtaking effect. The intricate Jadau setting showcases the exceptional skill of our artisans. A timeless investment piece that will be treasured for generations.",
  "tags": [
    "Haaram",
    "Jadau",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "South Sea Pearls",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Indian Wedding",
    "South Indian Jewelry",
    "Kanthabharanam",
    "కంఠాభరణం",
    "మాణిక్యం",
    "పచ్చ",
    "ముత్యాలు",
    "Hyderabad Jewelry",
    "Indian Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0382_0579",
  "collection": "diamond"
}