{
  "id": "earrings-480",
  "title": "Exquisite Rose Cut Polki Jhumka Earrings with Ruby Accents",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Rose Cut Polki Diamonds (Uncut Diamonds)",
    "Pear-Shaped Rubies. Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "A contemporary take on the classic Jhumka, these earrings feature a floral design crafted with delicately arranged Rose Cut Polki diamonds. The unique shield-shaped base is meticulously set with individual Polkies, creating a shimmering effect. A vibrant pear-shaped ruby dangles above, adding a touch of traditional color and elegance. The setting showcases the natural beauty of the uncut diamonds, highlighting their unique inclusions and character.",
  "colors": [
    "Yellow Gold",
    "Rose Cut Diamonds (off-white/champagne)",
    "Ruby (deep pink). The contrast between the warm gold",
    "the rustic charm of the Polkies",
    "and the vibrant ruby creates a visually stunning and harmonious combination."
  ],
  "occasions": [
    "Perfect for both traditional occasions like weddings (వివాహం)",
    "receptions",
    "and festivals",
    "as well as modern events such as cocktail parties and anniversaries. These Jhumkas are versatile enough to complement both ethnic and contemporary attire."
  ],
  "description": "These earrings offer a unique blend of traditional South Indian craftsmanship and modern design aesthetics. The use of Rose Cut Polki diamonds provides a raw, natural beauty, while the ruby accents add a touch of classic Indian elegance. Handcrafted in Hyderabad, the Hyderabadi polish ensures exceptional durability and lasting shine. A statement piece that will be treasured for generations.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Polki Diamonds",
    "Rose Cut Diamonds",
    "Ruby",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "చెవి దుద్దులు",
    "Polki",
    "Hyderabad",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1419_2601",
  "collection": "ear"
}