{
  "id": "bangles-147",
  "title": "Exquisite Antique Finish Emerald & Diamond Kangan",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features a central oval-cut Emerald and brilliant-cut Diamonds (VS clarity",
    "G-H color)."
  ],
  "features": "This kangan features intricate filigree work reminiscent of traditional South Indian jewelry. The central floral motif is centered with a natural emerald and haloed by sparkling diamonds in a prong setting. The overall design boasts an antique finish, giving it a vintage, heirloom appeal. The bangle itself is intricately designed with floral cut outs adding to the overall delicacy. Designed with open settings for maximum brilliance.",
  "colors": [
    "Primarily gold with a vibrant green from the emerald and the dazzling white sparkle of the diamonds."
  ],
  "occasions": [
    "Ideal for weddings (muhurtham)",
    "festivals (like Sankranthi or Diwali)",
    "or any special occasion where you want to showcase a blend of tradition and elegance. Equally suited for formal gatherings and high-end social events."
  ],
  "description": "This Kangan showcases exceptional craftsmanship and an authentic antique aesthetic. The combination of the emerald and diamonds symbolizes prosperity and everlasting love. The Hyderabadi polish enhances the gold's natural luster, ensuring a timeless piece. Its sturdy construction ensures durability, making it a treasured heirloom for generations. A perfect blend of traditional Telugu design and modern aesthetics, making it a unique and captivating addition to any jewelry collection.",
  "tags": [
    "Kangan",
    "Kadayam",
    "Bracelet",
    "Antique Finish",
    "Emerald",
    "Pachala",
    "Diamonds",
    "Vairala",
    "Gold",
    "Bangaru",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Filigree",
    "Ethnic Jewelry",
    "Vintage Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0417_0614",
  "collection": "diamond"
}