{
  "id": "necklaces-692",
  "title": "Emerald Pavalamala Haram - A Timeless Statement of Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Kundan Setting",
    "Natural Zambian Emeralds (various cuts)",
    "Polki Diamonds. Features a Hyderabadi Polish for a rich luster."
  ],
  "features": "Intricately handcrafted Haaram featuring traditional Kundan setting and Polki diamond embellishments. The necklace boasts a delicate lattice pattern and is centered with a stunning Zambian Emerald. Features peacock motif, embodying grace and prosperity. Dangles feature gold beads, adding a gentle sway and shimmer.",
  "colors": [
    "Predominantly Gold with vibrant Green Emeralds and the brilliant sparkle of Polki Diamonds. Hints of pavalam (red coral) are seen in some settings",
    "a traditional auspicious color combination."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "engagements",
    "grand celebrations",
    "or formal gatherings. A magnificent piece for the bride (Vadhuvu) or any special occasion like seemantham (baby shower) or half-saree function (Langa Voni)."
  ],
  "description": "This Haaram represents a harmonious blend of traditional craftsmanship and timeless design. The use of natural Zambian Emeralds and Polki diamonds creates a regal aesthetic. The Hyderabadi polish ensures a long-lasting, radiant shine. It's an investment in artistry and cultural heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan",
    "Jadau",
    "Emerald",
    "Panna",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Vivaha Mahotsavam",
    "Traditional",
    "Bridal Jewelry",
    "Festive",
    "Pavalam",
    "Peacock Motif",
    "Antique Finish",
    "22K Gold",
    "Zambian Emerald"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-52 2_1198",
  "collection": "diamond"
}