{
  "id": "necklaces-353",
  "title": "Exquisite Diamond Lakshmi Kasula Haaram Set with Jhumka Earrings",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "GH Color)",
    "Natural Ruby (Center)",
    "Natural Emerald (Center)",
    "South Sea Pearls. Meticulously crafted with authentic Hyderabadi Polish for a lasting luster."
  ],
  "features": "This stunning Haaram showcases a classic Lakshmi Kasula design intricately crafted with floral diamond settings. Features a central Ruby on a square setting, contrasted by the pendant with an Emerald center. Dangler South Sea Pearls enhance its elegance. The accompanying Jhumka earrings mirror the necklace's floral motif, culminating in a single pearl drop. The back of the jewelry is finished with exquisite filigree work.",
  "colors": [
    "Predominantly gold with brilliant white diamonds",
    "complemented by the deep red of the ruby and the vibrant green of the emerald. Soft white South Sea Pearls add a touch of classic refinement."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festive celebrations (Sankranthi",
    "Dasara",
    "Diwali)",
    "and other grand occasions. A cherished heirloom for generations",
    "ideal for Muhurtham",
    "Seemantham",
    "or any significant family event."
  ],
  "description": "This Haaram set represents the pinnacle of South Indian jewelry artistry. Its combination of 22K gold, dazzling diamonds, and precious gemstones makes it a timeless investment. The Lakshmi Kasula design symbolizes prosperity and good fortune, making it a meaningful gift and a treasured addition to any jewelry collection. Durability and timeless design ensure its value endures for generations.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace Set",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Lakshmi Kasula",
    "Ruby",
    "Emerald",
    "Pearls",
    "Hyderabadi Polish",
    "22K Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Vivahaalu",
    "Nischitartham",
    "Seemantham",
    "Muhurtham",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Bharatanatyam Jewelry",
    "Traditional Jewelry",
    "Kasulaperu"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0467_0649",
  "collection": "diamond"
}