{
  "id": "necklaces-1385",
  "title": "The 'Indrani' Haaram: A Regal Symphony of Sapphire and Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold with Brilliant Cut Diamonds and a Deep Blue Sapphire. Features our signature Hyderabadi polish for unparalleled lustre."
  ],
  "features": "This stunning necklace features a graduating line of baguette-cut diamonds, culminating in a breathtaking pear-shaped sapphire surrounded by a halo of smaller brilliant cut diamonds. The setting emphasizes the brilliance of each stone, creating a dazzling cascade of light. Its design is rooted in traditional haaram aesthetics, but interpreted with clean, modern lines.",
  "colors": [
    "Predominantly gold",
    "white (diamonds)",
    "and a rich",
    "deep blue (sapphire). A timeless and elegant color palette."
  ],
  "occasions": [
    "Perfect for a modern bride",
    "a high-profile event",
    "or as an heirloom piece for special celebrations like Seemantham or a milestone birthday. Its understated elegance also makes it suitable for upscale parties and galas."
  ],
  "description": "The Indrani Haaram is a masterpiece of modern design meeting traditional sensibilities. The sapphire, symbolizing wisdom and royalty, is the focal point. Exceptional diamond quality and superior Hyderabadi craftsmanship guarantee a piece that will retain its value and beauty for generations. This haaram offers a luxurious statement without being ostentatious, ideal for the discerning collector.",
  "tags": [
    "Haaram",
    "Necklace",
    "Sapphire",
    "Diamonds",
    "Gold Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Partywear",
    "Gift",
    "ఆభరణాలు (Aabharanalu)",
    "నెక్లెస్ (Neckles)",
    "వజ్రాలు (Vajralu)",
    "నీలమణి (Neelamani)",
    "బంగారు (Bangaru)"
  ],
  "original_id": "sjpl_PHOTO-2024-05-14-12-56-59 2_2003",
  "collection": "sjpl"
}