{
  "id": "necklaces-532",
  "title": "Diamond Floral Pendant – A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "Crafted in 18K Yellow Gold",
    "meticulously set with brilliant-cut diamonds. The diamonds are of VS clarity and G-H color grade",
    "offering exceptional brilliance and fire. Features Hyderabadi polish for a rich",
    "lasting luster."
  ],
  "features": "This exquisite pendant features a delicate floral design, where each diamond is carefully set to maximize its sparkle. The piece showcases a lattice-like structure forming a semi-circular design with gracefully hanging diamond droplets, adding movement and sophistication. The pendant's design offers a modern take on classic floral motifs, making it a versatile addition to any jewelry collection.",
  "colors": [
    "Predominantly yellow gold with the dazzling white sparkle of the diamonds",
    "creating a sophisticated and timeless color combination."
  ],
  "occasions": [
    "Perfect for special occasions",
    "anniversaries",
    "engagements",
    "or as a treasured gift for loved ones. Suitable for both traditional and modern attire",
    "adding a touch of elegance to any ensemble. A versatile choice for daily wear or evening events."
  ],
  "description": "This diamond pendant is a testament to exquisite craftsmanship and timeless design. The high-quality diamonds and 18K gold ensure lasting beauty and value. Its versatile design makes it suitable for any occasion, from casual gatherings to formal events. This piece is designed to become a cherished heirloom, embodying lasting elegance and refinement. A perfect blend of modern design and traditional craftsmanship from our renowned Hyderabad workshop.",
  "tags": [
    "Diamond Pendant",
    "Gold Pendant",
    "Floral Pendant",
    "Modern Jewelry",
    "Hyderabadi Jewelry",
    "Diamond Locket",
    "Indian Jewelry",
    "18K Gold",
    "VS Clarity Diamonds",
    "Gift for Her",
    "Anniversary Gift",
    "Engagement Jewelry",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-14_1014",
  "collection": "diamond"
}