{
  "id": "necklaces-333",
  "title": "Emerald Blossom Diamond Haaram with Jhumka Set",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold",
    "High-Quality Diamonds (VVS Clarity)",
    "Emeralds",
    "Rubies",
    "South Sea Pearls. Features meticulous Hyderabadi Polish for lasting luster and shine."
  ],
  "features": "This exquisite set showcases a contemporary take on the traditional Haaram. The necklace is crafted with intricate diamond latticework interspersed with emerald accents. The central pendant features a ruby centerpiece surrounded by diamonds and dangling South Sea pearls. Matching Jhumka earrings echo the floral motif and complete the set with graceful movement. The setting is a masterful blend of prong and pave, ensuring each gemstone's brilliance is maximized.",
  "colors": [
    "Predominantly Gold and White (Diamonds)",
    "with vibrant Emerald Green",
    "Ruby Red",
    "and iridescent White (Pearls). A classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "receptions",
    "engagement ceremonies",
    "and other grand celebrations. Equally stunning for modern cocktail parties and formal events. A treasured heirloom piece."
  ],
  "description": "A dazzling fusion of tradition and contemporary design. The use of high-quality diamonds, emeralds, rubies, and South Sea pearls ensures lasting beauty and value. The Hyderabadi polish provides a superior finish and exceptional durability. This set is a statement piece that will elevate any attire and become a cherished family heirloom. The exquisite floral design symbolizes prosperity and new beginnings.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Jhumka",
    "Emerald Jewelry",
    "Ruby Jewelry",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Hyderabad Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Diamond Set",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0447_0629",
  "collection": "diamond"
}