{
  "id": "bangles-279",
  "title": "Antique Gold Kadas with Navaratan Stones - Vangi (వంకీ)",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish. Features a collection of Navaratna gemstones",
    "including ruby",
    "pearl",
    "coral",
    "emerald",
    "yellow sapphire",
    "blue sapphire",
    "hessonite",
    "cat's eye and diamond accents. Diamond weight: 2.10 carats. Total gemstone weight: 12.15 carats."
  ],
  "features": "These exquisitely crafted Kadas showcase a blend of traditional and modern design elements. They feature square-cut Navaratna stones bezel-set along the band, each representing a celestial body and its associated benefits. The stones are alternated with delicate floral motifs paved with sparkling diamonds. The antique gold finish enhances the traditional aesthetic, reminiscent of classic Telugu jewelry. The detailed workmanship and careful stone setting ensure a piece that's both beautiful and durable.",
  "colors": [
    "Predominantly antique gold with a vibrant interplay of gemstone colors - deep reds from ruby and coral",
    "lush green from emerald",
    "radiant yellow from sapphire",
    "serene blue from sapphire",
    "with accents of sparkling white diamonds."
  ],
  "occasions": [
    "Perfect for traditional South Indian ceremonies such as weddings (Vivaha)",
    "engagements (Nischitartham)",
    "and festivals (Panduga). Equally stunning for modern occasions where a touch of ethnic elegance is desired."
  ],
  "description": "These Kadas are more than just jewelry; they are a statement of prosperity, well-being, and cultural heritage. The Navaratna stones are believed to bring good fortune and protect the wearer. The antique finish and expert craftsmanship reflect the rich traditions of Hyderabad's jewelry heritage. A timeless piece that can be treasured for generations.",
  "tags": [
    "Kada",
    "Bangles",
    "Vangi",
    "Navaratna",
    "Hyderabad Jewelry",
    "Antique Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "22K Gold",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Panduga",
    "Gemstone Jewelry",
    "Diamond Bangles",
    "Ethnic Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-05-04-11-18-22_1698",
  "collection": "sjpl"
}