{
  "id": "necklaces-206",
  "title": "Rajputana Peacock Haaram - A Timeless Legacy",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Hyderabadi Polish. Adorned with high-quality Cubic Zirconia (CZ) stones",
    "Ruby cabochons",
    "and Emerald accents. Durable chain link design."
  ],
  "features": "Inspired by Rajputana Royalty, this Haaram features a beautifully crafted pendant with intricate peacock motifs. Detailed filigree work (తీగ పని) with beaded gold dangles (గుట్టపూసలు). The pendant showcases a symmetrical design with peacocks facing each other, symbolizing love and harmony. High-quality cubic zirconia for a diamond-like sparkle.",
  "colors": [
    "Predominantly gold with vibrant accents of ruby red and emerald green. Traditional South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "Seemantham (శ్రీమంతం)",
    "half-saree functions (లంగా ఓణి)",
    "and other grand celebrations. Can also be styled for festive occasions."
  ],
  "description": "This Rajputana Peacock Haaram embodies the rich cultural heritage of South Indian jewelry design. The exquisite craftsmanship and high-quality materials ensure lasting beauty and value. The peacock motif is a symbol of beauty, royalty, and prosperity. Makes a stunning heirloom piece for generations to come. The detailed filigree work, the Hyderabadi polish, and the high-quality Cubic Zirconia stones elevate this piece to a luxury status.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Peacock Design",
    "Rajputana",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "22K Gold",
    "CZ Stones",
    "Ruby",
    "Emerald",
    "Filigree",
    "Guttapusalu",
    "Kanthabharanam",
    "పెళ్లి",
    "శ్రీమంతం",
    "లాంగా ఓని"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0282_0480",
  "collection": "diamond"
}