{
  "id": "earrings-346",
  "title": "Floral Blossom Earrings - A Modern Take on Nakshi Design",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base metal with Rose Gold and White Gold plating",
    "studded with Cubic Zirconia (CZ)",
    "Mixed Gemstones including Navy and Pink Hues",
    "and Freshwater Pearls (Moti)."
  ],
  "features": "Intricate floral design inspired by traditional Nakshi craftsmanship, with a modern twist using mixed gemstones. The openwork design creates a light and airy feel, while the strategically placed pearls add a touch of elegance. The floral buds are accented with pave-set CZ, adding to the overall sparkle.",
  "colors": [
    "Rose Gold",
    "White Gold",
    "Navy Blue",
    "Light Pink",
    "and Pearl White. The color palette is inspired by traditional South Indian flower garlands (Poovu Danda)",
    "representing purity and prosperity."
  ],
  "occasions": [
    "Suitable for modern evening events",
    "cocktail parties",
    "receptions",
    "or as a statement piece for festive occasions. Can be paired with both traditional sarees and contemporary outfits."
  ],
  "description": "This exquisite pair of earrings blends traditional South Indian design with modern aesthetics, making it a versatile addition to any jewelry collection. The vibrant gemstone colors and delicate pearl accents create a visually stunning piece, while the lightweight construction ensures comfortable wear. The floral motif symbolizes growth, beauty, and new beginnings, making it a meaningful gift for any occasion.",
  "tags": [
    "Earrings",
    "Statement Earrings",
    "Floral Jewelry",
    "Nakshi Design",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Cocktail Earrings",
    "Moti",
    "Pearls",
    "CZ",
    "Cubic Zirconia",
    "Gemstone Earrings",
    "Fashion Jewelry",
    "Telugu Jewelry",
    "Poovu Danda",
    "Ethnic Earrings"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-44 2_1386",
  "collection": "diamond"
}