{
  "id": "necklaces-664",
  "title": "Emerald Grandeur: Traditional Diamond and Emerald Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base with Hyderabadi Polish",
    "ethically sourced AAA Quality Zambian Emeralds (Pachala Rallu) in round cut",
    "high-clarity brilliant-cut Diamonds (Vajralu) with VS clarity and G color. The emerald beads are strung meticulously."
  ],
  "features": "Features a traditional paisley-inspired design at the collar, adorned with rows of emeralds and diamonds set in a bezel and pave setting. Intricate filigree work connects the emerald bead strands to the central pendant. The pendant showcases a peacock motif (Mayura Akruti), a symbol of beauty and prosperity, embellished with diamonds and a larger central emerald. Diamond-encrusted floral (Puvvulu) dangles add graceful movement. The necklace employs the antique finish (Antique Polish) technique.",
  "colors": [
    "Predominantly gold",
    "with vibrant green emeralds and sparkling white diamonds creating a regal and auspicious color palette. The contrast between the stones enhances the overall brilliance."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "weddings (Vivaham/Pelli)",
    "Seemantham",
    "half-saree function (Langa Voni Function)",
    "or any grand celebration where you want to make a statement. Also suitable for high-end cultural events and galas."
  ],
  "description": "This Haaram is a testament to exquisite South Indian craftsmanship, blending traditional design elements with modern setting techniques. The use of high-quality Zambian emeralds and brilliant-cut diamonds ensures exceptional brilliance and lasting value. The peacock motif symbolizes prosperity and good luck, making this piece not only beautiful but also meaningful. Its durable construction and timeless design make it a treasured heirloom to be passed down through generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "22K Gold",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Pachala Haaram",
    "Vajrala Haaram",
    "Andhra Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Mayura",
    "Peacock",
    "Traditional Jewelry",
    "Seemantham",
    "Langa Voni Function",
    "Vivaham",
    "Pelli",
    "Antique Polish"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-33 2_1170",
  "collection": "diamond"
}