{
  "id": "earrings-148",
  "title": "Indrani's Tear: Emerald & Polki Diamond Drop Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K Rose Gold. Features a centerpiece of uncut",
    "natural Polki Diamond and meticulously set Emeralds. Accentuated with brilliant-cut diamonds of VS clarity. Finished with a signature Hyderabadi polish for a lasting luster."
  ],
  "features": "These earrings blend traditional Indian aesthetics with modern design. The floral top features emerald petals in a traditional cluster setting, framing the central Polki diamond in a rose gold bezel. The drop showcases a unique, organic Polki diamond, surrounded by a delicate halo of pavé-set diamonds. The open setting allows maximum light to enhance the natural sparkle of the Polki and diamonds.",
  "colors": [
    "Rose gold provides a warm",
    "romantic base",
    "complemented by the vibrant green of the emeralds and the icy brilliance of the Polki diamond. The accent diamonds add a subtle shimmer."
  ],
  "occasions": [
    "Perfect for modern brides seeking a touch of heritage",
    "evening galas",
    "cocktail parties",
    "or adding a sophisticated sparkle to festive occasions. A statement piece that transcends trends."
  ],
  "description": "This pair of earrings is a testament to timeless craftsmanship and refined aesthetics. The unique Polki diamond adds an air of exclusivity, while the emeralds and diamonds exude elegance. Durable and designed for comfortable wear, these earrings are an investment in wearable art. The Hyderabadi polish ensures a long-lasting shine, preserving the beauty for generations.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Polki Diamond",
    "Emerald",
    "Rose Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Cocktail Earrings",
    "Statement Earrings",
    "Adhira",
    "Kundan",
    "Pachi"
  ],
  "original_id": "diamond_jewellery_DPER8-1570_0273",
  "collection": "diamond"
}