{
  "id": "necklaces-1462",
  "title": "Floral Tanzanite Chandrika Haar: A Symphony of Tradition and Modernity",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Pink Sapphires",
    "Brilliant Cut Diamonds (VVS Clarity)",
    "Tanzanite Drops. Meticulously crafted with a Hyderabadi polish for lasting brilliance."
  ],
  "features": "This Chandrika Haar features a delicate floral design with geometric elements. Each floral motif is meticulously set with brilliant cut diamonds and framed with a border of pink sapphires. Tanzanite gemstone drops cascade from each pendant, adding a touch of contemporary flair. The intricate filigree work (కళాత్మకమైన నగిషీ పని) adds a traditional South Indian touch, enhancing the overall beauty and depth of the piece.",
  "colors": [
    "Yellow Gold",
    "Pink Sapphires",
    "White Diamonds",
    "and captivating Blue Tanzanite."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "festivals (పండుగలు)",
    "or any special occasion. Its unique design makes it suitable for both traditional South Indian events and contemporary celebrations."
  ],
  "description": "This exquisite Chandrika Haar is a harmonious blend of traditional South Indian craftsmanship and modern design aesthetics. The combination of vibrant pink sapphires, sparkling diamonds, and rich tanzanite creates a statement piece that is both timeless and eye-catching. The high-quality materials and meticulous detailing ensure lasting beauty and value. Own a piece of heritage infused with contemporary elegance.",
  "tags": [
    "Necklace",
    "Haaram",
    "Chandrika",
    "Gold",
    "Diamond",
    "Sapphire",
    "Tanzanite",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "పెళ్లి నగలు",
    "కంఠాభరణము",
    "వజ్రాలు",
    "పచ్చలు",
    "బంగారు"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-54_2080",
  "collection": "sjpl"
}