{
  "id": "necklaces-933",
  "title": "Lakshmi Kasula Haaram - Exquisite Temple Inspired Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated. Meticulously studded with CZ Diamonds",
    "Ruby",
    "and Emerald gemstones. High-quality Hyderabadi polish for lasting brilliance and tarnish resistance."
  ],
  "features": "Double-layered Kasula Haaram featuring exquisitely crafted Lakshmi motifs. The central pendant boasts a mesmerizing floral design with embedded ruby and emerald accents. Divine goddess Lakshmi embellished settings with exceptional details and intricate work. The design incorporates a modern geometric pattern in the necklace's main body, creating a unique blend of tradition and contemporary style. The lower pendant has the traditional gold pearl drop hangings.",
  "colors": [
    "Predominantly gold with dazzling white from the CZ diamonds",
    "complemented by vibrant touches of ruby red and emerald green. A classic South Indian color palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "traditional ceremonies (Pujas)",
    "Seemantham",
    "Half-Saree functions (Langa Voni Function)",
    "and festive celebrations (Ugadi",
    "Diwali",
    "Sankranthi). It is also suitable for high-end parties and special events where you wish to make a statement."
  ],
  "description": "This Lakshmi Kasula Haaram is a symbol of prosperity and divine blessings. A timeless piece meticulously crafted with traditional South Indian artistry and modern jewelry techniques. High-quality materials and attention to detail ensure durability and enduring beauty. Perfect for gifting to a bride or a loved one. Its unique design makes it a treasured family heirloom.",
  "tags": [
    "Lakshmi Haaram",
    "Kasula Mala",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "CZ Diamonds",
    "Ruby",
    "Emerald",
    "Gold Plated",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Grand Necklace",
    "Indian Jewelry",
    "Telugu Jewelry",
    "Devotional Jewelry",
    "Seemantham",
    "Muhurtham"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0327_2394",
  "collection": "necklace"
}