{
  "id": "waistbands-008",
  "title": "The Emerald Empress Vaddanam: Diamond and Pearl Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "18K Gold base",
    "intricately set with brilliant-cut diamonds and adorned with a central emerald. Features premium quality South Sea pearls. Hyderabadi Polish enhances the brilliance of the gold and diamonds."
  ],
  "features": "A stunning Vaddanam featuring traditional South Indian design elements. Delicate filigree work and meticulously crafted diamond settings create an intricate floral and peacock motif. The centerpiece features a vibrant emerald. Pearl drops add a touch of elegance and movement. Crafted with traditional nakshi techniques, adding a regal touch to the modern design.",
  "colors": [
    "Predominantly white (diamonds)",
    "accented by the vibrant green of the emerald and the creamy white of the pearls. The Hyderabadi polish provides a subtle golden sheen to the setting."
  ],
  "occasions": [
    "Perfect for weddings",
    "bridal wear",
    "Seemantham",
    "Half-Saree functions",
    "and other grand celebrations. Its exquisite design makes it a statement piece for any special occasion."
  ],
  "description": "This Vaddanam is a harmonious blend of tradition and contemporary style. The use of high-quality diamonds and pearls, coupled with traditional craftsmanship, makes it a valuable investment. Its exquisite design and cultural significance make it a cherished heirloom for generations. Features a striking emerald centerpiece, symbolizing prosperity and good fortune.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Half-Saree",
    "Hyderabad Jewelry",
    "Nakshi Work",
    "Filigree",
    "Indian Jewelry",
    "OTTIYAM"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-20_1288",
  "collection": "diamond"
}