{
  "id": "necklaces-1199",
  "title": "Emerald and Diamond Floral Cascade Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "brilliant-cut Diamonds (VS clarity)",
    "Emeralds (square cut",
    "vibrant green)",
    "South Sea Pearls (round",
    "lustrous). Features a Hyderabadi Polish for lasting shine."
  ],
  "features": "A stunning two-layer haaram featuring an intricate floral design. Each floral motif is meticulously crafted with brilliant-cut diamonds. The necklace features round-shaped floral patterns, with eye-catching Emeralds placed along the neckline. The pendant showcases a traditional design with a central square-cut Emerald surrounded by diamonds. Delicate pearl drops enhance the elegance of the haaram. The setting is carefully crafted to maximize the brilliance of each diamond and gemstone.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emeralds)",
    "Cream (Pearls). A classic and elegant color palette."
  ],
  "occasions": [
    "Ideal for weddings (Vivah)",
    "receptions",
    "traditional ceremonies",
    "and grand celebrations. Perfect for muhurtham",
    "seemantham",
    "and any special occasion where a touch of regal elegance is desired."
  ],
  "description": "A timeless piece of art, blending traditional South Indian craftsmanship with modern design. The combination of brilliant-cut diamonds, vibrant emeralds, and lustrous South Sea pearls makes it a show-stopper. This haaram is a valuable investment, combining cultural significance with exquisite craftsmanship.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Gemstone Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "Vivah",
    "Muhurtham",
    "Seemantham",
    "Kanti",
    "Golusu",
    "Addigai"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-45_1773",
  "collection": "sjpl"
}