{
  "id": "bangles-034",
  "title": "Emerald Blossom Vanki: A Symphony of Tradition and Sparkle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Natural Emeralds (Oval Cut",
    "High Clarity)",
    "Cubic Zirconia (CZ) Diamonds. Features a Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite vanki boasts a unique openwork design. Oval-cut Emeralds are strategically placed and highlighted by a glittering array of CZ diamonds in a pavé setting. The scalloped edge adds a touch of sophistication. Crafted with traditional Telugu craftsmanship techniques blended with modern design sensibilities.",
  "colors": [
    "Lustrous Yellow Gold",
    "Vivid Green Emeralds",
    "and Dazzling White CZ Diamonds create a vibrant and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (pellilu)",
    "festivals (pandagalu)",
    "and special occasions. Ideal for bridal wear (pattu sarees) and adds a touch of elegance to any ensemble. Equally suited for a modern cocktail party or a traditional Bharatanatyam performance."
  ],
  "description": "This vanki is a testament to timeless elegance. The combination of natural emeralds, sparkling CZ diamonds, and meticulous craftsmanship ensures lasting beauty and value. The open design makes it lightweight and comfortable to wear. It is a perfect blend of tradition and modernity, making it a cherished heirloom for generations to come. This is a symbol of prosperity and good fortune, embodying the rich cultural heritage of Andhra Pradesh and Telangana.",
  "tags": [
    "Vanki",
    "Bangle",
    "Emerald",
    "CZ Diamond",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Kankanam",
    "కంకణం",
    "Pelli",
    "పెళ్లి",
    "Pandaga",
    "పండగ",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Contemporary Jewelry",
    "Emerald Bangle"
  ],
  "original_id": "bangles_IMG-20240902-WA0042_1650",
  "collection": "bangles"
}