{
  "id": "earrings-103",
  "title": "Emerald-Kissed Golden Jhumka – A Timeless Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Premium Emerald Center",
    "High-Quality CZ Diamonds (American Diamonds)",
    "Cultured Pearls",
    "Hyderabadi Polish"
  ],
  "features": "Exquisitely crafted jhumkas featuring a floral stud with a pear-shaped Emerald centerpiece, surrounded by sparkling CZ diamonds. The bell-shaped jhumka is intricately designed with an openwork lattice pattern encrusted with CZ diamonds. Dangling from the base are delicate strands of lustrous cultured pearls, adding a touch of elegance. The piece showcases traditional South Indian craftsmanship with a modern flair.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Diamonds)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "festivals (Pandugalu)",
    "engagements (Nischitartham)",
    "and other special occasions. These jhumkas add a touch of traditional South Indian elegance to any outfit",
    "making them suitable for both traditional and contemporary events."
  ],
  "description": "Embrace timeless elegance with these stunning Emerald-Kissed Golden Jhumkas. The combination of rich gold, vibrant emerald, and sparkling CZ diamonds creates a captivating piece that will be cherished for generations. The impeccable craftsmanship and Hyderabadi polish ensure lasting beauty and durability. These jhumkas are a symbol of South Indian heritage and a testament to your refined taste. They are lightweight and comfortable to wear, allowing you to enjoy your special day without any discomfort.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Gold Earrings",
    "Emerald",
    "CZ Diamond",
    "Kundan",
    "Kempulu",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Indian Jewelry",
    "Pearls",
    "Temple Jewelry",
    "Vivahaalu",
    "Pandugalu",
    "Nischitartham"
  ],
  "original_id": "diamond_jewellery_cf15bcd0-5f44-485c-8617-2d051c76eead_0204",
  "collection": "diamond"
}