{
  "id": "earrings-324",
  "title": "Pearl Drop Kundan Jhumka Earrings - A Timeless South Indian Classic",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base metal with high-quality gold plating",
    "embellished with sparkling Kundan stones and a single",
    "lustrous faux pearl drop on each earring. The plating mimics the traditional Hyderabadi Polish for a rich",
    "authentic look."
  ],
  "features": "Classic Jhumka bell shape with intricate Kundan stone detailing throughout. The design features delicate floral motifs on the ear studs, leading to a tiered Jhumka bell pattern. The openwork design allows light to reflect beautifully off the Kundan stones. A single, perfectly round pearl drop adds a touch of elegance and completes the traditional aesthetic.",
  "colors": [
    "Predominantly gold with brilliant white (Kundan) and a soft",
    "creamy pearl hue. The gold finish replicates the warmth of 22K gold",
    "creating a classic South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "festivals (పండుగలు)",
    "Seemantham (శీమంతం)",
    "half-saree functions (లంగా ఓణి)",
    "or any special occasion where you want to showcase traditional South Indian elegance. Suitable for both traditional and contemporary outfits."
  ],
  "description": "These Kundan Jhumkas offer the timeless beauty of traditional South Indian jewelry with a modern touch. The faux pearl drop adds sophistication, while the Kundan stones provide dazzling brilliance. Lightweight and comfortable to wear, they are perfect for extended events. A valuable addition to any jewelry collection, representing a blend of heritage and style. Represents excellent craftsmanship.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Kundan",
    "Pearl",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Earrings",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Earrings",
    "ചെവി దుద్దులు",
    "జుంకా",
    "కుందన్",
    "ముత్యం",
    "Hyderabadi Jewelry",
    "Gold Plated",
    "Ethnic Jewelry",
    "Festive Jewelry",
    "Pelli Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-36_1353",
  "collection": "diamond"
}