{
  "id": "earrings-193",
  "title": "Lakshmi Devi Temple Jhumka Earrings with South Sea Pearls",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold)",
    "Brilliant Cut Cubic Zirconia",
    "South Sea Pearls with excellent luster and round shape",
    "crafted with traditional Hyderabadi Polish for an enduring sheen."
  ],
  "features": "Intricately designed Temple Jhumka earrings featuring a central Lakshmi Devi figure, meticulously handcrafted with Nakshi work. The circular frame is adorned with sparkling cubic zirconia set in a pavé style. Three South Sea pearls dangle gracefully from the bottom, enhancing the traditional elegance. The jhumkas have a secure screw-back closure for comfortable wear.",
  "colors": [
    "Warm gold tone",
    "bright white cubic zirconia",
    "and iridescent gold South Sea pearls create a sophisticated and timeless color palette."
  ],
  "occasions": [
    "Perfect for traditional South Indian occasions like weddings (pellilu)",
    "festivals (pandugalu)",
    "housewarmings (gruhapravesham)",
    "and significant life events. Suitable also for formal gatherings or to add a touch of heritage to contemporary outfits."
  ],
  "description": "These Lakshmi Devi Temple Jhumkas embody the rich cultural heritage of South India. The intricate Nakshi work, the presence of Goddess Lakshmi, and the lustrous South Sea pearls make this a powerful and auspicious piece. Handcrafted with the highest quality materials and the expertise of Hyderabad's finest artisans, these earrings are a timeless investment. The timeless design will definitely fetch you compliments.",
  "tags": [
    "Jhumka",
    "Temple Jewelry",
    "Lakshmi",
    "South Sea Pearls",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Earrings",
    "Traditional Jewelry",
    "Nakshi Work",
    "చెవి దుద్దులు",
    "దేవాలయ నగల",
    "లక్ష్మి",
    "ముత్యాలు",
    "బంగారు"
  ],
  "original_id": "diamond_jewellery_fcf9012d-368d-4a7a-b40a-4dafbfa3af92_0409",
  "collection": "diamond"
}