{
  "id": "earrings-571",
  "title": "Navaratna Diamond Stud Earrings - Sampoorna Shubhakar",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Sona) with Hyderabadi Polish. Features nine precious gemstones (Navaratnas) including Ruby (Manikyam)",
    "Pearl (Moti)",
    "Coral (Viduramu)",
    "Emerald (Panna)",
    "Yellow Sapphire (Pukhraj)",
    "Diamond (Vajram)",
    "Blue Sapphire (Neelam)",
    "Hessonite (Gomedh)",
    "and Cat's Eye (Lehsuniya). Diamonds are of VS clarity and G color."
  ],
  "features": "Circular stud design featuring the Navaratnas in a radiating arrangement around a central Ruby. Set within an intricate micro-pavé setting of brilliant-cut diamonds, creating a starburst effect. Expertly crafted with attention to detail showcasing traditional gem placement and modern diamond setting techniques. The back is smooth for comfortable wear.",
  "colors": [
    "Predominantly gold with a vibrant palette of gemstone colors: deep red (Ruby)",
    "creamy white (Pearl)",
    "fiery orange (Coral)",
    "lush green (Emerald)",
    "sunny yellow (Yellow Sapphire)",
    "icy white (Diamond)",
    "deep blue (Blue Sapphire)",
    "earthy brown (Hessonite)",
    "and shimmering cat's eye green (Cat's Eye)."
  ],
  "occasions": [
    "Ideal for auspicious occasions like weddings (Vivahalu)",
    "festivals (Pandugalu)",
    "housewarmings (Gruhapravesham)",
    "baby showers (Seemantham)",
    "and other celebratory events. Also suitable for adding a touch of traditional elegance to modern formal wear."
  ],
  "description": "A harmonious blend of tradition and luxury, these Navaratna stud earrings are believed to bring good fortune, health, and prosperity to the wearer. The meticulous craftsmanship and high-quality gemstones make this a timeless heirloom piece. The Hyderabadi Polish ensures a lasting sheen and brilliance. The combination of Navaratnas and diamonds amplifies the jewelry's aesthetic appeal and metaphysical benefits.",
  "tags": [
    "Navaratna",
    "Earrings",
    "Jhumka",
    "Stud Earrings",
    "Gold",
    "Diamonds",
    "Precious Stones",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Auspicious",
    "Sampoorna",
    "Manikyam",
    "Moti",
    "Viduramu",
    "Panna",
    "Pukhraj",
    "Vajram",
    "Neelam",
    "Gomeda",
    "Lehsuniya",
    "Wedding Jewelry",
    "Vivahalu",
    "Pandugalu"
  ],
  "original_id": "sjpl_PHOTO-2023-05-04-12-03-34_1699",
  "collection": "sjpl"
}