{
  "id": "earrings-318",
  "title": "Emerald Aura Jhumkas: A Touch of Tradition with Modern Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "High-quality Gold Plating over Alloy",
    "adorned with Cubic Zirconia and a vibrant Emerald Green Zircon. Features a lustrous",
    "cultured Pearl drop. The intricate design is finished with a Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "These captivating Jhumkas showcase a fusion of traditional silhouette with modern detailing. The floral stud features a prominent Emerald Green Zircon, surrounded by sparkling Cubic Zirconia. The Jhumka bell is intricately designed with openwork filigree, adding a touch of lightness and sophistication. A delicate Pearl drop completes the design, adding a classic touch.",
  "colors": [
    "Predominantly Gold and White (Cubic Zirconia)",
    "accented by the vibrant Emerald Green Zircon and the soft white of the Pearl."
  ],
  "occasions": [
    "Perfect for festive occasions like Diwali",
    "weddings (Sangeet or Mehendi)",
    "and family gatherings. Their elegant design makes them suitable for both traditional attire (like sarees and lehengas) and contemporary outfits."
  ],
  "description": "These Jhumkas effortlessly blend traditional South Indian aesthetics with modern sensibilities. The vibrant Emerald Green Zircon adds a pop of color and sophistication, while the Hyderabadi Polish ensures long-lasting shine. The lightweight design ensures comfortable wear for extended periods. A perfect statement piece to elevate any ensemble.",
  "tags": [
    "Jhumka",
    "Karnaphul",
    "Emerald",
    "Zircon",
    "Pearl",
    "Gold Plated",
    "Hyderabadi Polish",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Traditional Earrings",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-35 6_1347",
  "collection": "diamond"
}