{
  "id": "earrings-202",
  "title": "Emerald Vaagai Jhumka - Traditional Elegance with a Modern Twist",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds",
    "Oval Cabochon Emerald (Premium Quality",
    "Zambian)",
    "Diamond Clarity - SI1",
    "Diamond Cut - Rose Cut."
  ],
  "features": "Exquisite Jhumka design featuring a central, vivid green Emerald cabochon surrounded by a floral halo of uncut Polki diamonds. The Jhumka incorporates a square-shaped Polki design at the top. The gold setting showcases intricate filigree work and a rich, lustrous Hyderabadi polish, enhancing the antique aesthetic. A delicate droplet design connects the top piece with the main jhumka component.",
  "colors": [
    "Primarily gold with brilliant white Polki diamonds and a vibrant emerald green centerpiece."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "receptions",
    "traditional ceremonies like Seemantham (శీమంతం)",
    "and festive celebrations. Equally stunning paired with contemporary evening wear for a touch of regal elegance."
  ],
  "description": "This Jhumka embodies the timeless beauty of South Indian jewelry, meticulously handcrafted by skilled artisans in Hyderabad. The combination of uncut Polki diamonds and a vibrant emerald creates a captivating contrast. The Hyderabadi polish ensures lasting shine and durability. A symbol of prosperity and tradition, this piece is an investment in enduring style and cultural heritage. The use of natural emerald signifies growth and renewal, making it an auspicious choice.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Polki",
    "Emerald",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "చెవి దుద్దులు",
    "జుంకా",
    "పోల్కి",
    "పచ్చ",
    "పెళ్ళి నగలు",
    "Seemantham",
    "Vaagai",
    "Gemstone Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0040_0448",
  "collection": "diamond"
}