{
  "id": "necklaces-180",
  "title": "Ratanjot Haaram - Exquisite Tourmaline and Diamond Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features Oval cut Green Tourmaline (approximately 5 carats each)",
    "Oval cut Pink Tourmaline (approximately 5 carats each)",
    "Rose Cut Diamonds (VS Clarity",
    "G Color",
    "approximately 10 carats total)",
    "Pear Cut Tourmaline (approximately 10 carats)"
  ],
  "features": "A stunning contemporary take on the classic Haaram. The design features alternating Green and Pink Tourmalines, bezel set in gold, linked by delicate floral motifs adorned with rose-cut diamonds. The central pendant is a masterpiece, featuring a square Pink Tourmaline with a cluster of diamonds and a larger tear-drop shaped Tourmaline pendant. The framework features intricate detailing and a modern geometric aesthetic, yet retains the grandeur of traditional South Indian jewelry. Handcrafted by skilled artisans with generations of expertise.",
  "colors": [
    "Predominantly Gold",
    "with vibrant shades of Green and Pink Tourmaline. Sparkling White Diamonds create a captivating contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "grand celebrations",
    "or as a statement piece for special occasions. Its modern design also makes it suitable for upscale parties and contemporary events."
  ],
  "description": "This Ratanjot Haaram is a unique blend of tradition and modernity, making it a versatile addition to any jewelry collection. The high-quality Tourmalines and Rose-Cut Diamonds, combined with the expert craftsmanship and Hyderabadi Polish, ensure a lasting shine and enduring value. It's a statement piece that will draw admiration and become a cherished heirloom.",
  "tags": [
    "Haaram",
    "Necklace",
    "Tourmaline",
    "Diamond",
    "Rose Cut",
    "Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Ratnajot",
    "Contemporary Jewelry",
    "Statement Piece",
    "Bespoke Jewelry",
    "Bridal Necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0021_0429",
  "collection": "diamond"
}