{
  "id": "necklaces-904",
  "title": "Exquisite Emerald & Diamond Vanki Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (SI Clarity",
    "G-H Color)",
    "Natural Emerald (Oval Cut). Features a radiant Hyderabadi Polish for lasting luster and shine."
  ],
  "features": "This contemporary Vanki Haaram features a unique layered design meticulously crafted with rows of shimmering diamonds. The central pendant showcases an elegant floral motif adorned with a vibrant oval-cut Emerald. Delicate gold ghungroo-style drops add a touch of traditional charm. The design offers a modern take on the classic Vanki style often seen as armlets but adapted elegantly into a necklace.",
  "colors": [
    "Primarily gold with dazzling white diamonds and a striking green Emerald centerpiece. The combination is a symbol of prosperity and new beginnings."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "special anniversaries",
    "and grand celebrations. This piece also seamlessly blends with modern evening wear for a touch of South Indian elegance."
  ],
  "description": "This Vanki Haaram is a statement of refined taste, blending modern design with traditional South Indian aesthetics. The use of high-quality diamonds and a vibrant Emerald ensures brilliance and timeless beauty. Its unique design sets it apart, making it a cherished heirloom for generations to come. The craftsmanship reflects the rich heritage of Hyderabad's jewelry making traditions.",
  "tags": [
    "Haaram",
    "Vanki",
    "Emerald Necklace",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Telugu Jewellery",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Hyderabadi Jewellery",
    "Ghungroo",
    "22K Gold",
    "Contemporary Jewellery",
    "Indian Jewellery",
    "Bridal Haaram",
    "SI Diamonds",
    "Emerald"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0298_2365",
  "collection": "necklace"
}