{
  "id": "necklaces-1527",
  "title": "Emerald and Diamond Nakshi Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Oval Cut Emeralds (approximately 15.93 carats total)",
    "Brilliant Cut Diamonds (approximately 8.13 carats total)",
    "South Sea Pearls (approximately 21.30 carats total)"
  ],
  "features": "Exquisite Nakshi work detailing on the gold framework. The necklace features a floral motif setting where oval-cut Emeralds are surrounded by brilliant-cut diamonds, enhancing their brilliance. Delicate South Sea Pearls are elegantly suspended from the floral motifs. The design blends traditional South Indian Haaram aesthetics with a modern, luxurious feel.",
  "colors": [
    "Gold (yellow)",
    "Emerald (vibrant green)",
    "Diamond (white/clear)",
    "Pearl (creamy white)"
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals (Sankranti",
    "Diwali)",
    "Seemantham (baby shower)",
    "and significant family celebrations. Perfect for making a statement at formal galas or high-profile events."
  ],
  "description": "This Haaram represents the pinnacle of South Indian jewelry craftsmanship. The combination of emeralds, diamonds, and South Sea pearls symbolizes prosperity, love, and purity. Crafted with meticulous attention to detail, its exquisite design makes it a treasured heirloom piece. The Hyderabadi polish ensures lasting luster and beauty, while the high-quality gemstones provide exceptional sparkle and value. This statement piece blends traditional elegance with modern sophistication, making it a perfect addition to any discerning jewelry collection. A true 'Kasulaperu' with an elegant twist.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kasulaperu",
    "Emerald",
    "Diamond",
    "South Sea Pearls",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Nakshi Work",
    "Fine Jewelry",
    "Bridal Necklace",
    "Vivahaalu",
    "Nischitartham",
    "Ethnic Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-05_2145",
  "collection": "sjpl"
}