{
  "id": "earrings-510",
  "title": "Heera & Manikyam Jhumka: A Touch of Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold setting",
    "featuring exquisite Polki Diamonds (uncut diamonds) and a vibrant",
    "teardrop-shaped Ruby (Manikyam). Impeccable Hyderabadi Polish ensures a lustrous",
    "enduring shine."
  ],
  "features": "Classic South Indian Jhumka design, with a floral arrangement top featuring Polki diamonds and a ruby accentuating the center. The main jhumka showcases a larger pear-shaped ruby bordered by a halo of Polki diamonds. Expertly crafted setting maximizes the brilliance of each gemstone. The overall design reflects a timeless elegance and showcases masterful craftsmanship.",
  "colors": [
    "Predominantly gold with striking contrasts from the vibrant red Ruby and sparkling White/Off-White of the Polki Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "traditional ceremonies (Pujas",
    "Vratams)",
    "festive celebrations like Diwali and Sankranti",
    "and special family gatherings. Adds a touch of traditional glamour to any formal event."
  ],
  "description": "A true heirloom piece crafted with the highest quality materials and traditional techniques. The combination of Polki diamonds and a natural Ruby carries cultural significance and symbolizes prosperity and good fortune. The exquisite craftsmanship ensures durability and a timeless appeal. This Jhumka is a statement piece that exudes grace and sophistication.",
  "tags": [
    "Jhumka",
    "Chettu Kammalu",
    "Polki Diamonds",
    "Manikyam",
    "Ruby",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Gold Earrings",
    "Indian Earrings",
    "Uncut Diamonds",
    "Heirloom Jewelry",
    "Ethnic Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "ear_rings_DPER8-755_2650",
  "collection": "ear"
}