{
  "id": "necklaces-107",
  "title": "Chandrika Kundan Necklace Set - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "High-Quality Kundan Polki Diamonds",
    "Natural Blue Sapphires. Features the signature Hyderabadi Polish for enduring luster. The Kundan stones are carefully set",
    "and the gold is hallmark certified for purity."
  ],
  "features": "This exquisite necklace features a classic Kundan setting, where uncut Polki diamonds are meticulously set within a gold frame. The centerpiece is a series of interconnected floral and geometric motifs, each meticulously crafted. The design incorporates strategically placed natural blue sapphires, adding a touch of color and regality. The setting showcases superior craftsmanship, common in traditional Hyderabadi jewelry.",
  "colors": [
    "Predominantly gold with a shimmering white (Polki) and pops of deep blue (Sapphire). The overall effect is a rich and luxurious color palette",
    "indicative of South Indian bridal jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagement ceremonies (Nischitartham)",
    "festivals (like Diwali and Sankranthi)",
    "and grand celebrations. Also suitable for formal events where a touch of traditional elegance is desired."
  ],
  "description": "This Chandrika Kundan Necklace Set is a true heirloom piece, embodying timeless elegance and superior craftsmanship. The combination of Polki diamonds and sapphires makes it unique, while the Hyderabadi polish ensures its lasting shine. Owning this piece is not just owning jewelry; it's owning a piece of South Indian cultural heritage. The use of natural gemstones adds to its value and ensures its enduring appeal.",
  "tags": [
    "Kundan",
    "Haaram",
    "Polki Diamonds",
    "Sapphire",
    "Necklace",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Traditions",
    "Wedding Jewelry",
    "Muhurtham",
    "Antique Jewelry",
    "Gold Necklace",
    "Uncut Diamonds",
    "Kundan Jewellery"
  ],
  "original_id": "diamond_jewellery_DPNK8-1401_0340",
  "collection": "diamond"
}