{
  "id": "necklaces-286",
  "title": "Divine Peacock Nakshi Haaram with Ruby Accent and Basra Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold Hallmark)",
    "High-Quality Cubic Zirconia (CZ)",
    "Natural Ruby (approx. 2 carats)",
    "Basra Pearls. Meticulously crafted with fine Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite haaram features a majestic peacock (Mayura) design, intricately crafted using traditional Nakshi work techniques. The central paisley motif is encrusted with sparkling CZ stones, leading to a pendant embellished with a vibrant ruby. Delicate Basra pearls dangle gracefully, adding a touch of sophistication. The necklace chain is carefully designed for comfort and features a secure clasp.",
  "colors": [
    "Predominantly gold with dazzling white from the CZ stones",
    "a pop of rich red from the ruby",
    "and subtle ivory hue from the Basra pearls",
    "creating a harmonious and opulent color palette."
  ],
  "occasions": [
    "Perfect for weddings (vivaham)",
    "engagements (nischitartham)",
    "festive celebrations like Sankranthi and Diwali",
    "as well as upscale social events. A timeless piece that enhances both traditional Kanjeevaram sarees and contemporary evening wear."
  ],
  "description": "A stunning blend of tradition and contemporary design, this haaram showcases the artistry of Hyderabadi craftsmanship. The intricate Nakshi work and vibrant ruby add a touch of regal elegance, while the use of high-quality CZ stones ensures exceptional sparkle and brilliance. The classic peacock design holds significant cultural symbolism, representing beauty, grace, and prosperity. This heirloom-worthy piece is a true investment in timeless style.",
  "tags": [
    "Haaram",
    "Necklace",
    "Nakshi",
    "Peacock",
    "Mayura",
    "Ruby",
    "Basra Pearls",
    "CZ",
    "Cubic Zirconia",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Vivaham",
    "Engagement",
    "Nischitartham",
    "Traditional",
    "Contemporary",
    "Fine Jewelry",
    "Investment Piece",
    "Heirloom"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0374_0571",
  "collection": "diamond"
}