{
  "id": "necklaces-717",
  "title": "Lakshmi Kasu Haaram with Emerald and Diamond Embellishments",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Natural Emeralds (Panna)",
    "Polki Diamonds (Uncut Diamonds)",
    "Hyderabadi Polish."
  ],
  "features": "This stunning Kasu Haaram features intricately designed Lakshmi Kasu coins suspended from a cascading arrangement of emerald beads and polki diamonds. The central pendant showcases a mesmerizing emerald center stone surrounded by a halo of dazzling polki diamonds. Each coin displays a finely detailed engraving of Goddess Lakshmi, embodying prosperity and abundance. Features a modern design with traditional South Indian elements. Diamond and emerald accents add a touch of royalty.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and Diamond White."
  ],
  "occasions": [
    "Ideal for traditional occasions such as weddings (Vivaham/పెళ్లి)",
    "festivals (Panduga/పండుగ)",
    "and religious ceremonies. Perfect for Muhurtham",
    "Seemantham",
    "or any grand celebration where you want to make a statement. Also",
    "stunning for formal events."
  ],
  "description": "This Kasu Haaram is a timeless investment, representing both cultural heritage and exquisite craftsmanship. The combination of emeralds and polki diamonds creates a unique and eye-catching design. The Lakshmi Kasu coins are believed to bring good fortune and prosperity. The Hyderabadi polish ensures a lasting luster and shine. A truly heirloom-worthy piece.",
  "tags": [
    "Kasu Mala",
    "Lakshmi Haaram",
    "Emerald Necklace",
    "Polki Diamond Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "లక్ష్మి కాసుల పేరు",
    "పచ్చల హారం",
    "వజ్రాల హారం",
    "దక్షిణ భారత ఆభరణాలు",
    "పెళ్లి ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-41-01 2_1223",
  "collection": "diamond"
}