{
  "id": "necklaces-1513",
  "title": "Maharani Emerald & Diamond Grand Haaram - COHar00028",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base with Hyderabadi Polish",
    "brilliant-cut diamonds (VVS clarity",
    "F-G color)",
    "natural Emeralds (oval and round cut",
    "vibrant green color). Accented with small rubies"
  ],
  "features": "Elaborate floral and paisley (manga malai) inspired design with intricate diamond setting. Central pendant features a large emerald surrounded by a halo of diamonds and ruby accents.. The Haaram is adorned with delicate heart-shaped diamond pendants, echoing traditional South Indian aesthetics with a contemporary feel. The intricate filigree and openwork contribute to a grand yet graceful appeal.",
  "colors": [
    "Predominantly gold and sparkling white (diamonds)",
    "complemented by the rich green of the emeralds and subtle red rubies."
  ],
  "occasions": [
    "Ideal for grand weddings",
    "bridal ensembles",
    "milestone celebrations like Seemantham (బొడ్డెమ్మ)",
    "or special occasions where a statement of elegance and tradition is desired. Perfect for Muhurtham (ముహూర్తం)",
    "reception",
    "or any major family function."
  ],
  "description": "This Grand Haaram is a masterpiece of South Indian craftsmanship. The combination of high-quality diamonds and vibrant emeralds creates a mesmerizing effect. Its timeless design ensures it will be treasured for generations. The Hyderabadi polish gives it a lasting sheen and antique charm. The meticulous diamond setting highlights the brilliance of each stone, making it a true statement piece.",
  "tags": [
    "Haaram",
    "Bridal Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "22K Gold",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Manga Malai",
    "Seemantham",
    "Muhurtham",
    "Grand Necklace",
    "Kanthabharanam",
    "బొడ్డెమ్మ",
    "ముహూర్తం",
    "పెద్ద హారం",
    "కంఠాభరణం"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-39 2_2131",
  "collection": "sjpl"
}