{
  "id": "necklaces-377",
  "title": "Polki Diamond and Emerald Grand Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Swarna)",
    "Polki Diamonds (Uncut Diamonds",
    "approximately VS2 clarity)",
    "Emerald (Panna). Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This modern haaram features a series of interconnected, intricately crafted triangular settings, each showcasing a dazzling Polki diamond. The design culminates in a stunning oval-shaped emerald pendant, surrounded by a halo of delicate diamonds. The triangular motif symbolizes strength and stability, a modern twist on traditional Indian designs. The reverse of the emerald pendant showcases meticulous kundan setting (if applicable) - a testament to the craftsman's dedication.",
  "colors": [
    "Predominantly gold and white (from the diamonds) with a vibrant pop of green from the emerald."
  ],
  "occasions": [
    "Perfect for weddings (vivaham)",
    "grand receptions",
    "and high-profile events. Also suitable for milestone celebrations like anniversaries or significant birthdays. A statement piece for the modern Indian woman who values tradition with a contemporary flair."
  ],
  "description": "This Haaram seamlessly blends traditional Polki diamond craftsmanship with a modern, geometric design. The high-quality emerald adds a touch of regality. The Hyderabadi polish ensures lasting brilliance, and the design allows for comfortable wear despite its grand appearance. The use of Polki diamonds bestows a unique, ethereal sparkle unlike traditional brilliant-cut diamonds. Crafted with utmost care and precision in our Hyderabad workshop, each piece embodies the legacy of our heritage.",
  "tags": [
    "Haaram",
    "Polki Diamonds",
    "Emerald",
    "Panna",
    "Necklace",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Contemporary Design",
    "Grand Necklace",
    "Vivaham",
    "Statement Piece",
    "Kundan"
  ],
  "original_id": "diamond_jewellery_IMG-20241218-WA0008_0770",
  "collection": "diamond"
}