{
  "id": "necklaces-170",
  "title": "The 'Chandrika' Polki Kundan Bridal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Natural Pearls",
    "Emerald Beads",
    "Ruby Beads. Crafted with a traditional Hyderabadi Polish for an antique lustre."
  ],
  "features": "This stunning choker-style Haaram features a mesmerizing Polki Kundan setting, meticulously handcrafted by skilled artisans. The floral motifs are intricately designed with uncut diamonds. The central pendant showcases a magnificent Polki diamond surrounded by vibrant emeralds. Dangler details with natural pearls and ruby beads add a touch of elegance. Features an adjustable gold chain for a comfortable fit.",
  "colors": [
    "Antique Gold",
    "Emerald Green",
    "Ruby Pink",
    "Ivory White (Pearls)",
    "Clear (Polki Diamonds). A classic South Indian color palette that exudes regal charm."
  ],
  "occasions": [
    "Ideal for bridal wear (Muhurtham",
    "Reception)",
    "Seemantham (baby shower)",
    "Half-Saree function (Langa Voni)",
    "or any grand celebration where you want to make a statement. This piece is also suitable for sophisticated modern events where a touch of tradition is desired."
  ],
  "description": "A true heirloom piece, the 'Chandrika' Haaram embodies the rich heritage of South Indian jewelry. The combination of Polki diamonds, pearls, and vibrant gemstones creates a breathtaking effect. Its antique finish and intricate craftsmanship ensure that it will be treasured for generations to come. This piece is a symbol of prosperity, beauty, and auspicious beginnings.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki",
    "Kundan",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Uncut Diamonds",
    "Pearls",
    "Emeralds",
    "Ruby",
    "22K Gold",
    "Traditional Jewelry",
    "Antique Jewelry",
    "Vaddanam",
    "Andhra Jewellery",
    "Telangana Jewellery",
    "Muhurtham",
    "Seemantham",
    "Half Saree"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0009_0418",
  "collection": "diamond"
}