{
  "id": "necklaces-355",
  "title": "Diamond Floral Vine Haaram Set with Jhumka Earrings",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Finely crafted in 18K Gold",
    "meticulously studded with sparkling Cubic Zirconia (CZ) stones. Accented with vibrant Ruby and Emerald gemstones",
    "and lustrous cultured Pearls. Features a Hyderabadi Polish for enhanced brilliance and longevity."
  ],
  "features": "This stunning Haaram showcases a delicate floral vine design, crafted with intricate detailing. The necklace features multiple leaf motifs with a central pendant adorned with a Ruby cabochon. The Jhumka earrings mirror the pendant design, with a matching Ruby and pearl drop. The overall design offers a contemporary take on traditional South Indian jewelry.",
  "colors": [
    "Predominantly gold with shimmering white CZ stones",
    "highlighted by the deep red of the Ruby",
    "the vibrant green of the Emerald",
    "and the soft white of the Pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "engagement parties (Nischayathartham)",
    "and other special occasions. The modern design also makes it suitable for upscale social gatherings."
  ],
  "description": "A dazzling combination of traditional Haaram design and modern sparkle. The high-quality CZ stones offer a brilliant shimmer at a fraction of the cost of real diamonds. The set is exquisitely crafted with attention to detail, ensuring both beauty and durability. An ideal statement piece for the modern South Indian bride.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Jhumka Earrings",
    "CZ Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Nischayathartham",
    "Bridal Jewelry",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0469_0651",
  "collection": "diamond"
}