{
  "id": "necklaces-344",
  "title": "Manoharam Diamond Haar - Exquisite Grandeur for Your Special Occasions",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features high-quality",
    "brilliant-cut Diamonds of VS clarity and a vivid Oval cut Ruby at the center. Meticulously hand-set stones to ensure maximum sparkle and durability."
  ],
  "features": "This stunning Haar showcases a delicate floral design intricately studded with shimmering diamonds. The central pendant features a striking oval-cut ruby, surrounded by an elaborate diamond lattice. This lattice continues throughout the necklace adding a touch of traditional South Indian elegance. The pendant design exudes timeless sophistication, blending seamlessly with both traditional and modern attire.",
  "colors": [
    "Predominantly Gold with sparkling white Diamonds and a captivating Red Ruby centerpiece."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements",
    "receptions",
    "anniversaries",
    "and other grand celebrations. A timeless piece suitable for Muhurtham ceremonies",
    "Seemantham celebrations",
    "or a Half-Saree function (Langa Voni/Pattu Pavadai). Also",
    "ideal for adding a touch of grandeur to any festive event."
  ],
  "description": "A captivating blend of traditional South Indian design and modern elegance. The high-quality diamonds and meticulous craftsmanship ensure lasting beauty and value. The ruby adds a touch of vibrant color and symbolizes love and passion. A cherished heirloom to be passed down through generations. Handcrafted Hyderabadi Gold guarantees exceptional luster and finish.",
  "tags": [
    "Diamond Haar",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Ruby Necklace",
    "22K Gold",
    "Hyderabadi Polish",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Vivaham",
    "Grand Necklace",
    "Floral Design",
    "Diamond Jewelry",
    "Engagement Necklace",
    "Ruby",
    "Pattu Pavadai",
    "Langa Voni",
    "Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0458_0640",
  "collection": "diamond"
}