{
  "id": "waistbands-013",
  "title": "Exquisite Diamond Vaddanam with Emerald and Ruby Accent",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "High-purity Gold (estimated 22K)",
    "Brilliant Cut Diamonds (VS clarity)",
    "Emerald (4.38 Carats)",
    "Ruby (7.48 Carats)",
    "Natural Pearls (61.10 Carats). Features a lustrous",
    "Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "Intricately crafted with a stunning floral design, this Vaddanam showcases exquisite diamond detailing. The central emerald is surrounded by a halo of diamonds, creating a focal point of regal elegance. The design is inspired by traditional South Indian motifs, with delicate floral patterns and pearl drops along the bottom edge that add a touch of classic charm.",
  "colors": [
    "Gold",
    "White (diamonds)",
    "Green (emerald)",
    "Red (ruby)",
    "Cream (pearls). This combination embodies the traditional South Indian color palette for auspicious occasions."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "engagements",
    "Bharatanatyam performances",
    "and other grand celebrations. A statement piece for Seemantham or Voni function (half-saree ceremony). Also suitable for formal gatherings where you want to make a lasting impression."
  ],
  "description": "This Vaddanam is a true heirloom piece, showcasing unparalleled craftsmanship and timeless design. The combination of diamonds, emerald, ruby, and pearls represents prosperity and good fortune, making it a meaningful investment. The Hyderabadi polish ensures a long-lasting shine, while the classic design transcends fleeting trends. It's a symbol of cultural heritage and exquisite taste.",
  "tags": [
    "Vaddanam",
    "Oddiyanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Voni function",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Bridal Accessory",
    "22K Gold",
    "Floral Design",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02 2_1293",
  "collection": "diamond"
}