{
  "id": "necklaces-148",
  "title": "Bloom Polki Haaram: Emerald and Diamond Cascade",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Polki Diamonds (uncut diamonds)",
    "Emeralds",
    "Rubies",
    "Pearls. Gold chain features alternating Emerald and Ruby beads."
  ],
  "features": "This exquisite piece features a floral pendant design, with each petal crafted from vibrant green enamel encircling a Polki diamond. A delicate diamond-studded cap suspends a cascading tassel of Emerald and Ruby beads, finished with lustrous pearls. The Polki diamonds are set in a Kundan style, showcasing traditional Indian craftsmanship. The alternating Emerald and Ruby beads on the chain provide a modern twist.",
  "colors": [
    "Gold",
    "Green (Emerald)",
    "Red (Ruby)",
    "White (Diamonds and Pearls)"
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "receptions",
    "festive celebrations",
    "and special occasions. Also suitable for modern formal events where a touch of cultural elegance is desired."
  ],
  "description": "This unique Polki Haaram blends traditional South Indian design with contemporary style. The exquisite craftsmanship and use of high-quality gemstones make it a valuable and timeless piece. The Polki diamonds are ethically sourced, and the Hyderabadi polish ensures lasting luster and durability. The combination of Emeralds, Rubies, and Polki diamonds symbolizes prosperity and good fortune, making it a cherished heirloom.",
  "tags": [
    "Haaram",
    "Polki Necklace",
    "Kundan Jewelry",
    "Emerald Necklace",
    "Ruby Necklace",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Ethnic Jewelry",
    "Statement Necklace",
    "Tassel Necklace",
    "Heirloom Jewelry",
    "పతకం",
    "నగలు",
    "వైవాహిక నగలు"
  ],
  "original_id": "diamond_jewellery_DPPD8-1625_0381",
  "collection": "diamond"
}