{
  "id": "necklaces-1258",
  "title": "Enchanting Swarna Moti Haaram - A Symphony of Gold and Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity gold (approximately 18K)",
    "this exquisite Haaram features lustrous South Sea Pearls (Moti) weighing 128.12 carats. Adorned with approximately 56.34 carats of meticulously selected Navratna gemstones",
    "including Sapphires",
    "Rubies",
    "Emeralds",
    "and Diamonds",
    "showcasing brilliant cuts and clarity. Finished with traditional Hyderabadi Polish for a rich",
    "enduring shine."
  ],
  "features": "This contemporary Haaram design showcases a beautiful floral motif, with intricately crafted gold flowers studded with dazzling diamonds. The centerpiece features seven large, golden South Sea Pearls, elegantly arranged to enhance the neckline. The necklace incorporates a modern take on traditional design elements, with a seamless blend of floral and gemstone clusters. Features pavé setting for diamonds and prong setting for pearls.",
  "colors": [
    "The overall color palette is a luxurious combination of golden yellow (Pearls and Gold)",
    "vibrant multi-colored gemstones (Navratnas)",
    "and sparkling white (Diamonds). This creates a captivating and auspicious blend of colors."
  ],
  "occasions": [
    "Perfect for grand celebrations such as weddings (Vivaha)",
    "receptions",
    "and milestone events. Also ideal for special occasions like Seemantham",
    "half-saree functions",
    "and upscale social gatherings. A statement piece that elevates any ensemble."
  ],
  "description": "This Swarna Moti Haaram is a testament to exceptional craftsmanship and timeless elegance. The combination of South Sea Pearls, Navratna gemstones, and high-purity gold creates a valuable and auspicious heirloom. The unique design seamlessly blends traditional South Indian aesthetics with contemporary sensibilities, making it a cherished addition to any jewelry collection. The Hyderabadi Polish ensures lasting brilliance and durability.",
  "tags": [
    "Haaram",
    "Necklace",
    "Moti",
    "Pearl",
    "Navratna",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Seemantham",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Fine Jewelry",
    "Heirloom Jewelry",
    "Swarna",
    "Jewellery",
    "Bridal Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-13-02-30_1854",
  "collection": "sjpl"
}