{
  "id": "necklaces-244",
  "title": "Lakshmi Kasu Haaram - Diamond and Emerald Divine Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Emeralds",
    "Rubies",
    "Carnelian beads. Hyderabadi Polish. Gold purity may vary +/- 0.5K"
  ],
  "features": "Temple-inspired Haaram featuring Goddess Lakshmi pendant at the center, meticulously crafted with Polki diamonds. The intricate design showcases traditional South Indian craftsmanship, with alternating emerald and ruby accents. Carnelian beads are suspended along the necklace's length. The setting uses a combination of closed and open settings for optimal diamond brilliance. The design incorporates elements resembling 'Mayura' (peacock) motifs. The necklace has a delicate texture.",
  "colors": [
    "Gold (Yellow)",
    "Emerald (Green)",
    "Ruby (Red)",
    "Carnelian (Orange)"
  ],
  "occasions": [
    "Weddings (Vivaha Mahotsavam)",
    "Engagements",
    "Religious ceremonies (Pooja)",
    "Festive occasions (Diwali",
    "Ugadi)",
    "Bridal wear",
    "Seemantham",
    "Half-Saree Function."
  ],
  "description": "This Lakshmi Kasu Haaram is a timeless piece that blends tradition with elegance. The presence of the Goddess Lakshmi bestows blessings of prosperity and abundance. The vibrant combination of emeralds, rubies, and carnelian beads adds a touch of royalty. This Haaram is meticulously handcrafted by skilled artisans using traditional techniques, guaranteeing exceptional quality and durability. Polki diamonds offer a unique brilliance that sets this piece apart from contemporary diamond jewellery. A cherished heirloom for generations to come, symbolizing cultural heritage and enduring beauty.",
  "tags": [
    "Haaram",
    "Necklace",
    "Temple Jewellery",
    "Kasu Maala",
    "Lakshmi Pendant",
    "Polki Diamond",
    "Emerald",
    "Ruby",
    "Carnelian",
    "South Indian Jewelry",
    "Telugu Jewellery",
    "Traditional Jewellery",
    "Wedding Jewellery",
    "Bridal Jewellery",
    "Festive Jewellery",
    "Hyderabadi Jewellery",
    "Mayura Design"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0324_0521",
  "collection": "diamond"
}