{
  "id": "necklaces-032",
  "title": "Mayura Manjari: 22K Gold Peacock Nakshi Pendant with Coral Drop",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "Natural Coral (Pagadam)",
    "Cubic Zirconia (CZ). The gold features a lustrous Hyderabadi Polish for exceptional shine and durability."
  ],
  "features": "This exquisite pendant showcases intricate Nakshi work, a hallmark of South Indian temple jewelry. The central design features a majestic peacock (Mayura), meticulously handcrafted with detailed texturing. The open filigree design is adorned with sparkling CZ stones, adding a touch of modern brilliance. A vibrant Coral drop (Pagadam Gundla) adds a traditional touch, symbolizing prosperity and good fortune.",
  "colors": [
    "Predominantly yellow gold with the fiery red of the Coral gemstone and the brilliant white of the CZ stones."
  ],
  "occasions": [
    "Perfect for traditional occasions like weddings (Vivaha)",
    "festivals (Panduga)",
    "and Bharatanatyam performances. Its elegant design also makes it suitable for contemporary parties and celebrations."
  ],
  "description": "This 'Mayura Manjari' pendant is a testament to timeless South Indian artistry. The intricate Nakshi work, the vibrant Coral drop, and the shimmering CZ stones create a harmonious blend of tradition and modernity. The high-quality 22K gold and the durable Hyderabadi polish ensure lasting beauty and value. The peacock motif symbolizes beauty, grace, and prosperity, making it a meaningful and cherished heirloom.",
  "tags": [
    "Pendant",
    "Addigai",
    "Locket",
    "Nakshi Jewelry",
    "Temple Jewelry",
    "South Indian Jewelry",
    "22K Gold",
    "Coral",
    "Pagadam",
    "Peacock",
    "Mayura",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Traditional Jewelry",
    "CZ",
    "Filigree",
    "handcrafted",
    "gold",
    "gemstones"
  ],
  "original_id": "diamond_jewellery_04d99356-3655-4b77-bb97-edf5a716e2b0_0069",
  "collection": "diamond"
}