{
  "id": "necklaces-899",
  "title": "Emerald and CZ Chandramukhi Haaram - A Timeless Adornment",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal alloy with high-quality CZ stones",
    "Emerald green stones",
    "tiny ruby stones",
    "and faux pearl accents. Finished with a durable Hyderabadi polish for a long-lasting",
    "radiant shine."
  ],
  "features": "This exquisite Chandramukhi Haaram features a captivating floral design with emerald green accents. The intricate filigree work showcases the skilled craftsmanship, while the dainty faux pearl drops add a touch of classic elegance. The pendant features a traditional floral and paisley design, set with emerald green and sparkling CZ stones. ",
  "colors": [
    "Emerald Green",
    "Ruby Red",
    "Sparkling White (CZ)",
    "and Soft Gold (Hyderabadi Polish finish)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "Seemantham",
    "bridal wear",
    "and other grand celebrations. Also suitable for festive occasions (Pandagalu) and formal events where you want to make a statement."
  ],
  "description": "This Chandramukhi Haaram blends traditional South Indian design with contemporary style. The high-quality CZ stones offer a dazzling sparkle comparable to diamonds, while the durable Hyderabadi polish ensures lasting beauty. It is a versatile piece that can be paired with both traditional and modern outfits, making it a valuable addition to any jewelry collection. A statement piece perfect for any South Indian bride. Lightweight for comfort during extended wear.",
  "tags": [
    "Haaram",
    "Chandramukhi",
    "Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "CZ Jewelry",
    "Emerald Jewelry",
    "Pearl Drops",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Pandagalu"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0291_2360",
  "collection": "necklace"
}