{
  "id": "necklaces-1173",
  "title": "Divine Blossom Diamond Haaram with Emerald and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Gold with a radiant Hyderabadi Polish. Adorned with meticulously set brilliant-cut Diamonds (VVS clarity",
    "G color)",
    "a central Emerald (1.65 carats) in the pendant",
    "and delicate Freshwater Pearls. The design also incorporates ruby accents (2.25 carats). Total gross weight: 149.220 grams. Diamond weight (necklace): 15.00 carats. Diamond weight (pendant): 3.84 carats."
  ],
  "features": "This exquisite haaram features a cascading floral design, intricately set with diamonds. The pendant boasts a peacock-inspired motif with a central emerald, symbolizing prosperity and good fortune. Delicate pearl drops enhance the necklace's ethereal beauty. The setting ensures maximum brilliance for each diamond, creating a stunning visual effect.",
  "colors": [
    "Predominantly gold with shimmering white diamonds. The central emerald adds a vibrant pop of green",
    "complemented by the soft luster of the pearls. Ruby accents provide subtle red highlights."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "receptions",
    "and other festive celebrations. Also suitable for formal events where you want to make a statement with timeless elegance."
  ],
  "description": "A true heirloom piece, this Diamond Haaram showcases impeccable craftsmanship and timeless design. The combination of diamonds, emeralds, and pearls makes it a symbol of prosperity and good fortune. The Hyderabadi polish ensures a lasting, radiant finish. A stunning embodiment of South Indian jewelry artistry, perfect for the discerning collector.",
  "tags": [
    "Diamond Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Emerald Necklace",
    "Pearl Necklace",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "VVS Clarity",
    "G Color Diamonds",
    "Vivahaalu",
    "Nischitartham",
    "Haaram",
    "Guttiapusalu Haaram inspired",
    "Floral Design",
    "Peacock Pendant"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-57-59 2_1725",
  "collection": "sjpl"
}