{
  "id": "necklaces-251",
  "title": "Divya Chandrika Haaram - Exquisite Diamond and Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal: Alloy",
    "Plated with 22K Gold. Adorned with high-quality Cubic Zirconia (CZ) diamonds",
    "Emerald (central stone)",
    "Ruby accents",
    "and Seed Pearls. Finished with a lustrous Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This modern Haaram features a graduated, crescent-shaped collar intricately studded with shimmering CZ diamonds. The central pendant showcases a traditional floral motif, incorporating Emerald and Ruby gemstones, enhanced by delicate seed pearls. The design balances contemporary aesthetics with traditional South Indian elements, making it a versatile piece.",
  "colors": [
    "Predominantly gold with white diamonds. Accented with vibrant green from the Emerald",
    "deep red from the Rubies",
    "and soft cream from the Seed Pearls."
  ],
  "occasions": [
    "Ideal for modern weddings",
    "receptions",
    "engagement ceremonies",
    "or any special occasion where you want to make a statement. Also suitable for traditional events such as Seemantham (baby shower) or half-saree function."
  ],
  "description": "This Divya Chandrika Haaram is a stunning fusion of modern design and traditional South Indian aesthetics. The meticulous craftsmanship, high-quality CZ diamonds, and vibrant gemstone accents ensure a dazzling look. The Hyderabadi polish guarantees lasting brilliance, making it a cherished addition to your jewelry collection. Its lightweight design ensures comfortable wear.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "CZ Diamonds",
    "Emerald",
    "Ruby",
    "Seed Pearls",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Temple Jewelry",
    "Contemporary Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Half Saree Ceremony",
    "Gold Plated",
    "Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0331_0528",
  "collection": "diamond"
}