{
  "id": "necklaces-941",
  "title": "The 'Manasa' Diamond & Gold Mango Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish. Features high-quality",
    "brilliant-cut Diamonds (SI1 Clarity",
    "G Color) and a subtle Ruby accent at the central pendant. Gold weight: 30 grams. Diamond weight: 1.5 carats."
  ],
  "features": "This exquisite Haaram showcases a delicate and modern take on the classic mango (paisley) motif. The design features a series of interconnected gold circles, each adorned with sparkling diamonds. Alternating with these circles are the meticulously crafted mango-shaped pendants, pavé-set with diamonds and finished with fine milgrain detailing. The central pendant is slightly larger and features a small ruby, adding a touch of traditional South Indian auspiciousness (Shubham).",
  "colors": [
    "Primarily Yellow Gold and sparkling White Diamonds",
    "with a subtle hint of Red from the Ruby accent."
  ],
  "occasions": [
    "Perfect for modern brides",
    "engagement ceremonies",
    "cocktail parties",
    "and festive occasions. A subtle statement piece ideal for both traditional Indian outfits and contemporary Western attire. Can also be worn for smaller gatherings or as a special gift for a loved one."
  ],
  "description": "This 'Manasa' Haaram blends traditional South Indian aesthetics with a contemporary design sensibility. The use of high-quality diamonds and 22K gold ensures lasting beauty and value. The Hyderabadi polish gives the gold a rich, warm glow. The delicate mango design, a symbol of prosperity and fertility, makes this necklace an ideal heirloom piece. The necklace is lightweight and comfortable, making it perfect for all-day wear.",
  "tags": [
    "Haaram",
    "Mango Necklace",
    "Diamond Necklace",
    "22K Gold",
    "South Indian Jewelry",
    "Indian Bridal Jewelry",
    "Temple Jewelry",
    "Paisley Design",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "kanthaabharanam",
    "కంఠాభరణం",
    "మామిడి డిజైన్",
    "Malle Puvvu Design"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0335_2402",
  "collection": "necklace"
}