{
  "id": "necklaces-183",
  "title": "Padma Emerald & Rose Quartz Antique Finish Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Antique Hyderabadi Polish. Features natural",
    "cushion-cut Rose Quartz",
    "round-cut Emeralds",
    "and brilliant-cut Uncut Diamonds (Polki). Exceptional gemstone clarity and color saturation."
  ],
  "features": "This exquisite Haaram showcases a harmonious blend of traditional and contemporary design elements. The necklace features a delicate arrangement of emeralds and diamonds, leading to a central Rose Quartz pendant encased in a diamond floral motif. The centerpiece is a large, intricately carved Green Quartz pendant, surrounded by an elaborate diamond setting in a floral design, exuding elegance and grandeur. Handcrafted with meticulous detail, showcasing the best of Hyderabadi craftsmanship.",
  "colors": [
    "The palette is dominated by the blush pink of the Rose Quartz",
    "the vibrant green of the Emeralds and Green Quartz",
    "and the warm golden hue of the antique-polished gold. The diamonds provide a brilliant white contrast."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaahaalu)",
    "engagement ceremonies (Nischayalu)",
    "traditional festivals (Pandugalu)",
    "and upscale social events. A treasured heirloom piece for a Seemantham (baby shower) or half-saree function."
  ],
  "description": "This Haaram is a masterpiece of South Indian jewelry design, blending time-honored techniques with modern aesthetics. The use of high-quality natural gemstones, combined with the meticulous craftsmanship of the Hyderabadi polish, makes this piece a valuable investment. Its unique design and vibrant color palette ensure it will be a cherished statement piece for generations. An ideal choice for the discerning woman who appreciates heritage and artistry.",
  "tags": [
    "Haaram",
    "Necklace",
    "Rose Quartz",
    "Emerald",
    "Uncut Diamond",
    "Polki",
    "Antique Finish",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Vivaahaalu",
    "Nischayalu",
    "Pandugalu",
    "Seemantham",
    "Heirloom Jewelry",
    "Green Quartz",
    "Ethnic Jewelry",
    "Statement Necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0024_0432",
  "collection": "diamond"
}