{
  "id": "earrings-161",
  "title": "Exquisite Kundan Polki Jhumka with Coral and Pearl Drops - A Timeless Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Kundan)",
    "Natural Corals",
    "Freshwater Pearls. Features Hyderabadi Polish for a rich",
    "lustrous finish."
  ],
  "features": "This magnificent jhumka showcases the traditional Kundan setting technique, where uncut polki diamonds are meticulously set in gold foil. The lotus design at the top, embellished with rubies, symbolizes purity and enlightenment. Cascading coral and pearl drops create a graceful, eye-catching movement. The tiered structure with a green accent in the middle enhances the Jhumka's grandeur and cultural significance.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Coral",
    "White Pearls",
    "Emerald Green. The warm gold beautifully complements the vibrant hues of the rubies and corals",
    "creating a classic South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "bridal wear",
    "temple visits",
    "festive occasions (like Sankranthi or Diwali)",
    "and traditional South Indian ceremonies such as Seemantham or Half-Saree Function."
  ],
  "description": "This Jhumka embodies timeless elegance and traditional South Indian craftsmanship. The use of high-quality Kundan polki diamonds, natural corals, and lustrous pearls ensures a piece of exceptional value and beauty. Its intricate design and symbolic elements make it a treasured heirloom to be passed down through generations. The Hyderabadi polish gives the gold a unique sheen that enhances its richness. This piece masterfully balances tradition with an opulent aesthetic.",
  "tags": [
    "Jhumka",
    "Kammal",
    "Kundan",
    "Polki",
    "Uncut Diamond",
    "Coral",
    "Pearl",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Seemantham",
    "Vivaha",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_DPER8-1645_0292",
  "collection": "diamond"
}