{
  "id": "necklaces-283",
  "title": "Navratna Kundan Haar: A Symphony of Heritage and Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality gold-plated alloy",
    "featuring meticulously set Kundan stones. Adorned with vibrant Navratna gemstones (Emerald",
    "Ruby",
    "Pearl",
    "Coral",
    "Zircon) reflecting astrological significance. Finished with delicate pearl drops."
  ],
  "features": "This exquisite Kundan Haaram showcases the traditional art of stone setting. The centerpiece features a beautifully designed pendant studded with Navratnas in a floral motif. The gold-plated chain is intricately embellished with Kundan stones in a floral pattern, interspersed with delicate pearl drops, adding a touch of elegance. The design draws inspiration from classic temple jewelry (గుడి ఆభరణాలు) with a contemporary flair.",
  "colors": [
    "Predominantly gold with vibrant gemstone hues of green (Emerald)",
    "red (Ruby & Coral)",
    "and iridescent white (Kundan & Pearl). This creates a rich and auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "receptions",
    "auspicious ceremonies (శుభకార్యాలు)",
    "and festive occasions. Ideal for a Seemantham (సీమంతం) or Half-Saree Function (లంగ ఓని ఫంక్షన్). Can also be styled for a modern fusion look."
  ],
  "description": "Embrace tradition with this Navratna Kundan Haar, a symbol of prosperity and good fortune. Each gemstone holds astrological significance, making it a meaningful and beautiful piece. The intricate Kundan setting and durable gold-plated finish ensure lasting beauty. This Haaram is a versatile investment that will elevate any outfit.",
  "tags": [
    "Kundan",
    "Haaram",
    "Navratna",
    "Necklace",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "శుభకార్యాలు",
    "ఆభరణాలు",
    "కంఠహారం",
    "పెళ్ళి",
    "సీమంతం"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0368_0565",
  "collection": "diamond"
}