{
  "id": "necklaces-361",
  "title": "Dazzling Diamond and Gemstone Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Rubies",
    "Natural Emeralds",
    "Cultured Pearls. Hyderabadi Polish for exceptional luster."
  ],
  "features": "This captivating Haaram showcases a delicate floral and paisley motif, meticulously crafted with dazzling diamonds. The design incorporates vibrant rubies and emeralds, adding a touch of traditional South Indian elegance. Pearls are delicately placed at the bottom of each paisley motif, to elevate this piece. The fine metal net adds to the delicate look and feel of this piece.",
  "colors": [
    "Yellow Gold",
    "White Diamonds",
    "Deep Red Rubies",
    "Vivid Green Emeralds",
    "Lustrous White Pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "anniversaries",
    "and grand celebrations. Ideal for a Seemantham or any special occasion where you want to make a statement."
  ],
  "description": "This Haaram seamlessly blends traditional South Indian design elements with modern aesthetics. The use of high-quality diamonds, rubies, and emeralds ensures lasting brilliance and enduring value. A true heirloom piece, handcrafted in Hyderabad with meticulous attention to detail. The design provides a perfect balance of tradition and modern trends. This piece is perfect for those who wish to make a statement with class.",
  "tags": [
    "Diamond Haaram",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "Hyderabad Jewelry",
    "Vaddanam",
    "Bridal Jewelry",
    "Contemporary Jewelry",
    "Temple Jewelry",
    "Indian Jewelry",
    "Ruby Jewellery",
    "Emerald Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0475_0657",
  "collection": "diamond"
}