{
  "id": "necklaces-424",
  "title": "Exquisite Peacock Emerald Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Gold (Dwt: 18.62) studded with a total of 8.43 carats of vibrant emeralds (Eme: 8.43(11))",
    "complemented by 4.07 carats of brilliant rubies (Ruby: 4.07(13)) and high-quality diamonds totaling 164.400 Grams (Gwt: 164.400). Showcases the signature Hyderabadi Polish for a lasting luster."
  ],
  "features": "This stunning Haaram features intricately designed floral and peacock motifs, symbols of beauty and prosperity. The pendant is adorned with delicate Jhumkas. The craftsmanship showcases exceptional detail, with each emerald and diamond meticulously set. The floral links are crafted with peacock motifs and are pave set with diamonds. The Jhumka pendant's intricate lattice design is a testament to skilled artistry, reflecting the rich heritage of South Indian jewelry.",
  "colors": [
    "The color palette is a harmonious blend of rich gold",
    "sparkling diamonds",
    "and vibrant emerald green",
    "creating a visually striking contrast that exudes elegance. Ruby accents enrich the piece with a touch of warmth."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "bridal wear",
    "religious ceremonies",
    "and other special occasions. A statement piece for grand celebrations (pedda pandugalu)",
    "and half-saree functions."
  ],
  "description": "This Haaram is a symbol of timeless beauty and cultural significance. The impeccable craftsmanship, high-quality gemstones, and traditional design make it a valuable heirloom piece. The peacock motif represents grace and prosperity, making it a meaningful gift for any significant occasion. The combination of traditional design and modern craftsmanship ensures both durability and a unique aesthetic. Possesses significant investment and sentimental value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Jhumka",
    "Peacock Motif",
    "Muhurtham",
    "Pedda Pandugalu",
    "சீமந்தம்",
    "పెళ్లి నగలు",
    "Emerald Necklace",
    "Gold Necklace",
    "Diamond Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-07 2_0865",
  "collection": "diamond"
}