{
  "id": "necklaces-1150",
  "title": "Navaratna Pendant - A Timeless Blend of Tradition and Elegance",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (approximately 18.97 grams)",
    "Central Emerald (4.26 carats)",
    "Ruby",
    "Pearl",
    "Coral",
    "Yellow Sapphire",
    "Green Agate",
    "Blue Sapphire",
    "Garnet",
    "Diamonds (approximately 1.50 carats",
    "67 stones). Hyderabadi Polish."
  ],
  "features": "This exquisite pendant features a classic Navaratna design, incorporating nine carefully selected gemstones surrounding a central vivid green emerald. The arrangement is inspired by traditional South Indian astrology and believed to bring prosperity and good fortune. The open setting allows maximum light to pass through each gemstone, enhancing its brilliance. Fine diamond detailing adds a touch of modern sparkle, creating a beautiful contrast with the traditional setting.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "Pearl White",
    "Coral Orange",
    "Yellow Sapphire Yellow",
    "Green Agate Light Green",
    "Blue Sapphire Dark Blue",
    "Garnet Dark Red. The rich and vibrant colors of the Navaratna stones create a visually stunning piece."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "festivals (like Diwali and Sankranthi)",
    "religious ceremonies",
    "or any special occasion where you want to make a statement. Also perfect for adding a touch of traditional elegance to contemporary outfits."
  ],
  "description": "This Navaratna Pendant is more than just a piece of jewelry; it's a symbol of tradition, prosperity, and well-being. The combination of high-quality gemstones and expert craftsmanship makes it a valuable heirloom to be cherished for generations. Its unique design allows it to be worn with both traditional and modern attire, making it a versatile addition to any jewelry collection. The presence of Diamonds adds a touch of contemporary glam.",
  "tags": [
    "Navaratna",
    "Pendant",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Gemstone Pendant",
    "Emerald",
    "Ruby",
    "Pearl",
    "Coral",
    "Yellow Sapphire",
    "Green Agate",
    "Blue Sapphire",
    "Garnet",
    "Diamond",
    "22K Gold",
    "Hyderabadi Polish",
    "Vivaha",
    "Festival Jewelry",
    "Abharanam",
    "Andhra Jewellery",
    "Telugu Jewellery",
    "Astrological Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-04-21-12-34-11 2_1696",
  "collection": "sjpl"
}