{
  "id": "necklaces-629",
  "title": "The Padmavathi Diamond & Emerald Haaram: A Floral Symphony",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with a Hyderabadi polish. Features brilliant-cut Diamonds (VVS Clarity",
    "EF Color) and vibrant",
    "natural Emeralds (faceted). Accented with lustrous",
    "perfectly round South Sea Pearls."
  ],
  "features": "This exquisite haaram showcases an intricate floral design meticulously handcrafted by skilled artisans. The diamonds are set in a pavé setting, maximizing their brilliance. Emeralds are strategically placed to accentuate the floral motif and add a touch of regal elegance. The delicate pearl drops enhance its graceful movement. The pendant features the same floral and emerald design for extra elegance.",
  "colors": [
    "Predominantly gold and white (diamond) with captivating green (emerald) accents. The pearl drops offer a soft",
    "iridescent contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and significant celebrations. Suitable for modern brides seeking a contemporary twist on traditional jewelry. Ideal for reception parties and grand events where you want to make a statement."
  ],
  "description": "This haaram is a testament to timeless elegance and superior craftsmanship. The combination of brilliant diamonds, vibrant emeralds, and lustrous pearls creates a captivating piece that will be treasured for generations. The Hyderabadi polish enhances the gold's richness, while the contemporary design ensures versatility. A true heirloom piece!",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "Telugu Jewelry",
    "Vaddanam",
    "Kempu",
    "South Indian Wedding",
    "Engagement Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-06_1135",
  "collection": "diamond"
}