{
  "id": "necklaces-136",
  "title": "Divya Mayura Kanthaabharanam - Polki Diamond Peacock Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold setting",
    "Uncut Polki Diamonds",
    "High-quality Rubies",
    "Emeralds",
    "and Gold beads. Features a delicate gold chain woven through the bead strands. Finished with a rich",
    "Hyderabadi polish for a lasting luster."
  ],
  "features": "This exquisite necklace features a magnificent peacock (Mayura) pendant, meticulously crafted with Polki diamonds in a Kundan setting. The pendant showcases intricate detailing with rubies and emeralds, symbolizing prosperity and good fortune. The double-stranded Gutha Pusalu (beaded) necklace is made up of alternating ruby and emerald beads, creating a visually stunning design. Dangles with polki diamonds and gem beads add movement and sparkle.",
  "colors": [
    "Primarily gold",
    "with vibrant accents of ruby red and emerald green. The Polki diamonds add a touch of classic white sparkle."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements ( நிச்சయ తాంబూలం)",
    "traditional ceremonies like Seemantham or Half-Saree functions (Langa Voni Function)",
    "and grand celebrations. A timeless piece to be cherished for generations."
  ],
  "description": "This Mayura Kanthaabharanam is a testament to exquisite South Indian craftsmanship. The use of uncut Polki diamonds, coupled with vibrant rubies and emeralds, creates a unique and luxurious aesthetic. The design incorporates auspicious symbolism with the peacock motif, representing beauty, royalty, and love. The Hyderabadi polish ensures lasting brilliance and durability. A true heirloom piece that embodies tradition and elegance.",
  "tags": [
    "Necklace",
    "Haaram",
    "Gutha Pusalu",
    "Polki Diamonds",
    "Kundan",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Wedding",
    "Mayura",
    "Peacock",
    "Emeralds",
    "Rubies",
    "Hyderabadi Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Langa Voni",
    "நிச்சయ తాంబూలం",
    "Kanthaabharanam"
  ],
  "original_id": "diamond_jewellery_DPPD8-1243_0369",
  "collection": "diamond"
}