{
  "id": "necklaces-990",
  "title": "Manjula Diamond Haar with Ruby and Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Ruby",
    "Natural Emerald",
    "Freshwater Pearls. Hyderabadi Polish."
  ],
  "features": "The Manjula Haar features a delicate floral design encrusted with dazzling diamonds. The central pendant showcases a vibrant ruby at the top, transitioning to a larger emerald drop below, creating a stunning contrast. Each diamond is meticulously set to maximize brilliance. Pearl drops add a touch of traditional elegance. The necklace is connected by delicate floral diamond motifs connected with a gold chain.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Red (Ruby)",
    "Green (Emerald)",
    "Cream (Pearls)."
  ],
  "occasions": [
    "Perfect for weddings (vivaaham)",
    "receptions",
    "and special occasions. A dazzling choice for muhurtham or a grand seemantham ceremony. Its modern design also makes it suitable for contemporary celebrations and black-tie events."
  ],
  "description": "A testament to Hyderabad's exquisite craftsmanship, this Haar showcases a harmonious blend of tradition and modern design. The brilliant-cut diamonds, combined with the vibrant ruby and emerald, create a captivating sparkle. The Hyderabadi polish ensures a lasting luster, making it a cherished heirloom for generations to come. The floral motif with pearl drops adds a touch of feminine grace, embodying the spirit of Indian artistry. A timeless piece that will elevate any ensemble.",
  "tags": [
    "Diamond Necklace",
    "Haar",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Ruby",
    "Emerald",
    "Pearls",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Vivaaham",
    "Muhurtham",
    "Seemantham",
    "Manjula",
    "Floral Design",
    "Vaddanam",
    "Bandi."
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0446_2311",
  "collection": "necklace"
}