{
  "id": "necklaces-716",
  "title": "Rajeshwari Haaram: Emerald & Ruby Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmarked)",
    "High-Quality Emeralds (Zambian Origin",
    "Cabochon Cut)",
    "Natural Rubies (Burma Origin",
    "Round Cut)",
    "Sparkling CZ Diamonds. Features a luxurious Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This regal haaram features a graceful lattice design highlighted by CZ Diamonds that seamlessly transitions into floral emerald and ruby clusters. The center pendant showcases a captivating emerald surrounded by vibrant rubies, with delicate emerald drops suspended below. The intricate setting enhances the brilliance of each gemstone, offering a harmonious blend of traditional and contemporary aesthetics. The necklace showcases the meticulous craftsmanship associated with South Indian jewelry, with modern design flourishes.",
  "colors": [
    "Predominantly gold",
    "with vibrant pops of emerald green and ruby red. The white of the CZ diamonds provides a stunning contrast",
    "creating a visually captivating piece."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "anniversaries",
    "and grand celebrations. Suitable for a Seemantham",
    "Half-Saree function (Voni Function)",
    "or any occasion where you want to make a statement. Also a great modern piece to be worn on any special date."
  ],
  "description": "A fusion of traditional South Indian craftsmanship with contemporary design, this haaram is a timeless heirloom. The use of high-quality emeralds and rubies signifies prosperity and good fortune. The Hyderabadi polish ensures lasting brilliance, making it a worthwhile investment for generations to come. Makes a stunning statement as well as the perfect bridal piece. The perfect piece to be worn by a Devadasis during poojas at temples.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "CZ Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Addigai",
    "Vivahaalu",
    "Seemantham",
    "Half Saree Function",
    "Voni Function",
    "Heritage Jewelry",
    "Statement Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-41-00_1222",
  "collection": "diamond"
}