{
  "id": "bangles-136",
  "title": "Vaibhavam Diamond Bangle: A Touch of Tradition",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "Crafted in 22K Gold (916 Gold) with Hyderabadi Polish for a lasting sheen. Features brilliant-cut diamonds (VS clarity",
    "G-H color)",
    "vibrant Burmese rubies",
    "a central Zambian Emerald",
    "and natural coral beads (Pagadam)."
  ],
  "features": "This bangle showcases intricate filigree work, a hallmark of Hyderabadi craftsmanship. The central motif is a traditional sunburst design, adorned with a halo of rubies and sparkling diamonds. Coral beads are delicately placed on either side, adding a touch of auspiciousness. The bangle's openwork design ensures comfortable wear.",
  "colors": [
    "Predominantly gold",
    "complemented by the fiery red of rubies and coral",
    "the lush green of the emerald",
    "and the dazzling white of the diamonds. A vibrant color palette traditionally favored in South Indian bridal jewelry."
  ],
  "occasions": [
    "Perfect for weddings",
    "festive celebrations like Sankranthi and Ugadi",
    "and special occasions like anniversaries. A statement piece that can also elevate a modern ensemble."
  ],
  "description": "This Kada blends timeless design with exceptional craftsmanship. The Hyderabadi polish ensures a lasting luster, while the high-quality gemstones add unmatched brilliance. Its traditional design makes it a cherished heirloom, passed down through generations. Its eye-catching design and color combination exude sophistication.",
  "tags": [
    "Bangle",
    "Kada",
    "Gold Bangle",
    "Diamond Bangle",
    "Ruby",
    "Emerald",
    "Coral",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Ugadi",
    "Sankranthi",
    "Bridal Jewelry",
    "Filigree Jewelry",
    "Pagadam",
    "22K Gold",
    "916 Gold"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0370_0567",
  "collection": "diamond"
}