{
  "id": "necklaces-723",
  "title": "The Suvarnarekha Emerald & Diamond Haaram: A Heritage Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Faceted Emeralds",
    "Brilliant-Cut Diamonds (VS Clarity)",
    "Hyderabadi Polish"
  ],
  "features": "Elaborate floral motif design with a prominent central pendant. Features intricate diamond setting around larger cabochon emeralds. The pendant showcases a cascading design with dangling gold bead accents, reminiscent of classic South Indian temple jewelry. Nakshi work detailing evident in floral petals. The necklace employs a linked floral design around the neck which is complemented by subtle emerald accents.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant green emerald accents",
    "creating a rich and classic South Indian color palette."
  ],
  "occasions": [
    "Ideal for grand occasions such as weddings (muhurtham)",
    "bridal showers",
    "Seemantham ceremonies",
    "and high-profile social events. Also perfect for showcasing elegance at formal gatherings."
  ],
  "description": "This Haaram is a testament to exquisite craftsmanship and timeless design. The use of high-quality emeralds and diamonds, combined with the traditional Nakshi work, makes it a valuable heirloom piece. The Hyderabadi polish enhances the gold's luster, ensuring lasting brilliance. Its design blends traditional South Indian aesthetics with a touch of modern elegance. It is a statement piece that reflects cultural heritage and refined taste.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Mutyala Haaralu",
    "Seemantham",
    "Muhurtham",
    "Indian Wedding",
    "Temple Jewelry",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-46-45 3_1229",
  "collection": "diamond"
}