{
  "id": "necklaces-1504",
  "title": "Raani Haaram: The Celestial Sapphire Cascade Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold",
    "meticulously adorned with brilliant-cut Cubic Zirconia. Features hand-picked sapphire gemstones and emeralds",
    "each boasting exceptional clarity and vibrant color. Finished with a signature Hyderabadi polish for lasting radiance."
  ],
  "features": "This exquisite Raani Haaram showcases a two-layered design, featuring a cascading arrangement of floral motifs. Each floral element is carefully embedded with sparkling Cubic Zirconia that surround sapphire gemstones with touches of rubies. The first layer features sapphire and emerald gemstones. The second layer feature small golden beads that sway gracefully with every movement. The pendant incorporates a central sapphire surrounded by smaller, intricately set cubic zirconia.",
  "colors": [
    "The necklace presents a captivating color palette of rich gold",
    "deep blue sapphires",
    "and lush green emeralds. The clear Cubic Zirconia adds a brilliant sparkle",
    "enhancing the overall visual appeal."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivahaalu)",
    "receptions",
    "and important religious ceremonies. This Haaram adds a regal touch to any bridal ensemble or festive outfit",
    "making it ideal for celebrations like muhurtham and seemantham."
  ],
  "description": "This Raani Haaram is a testament to timeless elegance and exquisite craftsmanship. The intricate detailing, coupled with the vibrant gemstones and Hyderabadi polish, make it a true heirloom piece. Its classic design ensures it will remain a cherished part of your jewelry collection for generations.",
  "tags": [
    "Raani Haaram",
    "Necklace",
    "22K Gold",
    "Sapphire",
    "Emerald",
    "Cubic Zirconia",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Vivahaalu",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Jewelry",
    "కంఠాభరణం",
    "Jewellery",
    "Traditional Jewelry",
    "Indian Wedding"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-36 2_2122",
  "collection": "sjpl"
}