{
  "id": "necklaces-1432",
  "title": "Emerald Peacock Diamond Grand Haaram - Vaddanam Inspiration",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Yellow Gold) with Hyderabadi Polish. Features brilliant-cut Diamonds (SI Clarity",
    "G-H Color) and Oval and Pear-shaped Emeralds (Natural",
    "vivid green). Pearl drop. Setting is primarily pave and prong set."
  ],
  "features": "This stunning haaram draws inspiration from the traditional Vaddanam (waist belt) design. Features intricate peacock motifs studded with diamonds, symbolizing beauty and grace. The emeralds are meticulously placed to enhance the overall design. The Hyderabadi polish gives the gold a lustrous, rich finish. Delicate openwork design with diamond lattice.",
  "colors": [
    "Yellow Gold",
    "Diamond White",
    "Emerald Green",
    "Pearl White."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Muhurtham)",
    "receptions",
    "bridal showers",
    "Sangeeth ceremonies",
    "or any special celebration (Half-Saree function). Suitable for a modern twist on traditional attire for festivals or formal parties."
  ],
  "description": "A harmonious blend of tradition and contemporary design, this haaram features high-quality diamonds and vibrant emeralds, crafted with exceptional skill. The Vaddanam-inspired design makes it a statement piece, showcasing both heritage and sophistication. The perfect heirloom to pass down for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Vaddanam",
    "Emerald",
    "Diamonds",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Temple Jewelry",
    "Peacock Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Grand Necklace",
    "22K Gold",
    "muhurtham",
    "seemantham",
    "half saree function",
    "kempu",
    "pachalu",
    "nagalu",
    "andalu"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-43 2_2050",
  "collection": "sjpl"
}