{
  "id": "necklaces-652",
  "title": "Emerald & Polki Diamond Jadau Haaram - The \"Haritha Lakshmi\"",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base with Hyderabadi Polish. High-quality Polki diamonds (uncut diamonds) with a clarity grade of SI1-SI2. Natural Emeralds with a vibrant green hue. Freshwater Pearls."
  ],
  "features": "Intricate Jadau setting showcasing the artistry of Hyderabad's finest craftsmen. The necklace features a three-layered design with delicate floral and paisley motifs crafted with Polki diamonds. Emerald accents are strategically placed to draw the eye and add a touch of regal elegance. Finished with cascading freshwater pearl drops. The central pendant is a traditional mandala design symbolizing prosperity and wholeness.",
  "colors": [
    "Gold (warm yellow)",
    "Emerald (vibrant green)",
    "Polki diamonds (milky white)",
    "Pearls (creamy white)"
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha Mahotsavam)",
    "receptions",
    "Seemantham (baby shower)",
    "Half-saree function (Langa Voni Function)",
    "and other significant cultural events. Also suitable for high-end gala events and celebrations."
  ],
  "description": "This Haaram represents the pinnacle of Hyderabadi craftsmanship. The use of Polki diamonds gives it a unique, antique charm, while the Emeralds add a touch of modern sophistication. The handcrafted Jadau setting ensures that each stone is perfectly placed to maximize brilliance. A true heirloom piece, designed to be cherished for generations. Symbolizes prosperity, beauty, and tradition, making it a significant investment and a stunning addition to any jewelry collection. The flexible design allows for comfortable wear despite its opulent appearance.",
  "tags": [
    "Haaram",
    "Jadau",
    "Polki Diamond",
    "Emerald",
    "Pearl",
    "Necklace",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Vivaha Mahotsavam",
    "Kantabharanam",
    "Seemantham",
    "Langa Voni",
    "Heirloom Jewelry",
    "Antique Finish",
    "Hyderabadi Polish",
    "Pachala Haaram",
    "Manikyam",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-23_1158",
  "collection": "diamond"
}