{
  "id": "necklaces-787",
  "title": "Exquisite Floral Diamond Haaram with Rice Pearls - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18 KT Gold (18 క్యారెట్ల బంగారం)",
    "adorned with dazzling Fancy diamonds (18.81 carats) and meticulously placed White diamonds (7.27 carats). Featuring genuine Rice Pearls (6.51 carats). Each diamond is carefully selected for its brilliance and clarity."
  ],
  "features": "This Haaram showcases a sophisticated floral design, blending traditional South Indian motifs with a contemporary aesthetic. The centerpiece features a delicate flower design, surrounded by leaves and vines meticulously set with diamonds. Rice Pearls add a touch of classic elegance. The setting is designed for maximum light reflection, enhancing the sparkle of each diamond. The piece is finished with a high-polish to ensure lasting shine.",
  "colors": [
    "The necklace features a harmonious blend of White Diamonds",
    "with subtle accents of Pink and Purple gemstones. The 18 KT Gold provides a warm",
    "luxurious contrast to the cool brilliance of the diamonds and pearls."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (వివాహాలు)",
    "receptions",
    "festive celebrations like Sankranthi or Diwali",
    "and formal gatherings. A statement piece ideal for brides or anyone looking to make a lasting impression. Suitable for modern events as well."
  ],
  "description": "This Haaram represents a fusion of traditional South Indian craftsmanship and contemporary design. Its exceptional quality, combined with the timeless appeal of diamonds and pearls, makes it a valuable investment and a cherished heirloom. The intricate floral design and exquisite detailing showcase the skill of our master artisans. Designed to be both eye-catching and comfortable to wear, this piece is sure to become a treasured part of your jewelry collection.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Rice Pearls",
    "18KT Gold",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Contemporary Jewelry",
    "Floral Design",
    "Bridal Necklace",
    "Hyderabad Jewelry",
    "Diamonds",
    "Pearls",
    "Luxury Jewelry",
    "Fine Jewelry",
    "ఆభరణాలు",
    "హారం",
    "బంగారం",
    "వజ్రాలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-30 3_1355",
  "collection": "diamond"
}