{
  "id": "necklaces-1584",
  "title": "Emerald Radiance Haaram - A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Premium Quality Gold (details of purity not available)",
    "Certified Natural Emeralds (57.800ct",
    "approx) with exceptional color and clarity",
    "Brilliant Cut Diamonds (Total Diamond weight: 17.58 ct)",
    "meticulously set with precision. Finished with a delicate Hyderabadi Polish."
  ],
  "features": "A contemporary take on the traditional Haaram, this piece showcases a cascading design of pear-shaped emeralds, each surrounded by a halo of sparkling diamonds. The geometric diamond patterns add a modern flair while maintaining the grandeur of South Indian jewelry. Features a multi-layered diamond arrangement that creates a captivating neckline.",
  "colors": [
    "Lush Emerald Green",
    "Dazzling White (Diamonds)",
    "and a subtle hint of gold",
    "creating a vibrant yet elegant color palette."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham",
    "Reception)",
    "grand celebrations",
    "or adding a touch of royal elegance to any special occasion. This versatile piece is suitable for both traditional and modern attire."
  ],
  "description": "This Emerald Radiance Haaram is a unique blend of traditional South Indian aesthetics and contemporary design. The exceptional quality of the emeralds and diamonds, combined with the expert craftsmanship, ensures a timeless and luxurious piece. It's a statement of elegance and sophistication, a treasure to be cherished for generations. The exquisite arrangement and fine finishing make it a standout piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamonds",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Statement Necklace",
    "Muhurtham",
    "Reception",
    "Grand Occasion",
    "Contemporary Design",
    "Gemstone Jewelry",
    "Indian Bridal",
    "Pachala Haram",
    "Ratnalu Haram",
    "Jadau Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-46_2289",
  "collection": "sjpl"
}