{
  "id": "necklaces-137",
  "title": "Mutyala Haaram with Antique Kundan Pendant - Divine Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) chain",
    "Freshwater Pearls (Mutyalu)",
    "Kundan stones (uncut diamonds)",
    "Faceted Ruby Beads",
    "and Large Oval Ruby Cabochon Pendant. Hyderabadi Polish for lasting luster."
  ],
  "features": "Delicate Mutyala Haaram crafted with alternating lustrous freshwater pearls and vibrant ruby beads. The antique-finish Kundan pendant showcases intricate craftsmanship, featuring floral motifs and strategically placed Kundan stones to maximize brilliance. A captivating large oval Ruby cabochon dangles gracefully, adding a touch of regal charm. The Kundan setting is meticulously handcrafted in the traditional Hyderabad style.",
  "colors": [
    "Gold (yellow)",
    "White (pearls)",
    "Red (ruby)",
    "Clear (Kundan stones). Classic and auspicious color combination."
  ],
  "occasions": [
    "Perfect for traditional occasions like weddings (vivaham)",
    "engagements (nischitartham)",
    "and festive celebrations (pandugalu). Also suitable for modern events and adding a touch of elegance to contemporary attire."
  ],
  "description": "This Mutyala Haaram represents timeless elegance and cultural heritage. The combination of lustrous pearls, vibrant rubies, and exquisite Kundan work makes it a truly unique and valuable piece. The handcrafted design and Hyderabadi polish ensure lasting beauty and durability. It's not just jewelry; it's an heirloom.",
  "tags": [
    "Mutyala Haaram",
    "Pearl Necklace",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Ruby",
    "Pearls",
    "Vivaham",
    "Nischitartham",
    "Pandugalu",
    "Antique Jewelry"
  ],
  "original_id": "diamond_jewellery_DPPD8-1259_0370",
  "collection": "diamond"
}