{
  "id": "necklaces-207",
  "title": "Devi Lakshmi Kasu Haaram - A Divine Gold Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality CZ Diamonds",
    "Ruby",
    "Emerald; Meticulously crafted with Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "This exquisite Haaram features a central Lakshmi pendant intricately detailed with Nakshi work. The coin (Kasu) design is interspersed with floral motifs adorned with CZ diamonds and touches of vibrant rubies. A teardrop-shaped emerald graces the top of the pendant. Delicate gold balls (gundlu) dangle gracefully from the pendant’s base, adding movement and charm. The neck chain is meticulously crafted in a floral pattern to match the centerpiece.",
  "colors": [
    "Predominantly gold with accents of ruby red",
    "emerald green",
    "and sparkling clear CZ diamonds."
  ],
  "occasions": [
    "Ideal for weddings (Vivaaham)",
    "engagement ceremonies (Nischayathartham)",
    "religious festivals (Pujas)",
    "Seemantham",
    "and other auspicious occasions. This piece will elevate any traditional Telugu or South Indian ensemble."
  ],
  "description": "This Kasu Haaram is more than just jewelry; it's a symbol of prosperity and divine blessings. The craftsmanship reflects the rich heritage of Hyderabad jewelry making. The classic design ensures timeless elegance, making it a valuable addition to any heirloom jewelry collection. The combination of traditional design and modern craftsmanship ensures durability and lasting beauty.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Lakshmi Pendant",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Gold Necklace",
    "Temple Jewelry",
    "Nakshi Work",
    "CZ Diamonds",
    "Ruby",
    "Emerald",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Vivaaham",
    "Seemantham",
    "Engagement",
    "auspicious",
    "gundlu"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0283_0481",
  "collection": "diamond"
}