{
  "id": "necklaces-109",
  "title": "Polki & Ruby Contemporary Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds (Rose Cut)",
    "Natural Rubies. Hyderabadi Polish for lasting luster."
  ],
  "features": "This haaram showcases a contemporary adaptation of traditional Kundan craftsmanship. Each Polki diamond is meticulously set to maximize its natural brilliance, creating a captivating sparkle. The rose-cut diamonds form stylized floral motifs within shield-shaped pendants. The rubies are individually bezel set to add color and dimension. The design incorporates a delicate balance of negative space, allowing the light to play beautifully across the piece.",
  "colors": [
    "Yellow Gold",
    "White (Polki Diamonds)",
    "and Vivid Red (Rubies). A classic South Indian color combination that exudes richness and elegance."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "festive celebrations (Sankranti",
    "Diwali)",
    "and special occasions. Also suitable for modern cocktail parties and events where you want to make a statement."
  ],
  "description": "This Polki & Ruby Haaram offers a unique blend of traditional craftsmanship and contemporary design. The use of uncut Polki diamonds gives it a timeless, heirloom quality, while the ruby accents add a touch of modern sophistication. Each piece is handcrafted by skilled artisans, ensuring exceptional quality and durability. The Hyderabadi polish guarantees a lasting shine that will make you stand out from the crowd. Owning this piece is owning a piece of South Indian heritage with a modern twist.",
  "tags": [
    "Polki Necklace",
    "Kundan Jewelry",
    "Ruby Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Uncut Diamonds",
    "Rose Cut Diamonds",
    "Telugu Jewelry",
    "Vivahaalu",
    "Indian Bridal Jewelry",
    "Contemporary Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_DPNK8-1418_0342",
  "collection": "diamond"
}