{
  "id": "necklaces-736",
  "title": "Emerald Kundan Bridal Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Emeralds (Oval Cut",
    "High Clarity)",
    "Kundan stones",
    "Hyderabadi Polish"
  ],
  "features": "This magnificent 4-layer Haaram features exquisite Kundan setting, meticulously handcrafted with traditional Telugu artistry. The central pendant showcases a captivating emerald surrounded by intricate floral Kundan work. Delicate gold balls (gundla) cascade from the pendant and second strand, adding a touch of auspicious charm. The layers are designed with varying lengths to create a cascading effect, enhancing the overall grandeur. Features nakshi work detailing for a heritage touch.",
  "colors": [
    "Gold (warm yellow)",
    "Emerald (vibrant green)",
    "White (Kundan)"
  ],
  "occasions": [
    "Ideal for bridal wear (Pelli)",
    "Seemantham",
    "Half-Saree Function (Langa Voni Function)",
    "Annaprasana",
    "and other grand celebrations. A statement piece for any formal occasion where you want to exude timeless elegance."
  ],
  "description": "This Haaram is a masterpiece of traditional South Indian jewelry craftsmanship. The combination of radiant gold, vibrant emeralds, and shimmering Kundan stones creates a mesmerizing effect. The intricate design and superior quality materials ensure that this piece will be treasured for generations to come. A true heirloom piece embodying cultural significance and unparalleled beauty.",
  "tags": [
    "Haaram",
    "Kundan Jewelry",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Bridal Necklace",
    "Kasulaperu",
    "Telugu Jewelry",
    "Nakshi Work",
    "Temple Jewelry",
    "Indian Wedding",
    "Pelli",
    "Seemantham",
    "Heirloom Jewelry",
    "Gundla",
    "22K Gold"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-34 3_1242",
  "collection": "diamond"
}