{
  "id": "necklaces-008",
  "title": "Exquisite Floral Cascade Haaram with Matching Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "18K Gold (Rose and White Gold finish)",
    "precision-cut Cubic Zirconia (CZ). Expertly crafted with Hyderabadi Polish for lasting brilliance and shine."
  ],
  "features": "This stunning set features a unique cascade design with intricate floral and leaf motifs meticulously rendered in both rose and white gold. The necklace presents a graduated design that sits beautifully on the neckline. The matching Jhumkas echo the necklace's floral pattern, creating a cohesive and elegant bridal look. The openwork filigree detailing showcases exceptional craftsmanship and light play.",
  "colors": [
    "Rose Gold",
    "White Gold",
    "Clear Cubic Zirconia"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "engagement ceremonies",
    "and other grand celebrations. The elegant design also makes it suitable for formal parties and upscale events."
  ],
  "description": "This Haaram set offers a modern twist on traditional South Indian jewelry. The two-tone gold design provides versatility, allowing it to complement both traditional and contemporary attire. The meticulous craftsmanship and high-quality CZ stones ensure lasting brilliance and a luxurious feel. This statement piece is sure to make you the center of attention and become a cherished heirloom.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace",
    "Earrings",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Rose Gold",
    "White Gold",
    "Cubic Zirconia",
    "Telugu Jewelry",
    "Vivaha",
    "Reception",
    "Engagement",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Indian Jewelry",
    "Two Tone Gold"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0014_0043",
  "collection": "choker"
}