{
  "id": "necklaces-1404",
  "title": "Divine Emerald and Diamond Nakshi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously studded with brilliant-cut Diamonds and vibrant Emeralds. Features South Sea Pearls. The gold has a lustrous Hyderabadi Polish",
    "enhancing its rich tone."
  ],
  "features": "This exquisite Haaram features intricate Nakshi work, a hallmark of South Indian jewelry craftsmanship. The cascading design is adorned with dazzling diamonds, interspersed with captivating emeralds. The center showcases a pear-shaped emerald, surrounded by a halo of diamonds. Delicate South Sea pearl drops add a touch of elegance and tradition.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with striking green emerald accents and the soft luster of white pearls."
  ],
  "occasions": [
    "Perfect for weddings (వివాహాలు)",
    "receptions",
    "engagements (నిశ్చితార్థం)",
    "and other grand celebrations. Its contemporary design also makes it suitable for upscale events and special occasions where you want to make a statement."
  ],
  "description": "This Haaram is a fusion of traditional South Indian artistry and contemporary design. The Nakshi work showcases centuries-old techniques, while the use of brilliant-cut diamonds and South Sea pearls adds a modern flair. Its durability and timeless elegance make it a valuable investment piece that can be passed down through generations. The emeralds symbolize prosperity and growth, adding a layer of auspiciousness to this already stunning piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Nakshi",
    "Emerald",
    "Diamond",
    "South Sea Pearl",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "కంఠాభరణం",
    "నగలు",
    "వివాహం",
    "నిశ్చితార్థం"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-18 2_2022",
  "collection": "sjpl"
}