{
  "id": "necklaces-1430",
  "title": "Emerald & Diamond Floral Cascade Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (High Clarity",
    "Square & Pear Cut)",
    "VVS Clarity Diamonds. Features a fine Hyderabadi Polish for a lasting luster."
  ],
  "features": "Intricately designed floral motifs set with sparkling diamonds and vibrant green emeralds. The necklace features a graduated cascade design, leading to a larger central pendant. The setting showcases a blend of prong and pave settings to maximize diamond brilliance. The pendant features delicate gold bead dangles for added movement and elegance.",
  "colors": [
    "Golden Yellow (Gold)",
    "Emerald Green (Emeralds)",
    "White/Colorless (Diamonds)."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "receptions",
    "engagement ceremonies",
    "and other grand occasions. Perfect for Muhurtham",
    "Seemantham",
    "and special family gatherings. Also suitable for making a statement at high-profile events."
  ],
  "description": "A breathtaking Haaram embodying traditional South Indian opulence with a modern flair. The exquisite combination of emeralds and diamonds symbolizes prosperity and timeless beauty. Crafted by skilled artisans, this piece is a testament to exceptional craftsmanship and enduring value. The Hyderabadi polish ensures a brilliant shine for years to come. This piece will become a treasured family heirloom, to be passed down from generation to generation. Its design draws inspiration from our Telugu traditions.",
  "tags": [
    "Haaram",
    "కంఠాభరణం",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "22K Gold",
    "Emerald",
    "Diamond",
    "VVS Clarity",
    "Floral Design",
    "Cascade",
    "Grand Occasion",
    "Muhurtham",
    "Seemantham",
    "Vivahaalu",
    "Engagement"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-34 2_2048",
  "collection": "sjpl"
}