{
  "id": "bangles-133",
  "title": "Manikyam & Diamond Gold Vanki Bangle - A Touch of Telugu Heritage",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Fine Quality Ruby (Manikyam)",
    "White Diamonds (VVS Clarity). Features a rich Hyderabadi polish for lasting shine and brilliance."
  ],
  "features": "This exquisite Vanki Bangle showcases an intricate openwork design with square and circular motifs, meticulously handcrafted by our skilled artisans. The central Ruby (Manikyam) is surrounded by sparkling diamonds, creating a captivating focal point. The design incorporates classic South Indian influences, blending traditional aesthetics with a modern openwork style. Notice the delicate detailing, reflecting the skill and expertise passed down through generations.",
  "colors": [
    "Predominantly Gold with vibrant Ruby Red at the center and brilliant White Diamonds",
    "creating a rich and luxurious color palette."
  ],
  "occasions": [
    "Perfect for weddings (pellillu)",
    "engagements (nischitartham)",
    "festivals (pandugalu)",
    "and other special occasions. A timeless piece that can also add a touch of elegance to modern events and celebrations."
  ],
  "description": "This Vanki Bangle is a true statement piece, blending traditional Telugu design with exceptional craftsmanship. The high-quality gold and gemstones ensure lasting beauty and value. The intricate design and Hyderabadi polish make this bangle a unique and cherished heirloom. Its elegant design ensures comfortable wear, making it a perfect choice for both traditional and modern occasions. A symbol of prosperity and auspicious beginnings.",
  "tags": [
    "Vanki",
    "Kadiyam",
    "Bangle",
    "Ruby",
    "Manikyam",
    "Diamond",
    "Gold",
    "22K",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Indian Jewelry",
    "Pellillu",
    "Nischitartham",
    "Pandugalu"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0359_0556",
  "collection": "diamond"
}