{
  "id": "necklaces-1237",
  "title": "Emerald Grandeur: The 'Vajra Harita Haaram' - Diamond and Emerald Statement Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold",
    "meticulously embellished with brilliant-cut diamonds (11.93 carats) and featuring a captivating array of natural emeralds (23.11 carats) with superior clarity. Showcases Hyderabadi Polish for a lasting radiant luster."
  ],
  "features": "This magnificent 'Haaram' showcases a stunning fusion of traditional and contemporary design elements. It features a breathtaking floral mandala pendant with a central square-cut emerald, surrounded by intricate diamond lattice work. The necklace culminates in a graceful array of diamond and emerald studded foliage that adds an organic touch, reminiscent of traditional 'vellari poo' (cucumber flower) motifs. Diamond settings are primarily pave and prong for maximum brilliance. ",
  "colors": [
    "Vibrant emerald green is offset by the dazzling sparkle of white diamonds and the rich warmth of yellow gold. This classic South Indian color palette symbolizes prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "receptions",
    "milestone anniversaries",
    "Seemantham (baby shower)",
    "and upscale gala events. This 'Haaram' will undoubtedly become a cherished heirloom."
  ],
  "description": "This is a statement piece that embodies timeless elegance and rich cultural heritage. Its exquisite craftsmanship, coupled with the inherent value of the diamonds and emeralds, makes it a valuable investment. The unique design effortlessly bridges tradition and modernity, making it a treasured possession for generations to come. The vibrant emeralds are believed to bring luck and prosperity, making this necklace not just a beautiful adornment, but also a symbol of auspicious beginnings.",
  "tags": [
    "Haaram",
    "Emerald Necklace",
    "Diamond Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Emerald",
    "Diamonds",
    "Vivaha",
    "Kantaabharanam",
    "Seemantham",
    "Anniversary Gift",
    "Wedding Necklace",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-58_1811",
  "collection": "sjpl"
}