{
  "id": "earrings-285",
  "title": "Exquisite Floral Diamond & Pink Tourmaline Cascade Jhumka",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted with precision in 18K White and Rose Gold",
    "these earrings are adorned with brilliant-cut diamonds (D Pan",
    "1/10th ct) and vibrant Pink Tourmaline gemstones. Features a high Hyderabadi Polish for lasting shine."
  ],
  "features": "These contemporary jhumkas showcase a cascading floral design. Each flower, meticulously crafted, is set with sparkling diamonds. The bottom section features a delicate fan of carefully set pink tourmalines. The design perfectly blends modern aesthetics with a touch of South Indian elegance.",
  "colors": [
    "The color palette features a luxurious blend of white and rose gold",
    "perfectly complemented by the dazzling white diamonds and the rich pink hue of the Tourmalines. This combination offers a sophisticated and contemporary aesthetic."
  ],
  "occasions": [
    "Perfect for modern events",
    "parties",
    "cocktail gatherings",
    "or adding a touch of elegance to your everyday attire. These earrings can also be worn on special occasions like festive celebrations and family gatherings."
  ],
  "description": "These stunning earrings offer a unique blend of modern design and gemstone elegance. The quality craftsmanship, coupled with the brilliance of diamonds and the vibrant hue of the Tourmalines, makes this a truly special piece. The earrings are designed for lasting durability and enduring style, making them a valuable addition to your jewelry collection.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Diamond Jewelry",
    "Pink Tourmaline",
    "Floral Design",
    "18K Gold",
    "Contemporary Jewelry",
    "Indian Jewelry",
    "Hyderabad Jewelry",
    "Cocktail Earrings",
    "Partywear",
    "Fine Jewelry",
    "Gift for Her",
    "South Indian Inspired"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-30-48_0958",
  "collection": "diamond"
}