{
  "id": "necklaces-290",
  "title": "Exquisite Diamond Emerald Haar Set - A Timeless Heritage Piece",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Emeralds (Natural",
    "Zambian origin)",
    "South Sea Pearls. Features our signature Hyderabadi Polish for a lasting lustre."
  ],
  "features": "This magnificent haaram features intricate floral motifs meticulously set with dazzling brilliant cut diamonds. Emerald accents are strategically placed to enhance the design and highlight the center pendant, showcasing the traditional *pachchikam* work technique. Dainty South Sea pearls adorn the bottom edge, adding a touch of elegance. The matching Jhumka earrings echo the floral design and pearl accents for a cohesive and stunning look.",
  "colors": [
    "Predominantly white (diamonds) and yellow gold",
    "accented by vibrant green emeralds and lustrous white pearls."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (kalyanam)",
    "receptions",
    "Seemantham ceremonies",
    "or any special event where you want to make a statement. This set is also ideal for brides looking for a piece that blends tradition with modern elegance."
  ],
  "description": "This heirloom-worthy set is a testament to exquisite craftsmanship and timeless design. The use of high-quality materials, including Zambian emeralds and VVS diamonds, ensures lasting beauty and value. The traditional Haaram design, combined with contemporary setting techniques, makes this piece both culturally significant and effortlessly stylish. It's a valuable addition to any discerning jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Kalyan",
    "Seemantham",
    "Pachchikam",
    "Bridal Jewelry",
    "Gold Necklace",
    "Pearl Jewelry",
    "Haar"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0379_0576",
  "collection": "diamond"
}