{
  "id": "necklaces-1127",
  "title": "Raani Haar Set: The Emerald Embrace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (approx. 12 carats)",
    "Natural Emerald (approx. 5 carats)",
    "Pink Tourmaline (approx. 8 carats total)",
    "Hyderabadi Polish"
  ],
  "features": "Intricate floral motifs crafted in 22K gold, showcasing the splendor of traditional Hyderabadi jewelry making. The Haaram features a central Emerald framed by Polki diamonds. The side and drop pendants are adorned with pink tourmaline and smaller uncut diamonds set in a closed setting (Kundan style), creating a vintage feel. Delicate tear-drop Polki diamonds hang elegantly from the main design elements. The Polki diamonds are carefully selected for their unique character and natural brilliance, adding depth and dimension to the piece.",
  "colors": [
    "Gold (Antique Finish)",
    "Emerald Green",
    "Pink Tourmaline",
    "and the white-ish sparkle of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli Kuthuru)",
    "Engagement (Nischitartham)",
    "Seemantham",
    "Upanayanam",
    "and grand celebrations. Suitable for adding a regal touch to modern South Indian fusion attire."
  ],
  "description": "A timeless heirloom piece showcasing exquisite craftsmanship and the finest materials. This Raani Haar is a statement of elegance and cultural pride, reflecting the rich heritage of Hyderabadi jewelry. The combination of Polki diamonds, Emerald, and Tourmaline creates a unique and captivating color palette. The Hyderabadi polish gives it a rich, antique-like luster that ages gracefully, making it a cherished possession for generations.",
  "tags": [
    "Haaram",
    "Polki Diamond",
    "Emerald",
    "Tourmaline",
    "Kundan Jewelry",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Rani Haar",
    "Traditional Necklace",
    "Wedding Necklace",
    "Pelli Utla",
    "Nischitartham",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Jadau Jewellery"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0023_2541",
  "collection": "radhe"
}