{
  "id": "necklaces-475",
  "title": "Maharani Emerald and Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "featuring meticulously selected Round Cut Diamonds (D-F Color",
    "VVS Clarity) weighing 12.45 Dwt (1187 diamonds). Adorned with Oval Cut Emeralds (3.97 Carats) and Round Cut Rubies (5.64 Carats). The locket is crafted with an additional 2.56 Dwt (212 Diamonds)",
    "4.65 Carat Ruby and a 3.30 Carat Emerald."
  ],
  "features": "This majestic Haaram showcases intricate filigree work and delicate diamond setting, embodying the opulent Hyderabadi jewelry tradition. The design incorporates a central Emerald focal point, enhanced by a diamond and ruby studded floral motif. Features a detachable pendant with a prominent oval-cut Emerald, surrounded by a halo of sparkling diamonds. The intricate detailing and cascading diamond drops add a touch of royal elegance.",
  "colors": [
    "Predominantly Gold with vibrant Emerald Green and Ruby Red accents",
    "creating a regal and striking color contrast."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha Mahotsavam)",
    "engagements (Nischitartham)",
    "anniversaries",
    "and other significant celebrations (Shubhakaryalu). A stunning statement piece for a bride or to elevate any festive ensemble."
  ],
  "description": "A testament to Hyderabad's rich jewelry heritage, this Haaram combines traditional craftsmanship with contemporary design sensibilities. The high-quality diamonds and vibrant gemstones ensure lasting beauty and exceptional value. The detachable pendant offers versatility, allowing the Haaram to be styled in different ways. Represents a timeless investment and a cherished heirloom.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Gold Necklace",
    "Bridal Jewelry",
    "Vivah",
    "Kantaabharanam",
    "कंठाभरणमु",
    "Engagement",
    "Anniversary"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-57 2_0938",
  "collection": "diamond"
}