{
  "id": "necklaces-696",
  "title": "Emerald and Pearl Delicate Diamond Haaram - Manohar's Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity)",
    "Emerald (Pear Shaped",
    "Faceted Cut)",
    "Freshwater Pearls. Features Hyderabadi Polish for a lasting shine."
  ],
  "features": "A delicate diamond haaram featuring a center pendant with intricate filigree work. The pendant showcases a vibrant pear-shaped emerald surrounded by shimmering diamonds. Lustrous freshwater pearls are suspended from the pendant, adding a touch of traditional grace. The necklace chain is meticulously crafted with small diamond drop pendants.",
  "colors": [
    "Predominantly white (diamonds)",
    "accentuated by the lush green of the emerald and the creamy white of the pearls. The yellow gold adds warmth and richness to the design."
  ],
  "occasions": [
    "Ideal for small celebrations",
    "intimate gatherings",
    "cocktail parties and daily wear. Also perfect as a light weight haaram for Seemantham (baby shower) or other traditional family functions."
  ],
  "description": "This diamond haaram offers a blend of traditional South Indian aesthetics with a modern, lightweight design. The high-quality diamonds and vibrant emerald create a captivating sparkle, while the freshwater pearls add a touch of classic elegance. Expert Hyderabadi craftsmanship guarantees durability and lasting beauty. A perfect piece for those who appreciate both tradition and contemporary style.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Emerald Jewelry",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Party Wear",
    "Seemantham",
    "Ladies Necklace",
    "Mogappu",
    "Diamond Haarams",
    "Emerald Pendant",
    "Hyderabadi Polish"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-53 3_1202",
  "collection": "diamond"
}