{
  "id": "necklaces-1524",
  "title": "Manohari Emerald & Diamond Chowker Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (84.660 gms)",
    "Brilliant Cut Diamonds (6.96 carats)",
    "Pear Cut Emeralds (3.37 carats)",
    "Natural South Sea Pearls (34.95 carats); Hyderabadi Polish."
  ],
  "features": "Intricate floral design with delicate diamond setting. Features two pear-shaped emeralds set within diamond halos, one in the choker itself and another in the detachable pendant. The pendant is adorned with a detailed floral pattern, meticulously crafted to enhance the emerald's brilliance. The Chowker border has ornate diamond flowers and hanging South Sea Pearls (Motulu).",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emeralds)",
    "Cream (Pearls)."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "Engagements (Nischitartham)",
    "Receptions",
    "and other grand celebrations. Also suitable for Seemantham or traditional family functions."
  ],
  "description": "This Chowker Haaram is a testament to exquisite craftsmanship and traditional South Indian design. The combination of sparkling diamonds, vibrant emeralds (Pachalu), and lustrous South Sea pearls creates a timeless piece that will be cherished for generations. The detachable pendant offers versatility, allowing the piece to be worn as a simple choker or a more elaborate haaram. It's a valuable addition to any bride's trousseau and a cherished family heirloom.",
  "tags": [
    "Chowker",
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald",
    "South Sea Pearls",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "22K Gold",
    "Indian Jewellery",
    "कंठाभरणं",
    "Pachalu",
    "Motulu",
    "Hyderabad Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-05 2_2142",
  "collection": "sjpl"
}