{
  "id": "necklaces-1475",
  "title": "Emerald Bloom Haaram - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Kundan Stones",
    "Faceted Emeralds (VS Clarity)",
    "Cultured Pearls. Finished with traditional Hyderabadi polish for enduring luster."
  ],
  "features": "This exquisite haaram showcases intricate Kundan settings, complemented by vibrant Emeralds. The floral pendant, a modern interpretation of traditional motifs, is adorned with delicate pearl drops for added grace. The central emerald is a striking pear-shaped cut. The necklace features repeating floral and paisley patterns, a hallmark of South Indian design.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Kundan)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "sangeet ceremonies",
    "festive celebrations like Diwali and Sankranti",
    "and even contemporary cocktail events where a touch of tradition is desired."
  ],
  "description": "This Emerald Bloom Haaram is a captivating blend of heritage and modernity. The meticulously handcrafted Kundan work reflects the skill of our master artisans. The Emeralds, known for their rich color and auspicious properties, make this piece a truly unique investment. The timeless design ensures it will be cherished for generations, making it a valuable addition to your bridal trousseau or a statement piece for special occasions. It is a perfect example of \"Andala Aabharanam\" (beautiful ornament) ",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Pear Shaped Emerald",
    "Pearl Jewelry",
    "Vivaha",
    "Sangeet",
    "Diwali",
    "Sankranti",
    "Indian Fashion",
    "Ethnic Jewelry",
    "Fine Jewelry",
    "Andala Aabharanam"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-59 2_2093",
  "collection": "sjpl"
}