{
  "id": "necklaces-902",
  "title": "Chandrika Kundan Haaram - Traditional Elegance with a Modern Twist",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Kundan Stones (Polki Diamonds)",
    "Ruby",
    "Emeralds",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Kundan Haaram features a meticulously crafted pendant with intricate floral motifs and traditional paisley patterns. The Kundan stones are expertly set in a traditional pacheli setting, showcasing the impeccable craftsmanship of our artisans. The pendant is adorned with a vibrant Ruby at its center, complemented by sparkling white Kundan and two Emerald accents. The pendant is finished with delicate gold bead drops. The triple-strand chain enhances its elegance. It showcases impeccable Nakshi Work.",
  "colors": [
    "Gold",
    "White (Kundan)",
    "Red (Ruby)",
    "Green (Emerald)"
  ],
  "occasions": [
    "Ideal for weddings",
    "engagements",
    "festivals like Diwali and Sankranthi",
    "or any special occasion. Perfect for brides (pellikuturu) and can be worn during muhurtham",
    "seemantham",
    "or a half-saree function."
  ],
  "description": "A stunning fusion of traditional South Indian design and contemporary elegance. This Kundan Haaram is handcrafted by skilled artisans using the finest materials. The authentic Kundan work adds a touch of royal grandeur. It's a timeless piece that can be passed down as a family heirloom, representing cultural heritage and lasting value. Its durable build makes it an investment.",
  "tags": [
    "Kundan Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Pellikuturu",
    "Seemantham",
    "Muhurtham",
    "Nakshi Work",
    "Temple Jewelry",
    "Polki Diamonds",
    "Emerald",
    "Ruby",
    "Harivaramto",
    "Necklaces"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0295_2363",
  "collection": "necklace"
}