{
  "id": "bangles-084",
  "title": "Royal Blossom Vanki: A Touch of Heritage",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "featuring natural Rubies",
    "Emeralds",
    "and meticulously set Cubic Zirconia (CZ) stones. Sourced for superior clarity and brilliance."
  ],
  "features": "Classic Vanki design with intricate filigree work inspired by traditional South Indian floral motifs. The central blossom element showcases a vibrant arrangement of Rubies, Emeralds, and sparkling CZs, adding a touch of regality. The openwork design ensures a lightweight and comfortable fit.",
  "colors": [
    "Rich gold hues are beautifully complemented by the deep reds of the Rubies",
    "the verdant green of the Emeralds",
    "and the dazzling white of the Cubic Zirconia. A time-honored South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (pelliki)",
    "festive occasions (pandugalu)",
    "and traditional ceremonies like Seemantham or Half-Saree Function. Its elegance also makes it a sophisticated accessory for modern celebrations and evening wear."
  ],
  "description": "This Vanki is a testament to the skilled craftsmanship passed down through generations in Hyderabad. The classic design, combined with high-quality materials and meticulous detailing, makes it a timeless investment and a cherished heirloom. A symbol of prosperity and good fortune, Vankis are a treasured part of South Indian culture.",
  "tags": [
    "Vanki",
    "Bangle",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Gold Jewelry",
    "22K Gold",
    "Ruby",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "Filigree",
    "Floral Design",
    "Wedding Jewelry",
    "Pelliki",
    "Pandugalu",
    "Seemantham",
    "Half-Saree Function",
    "వంకీ",
    "పండుగలు",
    "పెళ్ళికి"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0279_0012",
  "collection": "bracelets"
}