{
  "id": "necklaces-456",
  "title": "Emerald & Diamond Grand Haaram with South Sea Pearls - NEC03006",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold (estimated)",
    "High-quality diamonds (Dwt: 4.70 ct - 1749)",
    "Emeralds (Eme: 2.55 ct - 2)",
    "Rubies (Ruby: 3.86 ct - 2)",
    "South Sea Pearls (Moti: 27.60 ct - 12)",
    "Hyderabadi Polish"
  ],
  "features": "Exquisite Haaram featuring a classic South Indian design with a delicate fusion of traditional and contemporary elements. The necklace showcases meticulously set diamonds forming intricate floral and paisley motifs. Two stunning pear-shaped Emeralds are the focal points of the pendant. Dangling South Sea pearls add a touch of elegance and movement. The piece exhibits the fine craftsmanship synonymous with Hyderabad jewelry making.",
  "colors": [
    "Gold (yellow)",
    "White (diamonds)",
    "Green (emeralds)",
    "Red (rubies)",
    "Creamy White (South Sea Pearls)"
  ],
  "occasions": [
    "Perfect for weddings",
    "grand receptions",
    "Seemantham ceremonies",
    "and other auspicious occasions. Its elegant design also makes it suitable for upscale parties and cultural events."
  ],
  "description": "This grand Haaram represents a timeless blend of traditional South Indian artistry and modern design sensibilities. The use of high-quality diamonds, emeralds, rubies, and South Sea pearls, combined with impeccable Hyderabadi craftsmanship, makes this a valuable heirloom piece. Its versatile design allows it to be paired with both traditional and contemporary attire, making it a cherished addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Kasulaperu",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Indian Bridal Jewelry",
    "Diamond Jewelry",
    "Luxury Jewelry",
    "Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-50 3_0919",
  "collection": "diamond"
}