{
  "id": "necklaces-1029",
  "title": "Divine Emerald & Ruby Raasi Haaram with Matching Tikka - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold plated base metal with Hyderabadi Polish",
    "High-quality CZ stones",
    "Oval-cut Emerald",
    "Pear-shaped Ruby",
    "and Freshwater Pearls."
  ],
  "features": "This exquisite Haaram features a classic Raasi design, adorned with intricate floral patterns rendered in CZ stones. The center showcases an oval-cut Emerald, flanked by intricately designed peacock motifs. A Ruby drop pendant is gracefully suspended below. Dainty freshwater pearl drops accentuate the necklace and the matching Tikka. The piece showcases Hyderabadi craftsmanship, known for its delicate and detailed work.",
  "colors": [
    "Predominantly gold (due to the gold plating)",
    "white (CZ stones)",
    "green (emerald)",
    "red (ruby)",
    "and ivory (pearls). The combination of green",
    "red",
    "and gold is a traditionally auspicious color palette in South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischayathartham)",
    "bridal showers",
    "and grand festive occasions like Diwali",
    "Dasara",
    "Sankranthi. Also suitable for traditional Telugu ceremonies like Seemantham (baby shower)",
    "half-saree function (Voni Function)",
    "and other family celebrations."
  ],
  "description": "This Raasi Haaram set is a statement piece that embodies tradition and elegance. The combination of high-quality CZ stones, the vibrant emerald and ruby, and the delicate pearl drops creates a captivating sparkle. The Hyderabadi craftsmanship ensures lasting quality and brilliance. It's a timeless heirloom to be cherished for generations. The matching Tikka completes the look, adding a touch of regal charm.",
  "tags": [
    "Haaram",
    "Raasi",
    "Necklace",
    "Tikka",
    "Maang Tikka",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "CZ Stones",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Vivaham",
    "Seemantham",
    "Voni Function",
    "Nischayathartham",
    "Festive Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0488_2350",
  "collection": "necklace"
}