{
  "id": "necklaces-256",
  "title": "Divine Embrace: The Lakshmi Kasu Mala Diamond Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Certified Diamonds (VVS Clarity",
    "G Color)",
    "Red and Green Beads. Features a traditional Hyderabadi polish for a rich",
    "enduring luster."
  ],
  "features": "This exquisite Kasu Mala features a delicate vine-like diamond chain with paisley-shaped pendants. The central pendant showcases a beautifully detailed Lakshmi idol in a traditional setting, surrounded by a cluster of vibrant red and green beads for auspiciousness. Each 'kasu' or coin element is intricately designed, reflecting the rich heritage of South Indian artistry. The pendant is detachable offering versatility in wearing style.",
  "colors": [
    "Predominantly gold with sparkling diamonds",
    "complemented by the auspicious red and green bead accents."
  ],
  "occasions": [
    "Ideal for weddings",
    "festive celebrations (like Sankranthi",
    "Dasara",
    "Diwali)",
    "Seemantham ceremonies",
    "and other traditional South Indian occasions. Also perfect for adding a touch of heritage to contemporary outfits."
  ],
  "description": "This Kasu Mala is a timeless symbol of prosperity and tradition. The Lakshmi pendant brings blessings, while the high-quality diamonds add a touch of modern elegance. The Hyderabadi polish ensures long-lasting beauty, making it a cherished heirloom piece. The detachable pendant allows the diamonds only string to be worn on its own, providing great versatility.",
  "tags": [
    "Kasu Mala",
    "Lakshmi Pendant",
    "Diamond Necklace",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Diwali",
    "Festive",
    "Heirloom",
    "Bridal",
    "Ethnic",
    "Hindu",
    "కాసుల పేరు",
    "లక్ష్మి పెండెంట్",
    "బంగారు నెక్లెస్"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0336_0533",
  "collection": "diamond"
}