{
  "id": "necklaces-788",
  "title": "Blossom Allure: Diamond and Gemstone Floral Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Fine Gold (FG) setting with a total gold weight of 153.860 grams. Adorned with 2500 diamonds totaling 18.70 carats (estimated). Features an array of natural colored gemstones with fancy cuts (pan",
    "mq) and an additional 68 natural stones weighing 52.79 carats."
  ],
  "features": "A captivating floral design meticulously crafted with diamonds. The vibrant flower motifs showcase a fusion of traditional Haaram styling with a modern aesthetic. Features intricate diamond pave settings, enhancing the brilliance of each gemstone. The floral arrangement is designed for a graceful drape, creating a stunning statement piece.",
  "colors": [
    "Multicolor",
    "featuring a vibrant palette of gemstone hues including pink",
    "blue",
    "yellow",
    "and green",
    "contrasted by the brilliance of the white diamonds and the warm tone of the Fine Gold."
  ],
  "occasions": [
    "Perfect for modern weddings",
    "grand receptions",
    "upscale parties",
    "or any special occasion where you want to make a lasting impression. Also suited for a Seemantham or Half-Saree function",
    "adding a touch of contemporary elegance to traditional celebrations."
  ],
  "description": "This Floral Haaram is a true testament to artisanal craftsmanship, blending the timeless elegance of diamonds with the vibrant charm of colored gemstones. Its unique floral design and impeccable finishing make it a cherished heirloom piece to be treasured for generations. A perfect balance between traditional opulence and modern sophistication.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Gemstone Jewelry",
    "Floral Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Contemporary Haaram",
    "Fine Gold",
    "Multicolor Gemstones",
    "Pachi Work",
    "Hyderabadi Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-30_1356",
  "collection": "diamond"
}