{
  "id": "necklaces-154",
  "title": "Ratan Haaram with Gemstone Tassels - A Regal Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated Base Metal. Features AAA-grade faceted Tourmaline beads in varying shades of pink",
    "multi-sapphire accents",
    "and freshwater pearls. Set in a Kundan-inspired style. The gold plating undergoes a meticulous Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisitely crafted haaram features a beaded necklace that leads to a floral medallion design encrusted with dazzling stones and a central pearl. Two contrasting tassels, one crafted of tourmaline beads, the other of freshwater pearls, hang from the medallion. The piece blends traditional motifs with modern sensibilities.",
  "colors": [
    "Primarily pink (tourmaline)",
    "with hints of yellow",
    "blue",
    "orange sapphires and white pearls. The gold accents provide a warm",
    "luxurious contrast."
  ],
  "occasions": [
    "Perfect for weddings (Pendli)",
    "receptions",
    "festive occasions",
    "or adding a touch of regal elegance to formal events. Its unique design makes it suitable for both traditional and modern attire."
  ],
  "description": "This haaram is a unique blend of traditional Indian craftsmanship and modern design aesthetics. The use of high-quality gemstones and meticulous detailing ensures a timeless appeal and lasting value. The Hyderabadi polish adds a touch of local artistry and enduring shine. The contrasting tassels provide movement and visual interest. It's a true statement piece that will elevate any outfit.",
  "tags": [
    "Haaram",
    "Necklace",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kundan",
    "Gemstone Necklace",
    "Tourmaline",
    "Pearl",
    "Tassels",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Pendli",
    "Festive Jewelry",
    "Modern Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_DPPD8-1807_0387",
  "collection": "diamond"
}