{
  "id": "necklaces-037",
  "title": "Divya Lakshmi Pendant: A Touch of Divine Grace",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish for a lasting luster. Adorned with high-quality CZ diamonds (American Diamonds) and accented with vibrant ruby (Red) and emerald (Green) simulants. Expertly crafted setting to maximize gemstone brilliance."
  ],
  "features": "Features a finely detailed Lakshmi Devi motif at the center, embodying prosperity and blessings. The pendant showcases a traditional temple design with intricate detailing (Nakshi work inspired) and a modern adaptation with sparkling CZ stones. Delicately crafted design incorporating floral and scrollwork elements.",
  "colors": [
    "Predominantly gold with flashes of ruby red and emerald green",
    "complemented by the dazzling brilliance of white CZ diamonds. A classic South Indian color palette symbolizing auspiciousness."
  ],
  "occasions": [
    "Ideal for traditional occasions like weddings (Vivahaalu)",
    "festivals (Pandugalu)",
    "housewarmings (Gruhapravesam)",
    "and religious ceremonies. Also suitable for adding a touch of elegance to contemporary outfits for parties and cultural events."
  ],
  "description": "This pendant is a harmonious blend of traditional South Indian temple jewelry design and modern aesthetics. The Lakshmi Devi motif brings blessings and prosperity, making it an auspicious and cherished piece. Its high-quality craftsmanship ensures lasting beauty and value. The Hyderabadi polish guarantees a radiant and durable finish. A timeless piece that can be passed down through generations, representing cultural heritage and elegance.",
  "tags": [
    "Pendant",
    "Addigai",
    "Temple Jewelry",
    "Lakshmi Devi",
    "CZ Diamonds",
    "Hyderabadi Polish",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Gold Jewelry",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Nakshi work",
    "22K Gold",
    "పెండెంట్",
    "అడ్డిగై",
    "టెంపుల్ జువెలరీ",
    "లక్ష్మి దేవి",
    "Hyderabadi జువెలరీ"
  ],
  "original_id": "diamond_jewellery_2736b101-3b68-4d82-9a59-45566427b4cd_0086",
  "collection": "diamond"
}