{
  "id": "earrings-268",
  "title": "Emerald & Diamond Chandbali Earrings - Unveiling Andhra's Timeless Splendor",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base Metal: 18K Gold plated",
    "Gemstones: Emerald (Square Cut) and CZ Diamonds (AAA Grade)",
    "Pearls: High-Quality Imitation Pearls. Showcases a Hyderabadi Polish for an enduring shine and lustre."
  ],
  "features": "These Chandbali earrings feature a intricate, floral-inspired design meticulously studded with sparkling CZ diamonds. The center stone is a captivating square-cut Emerald complemented by matching stone at the top. Delicate imitation pearls dangle gracefully, adding a touch of classic charm. The design is inspired by Mughal jewelry aesthetics, a hallmark of Hyderabadi craftsmanship.",
  "colors": [
    "Gold (warm yellow tone)",
    "Emerald (vibrant green)",
    "White (diamonds and pearls). This combination embodies a regal and auspicious palette."
  ],
  "occasions": [
    "Perfect for weddings (vivaham)",
    "receptions",
    "festivals like Diwali and Ugadi",
    "and special occasions where you want to make a statement. Suitable for half-saree functions or any event where traditional attire is desired."
  ],
  "description": "These exquisite Chandbali earrings offer a captivating blend of tradition and sophistication. The meticulous craftsmanship, radiant sparkle of the diamonds, and lustrous pearls create a mesmerizing effect. Lightweight design allows for comfortable wear throughout the day or evening. The emeralds add a touch of auspiciousness and prosperity, making these earrings an heirloom-worthy addition to your jewelry collection.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Indian Earrings",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Muhurtham Jewelry",
    "Party Wear",
    "Ethnic Jewelry",
    "CZ Diamonds",
    "Pearl Earrings",
    "Emerald Earrings",
    "Half-Saree Function"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-32 2_0894",
  "collection": "diamond"
}