{
  "id": "earrings-554",
  "title": "Aarya Emerald Vine Stud Earrings - Enchanting Jadau Style",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (G WT: 8.210)",
    "Natural Emerald Center Stone (Oval Cut)",
    "Polki Diamonds (N WT: 7.92). Features exquisite Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "Intricate floral vine design in the classic Jadau style, with a central vibrant Emerald. The Polki diamonds are meticulously set to enhance the emerald's brilliance, creating a captivating contrast of colors. The openwork design adds a touch of lightness and modern elegance. The gold work exhibits fine detail reminiscent of traditional South Indian craftsmanship.",
  "colors": [
    "Rich Yellow Gold",
    "Emerald Green",
    "and Sparkling White (Polki Diamonds). A classic and auspicious color combination for South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (pellilu)",
    "engagements (nischayartham)",
    "festive occasions like Diwali and Sankranthi",
    "and special events where a touch of traditional elegance is desired. Equally suitable for adding a sophisticated touch to modern ethnic outfits."
  ],
  "description": "These earrings represent a beautiful fusion of traditional Jadau craftsmanship and modern design sensibilities. The natural Emerald and Polki diamonds offer exceptional brilliance and value. The Hyderabadi polish ensures a lasting shine, while the intricate design adds a touch of timeless elegance. A valuable addition to any jewelry collection, embodying South Indian heritage and refined taste.",
  "tags": [
    "Earrings",
    "Studs",
    "Jadau",
    "Emerald",
    "Polki Diamonds",
    "Gold",
    "22K",
    "South Indian Jewelry",
    "Hyderabad",
    "Telugu Jewelry",
    "Pellilu",
    "Muhurtham",
    "Nischayartham",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "Aarya"
  ],
  "original_id": "jewellery_IMG-20241219-WA0024_1603",
  "collection": "jewellery"
}