{
  "id": "necklaces-468",
  "title": "Emerald and Diamond Floral Vaalai Poo Haram - A Timeless South Indian Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (47.810 g)",
    "Brilliant Cut Diamonds (5.36 carats",
    "1129 stones)",
    "Natural Emeralds (20.13 carats",
    "13 stones). Hyderabadi Polish finish enhances the gold's lustre."
  ],
  "features": "A two-layered Haaram featuring vibrant, oval-cut emeralds framed by dazzling diamond halos in the upper layer. The lower layer showcases an elaborate floral pattern, meticulously crafted with diamond-studded petals, culminating in a graceful teardrop pendant. The setting ensures maximum brilliance and secure gemstone placement. The floral 'Vaali Poo' design is a contemporary take on traditional South Indian motifs.",
  "colors": [
    "Lustrous yellow gold",
    "vibrant green emeralds",
    "and sparkling white diamonds create a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement ceremonies (Muhurtham)",
    "or any grand celebration. Its blend of tradition and modern design makes it a stunning choice for both traditional South Indian functions and contemporary parties."
  ],
  "description": "This Haaram embodies timeless elegance and craftsmanship. The combination of precious gemstones and intricate design reflects the rich cultural heritage of South Indian jewelry. The high-quality diamonds and emeralds ensure lasting value and enduring beauty, making it a treasured heirloom for generations to come. The floral design symbolizes prosperity and joy, making it a meaningful and beautiful addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Vaali Poo",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Indian Jewelry",
    "Muhurtham",
    "Seemantham",
    "Engagement",
    "Reception",
    "Floral Design"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-54_0931",
  "collection": "diamond"
}