{
  "id": "earrings-500",
  "title": "Chandbali Earrings - Exquisite Polki Diamond, Coral & Pearl Jhumka",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (VVS Clarity)",
    "Natural Coral Beads",
    "Freshwater Pearls. Finished with signature Hyderabadi Polish for lasting luster and brilliance."
  ],
  "features": "Classic Chandbali design featuring intricate Polki diamond settings around a vibrant cluster of natural coral beads. The lower tier is adorned with delicate pearl and coral drops, adding a touch of elegance and movement. Features traditional floral and paisley motifs typical of South Indian temple jewelry. The use of uncut polki diamonds adds a rustic and timeless appeal.",
  "colors": [
    "Predominantly Gold with the fiery orange of the Coral",
    "the creamy white of the pearls",
    "and the sparkling white of the Polki Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "receptions",
    "festivals (పండుగలు)",
    "and other special occasions. A stunning complement to traditional South Indian attire like Kanjeevaram sarees and lehengas. Also suitable for adding a touch of ethnic elegance to contemporary outfits."
  ],
  "description": "A true statement piece showcasing exceptional craftsmanship and timeless design. The use of genuine Polki diamonds and natural Coral ensures its value and enduring appeal. Its bold design blends traditional Telugu aesthetics with modern wearability. Owning this Chandbali is an investment in cultural heritage and timeless elegance. Durable and made to last generations.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "Polki Diamonds",
    "Coral",
    "Pearl",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "చెవి దుద్దులు",
    "పెళ్ళి నగల"
  ],
  "original_id": "ear_rings_DPER8-1612_2627",
  "collection": "ear"
}