{
  "id": "necklaces-868",
  "title": "The Raani Haar Set: Polki Diamond & Pearl Symphony with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold Base (సువర్ణ ఆధారితం)",
    "Uncut Polki Diamonds (పోల్కి వజ్రాలు) with exceptional fire",
    "Emerald Cabochon (పచ్చ)",
    "Ruby Accent (కెంపు)",
    "South Sea Pearls (ముత్యాలు) with a lustrous finish",
    "Hyderabadi Polish (హైదరాబాద్ పాలిష్)"
  ],
  "features": "Exquisite Raani Haar design featuring floral and paisley motifs intricately set with uncut Polki diamonds. A central Emerald Cabochon pendant is surrounded by Polki diamonds and cascading South Sea Pearls. The Jhumka earrings echo the floral motif with a matching Ruby accent and suspended Pearl. The setting showcases traditional Hyderabadi craftsmanship.",
  "colors": [
    "Predominantly white (Polki diamonds) with gold accents",
    "complemented by the vivid green of the Emerald and the subtle red of the Ruby. The South Sea pearls add a creamy white contrast."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements (నిశ్చితార్థం)",
    "milestone celebrations",
    "and other grand events (వేడుకలు). Ideal for brides seeking a traditional yet luxurious look. Suitable for Muhurtham",
    "Sangeet",
    "and Reception."
  ],
  "description": "This Raani Haar set is a timeless heirloom piece (వంశపారంపర్య ఆభరణం), showcasing the opulence of Polki diamonds and the elegance of South Sea pearls. The intricate Hyderabadi craftsmanship guarantees exceptional quality and durability. The blend of traditional design and modern setting makes it a versatile statement piece. The high-quality materials ensure lasting value and beauty.",
  "tags": [
    "Raani Haar",
    "Polki Diamond Necklace",
    "Jhumka Earrings",
    "South Sea Pearls",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Hyderabad Jewelry",
    "Telugu Wedding",
    "Engagement Jewelry",
    "Bridal Jewelry",
    "కంఠాభరణం",
    "జుంకాలు",
    "పోల్కి వజ్రాలు",
    "ముత్యాలు",
    "పెళ్ళి ఆభరణాలు",
    "నిశ్చితార్థం ఆభరణాలు"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0401_1555",
  "collection": "haaram"
}