{
  "id": "necklaces-1108",
  "title": "Emerald Lakshmi Kasu Haaram - Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Uncut Polki Diamonds (దాగిన వజ్రాలు)",
    "Zambian Emeralds (పచ్చలు)",
    "Burmese Rubies (కెంపు రాళ్ళు). Features Hyderabadi Polish for enduring lustre."
  ],
  "features": "This exquisite Haaram showcases a classic Lakshmi Kasu design interspersed with peacock (నెమలి) motifs, a symbol of beauty and prosperity. The statement Zambian Emerald drops are framed by Polki diamonds set in a closed setting, highlighting their intense color. The pendant features delicate engravings reminiscent of temple jewellery, lending it a regal touch. The Polki diamonds feature intricate detailing enhancing their brilliance.",
  "colors": [
    "Predominantly gold",
    "with vibrant green from the emeralds",
    "flashes of red from the rubies",
    "and a warm white from the Polki diamonds. The antique gold finish accentuates the traditional aesthetic."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham (శ్రీమంతం)",
    "and other grand celebrations. This Haaram adds an element of timeless elegance to any traditional attire",
    "making it suitable for modern parties and upscale events as well."
  ],
  "description": "This Haaram is a stunning fusion of tradition and contemporary design. The use of high-quality Zambian Emeralds and uncut Polki diamonds, combined with skilled craftsmanship, ensures a heirloom-worthy piece. Lakshmi Kasu design is a symbol of wealth and prosperity, making it an auspicious addition to your jewellery collection. The durable Hyderabadi Polish ensures lasting beauty. A true investment in style and cultural heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emeralds",
    "Polki Diamonds",
    "Lakshmi Kasu",
    "South Indian Jewellery",
    "Traditional Jewellery",
    "Wedding Jewellery",
    "Bridal Jewellery",
    "22K Gold",
    "Hyderabadi Jewellery",
    "Temple Jewellery",
    "канthaаbharaNam",
    "pachchalu",
    "Kempu raallu",
    "daagina vajraalu",
    "nemali",
    "vibhaaham",
    "nischithaartham",
    "sreemantham"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0003_2521",
  "collection": "radhe"
}