{
  "id": "earrings-031",
  "title": "Kanaka Jhumka - Heritage Diamond and Gemstone Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold (916 Gold). Features high-quality CZ Diamonds",
    "vibrant Rubies",
    "and striking Emeralds. Finished with a durable Hyderabadi Polish for lasting brilliance."
  ],
  "features": "Classic Jhumka design with intricate filigree work, set with sparkling CZ diamonds in a delicate floral pattern. Accented with pops of color from the ruby and emerald gemstones. The bell-shaped structure is adorned with dangling gold beads, known as 'gundlu', adding graceful movement. The top includes floral designs with gemstones in a cluster.",
  "colors": [
    "Predominantly yellow gold",
    "complemented by the fiery red of the rubies",
    "the lush green of the emeralds",
    "and the dazzling white brilliance of the CZ diamonds."
  ],
  "occasions": [
    "Perfect for traditional South Indian events such as weddings (Pelli)",
    "receptions",
    "festivals (like Sankranti or Dasara)",
    "and other auspicious occasions. Also suitable for adding a touch of ethnic elegance to modern celebrations."
  ],
  "description": "These Kanaka Jhumkas showcase exceptional craftsmanship and timeless design. The combination of traditional South Indian motifs and modern sparkle makes them a versatile and treasured addition to any jewelry collection. Made with high-quality materials and careful attention to detail, these earrings are both beautiful and durable. A statement piece that embodies the rich heritage of Telugu jewelry. They are lightweight and comfortable for extended wear.",
  "tags": [
    "Jhumka",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Earrings",
    "చెవి దిద్దులు",
    "Diamond Earrings",
    "Ruby",
    "Emerald",
    "Gold Earrings",
    "Wedding Jewelry",
    "Pelli",
    "Sankranti",
    "Dasara",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "Hyderabadi Polish",
    "22K Gold",
    "Filigree"
  ],
  "original_id": "diamond_jewellery_3c82b8e9-6ca9-43e5-b55f-7b9062f7d915_0103",
  "collection": "diamond"
}