{
  "id": "earrings-665",
  "title": "Emerald Cascade Jhumka: A Symphony of Tradition and Modern Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "High-grade silver",
    "intricately adorned with meticulously cut emeralds and sparkling cubic zirconia. Features a durable and lustrous Hyderabadi polish",
    "ensuring lasting brilliance and resistance to wear."
  ],
  "features": "These exquisite Jhumkas boast a cascading design reminiscent of traditional South Indian floral motifs (poola jaada inspiration). The central oval emerald is surrounded by a halo of shimmering cubic zirconia, creating a dazzling effect. The delicate emerald drops add movement and grace. The openwork filigree design enhances the lightness and airy feel.",
  "colors": [
    "Predominantly silver and emerald green",
    "with the clear sparkle of cubic zirconia adding to the overall vibrancy."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "grand celebrations",
    "and special occasions where a touch of traditional elegance is desired. Also suitable for cocktail parties and upscale social gatherings."
  ],
  "description": "These Emerald Cascade Jhumkas represent the perfect fusion of classic South Indian design and modern sensibility. The high-quality materials and meticulous craftsmanship ensure a piece that will be treasured for generations. The dazzling sparkle and vibrant emeralds make a bold statement, while the lightweight design ensures comfortable wear. A true heirloom-quality piece that captures the essence of Hyderabadi jewelry tradition.",
  "tags": [
    "Jhumka",
    "Karnaphool",
    "Earrings",
    "Emerald",
    "Cubic Zirconia",
    "Silver",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Statement Earrings",
    "Cocktail Earrings",
    "Fashion Jewelry",
    "Poola Jaada",
    "Bridal Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-41 3_2253",
  "collection": "sjpl"
}