{
  "id": "necklaces-858",
  "title": "Exquisite Diamond and Pearl Addigai Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "High-Quality Diamonds (VS Clarity",
    "G Color)",
    "Natural Freshwater Pearls",
    "Emerald",
    "Ruby. Showcases a delicate Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This Addigai Haaram features intricate floral motifs meticulously crafted with sparkling diamonds. The design includes two distinct pendants with contrasting emerald and ruby centerpieces. Dangling pearls add a touch of elegance. The adjustable chain ensures a perfect fit. The design shows great attention to detail.",
  "colors": [
    "Predominantly white (diamonds and pearls) with accents of gold",
    "green (emerald)",
    "and red (ruby)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "engagements (Nischitartham)",
    "bridal showers",
    "and grand celebrations. Suitable for formal events and traditional ceremonies. Can also be paired with contemporary outfits for a fusion look."
  ],
  "description": "A statement piece that embodies the grandeur of South Indian jewelry. This Addigai Haaram is handcrafted with exceptional attention to detail. The use of high-quality diamonds and lustrous pearls ensures lasting beauty. The intricate design reflects traditional craftsmanship while maintaining a modern appeal. Perfect for heirloom collections and a thoughtful gift.",
  "tags": [
    "Haaram",
    "Addigai",
    "Diamond Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Fine Jewelry",
    "18K Gold",
    "Hyderabad Jewelry",
    "Vivaha Mahotsavam",
    "Nischitartham",
    "Emerald",
    "Ruby",
    "Pearls",
    "Temple Jewelry"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0390_1545",
  "collection": "haaram"
}