{
  "id": "earrings-477",
  "title": "Heera Sapphire Blossom Earrings - A Timeless Telugu Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold base",
    "Polki Diamonds (Uncut Diamonds)",
    "Natural Sapphire. Handcrafted with meticulous detail",
    "featuring a subtle Hyderabadi Polish to enhance its antique charm."
  ],
  "features": "These exquisite earrings feature a unique hybrid design, blending traditional Polki setting with a contemporary floral motif. The square-shaped top showcases a central Polki diamond surrounded by a halo of smaller diamonds. A delicate sapphire anchors the floral drop below, comprised of three Polki diamond 'petals.' The setting emphasizes the natural brilliance of the uncut diamonds, creating a captivating sparkle.",
  "colors": [
    "Predominantly gold",
    "with the ethereal white of Polki diamonds and a striking deep blue of the central Sapphire. The color palette lends itself well with any type of outfit and event."
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "receptions",
    "festive occasions like Diwali and Sankranthi",
    "or any event where you want to add a touch of timeless elegance. Can also be worn as a statement piece for modern cocktail parties and celebrations."
  ],
  "description": "These earrings offer a rare blend of tradition and modernity. The use of Polki diamonds celebrates the rich heritage of Indian jewelry making, while the contemporary design ensures it remains a versatile addition to any jewelry collection. The high gold purity and gemstone quality guarantee lasting value and heirloom potential. A perfect representation of Hyderabad's jewelry legacy, handcrafted with passion and precision.",
  "tags": [
    "Polki Earrings",
    "Diamond Jhumka",
    "Sapphire Jewelry",
    "South Indian Jewellery",
    "Telugu Jewellery",
    "Hyderabad Jewelry",
    "Uncut Diamonds",
    "Traditional Earrings",
    "Wedding Jewellery",
    "Festival Jewellery",
    "Heirloom Jewellery",
    "22K Gold",
    "Gold Earrings",
    "Contemporary Indian Jewellery",
    "Muhurtham",
    "Sankranthi",
    "Diwali."
  ],
  "original_id": "ear_rings_DPER8-1402_2598",
  "collection": "ear"
}