{
  "id": "earrings-639",
  "title": "Emerald & Diamond Dewdrop Jhumka - లక్ష్మీ డిజైన్ జుమ్కాలు",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold)",
    "Brilliant Cut Diamonds (VVS Clarity)",
    "Pear-Shaped Natural Pearl Drops",
    "Emerald Center Stones. Featuring Hyderabadi Polish for a lasting luster."
  ],
  "features": "Classic Jhumka design with intricate filigree detailing, reminiscent of traditional Telugu craftsmanship. The earring features a floral and heart-shaped diamond-studded top with a vibrant emerald center stone. The bell-shaped jhumka is adorned with a delicate lattice pattern of diamonds and finished with hanging pearl dewdrops for an elegant sway. Lakshmi (లక్ష్మీ) motifs are subtly incorporated into the top design, signifying prosperity and good fortune.",
  "colors": [
    "Primary color is yellow gold",
    "complemented by the sparkle of white diamonds",
    "the vivid green of the emeralds",
    "and the soft creamy white of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements",
    "Bharatanatyam performances",
    "temple visits",
    "festivals like Diwali (దీపావళి) and Sankranthi (సంక్రాంతి)",
    "or any special occasion where you want to showcase your traditional roots with a touch of elegance. Also suitable for modern fusion outfits."
  ],
  "description": "This Jhumka beautifully blends traditional South Indian design with the timeless appeal of diamonds and pearls. The intricate filigree work, the auspicious Lakshmi motifs, and the high-quality gemstones make this a truly heirloom-worthy piece. The Hyderabadi polish ensures long-lasting shine and durability. These earrings are not just jewelry; they are a celebration of South Indian culture and craftsmanship.",
  "tags": [
    "Jhumka",
    "Jhumki",
    "Earrings",
    "Diamond Earrings",
    "Emerald Earrings",
    "Pearl Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "22K Gold",
    "చెవి దిద్దులు",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Lakshmi Design",
    "Temple Jewelry",
    "Pearl Drops",
    "Bridal Jewelry",
    "పెళ్లి",
    "దీపావళి",
    "సంక్రాంతి"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 23_2217",
  "collection": "sjpl"
}