{
  "id": "necklaces-655",
  "title": "Enchanting Raani Haar - A Symphony of Diamonds, Emeralds, and Sapphires",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant-cut Diamonds (VVS clarity)",
    "Natural Emeralds (Zambian Origin",
    "Excellent Cut)",
    "Natural Sapphires (Deep Blue",
    "Teardrop Cut). Features Hyderabadi Polish for lasting lustre and shine."
  ],
  "features": "Intricately designed Raani Haar showcasing floral motifs and geometric patterns. The necklace features a central pendant with a large, vibrant Emerald surrounded by pink stones. Cascading Sapphires add depth and dimension. The setting is a mix of bezel and prong setting to highlight the individual beauty of each gemstone. Filigree detailing adds a touch of old-world charm.",
  "colors": [
    "Primary colors are gold",
    "white (diamonds)",
    "green (emeralds)",
    "pink(stones)",
    "and blue (sapphires). The combination creates a rich",
    "regal palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (vivaha)",
    "receptions",
    "and milestone celebrations. Ideal for brides seeking a statement piece that embodies both tradition and elegance. Also suitable for Seemantham and other significant family events."
  ],
  "description": "This Raani Haar is a testament to exquisite craftsmanship and timeless design. The use of high-quality diamonds, emeralds, and sapphires ensures brilliance and lasting value. The Hyderabadi polish and intricate filigree detailing reflect the rich heritage of South Indian jewelry making. A true heirloom piece to be cherished for generations.",
  "tags": [
    "Raani Haar",
    "Bridal Necklace",
    "South Indian Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "Sapphire Necklace",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaabharanalu",
    "Heirloom Jewelry",
    "Fine Jewelry",
    "Indian Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-25_1161",
  "collection": "diamond"
}