{
  "id": "bangles-297",
  "title": "Contemporary Diamond Vanki Bracelet - A Touch of Timeless Elegance",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "Crafted with 14.21 grams of [Specify Gold Purity",
    "e.g.",
    "18K] Rose Gold",
    "this bracelet showcases brilliant-cut diamonds. Features 0.12 carats of smaller diamonds",
    "and 0.53 carats of larger baguette diamonds with (+3mm). The diamonds are of VS clarity and G-H color",
    "meticulously set for optimal brilliance."
  ],
  "features": "This exquisite vanki bracelet presents a modern twist on a classic design. Four round motifs, each containing stunning Baguette cut diamonds clustered at the center, are connected by an S-shaped band of small round diamonds set in a pavé setting. The negative space creates an airy and elegant design.",
  "colors": [
    "The combination of rose gold with the bright white of the diamonds offers a modern and sophisticated aesthetic. The warmth of the rose gold complements all skin tones."
  ],
  "occasions": [
    "Perfect for adding a touch of glamour to any occasion",
    "from a modern cocktail party to a traditional Telugu wedding reception. Suitable for formal events",
    "anniversaries",
    "or as a cherished gift."
  ],
  "description": "This bracelet is a testament to contemporary craftsmanship and design. Its unique blend of rose gold and baguette-cut diamonds ensures it will become a timeless heirloom, embodying elegance and modern sophistication. The meticulously set diamonds radiate brilliance from every angle, making it a true statement piece. Designed for comfort and durability.",
  "tags": [
    "Diamond Bracelet",
    "Vanki",
    "Kadiyam",
    "Rose Gold Jewelry",
    "Contemporary Jewelry",
    "Indian Bracelet",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Cocktail Jewelry",
    "Engagement Gift",
    "Baguette Diamonds",
    "Bridal Jewelry",
    "Hyderabadi Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-09-11-07-53 2_2000",
  "collection": "sjpl"
}