{
  "id": "necklaces-767",
  "title": "Rajasi Diamond Bridal Haaram - The Empress Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base",
    "meticulously studded with high-quality Cubic Zirconia (CZ) diamonds",
    "Emerald accents",
    "Pink stone accents and Blue Sapphire pendants. Features a brilliant Hyderabadi Polish for lasting shine."
  ],
  "features": "A breathtaking statement piece, this Haaram features an intricate floral and paisley design, symbolic of prosperity and auspicious beginnings. The cascading tiers of CZ diamonds create a mesmerizing sparkle, while the emerald and pink stone accents add a touch of royalty. The unique pendant adds a modern twist to the traditional design, making it truly one-of-a-kind.",
  "colors": [
    "Predominantly brilliant white (CZ Diamonds) with vibrant emerald green",
    "delicate pink",
    "and royal blue accents. The gold provides a warm and luxurious backdrop."
  ],
  "occasions": [
    "Perfect for grand celebrations",
    "bridal occasions (Muhurtham)",
    "receptions",
    "and other special events where you want to make a lasting impression. Also suitable for Seemantham or Half-Saree functions."
  ],
  "description": "This Rajasi Diamond Bridal Haaram is a stunning fusion of traditional South Indian design and modern elegance. The exceptional craftsmanship, brilliant sparkle, and vibrant color palette make it a true heirloom piece. The Hyderabadi polish ensures lasting shine, while the high-quality CZ diamonds offer exceptional value. Symbolizing prosperity and auspicious beginnings, this Haaram is the perfect embodiment of love and commitment.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "CZ Diamonds",
    "Emerald",
    "Pink Stone",
    "Blue Sapphire",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Muhurtham",
    "Reception",
    "Seemantham",
    "Half-Saree",
    "Kasulaperu",
    "Addigai",
    "Rajasi"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-06_1273",
  "collection": "diamond"
}