{
  "id": "earrings-468",
  "title": "Rani Pink Kundan Polki Jhumka - A Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Kundan Polki Diamonds (Uncut Diamonds)",
    "Ruby",
    "Emerald",
    "Freshwater Pearls. Features our signature Hyderabadi Polish for a lasting luster."
  ],
  "features": "These exquisite Jhumkas showcase intricate Kundan setting with vibrant Ruby and Emerald enameling. The Polki diamonds are carefully hand-set to maximize their brilliance. The design is a harmonious blend of traditional South Indian temple jewelry with a modern aesthetic, featuring a classic jhumka shape adorned with delicate pearl drops. Notice the fine craftsmanship in the open setting which allows light to pass through the Polki diamonds, enhancing their natural sparkle.",
  "colors": [
    "Gold (yellow)",
    "Ruby (rani pink)",
    "Emerald (green)",
    "Polki Diamond (white/clear)",
    "Pearl (cream). This is a traditional and auspicious color palette for South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (pendli)",
    "engagements",
    "Seemantham ceremonies",
    "half-saree functions (Langa Voni Function)",
    "and festive occasions like Sankranti and Ugadi. Their timeless elegance also makes them suitable for upscale parties and cultural events."
  ],
  "description": "These Jhumkas are a true heirloom piece, blending traditional South Indian design with exceptional craftsmanship. The use of high-quality Kundan Polki diamonds and genuine gemstones ensures lasting beauty and value. The Hyderabadi polish provides superior shine and durability, making them a worthy investment for generations to come. Their unique color combination and exquisite details will undoubtedly make you stand out at any occasion.",
  "tags": [
    "Jhumka",
    "Kundan",
    "Polki",
    "Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional",
    "Indian Wedding",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Chevi Duddulu",
    "Pendli",
    "Seemantham",
    "Langa Voni",
    "Ruby",
    "Emerald",
    "Pearls"
  ],
  "original_id": "ear_rings_DPER8-1230_2589",
  "collection": "ear"
}