{
  "id": "earrings-172",
  "title": "Anantika Polki Jhumka - Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated base. Features premium Polki diamonds (uncut diamonds) with a white polish finish. The center stones are natural Sapphires and the pearl drops are genuine cultured pearls. Hyderabadi craftsmanship ensures exceptional detailing and durability."
  ],
  "features": "Inspired by traditional South Indian temple jewelry, these Jhumkas feature intricate Polki diamond settings arranged in a floral halo around an oval-shaped Aqua center stone. A sapphire teardrop adds a regal touch, while the delicate pearl drops provide a classic finishing touch. The design is reminiscent of traditional Nakshi work (నక్షి పని), adding a timeless appeal.",
  "colors": [
    "The color palette consists of a warm white finish from the Polki diamonds",
    "rich blue Sapphires",
    "a soft blue Aquamarine hue in the center stone",
    "and creamy white pearls",
    "all complementing the golden sheen of the base."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu/వివాహాలు)",
    "engagements",
    "festivals like Diwali (దీపావళి)",
    "and traditional South Indian ceremonies like Seemantham (సీమంతం) or half-saree functions (Langa Voni/లంగా వోణి). Also suitable for adding a touch of elegance to contemporary evening wear."
  ],
  "description": "These Anantika Polki Jhumkas blend traditional South Indian aesthetics with modern sensibilities. The use of uncut Polki diamonds adds a touch of royalty, while the sapphire and pearl accents create a refined look. Handcrafted by skilled artisans in Hyderabad, these earrings are not just jewelry; they are a piece of art and a symbol of cultural heritage. Their durability ensures they will be cherished for generations.",
  "tags": [
    "Jhumka",
    "Polki",
    "Earrings",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Sapphire",
    "Pearl",
    "చెవిపోగులు",
    "Hyderabadi Jewelry",
    "Traditional",
    "Ethnic",
    "Fashion",
    "Anantika",
    "Jewellary"
  ],
  "original_id": "diamond_jewellery_DPER8-956_0314",
  "collection": "diamond"
}