{
  "id": "necklaces-1254",
  "title": "Exquisite Emerald and Ruby Haaram with Polki Diamond Embellishments",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (hallmarked)",
    "Premium Quality Emerald beads (16.56 ct)",
    "Natural Burmese Ruby (12.01 ct",
    "23.77ct)",
    "Polki Diamonds (3.28ct)",
    "Cultured Rice Pearls (6.83ct)",
    "Natural Blue Sapphires (15.73ct). Features Hyderabadi Polishing for a lasting lustre."
  ],
  "features": "A stunning five-strand emerald bead Haaram culminating in a lavish floral pendant. The pendant showcases a central cabochon Ruby surrounded by intricately set Polki diamonds and floral motifs adorned with emeralds, rubies, and blue sapphires. The overall design seamlessly blends traditional South Indian Nakshi work inspiration with a modern, lightweight setting.",
  "colors": [
    "Dominant hues of lush green (emeralds)",
    "vibrant red (rubies)",
    "shimmering white (Polki diamonds)",
    "soft blue (sapphires) and golden yellow (gold). A classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "traditional ceremonies (Puja)",
    "Seemantham (baby shower)",
    "half-saree function (Vayyaralu). Also suitable for upscale evening events or celebrations."
  ],
  "description": "This Haaram is a masterpiece of traditional South Indian jewelry craftsmanship, showcasing a blend of vibrant gemstones and brilliant Polki diamonds. Its lightweight design ensures comfort while maintaining a bold, statement-making presence. The combination of emeralds and rubies is considered highly auspicious and brings prosperity. An heirloom piece to be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Vivahaalu",
    "Nischitartham",
    "Seemantham",
    "Vayyaralu",
    "Bangaru Thaggu",
    "Ratnalu Haaram"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-13-02-28 3_1850",
  "collection": "sjpl"
}