{
  "id": "waistbands-016",
  "title": "Diamond Vaddanam with Ruby and Emerald Accents - A Regal Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "High-purity Gold (exact karat specified upon inquiry) meticulously set with brilliant-cut Diamonds (13.70 carats total diamond weight). Features vibrant Rubies (1.90 carats total)",
    "lush Emeralds (7.07 carats total)",
    "and finely carved Pink Tourmalines (40.55 carats total). Features a Hyderabadi Polish",
    "enhancing the gold's luster."
  ],
  "features": "This contemporary Vaddanam showcases a delicate floral motif intricately crafted with diamond pave settings. Larger Emeralds are strategically placed to draw the eye, while the Pink Tourmaline drops add a touch of playful femininity. The design seamlessly blends traditional South Indian aesthetics with modern sensibilities. Features multiple rows of delicate diamond and gold detailing, along with a secure clasp for a perfect fit.",
  "colors": [
    "Primarily a shimmering white from the diamonds and a warm golden hue from the high-purity gold. Accented by the rich red of the Rubies",
    "the deep green of the Emeralds",
    "and soft pink of the Tourmalines."
  ],
  "occasions": [
    "Ideal for wedding receptions",
    "Sangeet ceremonies",
    "Seemantham (pregnancy ceremony)",
    "half-saree functions",
    "and other grand celebrations where a statement piece is desired. Suitable for both traditional and modern attire."
  ],
  "description": "A captivating blend of tradition and modern elegance, this Diamond Vaddanam is a statement piece that exudes opulence. The meticulous craftsmanship, combined with the brilliance of diamonds and the vibrancy of precious gemstones, makes it a treasured heirloom. Its unique design and superior quality promise to elevate any ensemble. Owning this piece signifies an appreciation for South Indian heritage and sophisticated style.",
  "tags": [
    "Vaddanam",
    "Oddaanam",
    "Waist Belt",
    "Diamond Belt",
    "Ruby",
    "Emerald",
    "Pink Tourmaline",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Antique Finish",
    "Nakshi Work",
    "Temple Jewelry",
    "ఒడ్డాణం",
    "Kasulaperu",
    "Kempu Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02_1296",
  "collection": "diamond"
}