{
  "id": "necklaces-998",
  "title": "Divine Diamond and Emerald Kasulaperu Haaram Set with Jhumki",
  "category": "necklaces",
  "original_type": "Necklace and Earrings",
  "materials": [
    "18K Yellow Gold",
    "VVS Clarity Diamonds (high-grade)",
    "Natural Emeralds (central stones)",
    "Natural Rubies",
    "Freshwater Pearls. Hyderabadi Polish for a lasting shine."
  ],
  "features": "Elaborate floral and paisley motifs intricately set with dazzling diamonds. Features a central emerald centerpiece and complementing emerald pendant. Adorned with delicate ruby accents and lustrous pearl drops. The necklace exhibits a classic Kasulaperu design with a modern twist. The matching Jhumki features a traditional bell shape, enhanced with a ruby top and pearl drop. Fine milgrain detailing adds a touch of vintage charm.",
  "colors": [
    "Predominantly gold and white (diamond) with vibrant accents of emerald green",
    "ruby red",
    "and soft pearl white."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "engagements (Nischitartham)",
    "receptions",
    "or grand festive occasions (like Diwali or Ugadi). A stunning statement piece for a bride or for special family celebrations like Seemantham or half-saree function."
  ],
  "description": "Exquisite craftsmanship showcases the rich heritage of Hyderabad's jewelry tradition. The combination of diamonds, emeralds, rubies, and pearls symbolizes prosperity and good fortune. The timeless design ensures it can be treasured for generations. High-quality materials and meticulous detailing guarantee durability and lasting beauty. The set makes a regal statement, blending tradition with modern elegance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Ruby Jewelry",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Kasulaperu",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Vivaaham",
    "Nischitartham",
    "Kantabharanam",
    "Chevipogulu",
    "ఆభరణాలు",
    "వివాహ ఆభరణాలు"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0455_2319",
  "collection": "necklace"
}