{
  "id": "bangles-073",
  "title": "Navarathna Kanganam - The Celestial Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "Natural Emeralds",
    "Natural Rubies",
    "Polki Diamonds. Hyderabadi Polish for enduring shine and depth. Enamel backing for comfort and vibrant contrast."
  ],
  "features": "Features a central floral medallion adorned with Polki diamonds, bordered by meticulously set rubies. The bangle incorporates intricate openwork gold detailing, reminiscent of traditional South Indian floral motifs. The design emphasizes symmetry and balance, embodying the 'Shobha' (beauty) of South Indian craftsmanship.",
  "colors": [
    "Primarily gold with vibrant pops of ruby red and emerald green. The diamonds add a layer of brilliance and sparkle. The enamel backing provides soft pink and pearly white color for a pleasing look."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements (Nischitartham)",
    "festivals like Diwali and Ugadi",
    "or any significant celebration where you want to showcase your appreciation for timeless elegance and heritage."
  ],
  "description": "This bangle seamlessly blends tradition with modern elegance. Its durable construction ensures longevity, making it an heirloom piece for generations to come. The use of authentic Polki diamonds and vibrant gemstones elevates its value and aesthetic appeal. Experience the luxury of wearing a piece that reflects your sophisticated taste and appreciation for South Indian artistry.",
  "tags": [
    "Kanganam",
    "bangle",
    "South Indian jewelry",
    "Telugu jewelry",
    "Indian jewelry",
    "wedding jewelry",
    "polki diamonds",
    "emerald",
    "ruby",
    "gold bangle",
    "Kadayam",
    "traditional jewelry",
    "Hyderabadi jewelry",
    "bridal jewelry",
    "navarathna",
    "nakshi work"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0266_0001",
  "collection": "bracelets"
}