{
  "id": "necklaces-051",
  "title": "Chandrika Diamond Haaram Pendant - A Touch of Celestial Splendor",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (916 Hallmarked)",
    "Brilliant Cut Diamonds (SI Clarity",
    "G-H Color). Features a radiant Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite pendant showcases a modern interpretation of the traditional Haaram design. Intricate filigree-inspired swirls embellished with meticulously set diamonds create a mesmerizing play of light. The design draws inspiration from celestial motifs, reminiscent of the 'Chandrika' (moonlight) in Telugu culture. The open setting enhances the diamonds' brilliance.",
  "colors": [
    "Predominantly Gold with sparkling White (Diamonds)."
  ],
  "occasions": [
    "Ideal for both traditional celebrations like weddings (Vivaha)",
    "festive occasions such as Sankranthi or Diwali",
    "and modern events like cocktail parties and anniversaries. A versatile piece that complements both traditional sarees and contemporary attire."
  ],
  "description": "A stunning fusion of traditional South Indian artistry and modern design sensibilities. Handcrafted with the finest materials and exceptional attention to detail, this pendant is a statement piece that exudes elegance and sophistication. The brilliant cut diamonds catch the light beautifully, adding a touch of glamour to any ensemble. Its unique design makes it a conversation starter and a cherished heirloom.",
  "tags": [
    "Pendant",
    "Haaram",
    "Diamond Pendant",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Telugu Jewelry",
    "Chandrika",
    "Contemporary Design",
    "22K Gold",
    "Vivaha",
    "Sankranthi",
    "Diwali"
  ],
  "original_id": "diamond_jewellery_58156909-24da-4967-9062-b3dae3fd501b_0124",
  "collection": "diamond"
}