{
  "id": "necklaces-630",
  "title": "Emerald and Diamond Floral Statement Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold with Hyderabadi Polish",
    "Brilliant-Cut Diamonds (VVS Clarity",
    "G Color)",
    "Faceted Emeralds",
    "Freshwater Pearls"
  ],
  "features": "This exquisite haaram showcases a floral motif with meticulously set brilliant-cut diamonds surrounding vibrant emeralds. The piece is handcrafted with exceptional attention to detail. The design incorporates a delicate, cascading pattern, creating a stunning visual impact. Small Freshwater pearls hang at intervals for a gentle movement and soft glow. The design strikes a beautiful balance between modern aesthetics and traditional South Indian craftsmanship.",
  "colors": [
    "Yellow Gold",
    "White Diamonds",
    "Vibrant Green Emeralds",
    "Creamy White Pearls"
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "engagement parties",
    "festive celebrations like Sankranthi (సంక్రాంతి) and Ugadi (ఉగాది)",
    "or any special occasion where you want to make a grand statement. Can also be styled for high-end modern events."
  ],
  "description": "This haaram is a true statement piece, combining the brilliance of diamonds with the rich color of emeralds and the softness of pearls. The Hyderabadi polish ensures a lasting luster and luxurious feel. The intricate floral design reflects a blend of tradition and contemporary elegance, making it a timeless investment. This piece is a perfect representation of Hyderabadi jewelry craftsmanship, known for its grandeur and quality. This is more than just a necklace, it's a piece of art that reflects your impeccable taste.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "కంఠాభరణం",
    "పెళ్లి నగలు",
    "Sankranthi Jewelry",
    "Ugadi Jewelry",
    "Floral Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "18K Gold",
    "Emeralds",
    "Diamonds",
    "Pearls",
    "Contemporary Haaram",
    "Fashion",
    "jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-07 2_1136",
  "collection": "diamond"
}