{
  "id": "earrings-670",
  "title": "Chandrika Pink Zircon Jhumkas - A Floral Cascade of Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated Alloy",
    "High-quality Pink Zircon",
    "Cubic Zirconia (CZ) stones. Hyderabadi Polish for lasting brilliance and durability."
  ],
  "features": "Exquisitely designed jhumkas featuring a cascading floral motif. The top portion showcases a delicate cluster of pink zircons and shimmering CZ stones, leading to a grand chandelier design. Meticulously set stones in a pavé setting enhance the overall sparkle. The design is inspired by the traditional temple jewelry of South India, updated with a modern sensibility.",
  "colors": [
    "Dominant pink hues from the Zircon stones",
    "complemented by the warm golden tones of the 22K gold plated alloy and the sparkling brilliance of the clear CZ stones. A perfect blend of feminine pink and classic gold."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festive celebrations like Sankranthi",
    "Diwali",
    "and Ugadi",
    "or to add a touch of glamour to any special occasion. Ideal for both traditional attire like sarees and lehengas",
    "as well as contemporary ensembles."
  ],
  "description": "These Chandrika Jhumkas are a fusion of traditional South Indian design and modern aesthetics. The high-quality pink zircons offer a unique and captivating sparkle. The Hyderabadi polish ensures longevity and maintains its brilliance. The intricate design and meticulous craftsmanship make these jhumkas a timeless investment.",
  "tags": [
    "Jhumka",
    "Karnamulu",
    "Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Pink Zircon",
    "Cubic Zirconia",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Festive Jewelry",
    "Statement Earrings",
    "Chandrika",
    "Telugu Jewelry",
    "Contemporary Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-43 2_2258",
  "collection": "sjpl"
}