{
  "id": "necklaces-1503",
  "title": "Apoorva Nakshi Haaram: Emerald & Ruby Embellished Bridal Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Suvarna)",
    "High-quality Cubic Zirconia (CZ) stones",
    "Emeralds (Pachala) – Faceted",
    "Rubies (Ratnalu) - Round Cut. Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This exquisite haaram features a classic circular link design, each meticulously set with sparkling CZ stones, emeralds, and rubies in a floral pattern. The centerpiece pendant showcases intricate nakshi work detailing peacocks and floral motifs. The drop pendant has three hanging golden balls. The design reflects traditional South Indian temple jewelry motifs with a modern appeal.",
  "colors": [
    "Predominantly gold with striking green (emerald) and red (ruby) accents. The white of the CZ stones provides a brilliant contrast",
    "enhancing the overall richness."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "Bharatanatyam performances",
    "and other grand celebrations. Perfect for brides",
    "this haaram can also be worn at Seemantham ceremonies",
    "Half-Saree functions",
    "and festive occasions like Sankranti and Diwali."
  ],
  "description": "This haaram is a timeless investment, showcasing exquisite craftsmanship and cultural significance. The combination of traditional design with high-quality materials ensures both beauty and durability. The Hyderabadi polish guarantees a long-lasting shine, making it a treasured heirloom for generations to come. The use of natural gemstones (emeralds and rubies) adds significant value and symbolizes prosperity and good health.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi",
    "Emerald",
    "Ruby",
    "Pachala",
    "Ratnalu",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "22K Gold",
    "CZ",
    "Cubic Zirconia",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Seemantham",
    "Muhurtham",
    "Ethnic Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-35_2121",
  "collection": "sjpl"
}