{
  "id": "necklaces-227",
  "title": "The 'Aadrika' Antique Gold Short Haaram with Emerald Center",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Antique Hyderabadi Polish. Features high-quality round-cut Cubic Zirconia (CZ) stones and a central Emerald cabochon."
  ],
  "features": "This exquisite short haaram features a delicate floral motif chain with a central pendant showcasing intricate filigree work. The pendant is adorned with sparkling CZ stones surrounding a vibrant Emerald cabochon. The design incorporates traditional South Indian beadwork (gundlu) along the bottom edge, adding a touch of classic elegance. Antique finish to enhance the vintage appeal.",
  "colors": [
    "Antique Gold",
    "Emerald Green",
    "and Diamond White (CZ)."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "traditional South Indian ceremonies like Muhurtham",
    "Seemantham",
    "and Half-Saree functions (Langa Voni Function). Also suitable for festive occasions such as Diwali and Sankranti."
  ],
  "description": "This 'Aadrika' Haaram is a testament to Hyderabad's rich jewelry heritage. The antique gold finish, combined with the sparkling CZ stones and vibrant Emerald, creates a timeless piece that blends tradition with modern aesthetics. The craftsmanship ensures durability and lasting beauty, making it a treasured heirloom for generations. The Emerald center symbolizes prosperity and good fortune, making it an auspicious choice for significant life events.",
  "tags": [
    "Haaram",
    "Gundla Mala",
    "Necklace",
    "South Indian Jewelry",
    "Antique Gold",
    "Emerald",
    "Cubic Zirconia",
    "CZ",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Muhurtham",
    "Seemantham",
    "Langa Voni",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0307_0504",
  "collection": "diamond"
}