{
  "id": "necklaces-1119",
  "title": "Amethyst and Aquamarine Navratna Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Amethyst (oval and pear cut)",
    "Aquamarine drops",
    "Emeralds (round cut)",
    "Polki Diamonds. Features a signature Hyderabadi polish for a lasting luster."
  ],
  "features": "This exquisite haaram blends traditional South Indian elements with a contemporary aesthetic. The circular motifs are set with round cut emeralds and polki diamonds. Graduated aquamarine drops add a touch of modern elegance, while the amethyst stones (oval on top and pear-shaped below) add a regal touch. Handcrafted with intricate detailing and a focus on gemstone quality.",
  "colors": [
    "Gold",
    "Amethyst (purple)",
    "Aquamarine (light blue-green)",
    "Emerald Green",
    "and Diamond White."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "receptions",
    "engagement ceremonies (Nischitartham)",
    "or any special occasion where you want to make a statement. Equally stunning for formal gatherings or elegant celebrations."
  ],
  "description": "This haaram is a true investment piece, combining the timeless appeal of South Indian jewelry with contemporary design sensibilities. The use of high-quality gemstones and expert craftsmanship ensures durability and lasting beauty. The Navratna influence brings good fortune and prosperity, making it a meaningful and cherished heirloom. The Hyderabadi polish ensures a rich, lasting glow.",
  "tags": [
    "Haaram",
    "Necklace",
    "Amethyst",
    "Aquamarine",
    "Emerald",
    "Polki Diamond",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Navratna",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Wedding Jewelry",
    "Vivaha Mahotsavam",
    "Nischitartham",
    "Engagement Jewelry",
    "Indian Jewelry",
    "Telugu Jewelry"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0015_2533",
  "collection": "radhe"
}