{
  "id": "necklaces-813",
  "title": "Emerald Brilliance Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "90.35 grams GH color gold",
    "7.52 carats of sparkling diamonds (167 stones)",
    "26.05 carats of vibrant emeralds (12 stones). Crafted with meticulous precision and set in a secure prong setting for enhanced brilliance and durability."
  ],
  "features": "This exquisite haaram showcases a graduated design with strategically placed emeralds interspersed amongst clusters of brilliant-cut diamonds. The emeralds are square cut, providing a geometric counterpoint to the organic arrangement of the diamond clusters, creating a mesmerizing play of light and color. Modern interpretation of a classic South Indian necklace.",
  "colors": [
    "Lustrous gold setting",
    "dazzling white diamonds",
    "and deep green emeralds. A captivating tricolor combination representing prosperity and growth."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (pendli)",
    "receptions",
    "and milestone celebrations. Also suitable for elegant evening events and modern soirees where you desire a touch of traditional grandeur."
  ],
  "description": "A harmonious blend of traditional aesthetics and contemporary design, this emerald and diamond haaram is a statement of timeless elegance. The carefully selected emeralds exude a rich, vibrant color, while the brilliant diamonds add unparalleled sparkle. Meticulously crafted for exceptional comfort and durability, this piece is an investment that will be treasured for generations.",
  "tags": [
    "Haaram",
    "Emerald",
    "Diamond",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Kanthabharanam",
    "Pelli Jewellery",
    "Emerald Necklace",
    "Diamond Necklace",
    "Contemporary Design"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-45 3_1407",
  "collection": "diamond"
}