{
  "id": "necklaces-1509",
  "title": "Emerald Radiance: Exquisite Diamond and Emerald Grand Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "brilliant-cut Diamonds (VS clarity",
    "G color)",
    "Emeralds (square cut",
    "vibrant green hue). Crafted with meticulous attention to detail and featuring a rich Hyderabadi Polish for enduring brilliance."
  ],
  "features": "This magnificent haaram showcases a mesmerizing arrangement of floral and geometric patterns, meticulously set with sparkling diamonds and vibrant square-cut emeralds. The openwork design allows light to dance through each gemstone, creating a dazzling spectacle. The arrangement is alternating emerald squares with floral diamond bursts surrounding emeralds. The piece is also finished with gold dotting for that extra shimmer.",
  "colors": [
    "Primarily gold",
    "white (diamonds)",
    "and vibrant green (emeralds). The traditional color combination evokes feelings of prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (muhurtham)",
    "receptions",
    "and milestone celebrations. Its exquisite design makes it a cherished heirloom for generations to come. Suitable for Seemantham or half-saree functions as well."
  ],
  "description": "This Grand Haaram is a testament to the skill and artistry of our master craftsmen. The combination of high-quality diamonds and vibrant emeralds, coupled with the rich Hyderabadi Polish, creates a piece that is both timeless and breathtaking. It symbolizes prosperity, love, and commitment, making it a treasured addition to any bridal trousseau. The flexible design and light weight construction makes it comfortable to wear for longer periods. Diamonds and Emeralds also known as Panna and Vajra, have astrological significance and are traditionally known to promote prosperity, harmony, and longevity.",
  "tags": [
    "Haaram",
    "Bridal Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Grand Haar",
    "Vajra",
    "Panna",
    "Gold Necklace",
    "Indian Jewelry",
    "Tradition",
    "Tradition",
    "Wedding",
    "Diamonds",
    "Emeralds"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-37_2127",
  "collection": "sjpl"
}