{
  "id": "necklaces-1246",
  "title": "Emerald and Diamond Floral Necklace - A Contemporary Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold. Features Pear-Shaped Emeralds of exceptional clarity and vibrant green hue",
    "accented with brilliant-cut Diamonds. Total Emerald Weight: 8.19 carats (10 stones). Total Diamond weight: 6.0 carats (63 brilliant cut stones). Hyderabadi Polish for lasting shine."
  ],
  "features": "A modern take on the traditional Haaram. This necklace showcases a delicate floral design, with meticulously prong-set pear-shaped emeralds surrounded by intricate diamond detailing. The graduated design creates a flattering drape. The pendant design incorporates floral motifs and pear drop emeralds for a touch of tradition.",
  "colors": [
    "Lustrous White Gold",
    "vibrant Emerald Green",
    "and dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "receptions",
    "anniversary celebrations",
    "and high-end social gatherings. Also suitable for adding a touch of elegance to contemporary attire."
  ],
  "description": "This exceptional piece combines the timeless allure of emeralds and diamonds with a modern design, making it a versatile addition to any jewelry collection. The brilliant sparkle and vibrant color will turn heads. A statement of refined taste and timeless elegance, this necklace is designed to be cherished for generations. The diamonds are of high clarity and brilliance, ensuring maximum sparkle.",
  "tags": [
    "Emerald Necklace",
    "Diamond Necklace",
    "White Gold Jewelry",
    "Haaram",
    "Hyderabadi Jewelry",
    "Contemporary Indian Jewelry",
    "Bridal Necklace",
    "Wedding Jewelry",
    "Emeralds",
    "Diamonds",
    "Floral Necklace",
    "Modern Haaram",
    "Indian Wedding",
    "Engagement",
    "Anniversary"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-45-08_1840",
  "collection": "sjpl"
}