{
  "id": "necklaces-1466",
  "title": "Emerald Radiance Haaram - A Timeless Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Brilliant Cut Diamonds (VVS Clarity)",
    "Zambian Emeralds",
    "Burmese Ruby accent stone. Crafted with Hyderabadi Kundan setting techniques."
  ],
  "features": "This exquisite Haaram features a cascading design, meticulously studded with brilliant-cut diamonds. The central pendant boasts a captivating Zambian Emerald, surrounded by a halo of diamonds in a classic Kundan setting. Delicate emerald and diamond drops enhance the necklace's graceful movement. A single Burmese Ruby provides a striking contrast at the center flower piece.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Emerald Green",
    "Ruby Red."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions (రిసెప్షన్)",
    "grand celebrations",
    "and milestone events. Its timeless elegance makes it suitable for both traditional Telugu ceremonies like Muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "and modern sophisticated events."
  ],
  "description": "This Emerald Radiance Haaram seamlessly blends traditional South Indian artistry with contemporary design sensibilities. The brilliance of the diamonds and the rich color of the Zambian Emerald create a captivating focal point. This heirloom-quality piece is crafted with utmost precision, ensuring lasting beauty and value. Its versatile design allows it to be paired with both traditional and modern attire.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "కంఠాభరణం",
    "ముహూర్తం",
    "సీమంతం",
    "రిసెప్షన్",
    "22K Gold"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-56 2_2084",
  "collection": "sjpl"
}