{
  "id": "necklaces-132",
  "title": "The 'Meghna' Nakshi Haaram: A Pastel Gemstone Symphony",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Polki Diamonds (Uncut Diamonds)",
    "Rose Quartz",
    "Green Amethyst",
    "Tanzanite",
    "Freshwater Pearls. Gold is Hallmarked for purity."
  ],
  "features": "This Haaram features a stunning arrangement of Polki diamonds in a floral and geometric pattern. The center boasts a large pear-shaped rose quartz pendant, accented by a oval tanzanite stone above. Delicate strands of green amethyst, rose quartz drops, and freshwater pearls cascade from the main body, offering movement and a touch of whimsy. The Hyderabadi polish lends a rich, antique sheen to the gold, enhancing the vintage charm. The reverse of the piece features detailed filigree work typical of South Indian craftsmanship.",
  "colors": [
    "Antique Gold",
    "Light Pink (Rose Quartz)",
    "Light Green (Green Amethyst)",
    "Deep Blue (Tanzanite)",
    "White (Polki Diamonds)",
    "Cream (Freshwater Pearls). This pastel palette is a modern interpretation of traditional color combinations."
  ],
  "occasions": [
    "Perfect for a Sangeet",
    "Reception",
    "or any modern celebration where you want to blend traditional elegance with contemporary flair. Also suitable for a Seemantham or half-saree function",
    "especially for someone seeking a less traditional color palette."
  ],
  "description": "This piece is a unique blend of traditional South Indian craftsmanship and modern design sensibilities. The use of Polki diamonds lends an authentic, regal touch, while the pastel gemstones offer a refreshing and contemporary aesthetic. The Hyderabadi polish ensures a lasting luster and enhances the vintage appeal. A true heirloom piece, this necklace is a statement of refined taste and enduring style.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamonds",
    "Rose Quartz",
    "Green Amethyst",
    "Tanzanite",
    "Freshwater Pearls",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "Contemporary Jewelry",
    "Nakshi Work",
    "Antique Finish",
    "Heirlooom Jewelry",
    "Muhurtham",
    "Seemantham",
    "Sangeet",
    "Reception",
    "పెళ్ళి నగలు",
    "నగలు",
    "హారము"
  ],
  "original_id": "diamond_jewellery_DPNK8-1790_0365",
  "collection": "diamond"
}