{
  "id": "necklaces-1413",
  "title": "Exquisite Navratna Kundan Haaram with Sky Blue Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Kundan stones",
    "Emeralds (Panna)",
    "Pink Sapphires",
    "Sky Blue Chalcedony drops. Features intricate Hyderabadi Polish for a radiant luster."
  ],
  "features": "This magnificent Haaram showcases traditional Kundan craftsmanship with an elaborate floral design. The setting is meticulously handcrafted, creating a seamless blend of stones and gold. Emeralds are strategically placed for auspiciousness (Navratna concept), complemented by delicate pink sapphire floral accents and smooth sky-blue chalcedony drops that add a touch of modern elegance. The central pendant features a cascading design with matching gemstones.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Sky Blue",
    "Pink. The combination creates a vibrant and auspicious palette",
    "reflecting traditional South Indian aesthetics."
  ],
  "occasions": [
    "Perfect for Bridal wear",
    "Muhurtham",
    "Weddings",
    "Receptions",
    "Seemantham (baby shower)",
    "and other grand celebrations. It's a statement piece ideal for making a lasting impression at any significant event."
  ],
  "description": "This Haaram is a harmonious fusion of traditional craftsmanship and contemporary design. The Kundan setting, coupled with the auspicious Navratna arrangement, makes it a timeless heirloom piece. The high-quality gemstones and expert Hyderabadi polish ensure lasting beauty and value. The combination of vibrant colors and intricate details makes it a true work of art.",
  "tags": [
    "Haaram",
    "Kundan",
    "Navratna",
    "Bridal Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Emerald",
    "Panna",
    "Pink Sapphire",
    "Chalcedony",
    "Hyderabad",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "कंఠహారం",
    "Gold Necklace",
    "22K Gold",
    "Indian Wedding"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-22 3_2031",
  "collection": "sjpl"
}