{
  "id": "necklaces-091",
  "title": "Heirloom Pink Tourmaline and Emerald Pendant with Polki Diamonds and Pearls",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold",
    "Natural Pink Tourmaline (cushion cut)",
    "Natural Emerald (round cabochon)",
    "Polki Diamonds (uncut diamonds)",
    "Freshwater Pearls. Features a Hyderabadi Antique Polish for a timeless look."
  ],
  "features": "This exquisite pendant showcases the artistry of Kundan craftsmanship. The focal point is the impressive emerald cabochon encircled by intricately set Polki diamonds, reflecting the traditional style of South Indian jewelry. The cascading arrangement of pearls and faceted pink tourmaline gems adds a touch of modern elegance. The floral-inspired Polki setting exudes regal charm.",
  "colors": [
    "Gold",
    "Pink Tourmaline",
    "Green Emerald",
    "White Pearls",
    "and White Polki Diamonds. The antique gold finish complements the vibrant gemstone colors",
    "creating a rich and captivating palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "special celebrations",
    "or as a statement piece for formal events. This pendant adds a touch of heritage and sophistication to any ensemble."
  ],
  "description": "This is an exceptional piece of jewelry that blends traditional Kundan artistry with modern aesthetics. The use of high-quality gemstones and meticulous craftsmanship makes it a valuable heirloom. The Polki diamonds add a unique sparkle, while the antique finish provides a timeless appeal. It is a symbol of South Indian heritage and refined elegance.",
  "tags": [
    "Pendant",
    "Locket",
    "Kundan",
    "Polki",
    "Emerald",
    "Tourmaline",
    "Pearls",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Antique Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Haar",
    "Gottapu Pusalu",
    "Kempu",
    "Pachalu",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_DPER8-1804_0303",
  "collection": "diamond"
}