{
  "id": "necklaces-433",
  "title": "Heera Jadau Haaram with Emerald and Ruby Accents - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base with Hyderabadi Polish",
    "meticulously set with brilliant-cut Diamonds (13.91 Dwt)",
    "vibrant Rubies (6.61 Dwt) and Emeralds (8.02 Dwt). Adorned with 16 South Sea Pearls (52.05 Moti) for a touch of elegance. Locket includes Diamond (2.89 Dwt)",
    "Ruby (1.56 Dwt)",
    "and Emerald (1.08 Dwt)."
  ],
  "features": "A stunning three-layered Haaram showcasing intricate Jadau craftsmanship, a hallmark of Hyderabad's rich jewelry tradition. The necklace features delicate floral motifs encrusted with diamonds, complemented by pear-shaped Emeralds and Rubies. The lower layer is embellished with lustrous South Sea pearl drops. The elaborate pendant continues the floral theme with a central Emerald, surrounded by diamonds and finished with dangling pearls.",
  "colors": [
    "Predominantly gold with a striking contrast of white diamonds",
    "deep red rubies",
    "and lush green emeralds. The creamy white pearls offer a soft and graceful finish."
  ],
  "occasions": [
    "Perfect for bridal wear (పెళ్లి)",
    "significant family functions",
    "temple visits (గుడి)",
    "and grand celebrations. Ideal for Muhurtham",
    "Seemantham",
    "and half-saree functions",
    "this Haaram will be the centerpiece of your ensemble."
  ],
  "description": "This Heera Jadau Haaram is a testament to exquisite craftsmanship and timeless elegance. The meticulous detailing, combined with high-quality gemstones, makes it a valuable heirloom. Its traditional design, enhanced with modern sensibilities, ensures it remains a cherished piece for generations to come. The blend of diamonds, rubies, emeralds, and pearls signifies prosperity, love, and wisdom – a meaningful addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Jadau Jewelry",
    "Diamond Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Heera",
    "Kanthabharanam",
    "Moti",
    "Jadau",
    "Pelli",
    "Seemantham",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-10_0874",
  "collection": "diamond"
}