{
  "id": "earrings-351",
  "title": "Polki & Pearl Chandbali Earrings - Traditional Andhra Nathulu Design",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features meticulously set Polki diamonds (uncut diamonds) and lustrous South Sea Pearls. Enhanced with smaller pearl accents."
  ],
  "features": "These Chandbali style earrings showcase a classic lotus motif rendered with shimmering Polki diamonds. The pear-shaped Polki stones are carefully chosen for their unique clarity and fire. Three genuine South Sea Pearls dangle gracefully, adding a touch of traditional elegance. Intricate gold detailing completes the look, showcasing traditional Hyderabadi craftsmanship.",
  "colors": [
    "Predominantly gold with a contrasting shimmer from the Polki diamonds (ranging from white to subtle grey tones). The pearls offer a creamy white luster",
    "creating a soft and elegant palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "traditional Telugu ceremonies like Seemantham and Pelli Kuthuru function",
    "or adding a touch of South Indian heritage to any special event. These earrings are equally suitable for elegant evening wear."
  ],
  "description": "These earrings are a stunning blend of traditional South Indian design and fine craftsmanship. The use of Polki diamonds offers a timeless elegance and a connection to royal heritage. The lustrous South Sea Pearls add a touch of sophistication and femininity. Crafted with 22K gold and given the special Hyderabadi polish for durability and a rich, lasting sheen, these earrings are a valuable investment and a cherished heirloom.",
  "tags": [
    "Earrings",
    "Chandbali",
    "Nathulu",
    "Polki",
    "Uncut Diamonds",
    "South Sea Pearls",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Andhra Jewelry",
    "Pelli Kuthuru",
    "Seemantham",
    "Wedding Gift",
    "Bride",
    "Devatha Mukhakamalam"
  ],
  "original_id": "diamond_jewellery_PKER8-1143_1422",
  "collection": "diamond"
}