{
  "id": "necklaces-167",
  "title": "Rajputi Chandrika Haaram: Ruby and Polki Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "High-Quality Polki Diamonds (Uncut Diamonds)",
    "Pear-shaped Rubies with Excellent Color Saturation",
    "South Sea Pearls. Gold weight approx 150g. Diamond weight approx 30cts. All materials are ethically sourced."
  ],
  "features": "This exquisite Chandrika Haaram showcases a breathtaking array of Polki diamonds set in a Kundan style, meticulously handcrafted by skilled artisans from Hyderabad. The necklace features a floral-motif choker style neckline, followed by multiple cascading pendants of teardrop rubies surrounded by Polki diamonds. Each pendant is adorned with delicate clusters of South Sea pearls, adding a touch of classic elegance. The piece is inspired by Rajputi jewelry designs, with a modern touch. The 'Jadau' technique is used in the setting, giving the piece an antique and royal feel.",
  "colors": [
    "Predominantly gold and white (from Polki diamonds)",
    "with vibrant Ruby red accents and the soft luster of South Sea Pearls."
  ],
  "occasions": [
    "Perfect for grand celebrations such as weddings (Vivaham)",
    "receptions",
    "and other special occasions like Seemantham (Baby Shower)",
    "and Half-Saree function. It is also a statement piece for upscale evening galas and cultural events."
  ],
  "description": "This Chandrika Haaram is a true testament to the rich heritage of Hyderabadi craftsmanship. The combination of Polki diamonds, vibrant rubies, and lustrous pearls creates a mesmerizing effect that will make you the center of attention. Its timeless design ensures that it will be a cherished heirloom for generations to come. The intricate details and meticulous craftsmanship make it a valuable investment as well as a stunning piece of jewelry. The Hyderabadi polish provides superior luster and durability.",
  "tags": [
    "Haaram",
    "Chandrika Haaram",
    "Necklace",
    "Polki Diamonds",
    "Kundan",
    "Jadau",
    "Ruby",
    "South Sea Pearls",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Heritage Jewelry",
    "కంఠహారము",
    "Vivaham",
    "Seemantham",
    "Half-Saree",
    "muhurtham"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0006_0415",
  "collection": "diamond"
}