{
  "id": "necklaces-057",
  "title": "Exquisite Diamond Kasu Addigai Pendant - Modern Twist on Tradition",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "brilliant-cut diamonds (SI clarity",
    "G-H color). Crafted with meticulous attention to detail",
    "featuring a delicate Hyderabadi polish for a lasting luster."
  ],
  "features": "This captivating pendant features a modern take on the classic kasu design. The intricate gold filigree work is adorned with sparkling diamonds, creating a mesmerizing effect. The gold ball drops (gundla dandalu) add a touch of traditional South Indian charm to this contemporary piece. The setting is expertly crafted for maximum light reflection, enhancing the brilliance of the diamonds.",
  "colors": [
    "Predominantly yellow gold with brilliant white diamonds. The warm golden hue beautifully complements the dazzling sparkle of the diamonds."
  ],
  "occasions": [
    "Perfect for engagements",
    "weddings (pellillu)",
    "receptions",
    "and special occasions. This addigai pendant can also be worn for modern events to add a touch of South Indian elegance to your attire."
  ],
  "description": "This diamond kasu addigai pendant is a perfect fusion of traditional South Indian design and modern elegance. The high-quality diamonds and meticulous craftsmanship ensure that this piece will be treasured for generations. Its versatile design makes it suitable for both traditional and contemporary outfits. The Hyderabadi polish guarantees a lasting shine and durability.",
  "tags": [
    "Addigai",
    "Pendant",
    "Diamond Jewelry",
    "Kasu",
    "Gundla Dandalu",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Pellillu",
    "Fine Jewelry",
    "22K Gold",
    "Tradition Jewelry",
    "Indian Fashion",
    "Kundan",
    "Polki"
  ],
  "original_id": "diamond_jewellery_83407ae3-f9c5-46f6-bf13-d820c4680a90_0149",
  "collection": "diamond"
}