{
  "id": "necklaces-905",
  "title": "Raasi Haaram: Diamond and Emerald Celestial Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features brilliant-cut diamonds of VS clarity",
    "oval-cut emeralds of vivid green hue",
    "and a central ruby cabochon. The gold is ethically sourced and hallmarked for purity."
  ],
  "features": "This exquisite Haaram showcases a modern take on traditional South Indian designs. The intricate floral motif lattice work embedded with diamonds is the signature feature. The emeralds, each framed by gold and diamond petals, provide a vibrant contrast. A single ruby adorns the central piece, adding a touch of auspiciousness (Raasi). The necklace boasts a flexible design that comfortably adorns the neckline.",
  "colors": [
    "The necklace features a rich gold hue complemented by the fiery red of the ruby and the lush green of the emeralds. The diamonds add a layer of white sparkle to the setting."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Vivahaalu)",
    "engagements (Nischayalu)",
    "festivals (Pandugalu)",
    "and formal events. It is an ideal statement piece for a modern bride seeking to blend tradition with contemporary style."
  ],
  "description": "This 'Raasi Haaram' is a masterpiece that blends the timeless elegance of South Indian jewelry with modern design principles. The piece’s intricate detailing, the use of high-quality gemstones, and the Hyderabadi craftsmanship make it a unique and valuable investment. The symbolism of the gemstones adds a touch of spirituality and auspiciousness. Its exceptional craftsmanship ensures lasting beauty and durability, a family heirloom in the making. Crafted with high quality Emeralds, diamonds and ruby cabochon.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Temple Jewelry",
    "VS Clarity Diamonds",
    "Raasi",
    "Nischayalu",
    "Vivahaalu",
    "Pandugalu"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0299_2366",
  "collection": "necklace"
}