{
  "id": "necklaces-952",
  "title": "Vaibhavam Diamond & Emerald Lakshmi Kasu Haaram - Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously crafted with a 'Hyderabadi Polish' for a lasting luster. Adorned with dazzling",
    "meticulously cut diamonds (SI clarity",
    "G-H color grade). Features vibrant Emeralds (natural",
    "round cut) and Rubies (natural",
    "round cut) for a touch of classic contrast. Delicate freshwater pearls dangle gracefully."
  ],
  "features": "This exquisite Kasu Haaram features a tiered design, creating a statement of elegance. The central pendant showcases a Lakshmi motif intricately detailed with diamonds, symbolizing prosperity and abundance. The necklace is designed with multiple rows of 'Kasu' (coins), embellished with diamonds. Delicate filigree work is present throughout the design. The pendant is accentuated with subtle ruby and emerald accents, typical of South Indian temple jewelry.",
  "colors": [
    "Primarily gold with a brilliant diamond sparkle. Emeralds provide a lush green contrast",
    "while rubies add a vibrant red accent. The freshwater pearls introduce a soft",
    "creamy white hue."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "Seemantham (baby shower)",
    "and other grand celebrations. Its classic design makes it suitable for traditional ceremonies",
    "half-saree functions (Voni Function)",
    "and formal events where you want to make a regal statement. Can also be worn as a statement piece at high-end social gatherings."
  ],
  "description": "This Lakshmi Kasu Haaram is a true heirloom piece, blending traditional South Indian design with modern craftsmanship. The use of high-quality diamonds and precious gemstones ensures lasting value and brilliance. The intricate detailing and Hyderabadi Polish reflect the superior artistry of our master jewelers. The Lakshmi motif bestows blessings of prosperity and good fortune, making it an auspicious and meaningful gift.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Lakshmi Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "Pearls",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Voni Function",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Statement Necklace"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0346_2413",
  "collection": "necklace"
}