{
  "id": "necklaces-919",
  "title": "Maharani Kempu Haar: Diamond & Coral Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Panchaloha finish)",
    "Natural Coral beads",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Ruby and Emerald accents. Crafted with Hyderabadi Kundan setting techniques."
  ],
  "features": "This magnificent Haaram showcases a fusion of traditional and contemporary design. The striking semi-circular diamond pave pattern is accented with vibrant coral beads, creating a regal statement. A stunning floral motif at the center, set with rubies, acts as a focal point. The elaborate paisley-shaped pendant below boasts an intricate diamond-studded floral pattern, complemented by delicate gold ball drops (gundla dandalu). The Kundan setting allows each diamond's brilliance to truly shine.",
  "colors": [
    "Gold",
    "Red (Coral & Ruby)",
    "Green (Emerald)",
    "and Dazzling White (Diamonds). The contrast creates a rich and opulent color palette",
    "characteristic of South Indian Bridal Jewelry."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivahaalu)",
    "receptions",
    "Seemantham (baby shower)",
    "or any special occasion where you want to make a lasting impression. An excellent choice for Bharatanatyam performances or cultural events."
  ],
  "description": "This Haaram is a unique blend of tradition and modern elegance. The impeccable craftsmanship, combined with the high-quality diamonds and genuine coral, makes it a valuable heirloom piece. The Panchaloha finish gives it a rich, antique look, while the contemporary design ensures it remains a timeless classic. Its durability and enduring design will last for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Kundan Jewelry",
    "Coral Necklace",
    "Diamond Necklace",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Panchaloha",
    "Gundla Dandalu",
    "Vivahaalu",
    "Seemantham",
    "Kempu Haar",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Grand Necklace"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0313_2380",
  "collection": "necklace"
}