{
  "id": "earrings-669",
  "title": "Emerald Cascade Diamond Jhumkas - Exclusive Design",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Platinum setting",
    "featuring meticulously hand-set Emerald (estimated 4 carats",
    "Zambian origin",
    "vibrant green",
    "emerald cut",
    "VS clarity) and Brilliant cut Diamonds (estimated 3 carats",
    "EF color",
    "VVS clarity)."
  ],
  "features": "A captivating cascade design, these earrings feature a floral-inspired top graduating into a linear diamond-studded framework. The piece culminates in a dramatic teardrop shape encompassing a square Emerald. The intricate diamond setting enhances the light reflection, maximizing the sparkle. The design is a perfect blend of classic elegance with contemporary styling, offering a modern twist on the traditional jhumka.",
  "colors": [
    "Brilliant white (platinum and diamonds) and lush green (Emerald)."
  ],
  "occasions": [
    "Perfect for upscale parties",
    "receptions",
    "and evening galas. Also suitable for modern Indian wedding functions such as Sangeet or Cocktail parties."
  ],
  "description": "These earrings are a statement piece that blend modern design with the timeless appeal of diamonds and emeralds. The platinum setting ensures durability and showcases the brilliance of the stones. The emerald's vibrant green is a symbol of prosperity and good fortune, making this an ideal gift for yourself or a loved one. The exquisite craftsmanship makes it a valuable addition to any fine jewelry collection.",
  "tags": [
    "Emerald Earrings",
    "Diamond Earrings",
    "Platinum Jewelry",
    "Jhumka",
    "Dangle Earrings",
    "Contemporary Jewelry",
    "Party Wear",
    "Statement Earrings",
    "Green Emerald",
    "White Diamonds",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Telugu Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-42_2257",
  "collection": "sjpl"
}