{
  "id": "necklaces-198",
  "title": "Raani Haar: The Indradhanush Necklace - A Symphony of Colors and Craftsmanship",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold accents",
    "Zambian Emerald (center)",
    "Polki Diamonds (uncut diamonds)",
    "Freshwater Pearls",
    "Ruby accents",
    "Semi-Precious Gemstones (Amethyst",
    "Rose Quartz",
    "and other mixed hues)",
    "Glass Beads. Finished with a Hyderabadi Polish for enduring luster."
  ],
  "features": "This Raani Haar reimagines traditional grandeur with a contemporary twist. The design features cascading strands of meticulously strung glass beads in a harmonious blend of blues and pinks, creating an 'Indradhanush' (rainbow) effect. The central motif boasts a captivating Zambian Emerald surrounded by Polki diamonds and lustrous freshwater pearls, intricately designed like a blooming flower. Delicate gold accents with enamel work (Minakari) enhance the floral and peacock (Mayura) motifs. The tassels are adorned with semi-precious gemstones in tear-drop shapes, finished with gold caps.",
  "colors": [
    "Dominant colors are Blue and Pink",
    "accented by the lush green of the Emerald",
    "the brilliance of the Polki diamonds",
    "the creaminess of the Pearls",
    "and the colorful gemstones in hues of purple",
    "red and green."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "grand celebrations",
    "and cultural events. This statement piece adds a touch of regal elegance to any traditional or contemporary attire. Suitable for Muhurtham ceremonies and other auspicious occasions."
  ],
  "description": "A unique fusion of traditional Raani Haar design and modern aesthetics. The stunning gemstone combination, meticulous craftsmanship, and vibrant color palette make it a true statement piece. It is a modern heirloon. This necklace is not just jewelry; it is a piece of art that embodies the rich cultural heritage of Hyderabad and South India.",
  "tags": [
    "Raani Haar",
    "Necklace",
    "Emerald",
    "Polki Diamonds",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Hyderabadi Jewelry",
    "Designer Jewelry",
    "Contemporary Jewelry",
    "Vivaha",
    "Muhurtham",
    "Statement Necklace",
    "Indradhanush",
    "Minakari",
    "Mayura",
    "haar",
    "gemstones",
    "beadwork"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0045_0453",
  "collection": "diamond"
}