{
  "id": "waistbands-040",
  "title": "Diamond & Emerald Vaddanam - The 'Indrani' Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "Base metal in yellow gold finish. Features 1116 brilliant-cut diamonds (21.84 carats). Adorned with 6 oval-cut natural emeralds (6.82 carats) and 6 natural rubies (9.89 carats)."
  ],
  "features": "This exquisite Vaddanam showcases a traditional South Indian design with intricate floral and peacock motifs set within circular frames. The diamonds are pavé-set to maximize sparkle, creating a dazzling effect. The design incorporates traditional elements, and the entire piece is finished with delicate gold bead drops (gundu poppu design) for added elegance. The central motif features a stylized peacock, a symbol of grace and beauty.",
  "colors": [
    "Predominantly white (diamonds) and yellow (gold finish)",
    "with vibrant green (emeralds) and red (rubies) accents."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "bridal wear",
    "Seemantham (baby shower)",
    "half-saree function (Voni Function)",
    "and other grand celebrations. Also suitable for upscale social events where a statement piece is desired."
  ],
  "description": "This Vaddanam is a masterpiece of craftsmanship, blending traditional South Indian aesthetics with contemporary diamond setting techniques. The high-quality diamonds and vibrant emeralds and rubies create a luxurious and eye-catching piece. The design, with its peacock motif and traditional elements, embodies the rich cultural heritage of Andhra Pradesh and Telangana. It's not just a piece of jewelry; it's an heirloom, to be cherished for generations.",
  "tags": [
    "Vaddanam",
    "Oddanam",
    "Waist Belt",
    "Diamond Belt",
    "Emeralds",
    "Rubies",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "peacock",
    "Gundu Poppu",
    "Vivaha Mahotsavam",
    "Seemantham",
    "Voni Function"
  ],
  "original_id": "sjpl_PHOTO-2024-05-24-13-54-27 3_2194",
  "collection": "sjpl"
}