{
  "id": "necklaces-1271",
  "title": "Elegant Diamond Vanki Pendant - Addigai Charm",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18K Rose Gold",
    "meticulously set with brilliant-cut White Diamonds. The gold features a lustrous",
    "long-lasting Hyderabad Polish for enhanced shine and durability. Diamond clarity: VS-SI",
    "Color: G-H"
  ],
  "features": "This exquisite pendant features a Vanki-inspired design, a traditional South Indian motif symbolizing prosperity and protection. The design incorporates floral and teardrop elements, all pavé-set with sparkling diamonds for maximum brilliance. The intricate openwork design adds a touch of lightness and modern appeal. It is designed as a charm for Addigai.",
  "colors": [
    "Rose Gold and Sparkling White Diamonds",
    "offering a warm and luxurious contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and special occasions. Also suitable for modern celebrations like anniversaries",
    "parties",
    "and formal events. Can be worn with traditional silk sarees or contemporary outfits."
  ],
  "description": "This Diamond Vanki Pendant is a stunning blend of traditional South Indian design and modern elegance. The exquisite craftsmanship, high-quality diamonds, and durable Hyderabad Polish make it a timeless piece. It's not just jewelry; it's a symbol of heritage, prosperity, and style. A versatile piece that adds a touch of sophistication to any ensemble. Great value for money.",
  "tags": [
    "Vanki",
    "Addigai",
    "Pendant",
    "Diamond Jewelry",
    "Rose Gold",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Engagement Jewelry",
    "Pavé Setting",
    "Telugu Jewelry",
    "Andhra Jewelry",
    "Subhamuhurtham"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-00 2_1868",
  "collection": "sjpl"
}