{
  "id": "necklaces-381",
  "title": "Polki & Ruby Guluband Haaram - A Timeless Fusion of Tradition and Modernity",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Uncut Polki Diamonds (Superior Quality",
    "VVS Clarity)",
    "Natural Rubies (Oval Cut",
    "Pigeon Blood Red)",
    "Hyderabadi Polish"
  ],
  "features": "A stunning Guluband-style Haaram featuring a geometric arrangement of Polki diamonds set in open settings to maximize brilliance. Adorned with vibrant ruby floral motifs, each centered with a smaller diamond. Delicate diamond-encrusted border frames each Polki and ruby element. The reverse showcases intricate filigree work. Handcrafted by skilled artisans using traditional Telugu jewelry techniques.",
  "colors": [
    "Gold (warm yellow)",
    "Diamond (white/clear)",
    "Ruby (pigeon blood red)"
  ],
  "occasions": [
    "Perfect for modern brides",
    "receptions",
    "Sangeet ceremonies",
    "Cocktail parties",
    "Anniversary celebrations",
    "and high-end social gatherings. A beautiful statement piece for Seemantham or half-saree functions when paired with traditional attire."
  ],
  "description": "This exquisite Haaram seamlessly blends the timeless appeal of Polki diamonds with the vibrancy of rubies. The contemporary design is a versatile choice for both traditional and modern outfits. Crafted with exceptional attention to detail, ensuring heirloom quality and lasting beauty. The Hyderabadi polish enhances the gold's luster, adding to its regal charm. A unique and rare piece that will undoubtedly become a cherished possession.",
  "tags": [
    "Polki Necklace",
    "Ruby Necklace",
    "Guluband Haaram",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Necklace",
    "Diamond Necklace",
    "22K Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Half-Saree Function",
    "Muhurtham",
    "Haram",
    "Kasulaperu"
  ],
  "original_id": "diamond_jewellery_IMG-20241218-WA0012_0774",
  "collection": "diamond"
}