{
  "id": "bangles-129",
  "title": "Aditya's Allure: Floral Emerald & Ruby Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "Natural Emerald (cabochon)",
    "Natural Rubies",
    "American Diamonds"
  ],
  "features": "This bangle showcases a beautiful floral motif at its center, embellished with a captivating cabochon-cut emerald encircled by natural rubies. The intricate filigree detailing in the gold adds a touch of regality, complemented by the sparkle of American Diamonds set throughout the design. The gold possesses a rich, Hyderabadi polish, emphasizing the piece's heritage.",
  "colors": [
    "The piece features a vibrant combination of gold",
    "deep green (emerald)",
    "rich red (rubies)",
    "and the dazzling white of the American Diamonds",
    "which are traditional and auspicious colors in South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festivals (Ugadi",
    "Sankranthi)",
    "and special occasions such as Seemantham ceremonies. Its elegant design also makes it suitable for contemporary celebrations and formal events."
  ],
  "description": "This bangle seamlessly blends traditional craftsmanship with a modern aesthetic. The use of natural emerald and rubies makes it a timeless piece, rich in symbolism and cultural significance. The Hyderabadi polish enhances the gold's luster, ensuring its brilliance for generations. The secure setting of the gemstones provides durability and peace of mind.",
  "tags": [
    "Bangle",
    "Kada",
    "Emerald",
    "Ruby",
    "American Diamond",
    "Gold",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Vivaha",
    "Seemantham",
    "Ugadi",
    "Sankranthi",
    "Floral Design",
    "Filigree",
    "Hyderabadi Polish",
    "Pachala",
    "Bangaram"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0294_0491",
  "collection": "diamond"
}