{
  "id": "necklaces-1306",
  "title": "Diamond Vanki Necklace Pendant: A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace Pendant",
  "materials": [
    "18K Yellow Gold. Setting: Pave setting. Adorned with ethically sourced brilliant-cut diamonds. Carat weight: Approximate total diamond weight of 1.5 carats. Clarity: VS. Color: GH. Features a Hyderabadi Polish for superior luster and durability."
  ],
  "features": "This exquisitely crafted vanki (armlet) design pendant is meticulously set with sparkling diamonds. The design draws inspiration from traditional South Indian armlets but modernized for versatile wear as a pendant. Features a floral motif at the top and cascading teardrop-shaped elements. The pave setting ensures maximum brilliance, creating a dazzling display of light and sparkle. The intricate filigree detailing in the gold adds depth and texture to the design.",
  "colors": [
    "Primary Color: Yellow Gold. Gemstone Color: White (Diamonds)."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "anniversaries",
    "and special occasions. Equally suitable for formal gatherings and festive celebrations. Can be worn as a statement piece for parties."
  ],
  "description": "A stunning blend of tradition and modernity. The vanki design is culturally significant, symbolizing prosperity and good fortune. The high-quality diamonds and expert craftsmanship ensure that this piece is a timeless investment. Its versatility allows you to wear it with both traditional and contemporary outfits, making it a valuable addition to any jewelry collection.",
  "tags": [
    "Diamond Pendant",
    "Vanki Pendant",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "Diamond Necklace",
    "Telugu Jewelry",
    "Armlet Design Pendant",
    "Modern Indian Jewelry",
    "Indian Diamond Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-35_1904",
  "collection": "sjpl"
}