{
  "id": "earrings-027",
  "title": "Navaratna Chakra Studs - A Kaleidoscope of Auspiciousness",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Swarna)",
    "Natural Navaratna gemstones (Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye) meticulously inlaid with a surround of brilliant-cut Diamonds. Hyderabadi polish enhances the gold's radiant luster."
  ],
  "features": "Circular Chakra design symbolizing completeness and auspiciousness. The Navaratna gemstones are arranged in a traditional layout, each representing a celestial body and its associated power. Delicate diamond accents highlight the vibrancy of the gemstones. Each stone is precisely set in a closed setting, ensuring durability and longevity. Intricate open work allows light to dance behind the gemstones enhancing their natural brilliance.",
  "colors": [
    "Predominantly gold with a vibrant spectrum of gemstone colors – deep red (Ruby)",
    "pearly white (Pearl)",
    "fiery red-orange (Coral)",
    "lush green (Emerald)",
    "sunny yellow (Yellow Sapphire)",
    "dazzling white (Diamond)",
    "deep blue (Blue Sapphire)",
    "honey brown (Hessonite)",
    "and iridescent gray-green (Cat's Eye)."
  ],
  "occasions": [
    "Ideal for daily wear",
    "festive celebrations",
    "auspicious ceremonies",
    "and cultural events. Perfect for gifting at weddings",
    "anniversaries",
    "or any special occasion where blessings and prosperity are wished."
  ],
  "description": "Embrace the power of Navaratnas with these exquisitely crafted Chakra studs. Each gemstone is carefully selected for its color, clarity, and brilliance, ensuring a piece of heirloom quality. The traditional design combined with the modern stud style makes these earrings versatile and suitable for all ages. Wearing Navaratna jewelry is believed to bring good luck, health, and prosperity.",
  "tags": [
    "Navaratna",
    "Kempulu",
    "Earrings",
    "Studs",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Telugu Jewelry",
    "Auspicious",
    "Chakra",
    "22K Gold",
    "Diamonds",
    "Hyderabad Jewelry",
    "Traditional",
    "Ethnic",
    "Fine Jewelry",
    "Subham",
    "Mangalam",
    "Digulu"
  ],
  "original_id": "diamond_jewellery_33707a22-4de6-4ba1-94fe-b2a60d1f158b_0098",
  "collection": "diamond"
}