{
  "id": "necklaces-657",
  "title": "Emerald Diamond Grandeur: Contemporary Haaram with Traditional Roots",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Ethically Sourced Diamonds (VVS Clarity",
    "Excellent Cut)",
    "Natural Emeralds (Oval Cut",
    "Deep Green). Hyderabadi Polish for a lasting luster."
  ],
  "features": "This Haaram features a contemporary design with a tiered chevron pattern adorned with pavé-set diamonds. The central pendant showcases intricate filigree work and a striking oval-cut emerald. The pendant is further enhanced with cascading diamond-studded elements and delicate gold bead accents, blending modern aesthetics with traditional South Indian grandeur.",
  "colors": [
    "Primarily a luminous combination of yellow gold and brilliant white diamonds",
    "accented by the rich green of the emeralds."
  ],
  "occasions": [
    "Perfect for modern brides",
    "grand receptions",
    "cocktail parties",
    "and contemporary Indian weddings. Its elegant design also makes it suitable for formal gatherings and special occasions."
  ],
  "description": "This statement piece seamlessly blends contemporary design with traditional South Indian artistry. The high-quality diamonds and emeralds create a dazzling display of light. The Hyderabadi polish ensures long-lasting shine and the unique design is sure to make you stand out. A true investment piece that can be treasured for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Contemporary Design",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "Bridal Haaram",
    "Reception Jewelry",
    "Kantaabharanam",
    "కంఠాభరణం",
    "Vaaddaanam",
    "Vaddanam",
    "vaddanamu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-26_1163",
  "collection": "diamond"
}