{
  "id": "necklaces-257",
  "title": "Devi Nakshi Work Temple Haaram with Precious Stones",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Swarna)",
    "Handcrafted Nakshi work",
    "studded with CZ diamonds",
    "Ruby (Ratnam)",
    "and Emerald (Panna). Finished with a traditional Hyderabadi Polish for an antique luster."
  ],
  "features": "Exquisite Temple Jewelry design featuring a central pendant with a meticulously crafted Devi figurine. The pendant showcases intricate Nakshi work, a traditional South Indian style, surrounded by sparkling CZ diamonds. Flanked by peacock motifs. Accentuated with dangling pearl beads at the base of the pendant and along the necklace chain. The chain consists of a closely linked pattern, giving it a rich and substantial feel.",
  "colors": [
    "Antique Gold (Bangaru)",
    "Emerald Green",
    "Ruby Red",
    "and Sparkling White."
  ],
  "occasions": [
    "Perfect for traditional South Indian occasions such as weddings (Vivah)",
    "Seemantham",
    "Upanayanam",
    "and temple visits. Also suitable for grand celebrations and cultural events."
  ],
  "description": "This Temple Haaram is a timeless heirloom piece, embodying the rich cultural heritage of South India. The intricate Nakshi work and depiction of Devi, the goddess, add a spiritual significance, making it an auspicious piece of jewelry. Crafted with high-quality 22K gold and precious gemstones, this Haaram is a testament to exceptional craftsmanship and durability. Its classic design ensures it will remain a cherished piece for generations to come.",
  "tags": [
    "Temple Jewelry",
    "Haaram",
    "Nakshi Work",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Golusu",
    "22K Gold",
    "CZ Diamonds",
    "Ruby",
    "Emerald",
    "Devi",
    "Hindu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "Swarna Abharanam"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0337_0534",
  "collection": "diamond"
}