{
  "id": "necklaces-493",
  "title": "Pushpa Haaram: Floral Splendor Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Rose Quartz",
    "Cubic Zirconia (CZ) Diamonds. Crafted with Hyderabadi precision."
  ],
  "features": "This exquisite necklace features a modern interpretation of the traditional Haaram, showcasing intricately designed floral motifs. Each flower is meticulously crafted with rose quartz petals surrounded by sparkling CZ diamonds, creating a captivating visual appeal. The setting is designed to maximize light reflection, enhancing the brilliance of the stones. The delicate gold chain complements the floral design, ensuring a comfortable and elegant fit.",
  "colors": [
    "Rose Gold",
    "Pink (Rose Quartz)",
    "White (CZ Diamonds)"
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "anniversaries",
    "and festive occasions like Diwali and Sankranthi. A stunning statement piece for a modern bride or any woman seeking a touch of elegance."
  ],
  "description": "This Pushpa Haaram seamlessly blends traditional South Indian aesthetics with contemporary design. The use of high-quality rose quartz and sparkling CZ diamonds offers a luxurious look without compromising on affordability. A timeless piece that will be cherished for generations. Made with meticulous craftsmanship, this necklace exudes sophistication and grace, making it a valuable addition to your jewelry collection. The Floral design is very versatile and can be paired with both traditional and modern outfits.",
  "tags": [
    "Necklace",
    "Haaram",
    "Rose Quartz",
    "CZ Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Wedding Jewelry",
    "Contemporary Jewelry",
    "Pushpa Haaram",
    "Andhra Jewellery",
    "Telangana Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-27_0973",
  "collection": "diamond"
}