{
  "id": "necklaces-1225",
  "title": "Emerald Blossom Haaram - A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (47.810 g)",
    "featuring 1129 brilliant-cut diamonds (5.36 carats) and 13 vibrant emeralds (20.13 carats). Showcasing exquisite Hyderabadi polish for a lasting luster."
  ],
  "features": "This stunning Haaram features a dual-strand design. The upper strand showcases graduated, bezel-set emeralds accented with sparkling diamonds. The lower strand culminates in a floral motif, crafted with intricate diamond pavé setting and a delicate teardrop pendant. The design blends traditional Haaram structure with a modern, floral aesthetic.",
  "colors": [
    "Lush green emeralds contrasted with the warm glow of yellow gold and the icy sparkle of white diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "receptions",
    "grand celebrations",
    "or any event where you want to make a statement. Its elegant design makes it suitable for both traditional functions like Seemantham and contemporary parties."
  ],
  "description": "This Emerald Blossom Haaram is a true testament to timeless elegance and exquisite craftsmanship. The vibrant emeralds symbolize prosperity and growth, while the diamonds add brilliance and sparkle. Its unique blend of traditional and modern design makes it a versatile piece that can be treasured for generations. The high-quality materials and meticulous craftsmanship ensure durability and lasting beauty. A true heirloom piece!",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Haaram",
    "Green",
    "Floral",
    "Vivaaha",
    "Seemantham",
    "Party Wear",
    "Ethnic Jewelry",
    "परंपरागत आभूषण",
    "పచ్చల హారం",
    "వజ్రాల హారం",
    "బంగారం"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-54_1799",
  "collection": "sjpl"
}