{
  "id": "necklaces-284",
  "title": "Exquisite Kundan Work Haaram - A Touch of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Finest Kundan setting with Ruby (మాణిక్యం)",
    "Emerald (పచ్చ)",
    "and Cubic Zirconia (CZ) stones. Features the exquisite 'Hyderabadi Polish' for a lasting luster."
  ],
  "features": "Intricate Kundan setting highlighting the floral and heart motifs, embodying traditional South Indian design. Delicate gold chain links connect each pendant. The central heart pendant adds a touch of modern romance to this classic design. The Kundan stones are meticulously placed to create a brilliant sparkle.",
  "colors": [
    "Predominantly Gold with accents of Ruby red",
    "Emerald green",
    "and dazzling white from the Cubic Zirconia stones."
  ],
  "occasions": [
    "Perfect for Weddings (వివాహము)",
    "Engagements",
    "Festivals (పండుగలు)",
    "and special occasions like Seemantham or Half-Saree Functions. Its delicate design also makes it suitable for more modern",
    "formal events."
  ],
  "description": "This Kundan Haaram is a testament to exquisite craftsmanship and timeless elegance. The high purity gold and meticulously placed Kundan stones create a piece of lasting value. The blend of traditional South Indian design with a modern touch makes it a versatile addition to any jewelry collection. It's a statement piece that exudes grace and sophistication, perfect for cherishing for generations. Symbolizes prosperity and new beginnings, making it an auspicious gift.",
  "tags": [
    "Kundan Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Gold Necklace",
    "Ruby",
    "Emerald",
    "CZ",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "కంఠాభరణం",
    "సువర్ణము",
    "వివాహము",
    "పండుగలు",
    "Ethnic Jewelry",
    "Fine Jewelry",
    "Temple Jewelry",
    "Bridal Necklace",
    "Latest Designs",
    "22K Gold",
    "Gemstone Necklace",
    "Kundan Jewellery",
    "Antique Finish",
    "Modern Kundan"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0369_0566",
  "collection": "diamond"
}