{
  "id": "earrings-632",
  "title": "Emerald Blossom Jhumkaalu: A Touch of Royalty",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (approximately 91.6% purity)",
    "meticulously studded with high-quality Cubic Zirconia (CZ) stones mimicking Diamonds. Features a central Emerald-colored gemstone",
    "and pearl drops (muthyalu)."
  ],
  "features": "Classic Jhumka silhouette with intricate filigree work and micro-pave setting of CZ stones. Features a floral-shaped top section with a central Emerald stone. The dome of the Jhumka showcases delicate cut-out patterns and is adorned with cascading pearl drops adding a touch of elegance and tradition. This is finished with a Hyderabad gold polish for added sheen and resilience.",
  "colors": [
    "Predominantly Gold and White (CZ) with a striking Emerald Green center stone and creamy white pearl drops."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "traditional festivals like Sankranti",
    "Ugadi",
    "or Dussehra. Also suitable for special occasions such as Seemantham (baby shower) or any festive event where a touch of traditional elegance is desired. Perfect for bridal wear or as a statement piece for formal gatherings."
  ],
  "description": "This pair of Jhumkaalu embodies timeless South Indian elegance. The Emerald center stone adds a regal touch, while the intricate filigree work and micro-pave CZ setting demonstrate exceptional craftsmanship. The combination of traditional design with modern gemstone setting makes this piece versatile and appealing to a wide range of customers. These are durable and will remain beautiful for years to come.",
  "tags": [
    "Jhumka",
    "Jhumkaalu",
    "Earrings",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Gold Earrings",
    "Emerald",
    "Pearls",
    "Muthyalu",
    "Indian Wedding",
    "Bridal Jewelry",
    "CZ Jewelry",
    "Filigree",
    "Hyderabad Jewelry",
    "Telugu Jewelry",
    "Festive Jewelry",
    "Indian Fashion",
    "Seemantham Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 16_2209",
  "collection": "sjpl"
}