{
  "id": "necklaces-777",
  "title": "Rajputana Kundan Jadau Polki Haaram with Emeralds and Sapphires",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximate)",
    "Uncut Polki Diamonds (Kundan)",
    "Emeralds (Zambian origin",
    "Oval & Square Cut)",
    "Sapphires (Oval & Pear Cut)",
    "Rose Quartz",
    "meticulously crafted in Kundan Jadau setting with Hyderabadi Polish for a timeless shine."
  ],
  "features": "This magnificent Haaram showcases the regal Rajputana influence with intricate Kundan Jadau work. The polki diamonds are meticulously set in a traditional floral design, complemented by vibrant Emeralds and Sapphires. A prominent Mogappu (pendant) features a larger Emerald centerpiece surrounded by more Polki diamonds and gemstone accents. The necklace design features floral and paisley motifs.",
  "colors": [
    "Predominantly gold with accents of green (Emeralds)",
    "blue (Sapphires)",
    "pale pink (Rose Quartz)",
    "and brilliant white (Polki Diamonds)."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "Muhurtham",
    "weddings",
    "grand receptions",
    "or any occasion where you want to make a statement. Also suitable for formal gatherings."
  ],
  "description": "A true heirloom piece, this Haaram seamlessly blends traditional Kundan Jadau craftsmanship with the allure of precious gemstones. The combination of Polki diamonds, Emeralds, and Sapphires symbolizes prosperity and good fortune. Its timeless design and exquisite craftsmanship ensure it will be cherished for generations. The Hyderabadi polish enhances the gold's luster and adds a touch of regal elegance.",
  "tags": [
    "Haaram",
    "Kundan Jadau",
    "Polki Diamond",
    "Emerald",
    "Sapphire",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Mogappu",
    "Royal Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Indian Wedding"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-09 3_1283",
  "collection": "diamond"
}