{
  "id": "necklaces-359",
  "title": "Aditya Diamond Haaram with Emerald & Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Emerald (Oval Cut)",
    "Natural Ruby (Pear Cut)",
    "Cultured Pearls. Features exquisite Hyderabadi Polish for enduring luster."
  ],
  "features": "This stunning Haaram showcases intricate floral motifs meticulously crafted in a pave setting with brilliant-cut diamonds. A regal central pendant features an oval-cut emerald, radiating opulence. A smaller, teardrop ruby provides a vibrant contrast, embodying the richness of South Indian heritage. The lower pendant is gracefully adorned with delicate pearl drops, known as 'gundla'.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "with pops of deep green (emerald) and rich red (ruby). The pearl adds a soft",
    "elegant touch. A classic tricolor combination considered auspicious in Telugu culture."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "milestone birthday celebrations",
    "and grand festive occasions. An ideal choice for muhurtham (ముహూర్తం) ceremonies or any event where you want to make a statement."
  ],
  "description": "This Diamond Haaram is a testament to timeless elegance and masterful craftsmanship. The combination of vibrant gemstones and dazzling diamonds makes it a truly exceptional piece. The Hyderabadi polish ensures a lasting shine, while the classic design guarantees it will be cherished for generations. It's not just jewelry, it's an heirloom.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Diamond Haaram",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Vaddanam",
    "kasulaperu",
    "వజ్రాల హారం",
    "పెళ్లి నగలు",
    "ఆభరణాలు",
    "Traditional Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0473_0655",
  "collection": "diamond"
}