{
  "id": "earrings-478",
  "title": "Mayur Jhumka: Regal Peacock Earrings with Polki and Pearl",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Hallmarked)",
    "Uncut Polki Diamonds (Kundan)",
    "Ruby accents",
    "Enamel detailing",
    "Cultured South Sea Pearl. Crafted with Hyderabadi polish for a lasting luster."
  ],
  "features": "Inspired by traditional Mayur (peacock) motifs, these Jhumkas feature a beautifully enameled peacock body above a crescent of Polki diamonds. A bell-shaped Jhumka with diamond detailing leads to a lustrous pearl drop. The Polki setting showcases the inherent beauty of the uncut diamonds, creating a regal and opulent look. The design incorporates elements of temple jewelry with a modern twist.",
  "colors": [
    "Gold",
    "Blue",
    "Red",
    "White (Polki Diamonds)",
    "and Cream (Pearl). A classic South Indian color palette with rich jewel tones."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "special celebrations (Subha Karyam)",
    "and festive occasions (Panduga). Also suitable for making a statement at contemporary parties and events."
  ],
  "description": "These Mayur Jhumkas blend traditional South Indian artistry with modern design sensibilities. The use of high-quality Polki diamonds and a lustrous South Sea pearl ensures a timeless elegance. The peacock motif symbolizes beauty, love, and prosperity, making this piece a meaningful and valuable addition to any jewelry collection. Expertly crafted with meticulous attention to detail and Hyderabadi polish for enduring shine and quality. A true heirloom piece to be cherished for generations.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Polki",
    "Kundan",
    "Peacock",
    "Mayur",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabad",
    "Pearls",
    "22K Gold",
    "Vivaha",
    "Wedding",
    "Traditional",
    "చెవి దుద్దులు",
    "Panduga",
    "Subha Karyam"
  ],
  "original_id": "ear_rings_DPER8-1403_2599",
  "collection": "ear"
}