{
  "id": "necklaces-306",
  "title": "Devasena Diamond Haaram Set with Matching Earrings",
  "category": "necklaces",
  "original_type": "Necklace and Earrings",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features brilliant-cut CZ Diamonds (American Diamonds)",
    "a central Emerald cabochon",
    "a Ruby accent stone",
    "and natural freshwater Pearls. Metal is hallmarked for gold purity."
  ],
  "features": "This captivating Haaram showcases a classic South Indian design with a modern flair. The intricate leafy pattern necklace is studded with shimmering CZ diamonds, culminating in a grand pendant. The pendant features a circular design with a central Emerald cabochon surrounded by concentric circles of CZ diamonds. Ruby stones add pops of color, while delicate freshwater pearls enhance the elegance. The matching earrings echo the pendant's design, creating a harmonious set.",
  "colors": [
    "Predominantly gold with the dazzling sparkle of diamonds",
    "complemented by the vibrant green of the Emerald and the deep red of the Ruby. The pearls add a soft",
    "creamy white accent."
  ],
  "occasions": [
    "Perfect for grand celebrations",
    "weddings (Vivaha Mahotsavam)",
    "engagements",
    "and other special occasions like Seemantham (baby shower) or half-saree functions. This Haaram is also ideal for adding a touch of heritage to contemporary outfits at upscale events."
  ],
  "description": "A true statement piece, this Devasena Haaram embodies the opulence of South Indian jewelry. The high-quality CZ diamonds provide exceptional brilliance at an accessible price point. The traditional design is versatile enough to be passed down through generations, making it a cherished heirloom. The Hyderabadi polish ensures a long-lasting shine and durable finish. This set offers both cultural significance and contemporary appeal.",
  "tags": [
    "Haaram",
    "Necklace",
    "Earrings",
    "South Indian Jewelry",
    "CZ Diamonds",
    "Emerald",
    "Ruby",
    "Pearls",
    "22K Gold",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Devatha Jewellery",
    "Seemantham",
    "Vivaha Mahotsavam",
    "Half-Saree Function",
    "Antique Finish",
    "Haram",
    "Addigai",
    "Kasu Mala",
    "Bridal Set",
    "Telangana Jewellery",
    "Andhra Jewellery",
    "Gold Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0395_0592",
  "collection": "diamond"
}