{
  "id": "necklaces-1533",
  "title": "The 'Maharani' Diamond & Emerald Haar with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "meticulously crafted with high-quality diamonds (VS clarity",
    "G color). Features vibrant emeralds and lustrous South Sea Pearls. Finished with a signature Hyderabadi polish for enduring shine."
  ],
  "features": "An opulent statement piece showcasing intricate diamond floral motifs throughout the 'haar'. Elegant emerald accents provide a striking contrast. Suspended pearls add a touch of traditional charm. The central pendant features a matching diamond and emerald design, echoing the necklace's overall aesthetic. Masterfully crafted with delicate openwork, embodying the richness of South Indian artistry.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "accented with vibrant green (emeralds) and soft white (pearls). The combination creates a regal and timeless color palette."
  ],
  "occasions": [
    "Perfect for bridal wear (Muhurtham",
    "Reception)",
    "grand celebrations",
    "and special occasions demanding a majestic statement. Ideal for Seemantham or Half-Saree ceremonies where a touch of heritage is desired."
  ],
  "description": "This 'Maharani' Haar is a testament to Hyderabad's rich jewelry tradition. The dazzling diamonds, combined with the vibrant emeralds and lustrous pearls, exude opulence and sophistication. Meticulously handcrafted for durability and lasting beauty, it's an heirloom piece to be cherished for generations. A symbol of prosperity and grace, perfect for the modern bride who appreciates timeless elegance.",
  "tags": [
    "Diamond Haar",
    "Emerald Necklace",
    "Pearl Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Necklace",
    "Statement Necklace",
    "Kandhaharam",
    "Muhurtham Jewelry",
    "Reception Jewelry",
    "Emerald Haar",
    "Diamond Jewelry",
    "Pearl Drops",
    "traditional jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-07 4_2151",
  "collection": "sjpl"
}