{
  "id": "necklaces-129",
  "title": "Heera Jadau Haaram with Emerald Pendant - The 'Vaishnavi' Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish; Polki Diamonds (Uncut Diamonds) with excellent clarity; Oval-cut Emerald of Zambian origin",
    "showcasing vibrant green color."
  ],
  "features": "This stunning Haaram features a meticulously crafted arrangement of Polki diamonds, each delicately set to maximize its brilliance. The diamond shapes are a mix of round and square, adding dimension to the piece. The central pendant showcases an oval Emerald, surrounded by a floral motif of Polki diamonds. The 'Vaishnavi' collection piece has square pendants studded with polki diamonds.",
  "colors": [
    "Predominantly gold with the captivating sparkle of white (uncut) diamonds and the lush green of the emerald."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "significant festivals like Diwali (దీపావళి)",
    "and upscale cultural events. A statement piece for brides (వధువు) during their Muhurtham (ముహూర్తం) or Seemantham (సీమంతం) ceremonies."
  ],
  "description": "This Heera Jadau Haaram is a timeless masterpiece, blending traditional craftsmanship with contemporary design. The Hyderabadi polish accentuates the gold's luster, while the Polki diamonds lend an unmatched sparkle. The emerald pendant adds a touch of regality and sophistication. A valuable heirloom to be passed down through generations, symbolizing prosperity and grace. The uncut polki diamonds are meticulously placed to have an alluring effect that is sure to mesmerize.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamond",
    "Uncut Diamond",
    "Jadau Jewelry",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "కంఠాభరణం",
    "హారము",
    "పోల్కి వజ్రం",
    "పచ్చ",
    "దక్షిణ భారత ఆభరణాలు",
    "పెళ్లి నగలు",
    "వధువు నగలు"
  ],
  "original_id": "diamond_jewellery_DPNK8-1610_0362",
  "collection": "diamond"
}