{
  "id": "bangles-295",
  "title": "Rose Gold Medusa Charm Bracelet with Diamond Accents",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "18K Rose Gold",
    "meticulously crafted and polished for a lasting shine. Features high-quality Cubic Zirconia stones",
    "offering the brilliance of diamonds with exceptional clarity. The charm boasts a central pink enamel."
  ],
  "features": "This exquisite bracelet showcases a modern design with a central Medusa head charm in rose gold, reminiscent of ancient Greek artistry but with a contemporary twist. The intricate detailing of the Medusa head is contrasted by the smooth pink enamel backdrop. Smaller circular settings encrusted with CZ stones add sparkle and elegance on either side. The delicate chain ensures comfortable wear, while the secure lobster clasp guarantees lasting durability.",
  "colors": [
    "Primarily rose gold",
    "with a soft pink center to the main charm",
    "complemented by the dazzling white sparkle of the Cubic Zirconia stones."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "evening outings",
    "or as a sophisticated gift for special occasions. Its modern design also makes it suitable for celebrations like birthdays and anniversaries."
  ],
  "description": "This rose gold bracelet offers a unique blend of modern design and timeless elegance. The Medusa charm provides a bold statement, while the Cubic Zirconia stones add a touch of luxury without overwhelming the piece. Its durable construction and comfortable fit make it a cherished addition to any jewelry collection. The bracelet reflects contemporary styling while hinting at classical motifs, making it versatile and eye-catching. It's a testament to refined taste and enduring style.",
  "tags": [
    "Bracelet",
    "Rose Gold",
    "Medusa",
    "Charm",
    "Cubic Zirconia",
    "Modern Jewelry",
    "Fashion",
    "Gift",
    "Women's Jewelry",
    "Party Wear",
    "Statement Piece",
    "Rose Gold Bracelet"
  ],
  "original_id": "sjpl_PHOTO-2024-05-09-11-07-51_1997",
  "collection": "sjpl"
}