{
  "id": "necklaces-846",
  "title": "Diamond and Emerald Kasulaperu Haaram with Pearl Drops - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Emeralds (High Clarity",
    "Zambian Origin)",
    "Brilliant Cut Diamonds (VS Clarity",
    "GH Color)",
    "South Sea Pearls. Hyderabadi Polish for lasting luster."
  ],
  "features": "Exquisite Kasulaperu design featuring alternating gold coins with intricately detailed floral motifs, each studded with dazzling diamonds. Two emerald centered round pendants. Accented with delicate South Sea pearl drops for a touch of elegance and tradition. The pendant displays impeccable 'Ghataam' (setting) work, a hallmark of Hyderabad's jewelry tradition. The setting enhances the brilliance and fire of each diamond.",
  "colors": [
    "Predominantly Gold and Diamond White",
    "with vibrant Green Emerald accents and iridescent Pearl White."
  ],
  "occasions": [
    "Ideal for weddings (muhurtham)",
    "receptions",
    "anniversaries",
    "and grand celebrations. Perfect for Bharatanatyam performances or any special occasion where a statement of refined heritage is desired. A valuable addition to any bridal trousseau (pellikuturu samagri)."
  ],
  "description": "A stunning blend of traditional Telugu design and modern elegance, this Kasulaperu Haaram showcases exceptional craftsmanship and the finest materials. The brilliance of the diamonds, the rich color of the emeralds, and the luster of the pearls create a captivating harmony. This piece is a true heirloom, representing timeless beauty and cultural significance, making it a treasured investment for generations to come. The detailed design makes it a conversation starter and a symbol of prosperity (Soubhagyam).",
  "tags": [
    "Haaram",
    "Kasulaperu",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham Jewelry",
    "Emerald",
    "Diamond",
    "Pearls",
    "Nakshi Work",
    "Temple Jewelry",
    "Ghataam",
    "Long Necklace"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0378_1533",
  "collection": "haaram"
}