{
  "id": "rings-010",
  "title": "Emerald Blossom Polki Ring - Ratnagarbha Pachala Anguliya",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold (Svarnam)",
    "Natural Emerald Cabochon",
    "Polki Diamonds (Uncut Diamonds) - Superior Clarity",
    "Hyderabadi Polish"
  ],
  "features": "Intricate floral design with a central Emerald cabochon surrounded by shimmering Polki diamonds. The setting showcases a delicate openwork pattern, enhancing the brilliance of the gemstones. Features a modern interpretation of the traditional 'Mogra' flower design, popular in South Indian jewelry. The use of Polki diamonds adds a rustic, antique charm. Handcrafted by skilled artisans in Hyderabad, known for their exceptional craftsmanship.",
  "colors": [
    "Lustrous gold with a vibrant green Emerald center and sparkling white Polki diamonds."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Vivaha)",
    "engagements (Nischitartham)",
    "festivals (like Diwali",
    "Ugadi)",
    "or as a statement piece for any evening event. Adds a touch of regal elegance to any outfit."
  ],
  "description": "This ring is a harmonious blend of traditional South Indian design and modern elegance. The use of genuine Polki diamonds and a vivid Emerald cabochon makes it a truly unique piece. Handcrafted in Hyderabad, known for its rich jewelry heritage, it is a valuable addition to any jewelry collection. Symbolizes prosperity and good fortune, making it a cherished heirloom. Exquisite craftsmanship ensures durability and lasting beauty.",
  "tags": [
    "Ring",
    "Anguliya",
    "Emerald",
    "Pachala",
    "Polki Diamond",
    "Uncut Diamond",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Mogra Flower",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Cocktail Ring",
    "Indian Jewelry",
    "Fine Jewelry",
    "22K Gold",
    "Swarnam",
    "Ratnagarbha"
  ],
  "original_id": "diamond_jewellery_DPER8-1591_0282",
  "collection": "diamond"
}