{
  "id": "necklaces-751",
  "title": "Rajputana Ratan Haaram: Emerald and Diamond Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "ethically sourced Diamonds (VVS Clarity",
    "Excellent Cut)",
    "Natural Zambian Emeralds. Crafted with Hyderabadi Kundan setting techniques for exceptional gemstone brilliance and durability."
  ],
  "features": "This exquisite three-layered Haaram features intricate floral and leaf motifs entirely studded with dazzling diamonds. Accented with round Zambian emerald beads for a touch of color and regal elegance. The centerpiece features a traditional peacock design in Kundan setting with a central ruby, cascading emerald drops, and delicate filigree work in the pendant. The clasp is seamlessly integrated, ensuring a smooth and comfortable fit.",
  "colors": [
    "Yellow Gold",
    "Sparkling White Diamonds",
    "Rich Green Emeralds",
    "Deep Red Ruby."
  ],
  "occasions": [
    "Ideal for weddings (పెళ్లి)",
    "receptions",
    "grand celebrations",
    "Seemantham (శీమంతం)",
    "bridal wear",
    "and special occasions where you want to make a statement. Perfect for festivals like Diwali",
    "Sankranthi",
    "and Ugadi."
  ],
  "description": "This Rajputana Ratan Haaram is a timeless heirloom piece, showcasing exceptional craftsmanship and timeless elegance. The use of ethically sourced diamonds and natural emeralds guarantees value and beauty. The traditional Haaram design is highly auspicious in Telugu culture, signifying prosperity and marital bliss. This piece is a true investment, to be treasured for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kundan",
    "Traditional Jewelry",
    "పెళ్లి",
    "శీమంతం",
    "కంఠాభరణం",
    "Gold Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-39 3_1257",
  "collection": "diamond"
}