{
  "id": "necklaces-1116",
  "title": "The 'Rani' Polki Diamond and Pearl Collar Necklace - A Regal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish",
    "showcasing uncut Polki Diamonds (VS clarity",
    "G-H color). Features lustrous South Sea Pearls",
    "meticulously hand-strung. The gold weight is approximately 80 grams and the total diamond weight is estimated at 35 carats."
  ],
  "features": "This stunning collar necklace, or 'కంఠాభరణం', features an intricate arrangement of Polki diamonds in a traditional Kundan setting. The design incorporates a graduated arrangement, with larger diamonds at the center and smaller ones towards the edges. Delicate pearl drops are suspended from the lower edge, adding movement and grace. The back features a secure adjustable clasp for a comfortable fit. The Hyderabadi polish enhances the antique appearance, creating a timeless heirloom.",
  "colors": [
    "Antique Gold with a subtle warm undertone",
    "complemented by the dazzling white of the Polki diamonds and the creamy luster of the South Sea pearls."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Muhurtham)",
    "receptions",
    "engagement ceremonies",
    "and other special occasions where you want to make a statement. Also suitable for upscale social events and formal gatherings."
  ],
  "description": "This 'Rani' necklace is a testament to traditional Indian craftsmanship and timeless elegance. The use of authentic Polki diamonds and South Sea pearls ensures the highest quality and enduring value. The Hyderabadi polish gives it a distinctive antique appeal, making it a unique and cherished piece for generations to come. Owning this piece signifies a connection to cultural heritage and a celebration of exquisite artistry.",
  "tags": [
    "Polki Necklace",
    "Kundan Jewelry",
    "Diamond Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Haaram",
    "Kanthabharanam",
    "Hyderabad Jewelry",
    "Indian Wedding",
    "Muhurtham",
    "Antique Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "handcrafted",
    "22K Gold"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0011_2529",
  "collection": "radhe"
}