{
  "id": "rings-023",
  "title": "Navaratna Vaibhavam Ring: The Auspicious Gemstone Bloom",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold",
    "Authentic Navaratna Gemstones (Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "Brilliant Cut Diamonds. Features signature Hyderabadi setting."
  ],
  "features": "This exquisite ring features the sacred Navaratna arrangement, with a central, large Polki diamond embraced by the nine auspicious gemstones. Each gemstone is carefully selected for its clarity, color, and astrological significance, set in a halo of sparkling diamonds to amplify its radiance. The gold setting is meticulously crafted to showcase the natural beauty of the gemstones and to enhance their positive energies.",
  "colors": [
    "Multicolor – Radiant array of gemstone hues (red",
    "white",
    "orange",
    "green",
    "yellow",
    "colorless",
    "blue",
    "brown",
    "grey) complemented by the warm yellow of 22K gold and the brilliant sparkle of white diamonds."
  ],
  "occasions": [
    "Ideal for weddings (Vivaaham)",
    "housewarmings (Gruhapravesam)",
    "auspicious ceremonies",
    "or to elevate your everyday attire with a touch of timeless elegance and divine protection. Also perfect for gifting on special occasions",
    "Seemantham or Baby showers."
  ],
  "description": "This Navaratna ring combines the rich traditions of South Indian jewelry with the modern sensibilities of fine craftsmanship. Each gemstone is believed to bring specific benefits, offering the wearer protection, prosperity, and overall well-being. The Hyderabadi setting ensures lasting beauty and durability, making this ring a treasured heirloom for generations to come.",
  "tags": [
    "Navaratna",
    "Ring",
    "Anguleeyakam",
    "Gemstone",
    "Gold",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad",
    "Traditional",
    "Auspicious",
    "Wedding",
    "Vivahaalu",
    "Hyderabadi Polish",
    "Polki Diamond",
    "Indian Jewelry",
    "Seemantham",
    "Baby Shower"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-04-20-13-18-49 2_0825",
  "collection": "diamond"
}