{
  "id": "bangles-118",
  "title": "The 'Aashirwad' Ruby and Diamond Bangle - A Symbol of Blessings",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold (Swarna)",
    "Natural Ruby (Ratna) center stone",
    "Brilliant Cut Diamonds (Vajra). Crafted with Hyderabadi polish for a lasting lustre and durability."
  ],
  "features": "Intricate openwork design adorned with pavé-set diamonds, creating a delicate and feminine aesthetic. The focal point is a central ruby set in the middle of a Diamond flower, symbolizing prosperity and divine blessings. The filigree work and the use of negative space gives the piece a light and airy feel. The openwork design enhances the sparkle of the diamonds.",
  "colors": [
    "Primarily Yellow Gold with vibrant Ruby red and dazzling white diamonds. The warm gold hue complements the richness of the ruby."
  ],
  "occasions": [
    "Perfect for traditional occasions such as weddings (Vivah)",
    "festive celebrations like Sankranti",
    "Deepavali and everyday wear. Its blend of traditional and modern aesthetics makes it suitable for contemporary events as well."
  ],
  "description": "This bangle is a masterpiece of craftsmanship, combining traditional Telugu design elements with modern jewelry techniques. The use of high-quality gemstones and Hyderabadi polish guarantees lasting beauty and value. The ruby is considered auspicious, especially for married women, symbolizing marital bliss and prosperity. The openwork design ensures that this is a statement piece that is surprisingly lightweight and comfortable to wear.",
  "tags": [
    "Bangle",
    "Kangan",
    "Kada",
    "Ruby",
    "Manikyam",
    "Diamond",
    "Vajra",
    "22K Gold",
    "Openwork",
    "Filigree",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Indian Wedding",
    "Muhurtham",
    "Festive",
    "Aashirwad",
    "Blessings",
    "Prosperity"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0270_0469",
  "collection": "diamond"
}