{
  "id": "earrings-030",
  "title": "Navaratna Kundan Jhumka - The Auspicious Gemstone Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "studded with nine precious gemstones (Navaratnas) - Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye. Accented with brilliant-cut Cubic Zirconia."
  ],
  "features": "Classic Jhumka design, featuring a floral motif in the center set with traditional Kundan technique. The outer circular design is detailed with intricate filigree work. A single, perfectly round gold 'gutti' (bead) dangles gracefully, adding movement and charm. The push-back closure ensures a secure and comfortable fit.",
  "colors": [
    "Predominantly Gold with vibrant gemstone colors including Red (Ruby)",
    "White (Pearl)",
    "Orange (Coral)",
    "Green (Emerald)",
    "Yellow (Sapphire)",
    "Blue (Sapphire)",
    "and colorless (Diamond",
    "Cubic Zirconia)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "festivals (like Diwali",
    "Ugadi",
    "Dussehra)",
    "traditional ceremonies such as Seemantham (baby shower)",
    "half-saree function (Langa Voni)",
    "and other auspicious occasions. Also suitable for elegant evening wear",
    "adding a touch of cultural heritage to any outfit."
  ],
  "description": "These Navaratna Jhumkas are more than just earrings; they are a symbol of prosperity and good fortune. The nine gemstones represent the nine planets and are believed to bring balance and harmony to the wearer. The Hyderabadi polish gives the gold a rich, lustrous finish that will last for generations. Handcrafted by skilled artisans, these earrings showcase the rich heritage of South Indian jewelry making. The modern setting ensures that the gemstones sparkle beautifully, catching the light with every movement.",
  "tags": [
    "Jhumka",
    "Navaratna",
    "Kundan",
    "Gold Earrings",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Ethnic Earrings",
    "22K Gold",
    "చెవి దుద్దులు",
    "ఆభరణాలు",
    "పెళ్లి నగలు",
    "Kundan Jewellery",
    "Navratan Jewellery",
    "Temple Jewellery",
    "Indian Earrings",
    "Ethnic Jewellery"
  ],
  "original_id": "diamond_jewellery_388cf933-6030-452f-8f0f-f8dfbf886faa_0101",
  "collection": "diamond"
}