{
  "id": "necklaces-1463",
  "title": "Manoharam Peacock Kanti Necklace with Sapphires and Polki Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (approx. 5 carats total weight",
    "SI clarity)",
    "Natural Blue Sapphires",
    "Ruby Accents. Hyderabadi Polish for a lasting luster."
  ],
  "features": "A stunning adaptation of the classic 'Kanti' necklace, this piece showcases a symmetrical design featuring stylized peacocks ('Mayura') flanking floral motifs. The peacocks are adorned with polki diamonds and small ruby accents for the eyes. The central section is a mesmerizing arrangement of polki diamonds and vibrant blue sapphires in a pavé setting. Delicate golden 'gundla' (beads) dangle gracefully, adding movement and a touch of traditional flair. Modern design with traditional 'mayura' elements.",
  "colors": [
    "Gold (yellow gold)",
    "White (polki diamonds)",
    "Blue (sapphires)",
    "Red (rubies). A harmonious blend of traditional South Indian colours."
  ],
  "occasions": [
    "Perfect for weddings (Vadhuvu/bride)",
    "receptions",
    "Seemantham (baby shower)",
    "and high-end social gatherings. Its contemporary design also allows it to be worn at modern events and parties."
  ],
  "description": "This exquisite necklace is a testament to timeless elegance and superior craftsmanship. The combination of lustrous 22K gold, brilliant polki diamonds, and deep blue sapphires creates a captivating piece that will be cherished for generations. The symbolic peacock motif adds a touch of tradition and auspiciousness. The intricate detailing and Hyderabadi polish ensure lasting beauty and value. A perfect heirloom piece.",
  "tags": [
    "Necklace",
    "Haaram",
    "Kanti",
    "Gundla Mala",
    "Polki Diamond",
    "Diamond Necklace",
    "Sapphire",
    "Blue Sapphire",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Mayura",
    "Peacock",
    "Hyderabadi Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-55 2_2081",
  "collection": "sjpl"
}