{
  "id": "earrings-682",
  "title": "Dazzling Diamond Dangles - A Modern Twist on Traditional Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features brilliant-cut CZ (Cubic Zirconia) stones with excellent clarity. The gold has a rich",
    "warm luster enhanced by our signature Hyderabadi polish."
  ],
  "features": "These earrings feature a unique open 'infinity' design in gold, creating a graceful, elongated dangle. Each earring is adorned with a linear arrangement of sparkling CZ stones, set in a secure prong setting. The open design promotes light reflection, maximizing the brilliance of the stones. The earring hooks are designed for comfort and secure wear.",
  "colors": [
    "Predominantly gold with clear",
    "shimmering white CZ stones. The contrast between the warm gold and the bright white stones creates a classic and elegant appeal."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "evening events",
    "cocktail parties",
    "or as a subtle yet sophisticated addition to your bridal trousseau. These earrings can be paired with both traditional South Indian outfits and modern attire",
    "making them incredibly versatile."
  ],
  "description": "These contemporary dangle earrings beautifully blend modern aesthetics with the timeless appeal of gold jewelry. The CZ stones offer exceptional sparkle at an accessible price point. The Hyderabadi polish ensures a lasting shine and durability. Lightweight and comfortable, these earrings are perfect for extended wear. This is an excellent choice for someone seeking modern design in traditional gold.",
  "tags": [
    "Earrings",
    "Dangle Earrings",
    "Gold Earrings",
    "CZ Earrings",
    "Hyderabadi Polish",
    "Contemporary Jewelry",
    "South Indian Jewelry",
    "Modern Earrings",
    "22K Gold",
    "Bridal Jewelry",
    "Party Wear",
    "Fashion Earrings",
    "Stud Earrings",
    "Jhumka (though not strictly a jhumka",
    "relates to earrings)"
  ],
  "original_id": "stock_in_india_IMG-20241130-WA0019_2778",
  "collection": "stock"
}