{
  "id": "necklaces-1148",
  "title": "Divine Lotus Polki Haaram with Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Rose Cut)",
    "Ruby Beads. Features authentic Hyderabadi Polish for a rich",
    "antique luster."
  ],
  "features": "This exquisite Haaram showcases a delicate lotus motif pendant, intricately set with uncut Polki diamonds in a closed setting. The pendant is adorned with cascading ruby bead drops, creating a traditional Gutapusalu (pearl-like droplet) effect. The chain features evenly spaced ruby beads, adding a touch of color and vibrancy. The gold has a signature Hyderabadi polish for a lustrous and vintage feel.",
  "colors": [
    "Gold",
    "White (Polki Diamonds)",
    "Ruby (Pinkish-Red)"
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "engagements",
    "family celebrations (like Seemantham)",
    "festive occasions (Sankranthi",
    "Diwali)",
    "and sophisticated cultural gatherings. Can be paired with traditional silk sarees or contemporary Indo-Western attire."
  ],
  "description": "Authentic Polki diamonds offer a unique, timeless appeal. The lotus motif symbolizes purity and prosperity, making it a meaningful gift. Handcrafted by skilled artisans in Hyderabad, ensuring exceptional quality and enduring beauty. The blend of traditional design with a contemporary chain makes it versatile and wearable for various occasions. The Hyderabadi polish enhances the gold's richness and provides a classic, heritage look.",
  "tags": [
    "Polki Necklace",
    "Gutapusalu",
    "Haaram",
    "Diamond Necklace",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Uncut Diamonds",
    "Traditional Jewelry",
    "Muhurtham",
    "Seemantham",
    "22K Gold",
    "Rose Cut Diamonds",
    "Lotus Pendant",
    "లక్ష్మి గొలుసు",
    "ముత్యాల హారము"
  ],
  "original_id": "radhe_diam_PKCH8-1624_2567",
  "collection": "radhe"
}