{
  "id": "necklaces-1114",
  "title": "Heirloom Polki and Pearl Guluband - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Kundan Setting",
    "Uncut Polki Diamonds (approximately 20 carats total weight)",
    "Emerald Center Stone",
    "Freshwater Pearls",
    "Ruby accents."
  ],
  "features": "This exquisite guluband features a floral motif choker design meticulously handcrafted using the traditional Kundan setting technique, perfected in Hyderabad for generations. Each uncut Polki diamond is carefully set to maximize its brilliance. The central pendant boasts a vibrant emerald surrounded by more Polkis. Delicate freshwater pearls and ruby accents adorn the lower edge, adding a touch of grace. The back is traditionally enameled for added artistry.",
  "colors": [
    "Dominant Gold with White (Polki Diamonds)",
    "Green (Emerald)",
    "Blush Pink (Ruby Accents)",
    "and Cream (Pearls)."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu / పెళ్ళి)",
    "receptions",
    "bridal showers",
    "or any grand celebration where a touch of timeless elegance is desired. Ideal for Muhurtham (ముహూర్తం) ceremonies and other auspicious occasions."
  ],
  "description": "A true heirloom piece, this guluband embodies the rich cultural heritage of Hyderabad and South India. Its exceptional craftsmanship, high-quality materials, and timeless design make it a worthy investment and a statement of refined taste. The Polki diamonds are responsibly sourced and meticulously cut to ensure maximum brilliance. The piece is surprisingly comfortable to wear despite its grandeur.",
  "tags": [
    "Guluband",
    "Kundan",
    "Polki",
    "Diamond Necklace",
    "Hyderabadi Jewelry",
    "Traditional South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Indian Necklace",
    "Antique Finish",
    "Pearls",
    "Emerald",
    "Ruby",
    "Vivahaalu",
    "Kanthabharanam",
    "పెళ్ళి",
    "కంఠాభరణం",
    "Muhurtham",
    "ముహూర్తం"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0009_2527",
  "collection": "radhe"
}