{
  "id": "necklaces-156",
  "title": "Rani Haar: Majestic Emerald and Ruby Gulbandh Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Suddha Bangaram) with Hyderabadi Polish",
    "Natural Emerald Beads",
    "Natural Ruby (Manikyam)",
    "Polki Diamonds (Uncut Diamonds)",
    "Cultured Pearls"
  ],
  "features": "This exquisite gulbandh showcases intricate filigree work (jalli) on the gold settings, framing a vibrant ruby and emerald centerpieces. Features traditional peacock (Mayura) motifs crafted with Nakshi craftsmanship, reflecting South Indian heritage. The emerald strands are carefully hand-knotted with delicate pearl accents, creating a layered, regal effect. Adjustable Dori closure provides a comfortable fit.",
  "colors": [
    "Emerald Green",
    "Ruby Red",
    "Golden Yellow (Bangaru Rang)",
    "Pearl White",
    "Diamond White"
  ],
  "occasions": [
    "Ideal for weddings (Vivahamu)",
    "engagement ceremonies (Nischitartham)",
    "traditional festivals (Ugadi",
    "Sankranti)",
    "Seemantham (baby shower)",
    "and other grand celebrations. A statement piece perfect for adding a touch of timeless elegance to any special occasion."
  ],
  "description": "A true heirloom piece, handcrafted with meticulous attention to detail using traditional South Indian techniques. The combination of emeralds, rubies, and polki diamonds creates a mesmerizing sparkle. The Rani Haar symbolizes prosperity, good fortune, and marital bliss, making it a cherished addition to any jewelry collection. The Hyderabadi polish provides a lustrous finish that enhances the natural beauty of the gemstones.",
  "tags": [
    "Rani Haar",
    "Gulbandh",
    "Emerald Necklace",
    "Ruby Necklace",
    "Polki Diamond",
    "Uncut Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Nakshi",
    "Filigree",
    "Traditional Jewelry",
    "Kanthabharanam",
    "कंठाभरणं",
    "Suddha Bangaram",
    "शुद्ध बंगारं"
  ],
  "original_id": "diamond_jewellery_DPPD8-547_0389",
  "collection": "diamond"
}