{
  "id": "earrings-578",
  "title": "Exquisite Emerald & Diamond Chandbali Jhumka",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Zambian Emeralds (Square Cut",
    "Teardrop Cut)",
    "Brilliant Cut Diamonds (VS Clarity)",
    "South Sea Pearls. Traditional Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "Intricate filigree work forming a classic Chandbali design. Features a central square-cut Emerald surrounded by a halo of sparkling diamonds. Teardrop Emeralds are suspended below, culminating in delicate South Sea Pearl drops. The openwork design allows for maximum light reflection, enhancing the brilliance of the gemstones.",
  "colors": [
    "Emerald Green",
    "Diamond White",
    "Pearl White",
    "Gold"
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "Seemantham (Baby Shower)",
    "Half-Saree Functions",
    "Diwali celebrations",
    "and other special occasions where a touch of timeless elegance is desired. Can also be paired with modern attire for a sophisticated statement."
  ],
  "description": "A harmonious blend of traditional South Indian artistry and modern gemstone setting techniques. The vibrant Zambian Emeralds symbolize prosperity and good fortune, while the lustrous South Sea Pearls represent purity and elegance. Handcrafted by skilled artisans in Hyderabad, ensuring exceptional quality and attention to detail. Makes a treasured heirloom piece for generations to come. The Chandbali design is a timeless classic, offering unparalleled versatility and enduring style.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "చెవి దుద్దులు",
    "Seemantham",
    "Half Saree",
    "Muhurtham",
    "Zambian Emerald",
    "South Sea Pearls",
    "Traditional Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-25_1750",
  "collection": "sjpl"
}