{
  "id": "necklaces-015",
  "title": "Elegant Diamond Leaf Bridal Set - Traditional Vanki Inspired Necklace with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Gold",
    "Rose and White Gold Finish",
    "AAA-Grade Cubic Zirconia (CZ) Diamonds"
  ],
  "features": "This breathtaking necklace set features a cascading leaf design inspired by the traditional Vanki armlet. The intricate openwork is crafted with both rose and white gold for a modern two-tone effect. Sparkling AAA-grade CZ diamonds are meticulously set throughout, catching the light with every movement. The matching Jhumkas echo the necklace's leaf and circular motif, completing this regal ensemble. The Rose gold plating and the greek patterns on the round shapes near the bottom offer a fusion of traditional and contemporary designs.",
  "colors": [
    "Rose Gold and White Gold with Brilliant Clear Diamond Simulants"
  ],
  "occasions": [
    "Ideal for bridal wear",
    "wedding receptions",
    "grand occasions like Muhurtham",
    "Sangeet",
    "or even upscale modern events where you want to make a statement."
  ],
  "description": "This dazzling necklace set is more than just jewelry; it's a statement of sophisticated elegance. The Vanki-inspired design holds cultural significance, while the modern two-tone gold and sparkling CZ diamonds create a contemporary allure. Lightweight and comfortable, this set allows you to shine without sacrificing comfort. A true conversation starter and a timeless investment.",
  "tags": [
    "Necklace",
    "Haaram",
    "Jhumka",
    "Earrings",
    "Bridal Jewelry",
    "Wedding Set",
    "Diamond Necklace",
    "CZ Diamonds",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Vanki",
    "Reception Jewelry",
    "Rose Gold",
    "White Gold",
    "Indian Wedding",
    "Traditional Jewelry",
    "Modern Jewelry"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0021_0050",
  "collection": "choker"
}