{
  "id": "necklaces-311",
  "title": "Chandrika Diamond Cascade Haaram Set - Unveil the Goddess Within",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "22K Gold",
    "Finest Quality White Diamonds (VVS Clarity",
    "Excellent Cut)",
    "Emeralds",
    "and Rubies. Showcasing the prestigious Hyderabadi Polish for a lustrous and long-lasting sheen."
  ],
  "features": "This magnificent three-layered Haaram features a cascading design of diamond-studded floral motifs. The central pendant showcases a harmonious blend of emeralds and rubies, reflecting prosperity and love. The matching Jhumkas mirror the pendant's elegance, creating a complete and captivating set. The delicate framework showcases exceptional setting techniques, ensuring secure and beautiful gemstone placement. The flexible link chain drapes gracefully and feels comfortable around the neck. The Haaram is carefully designed to look both traditional and modern.",
  "colors": [
    "Predominantly gold and white diamonds",
    "accented with the vibrant greens of emeralds and the passionate reds of rubies. This classic combination evokes timeless elegance and traditional South Indian aesthetics."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagement ceremonies (Vagdanam)",
    "bridal events",
    "festive celebrations (Sankranthi",
    "Diwali)",
    "and significant cultural events. The set is also suitable for high-end modern events and galas",
    "adding a touch of heritage and sophistication."
  ],
  "description": "This Chandrika Diamond Cascade Haaram Set represents a masterful blend of traditional craftsmanship and modern elegance. The high-quality materials ensure lasting beauty and value. It's not just jewelry; it's a statement of heritage, artistry, and personal style. Wear it and make a lasting impression on any special event.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "Gold Jewelry",
    "Emerald",
    "Ruby",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Wedding",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Vaddanam",
    "Kasulaperu",
    "Kante",
    "Jewellery Set",
    "Muhurtham",
    "Seemantham",
    "Half-Saree Function",
    "VVS Clarity",
    "Excellent Cut Diamonds"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0400_0597",
  "collection": "diamond"
}