{
  "id": "bangles-115",
  "title": "Vaishnavi Kundan Kangan: A Symphony of Emeralds, Rubies, and Diamonds",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "Emeralds (Cabochon Cut)",
    "Rubies (Round Cut)",
    "Polki Diamonds",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Kangan features a central medallion design inspired by traditional South Indian art. The medallion showcases a pavé setting of Polki diamonds, meticulously handcrafted to capture maximum brilliance. A captivating emerald cabochon sits at the heart of the medallion, surrounded by a border of vibrant rubies. The bangle itself is adorned with floral motifs and intricate filigree work, exhibiting the renowned craftsmanship of Hyderabad. The Hyderabadi polish gives it a rich, antique-inspired sheen, adding to its timeless appeal.",
  "colors": [
    "Gold (Yellow Gold)",
    "Emerald (Green)",
    "Ruby (Red)",
    "Diamond (White/Champagne)"
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals (like Sankranti",
    "Ugadi)",
    "traditional ceremonies",
    "and grand celebrations. A stunning piece to complete a bride's *muhurtham* ensemble or to add a touch of heritage to any special occasion."
  ],
  "description": "This Kangan is a testament to the enduring beauty of South Indian jewelry. The combination of high-quality gemstones, intricate gold work, and traditional design elements makes it a true heirloom piece. The use of Polki diamonds adds a touch of old-world charm, while the vibrant colors evoke a sense of festivity and prosperity. Its sturdy construction ensures durability, making it a valuable investment for generations to come. The Hyderabadi craftsmanship guarantees a unique piece steeped in history and cultural significance.",
  "tags": [
    "Bangle",
    "Kangan",
    "Kada",
    "Gold Jewelry",
    "Emerald",
    "Ruby",
    "Diamond",
    "Polki Diamond",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Women's Jewelry",
    "Jewelry",
    "Hyderabad"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0266_0466",
  "collection": "diamond"
}