{
  "id": "necklaces-1551",
  "title": "Enchanting Floral Diamond Haaram with Pastel Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18KT Gold",
    "Brilliant Cut Diamonds (estimated 18.81ct NV Fancy Diamonds",
    "7.27ct total diamond weight)",
    "Pink Sapphires",
    "Blue Sapphires",
    "Rice Pearls (6.51ct)",
    "Hyderabadi Polish"
  ],
  "features": "An exquisite floral-themed Haaram featuring a central medallion design with layers of meticulously placed diamonds and pastel-colored sapphires. The floral motifs are intricately crafted with exceptional detail, showcasing the skill of our artisans. The necklace is designed with graduating floral clusters leading to a central pendant, creating a balanced and elegant look. The setting ensures maximum brilliance for the diamonds and enhances the pastel sapphire hues. Rice pearls add a delicate touch.",
  "colors": [
    "Predominantly white (diamonds) with soft pink (sapphires)",
    "deep blue (sapphires)",
    "and a subtle sheen from the rice pearls",
    "set against the warm tone of 18KT gold."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham",
    "Reception)",
    "Seemantham",
    "Half-Saree Function (Langa Voni Function)",
    "or any grand celebration where you desire to make a statement. Also suitable for high-profile social events and parties."
  ],
  "description": "This Haaram is a harmonious blend of traditional South Indian design and contemporary elegance. The floral motifs are not only visually stunning but also represent prosperity and new beginnings, making it an auspicious choice. The high-quality diamonds and pastel sapphires ensure lasting beauty and value. The Hyderabadi polish adds a unique luster, characteristic of our region's finest jewelry. The floral design is a timeless symbol of beauty, making this piece a valuable addition to your heirloom collection.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Floral Design",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Reception",
    "Seemantham",
    "Hyderabadi Jewelry",
    "18KT Gold",
    "Diamond",
    "Sapphire",
    "Rice Pearl",
    "Kantabharanam",
    "కంఠాభరణం"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-30 3_2230",
  "collection": "sjpl"
}