{
  "id": "earrings-066",
  "title": "Emerald Blossom Studs - Pachala Ravva Buggalu",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold (Bangaru)",
    "Natural Emerald (Pachala Ravva) center stone",
    "high-quality Cubic Zirconia (CZ) accents. Crafted with traditional Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "Floral design inspired by South Indian jewelry tradition, featuring a central Emerald gemstone surrounded by meticulously set CZ stones that follow the curves of the floral pattern. Gold work is meticulously crafted, creating depth and texture. The earrings feature a secure screw-back closure for comfortable wear. This design blends traditional motifs with a modern lightweight design, making it suitable for everyday wear.",
  "colors": [
    "Lustrous yellow gold",
    "vibrant green emerald",
    "and sparkling white Cubic Zirconia create a captivating contrast."
  ],
  "occasions": [
    "Perfect for daily wear",
    "festive occasions",
    "small functions",
    "office wear",
    "or as a thoughtful gift. These earrings also complement traditional South Indian attire for events like Upanayanam",
    "Baby Showers",
    "and other celebrations."
  ],
  "description": "These 'Pachala Ravva Buggalu' earrings represent a fusion of tradition and modern elegance. The vibrant emerald center and glittering CZ accents set in rich 22K gold capture the essence of South Indian jewelry craftsmanship. Lightweight and comfortable, they add a touch of sophistication to any outfit. The secure screw-back closures ensure a secure fit, making them ideal for daily wear. Own a piece of heritage with these beautifully crafted studs.",
  "tags": [
    "Earrings",
    "Studs",
    "Buggalu",
    "Emerald",
    "Pachala Ravva",
    "Gold",
    "22K",
    "Cubic Zirconia",
    "CZ",
    "South Indian Jewelry",
    "Hyderabadi Polish",
    "Traditional",
    "Festive",
    "Gift",
    "Bangaru"
  ],
  "original_id": "diamond_jewellery_8b4a7158-46b1-457b-9db3-6e27d6b20148_0155",
  "collection": "diamond"
}