{
  "id": "earrings-177",
  "title": "Rajputana Polki Jhumka - A Royal Fusion",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Natural Diamonds)",
    "Ruby (Manikyam) Faceted Inlay",
    "Emerald (Panna) Beads",
    "Pink Tourmaline Drop. Hyderabadi Polish for lasting luster."
  ],
  "features": "Exquisite craftsmanship featuring a square motif inlaid with a ruby border and a central polki diamond. Adorned with surrounding polki diamonds in a petal-like arrangement, complemented by delicate emerald bead accents above. A teardrop Pink Tourmaline gracefully dangles below. The unique setting highlights the natural brilliance of the polki diamonds and offers a royal appeal. Features a delicate design inspired by traditional Rajput jewelry with a South Indian touch.",
  "colors": [
    "Golden yellow (gold)",
    "Ruby red",
    "Emerald green",
    "Pink Tourmaline",
    "and the ethereal white of the uncut Polki Diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "festive occasions",
    "traditional Telugu ceremonies like seemantham or half-saree functions",
    "and also suitable for adding a touch of elegance to modern evening wear."
  ],
  "description": "This stunning Polki Jhumka seamlessly blends traditional Rajput design with South Indian craftsmanship. The use of uncut polki diamonds highlights their natural beauty and creates a regal look. The Hyderabadi polish ensures lasting brilliance, making this a cherished piece for generations. The intricate detailing and vibrant color combination make it a true statement piece.",
  "tags": [
    "Polki Earrings",
    "Jhumka",
    "Uncut Diamonds",
    "Ruby",
    "Emerald",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Earrings",
    "Bridal Jewelry",
    "Wedding Earrings",
    "చెవి దుద్దులు",
    "Manikyam",
    "Panna",
    "Rajputana",
    "Indian Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_DPER8-988_0322",
  "collection": "diamond"
}