{
  "id": "earrings-277",
  "title": "Floral Cascade Diamond Jhumkas - Adorable Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Finely crafted in gold (estimated based on FG label",
    "purity to be verified upon inquiry)",
    "these jhumkas are embellished with a stunning mix of diamonds and colored gemstones. The total diamond weight is approximately 3.60 carats (586 stones)",
    "complemented by additional stones weighing approximately 1.31 carats (20 stones)",
    "plus another mix weighting 12.06 carats (36 stones). Feature a delicate Hyderabadi polish to enhance the gold's luster and highlight the stones' brilliance."
  ],
  "features": "These jhumkas boast a modern floral design with meticulously placed diamonds and colored gemstones. The cascading flower motif is intricately detailed, showcasing exceptional craftsmanship. Setting styles appear to be a combination of prong and pave settings to ensure the diamonds sparkle brilliantly. The design features a contemporary take on the traditional jhumka silhouette.",
  "colors": [
    "The overall color palette is a harmonious blend of gold",
    "the dazzling white of the diamonds",
    "and the soft hues of pink and yellow/orange gemstones. This combination evokes a sense of sophistication and understated elegance."
  ],
  "occasions": [
    "Perfect for various occasions",
    "from weddings and receptions to festive celebrations and elegant evening events. These jhumkas add a touch of glamour to both traditional Indian attire and modern outfits."
  ],
  "description": "These earrings exemplify a perfect blend of modern design with traditional Indian sensibility. The exceptional craftsmanship, coupled with the use of high-quality diamonds and colored gemstones, ensures that these jhumkas are a treasured piece for generations. Their unique floral cascade design sets them apart, making them a statement piece that exudes sophistication and charm.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Diamond Earrings",
    "Gold Earrings",
    "Floral Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Festive Jewelry",
    "Contemporary Jewelry",
    "Hyderabadi Jewelry",
    "colored Gemstones"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-30-45 2_0950",
  "collection": "diamond"
}