{
  "id": "necklaces-1517",
  "title": "Heera & Pagadam Jadau Haaram: The 'Rajalakshmi' Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "meticulously studded with brilliant-cut Diamonds",
    "vibrant Coral (Pagadam)",
    "and Emerald (Pachala). All gemstones are carefully selected for their clarity and color."
  ],
  "features": "This exquisite three-strand Haaram features intricate Jadau setting techniques, showcasing the rich heritage of Hyderabadi craftsmanship. The pendant showcases delicate filigree work (vankala panulu) and features alternating floral and paisley motifs. The design incorporates cascading Coral and Emerald beads for added elegance. The diamond setting is in the 'kundan' style.",
  "colors": [
    "Predominantly Gold with sparkling White Diamonds",
    "vibrant Red Coral",
    "and lush Green Emeralds. This classic South Indian color palette is considered auspicious."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "engagements (Nischitartham)",
    "and festive celebrations like Diwali and Sankranthi. Also suitable for milestone events such as Seemantham or Half-Saree Function (Langa Voni)."
  ],
  "description": "This 'Rajalakshmi' Haaram is a testament to timeless South Indian elegance. The combination of high-quality materials, meticulous craftsmanship, and traditional design elements makes it a valuable heirloom piece. The Jadau setting ensures both beauty and durability. This piece embodies cultural significance and is perfect for those who appreciate heritage jewelry.",
  "tags": [
    "Haaram",
    "Jadau",
    "Diamond Necklace",
    "Coral",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Necklace",
    "Gold Necklace",
    "22K Gold",
    "Kundan",
    "Wedding Jewelry",
    "Vivaha",
    "Seemantham",
    "Pagadam",
    "Pachala",
    "కంఠాభరణము",
    "సంప్రదాయ హారము",
    "వంకల పనులు"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-40 2_2135",
  "collection": "sjpl"
}