{
  "id": "rings-042",
  "title": "Muthyam & Ruby Vanki Ring - A Timeless Telugu Tradition",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold (approximate)",
    "Natural Rubies (Central cabochon and surrounding stones)",
    "Polki Diamonds (Uncut Diamonds)",
    "Natural Pearls (Muthyam). Features a traditional Hyderabadi Polish for a rich",
    "antique luster."
  ],
  "features": "This exquisite vanki ring showcases a classic floral motif design. The central ruby is surrounded by a halo of polki diamonds, followed by a ring of vibrant rubies and lustrous pearl stones. The open setting maximizes the brilliance of each stone. The floral arrangement echoes traditional Telugu jewelry design principles.",
  "colors": [
    "Predominantly gold",
    "with vibrant red rubies",
    "sparkling white polki diamonds",
    "and iridescent white pearls. The warmth of the gold complements the cool tones of the pearls and the fiery rubies creating a rich and vibrant palette."
  ],
  "occasions": [
    "Perfect for engagements",
    "weddings (especially Telugu weddings)",
    "festivals (like Sankranthi",
    "Diwali",
    "Dasara)",
    "and other special occasions. This ring is a statement piece suitable for both traditional and contemporary attire."
  ],
  "description": "This vanki ring is a unique blend of traditional Telugu craftsmanship and timeless elegance. The use of natural rubies, polki diamonds, and pearls signifies prosperity and good fortune. The Hyderabadi polish gives the ring a vintage charm, making it a valuable heirloom piece to be treasured for generations. The piece showcases the rich jewelry heritage of Andhra Pradesh and Telangana region.",
  "tags": [
    "Ring",
    "Vanki Ring",
    "Ungarala Batti",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Ruby Ring",
    "Pearl Ring",
    "Polki Diamond",
    "Uncut Diamond",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Engagement Ring",
    "Muthyam",
    "Manikyam",
    "Gold Ring",
    "Floral Design",
    "Antique Finish"
  ],
  "original_id": "ear_rings_DPER8-965_2657",
  "collection": "ear"
}