{
  "id": "necklaces-1176",
  "title": "Diamond and Emerald Grand Bridal Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (4288 stones",
    "19.65 dwt)",
    "Emeralds (7 stones",
    "14.26 carats total weight including 1 square emerald",
    "6.57 ct in locket)",
    "Rubies (2 stones",
    "17.01 carats total weight and 1 stone",
    "11.50 in locket)",
    "South Sea Pearls (16 pearls",
    "40.25 carats total weight",
    "5 in locket",
    "12.75carats total weight) with Hyderabadi Polish"
  ],
  "features": "This exquisite Haaram showcases intricate floral motifs crafted with dazzling brilliant cut diamonds. The design is centered around emeralds and includes pear shaped rubies as well, complemented by the soft glow of South Sea Pearls. The necklace features a detachable locket pendant showcasing the same diamond floral design centered around a emerald, mirroring the overall floral design of the necklace. The gold is meticulously finished with our signature Hyderabadi polish.",
  "colors": [
    "Predominantly Gold",
    "White (Diamonds)",
    "Green (Emeralds)",
    "off-white (South Sea Pearls) and touches of red (Rubies). A classic and regal color palette."
  ],
  "occasions": [
    "Perfect for grand bridal occasions such as muhurtham",
    "reception",
    "or any formal Telugu wedding ceremony. Can also be worn for significant family events like seemantham or half-saree functions. Suited for gala events where a statement of elegance is desired."
  ],
  "description": "This Grand Haaram is a true masterpiece of South Indian jewelry artistry. Its impressive size, combined with the exquisite craftsmanship and high-quality gemstones, makes it a timeless heirloom piece. The floral design is intricately made with attention to detail, symbolizing prosperity and good fortune. The addition of emeralds is considered auspicious. The Hyderabadi polish ensures long-lasting brilliance and durability.",
  "tags": [
    "Haaram",
    "Bridal Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Muhurtham Jewelry",
    "Seemantham",
    "Grand Necklace",
    "Traditional Jewelry",
    "Emeralds",
    "Diamonds",
    "Rubies"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-01 2_1728",
  "collection": "sjpl"
}