{
  "id": "necklaces-1460",
  "title": "Exquisite Peacock Kundan Haaram with Emerald Drop - \"Mayura Shobha\"",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously set Kundan stones",
    "Emeralds (oval and teardrop cut)",
    "Amethyst",
    "and CZ stones. Finished with a lustrous Hyderabadi polish to enhance the gold's brilliance."
  ],
  "features": "This stunning Haaram showcases a contemporary twist on traditional Kundan craftsmanship. Features intricately designed peacocks (Mayura) adorned with Kundan stones, flanking a central floral motif of Emeralds and Amethyst. A teardrop-shaped Emerald pendant adds a graceful focal point. Intricate detailing throughout, with delicate gold bead drops enhancing the overall elegance.",
  "colors": [
    "Gold (warm yellow)",
    "Emerald Green",
    "Amethyst Purple",
    "and sparkling White (Kundan and CZ stones). A vibrant yet sophisticated color palette",
    "perfect for South Indian celebrations."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "receptions",
    "Seemantham ceremonies",
    "half-saree functions",
    "and grand festive occasions. Also suitable for high-end social gatherings where you want to make a statement."
  ],
  "description": "A masterful blend of tradition and contemporary design. The peacock motif symbolizes beauty, love, and prosperity – deeply rooted in South Indian culture. High-quality Kundan stones provide a regal sparkle, complemented by the vibrant Emeralds and Amethyst. A valuable investment and a cherished heirloom piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan",
    "Emerald",
    "Amethyst",
    "Peacock Jewelry",
    "Mayura",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Indian Bridal",
    "Traditional Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-53_2078",
  "collection": "sjpl"
}