{
  "id": "necklaces-845",
  "title": "Manikyam Mogra Haaram - Emerald & Diamond Cascading Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color)",
    "Natural Zambian Emeralds (Round Cut",
    "Vivid Green). Features a delicate Hyderabadi Polish for enduring luster."
  ],
  "features": "This exquisite five-layered Mogra Haaram showcases intricate diamond floral motifs interspersed with vibrant Zambian Emeralds. Each layer features a graduated design, with the longest strand cascading gracefully. The floral motifs draw inspiration from traditional Mogra (Jasmine) garlands. Delicate diamond dangles embellish each link, creating mesmerizing movement and sparkle. Features a secure and discreet lobster clasp.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "punctuated by the vivid green of the emeralds. This classic South Indian color combination symbolizes prosperity and auspiciousness."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (Muhurtham)",
    "engagements",
    "receptions",
    "and significant family celebrations (Seemantham",
    "Half-Saree Function). Equally stunning for high-profile modern events and galas."
  ],
  "description": "A timeless masterpiece representing the pinnacle of South Indian jewelry craftsmanship. The combination of high-quality diamonds and natural emeralds creates a dazzling display of opulence. Handcrafted by skilled artisans in Hyderabad, this Haaram is an heirloom piece to be treasured for generations. The Mogra design symbolizes purity, love, and good fortune. The exceptional brilliance of the diamonds and the rich color of the emeralds ensures that you'll be the center of attention.",
  "tags": [
    "Haaram",
    "Mogra Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Necklace",
    "Traditional Jewelry",
    "Manikyam",
    "Pachala",
    "Vaddanam",
    "Kempu",
    "Nakshi",
    "Gold Necklace",
    "22K Gold",
    "Fine Jewelry",
    "Heirloom Jewelry"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0376_1532",
  "collection": "haaram"
}