{
  "id": "necklaces-955",
  "title": "Divya Kanthi Haaram - A Symphony of Emerald, Ruby & Diamond Splendor",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 purity)",
    "High-quality Emerald (Zambian origin",
    "Oval Cut)",
    "Natural Ruby (Oval Cut)",
    "Dazzling Cubic Zirconia (CZ)",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Haaram seamlessly blends traditional South Indian artistry with a contemporary aesthetic. The intricately designed pendant showcases a vibrant Emerald at its heart, surrounded by delicate CZ settings and interspersed with Rubies. The necklace chain features a delicate floral design, each petal encrusted with sparkling CZs. Features a classic 'Lakshmi Kasu' design inspiration. Beautifully crafted golden beads dangle from the pendant, adding a touch of playful elegance. The piece is finished with a signature Hyderabadi polish, ensuring a lasting luster and durability.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "and Brilliant White (CZ)"
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "festive celebrations (like Sankranthi",
    "Diwali)",
    "or any special occasion where you want to radiate elegance and cultural pride. Also suitable for modern events",
    "complementing both traditional sarees and contemporary attire."
  ],
  "description": "A truly unique piece that embodies the rich heritage of South Indian jewelry while appealing to modern sensibilities. The combination of emerald, ruby, and CZ creates a striking visual appeal. The exceptional craftsmanship and high-quality materials ensure lasting beauty and value. This Haaram is more than just jewelry; it's a statement of timeless elegance and cultural appreciation. Invest in a heirloom piece that will be cherished for generations to come.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Emerald Necklace",
    "Ruby Necklace",
    "CZ Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Ethnic Jewelry",
    "Bharatiya Abharanamulu",
    "Andhra Natyam Jewelry",
    "Green Stone Necklace",
    "Red Stone Necklace"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0349_2416",
  "collection": "necklace"
}