{
  "id": "necklaces-117",
  "title": "The 'RatnaJyothi' Ruby and Emerald Haaram: A Legacy of South Indian Splendor",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Burmese Rubies (Oval Cabochon)",
    "Zambian Emerald (Carved Square)",
    "Brilliant-Cut Diamonds (VS Clarity",
    "G Color). Features a rich Hyderabadi Polish for enduring luster."
  ],
  "features": "This stunning Haaram features a graduating design with meticulously bezel-set oval Burmese rubies, each surrounded by a halo of sparkling diamonds. The focal point is a large, intricately carved Zambian emerald, also framed by diamonds, creating a captivating centerpiece. The emerald's carving features delicate floral motifs, showcasing exquisite craftsmanship. The necklace is connected with diamond-studded connectors, adding to its brilliance and flexibility.",
  "colors": [
    "Rich Gold",
    "Deep Crimson Rubies",
    "Vivid Green Emerald",
    "and Sparkling White Diamonds."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha)",
    "engagements (Nischayathartham)",
    "Seemantham ceremonies",
    "or any event where you want to make a statement of timeless elegance. Also suitable for contemporary high-profile events."
  ],
  "description": "A true heirloom piece, this Haaram embodies South Indian artistry with a modern sensibility. The combination of vibrant rubies, a unique carved emerald, and dazzling diamonds creates a breathtaking effect. The Hyderabadi polish ensures long-lasting shine. This piece is not just jewelry; it's an investment in cultural heritage and timeless beauty.",
  "tags": [
    "Haaram",
    "Necklace",
    "Ruby",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Nakshi",
    "Antique Finish",
    "Ratnalu",
    "Bangaram"
  ],
  "original_id": "diamond_jewellery_DPNK8-1557_0350",
  "collection": "diamond"
}