{
  "id": "necklaces-938",
  "title": "Lakshmi Kasula Haaram: Temple Jewelry Necklace with Ruby and Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Burmese Rubies",
    "Zambian Emeralds",
    "Cultured Pearls",
    "High Quality Cubic Zirconia (CZ). Meticulously crafted with Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite Kasula Haaram features a central Lakshmi pendant, intricately detailed with traditional Nakshi work. The design incorporates floral motifs and peacock designs encrusted with dazzling CZ stones. Accented with vibrant Burmese Rubies and Zambian Emeralds in a classic South Indian color palette. The necklace is strung with graduated gold beads and delicate cultured pearls, adding a touch of elegance and refinement. The adjustable dori (cord) ensures a comfortable and secure fit.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Emerald Green",
    "Pearl White. A timeless combination symbolizing prosperity and auspiciousness."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "engagement ceremonies (Nischayalu)",
    "festivals like Diwali and Sankranthi",
    "and traditional functions like Seemantham (baby shower) or half-saree functions (Langa Voni Function). Also perfect as a statement piece for upscale events."
  ],
  "description": "Embrace timeless elegance with this stunning Lakshmi Kasula Haaram. Handcrafted by skilled artisans, this necklace embodies South Indian heritage and tradition. The vibrant gemstones, lustrous pearls, and intricate Nakshi work create a truly captivating piece. Its adjustable design ensures comfort, while its symbolic significance makes it a cherished heirloom. Invest in a piece that reflects your cultural pride and adds a touch of regal charm to any ensemble. Represents the blessings of Goddess Lakshmi, bestowing prosperity and good fortune.",
  "tags": [
    "Kasula Haaram",
    "Lakshmi Pendant",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Gold Necklace",
    "Ruby Emerald Necklace",
    "Nakshi Work",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Seemantham Jewelry",
    "Langa Voni",
    "Vivahaalu",
    "Nischayalu",
    "22K Gold",
    "CZ Jewelry",
    "Divine",
    "Ethnic Jewelry",
    "Ethnic Haaram",
    "Pachi work"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0332_2399",
  "collection": "necklace"
}