{
  "id": "earrings-647",
  "title": "Emerald Blossom Jhumka - Jadau Kundan Style",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Finish Alloy",
    "Simulated Emerald",
    "Cubic Zirconia (CZ)",
    "Freshwater Pearls."
  ],
  "features": "Inspired by vintage Jadau Kundan jewelry, these jhumkas feature intricate floral patterns set with sparkling CZ stones. A rich simulated emerald is placed at the center of the floral stud, lending an aristocratic touch. Delicate pearls line the base, adding a soft, feminine appeal. The design echoes traditional Telugu temple jewelry (దేవాలయ నమూనా), updated with modern sensibilities. Features detailed flower cut-out work on the jhumka dome.",
  "colors": [
    "Predominantly gold and white (CZ)",
    "with a striking emerald green accent and soft pearl white."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "receptions",
    "festivals like Ugadi (ఉగాది) or Sankranthi (సంక్రాంతి)",
    "Seemantham (సీమంతం) and other traditional South Indian celebrations. Can also be paired with contemporary outfits for a fusion look at parties or formal events."
  ],
  "description": "These Emerald Blossom Jhumkas are a timeless addition to any jewelry collection. The combination of traditional design elements with high-quality simulated gemstones ensures a luxurious look without the high price point of authentic Kundan. The pearls add a touch of grace and sophistication, while the simulated emerald brings a pop of color. These jhumkas are durable, exquisitely crafted, and will add a touch of Telugu cultural heritage to any ensemble.",
  "tags": [
    "Jhumka",
    "Jumka",
    "Earrings",
    "Kundan Style",
    "Jadau",
    "Emerald",
    "CZ",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal",
    "Ethnic",
    "Traditional",
    "Ethnic Earrings",
    "Fashion Earrings",
    "Jewelry",
    "accessories",
    "mmakaalu"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 8_2224",
  "collection": "sjpl"
}