{
  "id": "necklaces-1187",
  "title": "Emerald Radiance: Diamond & Gemstone Nakshi Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Hyderabadi Polish)",
    "Brilliant Cut Diamonds (estimated SI Clarity)",
    "Emeralds (faceted cut",
    "approx 5.55ct total)",
    "South Sea Pearls (approx 28.75ct total for main haaram",
    "23.93 for locket detailing)."
  ],
  "features": "This exquisite Haaram showcases intricate Nakshi work featuring peacock motifs, symbolizing beauty and grace. The necklace is embellished with a line of emeralds set amidst a bed of brilliant-cut diamonds. The pendant features a paisley design (Buta design) with pearls dangling delicately to add a touch of softness. This piece uses a closed setting (kundan style) for gemstones providing extra luster.",
  "colors": [
    "Primary color is gold with the vivid green of the emeralds. The diamonds add sparkle and brilliance in white",
    "and the South Sea pearls provide a lustrous creamy white contrast."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivahaalu)",
    "receptions",
    "Seemantham (baby shower)",
    "and important cultural festivals. This piece is also suitable for high-end formal events where a touch of traditional elegance is desired."
  ],
  "description": "This grand Haaram is a statement piece of exquisite craftsmanship, marrying traditional Nakshi work with the modern brilliance of diamonds and the timeless elegance of pearls. It holds significant cultural value, representing prosperity and good fortune. The high-quality gold and gemstones ensure lasting beauty and investment value. Hyderabadi Polish will maintain luster for years to come with proper care.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Nakshi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "South Sea Pearls",
    "Kundan Setting",
    "Buta Design",
    "Peacock Motif",
    "Hyderabadi Jewelry",
    "gold",
    "earrings",
    "pendant"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-09_1739",
  "collection": "sjpl"
}