{
  "id": "necklaces-729",
  "title": "Emerald Diamond Jadau Haaram - The \"Aaradhana\" Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base",
    "meticulously crafted with uncut diamonds (Polki/Jadau) and vibrant Zambian Emeralds. Features fine quality pearls. Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "A classic four-strand haaram showcasing exquisite Jadau craftsmanship. The central pendant boasts intricate floral and paisley motifs, accented with a central Emerald cut gemstone. Delicate Emerald drops enhance the pendant's elegance. The setting is a blend of traditional pacheli and contemporary prong settings to ensure the diamonds sparkle brilliantly. The neckline features a delicate diamond and emerald accent.",
  "colors": [
    "Gold (yellow)",
    "Emerald (green)",
    "Diamond (white/clear)",
    "Pearl (white)"
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "bridal wear",
    "and grand celebrations. A statement piece for any festive occasion or formal event."
  ],
  "description": "This Haaram represents the pinnacle of Hyderabadi Jadau artistry. The use of uncut diamonds and Zambian Emeralds highlights its luxurious appeal. Its heirloom quality ensures it can be treasured for generations. The harmonious blend of traditional design with a contemporary feel makes it a truly unique and timeless piece. Represents prosperity, good luck, and lasting beauty. Durability guaranteed due to the meticulous craftsmanship and high-quality materials.",
  "tags": [
    "Haaram",
    "Jadau",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "కంఠహారం",
    "ముహూర్తం",
    "సీమంతం",
    "Polki",
    "Zambian Emeralds",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-31_1235",
  "collection": "diamond"
}