{
  "id": "necklaces-983",
  "title": "Diamond Ruby Floral Nakshi Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow and White Gold",
    "Natural Round Brilliant Cut Diamonds (VS Clarity",
    "G-H Color)",
    "Natural Ruby Cabochons. Crafted with meticulous care using traditional Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite haaram features an intricate floral design, meticulously crafted with sparkling diamonds. The classic Nakshi work (నక్షి పని) detailing adds a touch of traditional South Indian artistry. The two prominent floral pendants are accented by rich, red ruby cabochons, creating a captivating focal point. The articulated design ensures a comfortable and elegant drape.",
  "colors": [
    "Yellow Gold",
    "White Gold",
    "Brilliant White Diamonds",
    "and Deep Red Rubies."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements",
    "grand receptions",
    "and important cultural celebrations like Seemantham (సీమంతం)",
    "Half-Saree function (లంగా ఓణి వేడుక). Also a sophisticated statement piece for high-end social events."
  ],
  "description": "A harmonious blend of traditional South Indian artistry and contemporary diamond jewelry design. The brilliance of the diamonds, combined with the rich color of the rubies, creates a stunning and unforgettable look. Invest in a timeless piece that can be passed down as a treasured heirloom. The excellent craftsmanship and high-quality materials ensure lasting beauty and value.",
  "tags": [
    "Diamond Haaram",
    "Ruby Necklace",
    "Nakshi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Fine Jewelry",
    "కంఠాభరణము",
    "నక్షి పని",
    "పెళ్ళి నెక్లెస్",
    "Hyderabadi Jewelry",
    "Floral Necklace",
    "Statement Necklace",
    "Diamond Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0435_2304",
  "collection": "necklace"
}