{
  "id": "necklaces-643",
  "title": "Emerald Cascade Haaram - A Regal Embrace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Yellow Gold with a Hyderabadi Polish. Adorned with vibrant",
    "pear-shaped Emeralds of exceptional clarity and brilliant-cut Diamonds. Setting is prong and pave."
  ],
  "features": "This exquisite necklace features a cascading design, resembling a waterfall of emeralds and diamonds. The delicate diamond foliage motif adds a touch of nature-inspired elegance. The prong setting showcases the emeralds' vibrant green color, while the pave-set diamonds provide maximum sparkle. The necklace blends traditional Haaram elements with modern design sensibilities.",
  "colors": [
    "The color palette is dominated by the rich green of the Emeralds",
    "complemented by the sparkling white of the Diamonds and the warm yellow of the 18K Gold."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaaham)",
    "receptions",
    "and high-profile events. Also suitable for formal dinners and cocktail parties. A statement piece for the modern bride or anyone seeking to make a lasting impression."
  ],
  "description": "This Emerald Cascade Haaram is a masterpiece of craftsmanship, showcasing the finest emeralds and diamonds. Its unique design seamlessly blends traditional and contemporary elements, making it a versatile piece for any occasion. The Hyderabadi polish gives the gold a rich, lustrous finish that will last for generations. Own a piece of timeless elegance and make a statement wherever you go.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Wedding Jewelry",
    "Contemporary Design",
    "Bridal Jewelry",
    "Green",
    "Gemstone",
    "Luxury",
    "Fine Jewelry",
    "Statement Necklace",
    "Indian Jewelry",
    "Jadau",
    "Bridal Haaram"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-18_1149",
  "collection": "diamond"
}