{
  "id": "necklaces-939",
  "title": "Diamond Polki Kasulaperu Haaram with Ruby & Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-quality Alloy",
    "expertly plated with Gold Finish. Adorned with dazzling Polki Diamonds",
    "genuine Ruby and Emerald gemstones. Features delicate South Sea Pearls",
    "and finished with a radiant Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite Kasulaperu Haaram features a classic three-strand design, with each strand meticulously embellished with floral Diamond Polki motifs. The central pendant showcases an elaborate flower design, featuring ruby and emeralds that complement the shimmering diamonds. Delicate South Sea pearl drops add a touch of traditional elegance. The flower and vine design elements reflect the rich heritage of South Indian jewelry design.",
  "colors": [
    "Predominantly golden with the sparkle of diamonds",
    "accented by the vibrant red of the rubies and the lush green of the emeralds. The white South Sea pearls add a soft",
    "luxurious contrast."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "bridal wear",
    "and traditional South Indian festivals like Ugadi (ఉగాది) and Sankranthi (సంక్రాంతి). Also suitable for special occasions like anniversaries or cultural events. A statement piece for any grand celebration."
  ],
  "description": "This Kasulaperu Haaram is a timeless heirloom piece, blending traditional South Indian design with modern elegance. The high-quality gold polish ensures lasting beauty and durability. The genuine polki diamonds offer exceptional brilliance and sparkle, making this necklace a true showstopper. Its versatile design ensures it complements both traditional and contemporary outfits.",
  "tags": [
    "Kasulaperu",
    "Haram",
    "Necklace",
    "Polki Diamonds",
    "Ruby",
    "Emerald",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Pelli",
    "Muhurtham",
    "కసులపేరు",
    "హారం",
    "పెళ్లి"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0333_2400",
  "collection": "necklace"
}