{
  "id": "necklaces-001",
  "title": "Enchanting Floral Diamond Grand Haaram Set with Matching Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Yellow and White Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color). Features a signature Hyderabadi Polish for exceptional luster and durability."
  ],
  "features": "A breathtaking floral motif forms the core of this Grand Haaram, intricately handcrafted with individual petal-shaped settings. The repeating patterns evoke traditional South Indian designs, while the modern geometric links add a contemporary flair. The matching Jhumkas mirror the necklace's design, ensuring a cohesive and luxurious ensemble. Delicate teardrop-shaped dangles add movement and sparkle.",
  "colors": [
    "Two-Tone Gold: The warm yellow gold provides a classic base",
    "while the white gold accents highlight the brilliance of the diamonds. The diamonds themselves are colorless (E-F range)."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaaham/Pelli)",
    "receptions",
    "or milestone celebrations. A statement piece ideal for brides or anyone looking to make a lasting impression. Also suitable for high-end cultural events and galas."
  ],
  "description": "This stunning necklace set showcases exceptional craftsmanship and blends traditional design elements with a modern aesthetic. The use of high-quality diamonds and 18K gold ensures lasting value and brilliance. Its intricate detailing and exquisite finish make it a true heirloom piece, a symbol of timeless elegance and refined taste. The Hyderabadi Polish guarantees exceptional shine and resistance to wear, ensuring it remains a cherished possession for generations.",
  "tags": [
    "Haaram",
    "Necklace Set",
    "Jhumkas",
    "Earrings",
    "Diamond Jewelry",
    "18K Gold",
    "Yellow Gold",
    "White Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Pelli",
    "Grand Necklace",
    "Floral Design",
    "Fine Jewelry",
    "Contemporary Jewelry",
    "Vaddanam"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0007_0036",
  "collection": "choker"
}