{
  "id": "necklaces-1076",
  "title": "Polki Diamond and Emerald Kasu Mala Style Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Uncut Polki Diamonds (వజ్రాలు)",
    "Natural Emerald (పచ్చ)",
    "Hyderabadi Polish for a lasting lustre. Gold Purity is Assured."
  ],
  "features": "This exquisite Haaram showcases the beauty of uncut Polki diamonds, set in a traditional Kasu Mala style. The design incorporates symmetrical placement of square polki diamond 'coins' leading to a larger pendant with a central emerald stone. The pendant features a floral halo of smaller, round polki diamonds surrounding the vibrant green emerald. The necklace strand is composed of two rows of smaller polki stones, linked for comfortable wear. The overall antique finish adds a touch of old-world charm.",
  "colors": [
    "Dominant hues include the warm yellow of the 22K gold",
    "the sparkling white of the Polki diamonds",
    "and the rich green of the central Emerald. The colour contrast gives the jewellery a luxurious and regal look."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (పెళ్లి)",
    "receptions",
    "milestone birthday celebrations",
    "and important religious ceremonies. This piece is suitable for brides (వధువు) during the muhurtham (ముహూర్తం) and for expectant mothers during Seemantham (సీమంతం). It adds elegance to any special occasion."
  ],
  "description": "This Haaram blends the richness of tradition with sophisticated design. The use of uncut Polki diamonds ensures a unique sparkle, while the Emerald pendant adds a touch of regal elegance. Its superior craftsmanship and high-quality materials guarantee durability and timeless beauty. Owning this piece signifies an appreciation for cultural heritage and a statement of refined taste.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Polki Diamonds",
    "Emerald",
    "South Indian Jewellery",
    "Telugu Jewellery",
    "Wedding Jewellery",
    "Bridal Jewellery",
    "Heritage Jewellery",
    "Hyderabad Jewellery",
    "Kanthaabharanam",
    "Vaddanam",
    "Antique Finish",
    "Temple Jewellery",
    "Traditional Jewellery",
    "Diamond Necklace"
  ],
  "original_id": "radhe_diam_DPNK8-1610_2489",
  "collection": "radhe"
}