{
  "id": "earrings-111",
  "title": "Divya Kanakapushpa Jhumkas: Golden Blossom Earrings with Ruby Accents",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Swarna) with Hyderabadi Polish. Adorned with high-quality Cubic Zirconia (CZ) and Ruby (Ratna) accents."
  ],
  "features": "Classic bell-shaped Jhumka design featuring intricate filigree work and delicate floral motifs. The top design has floral motifs around the rubies. The Jhumka bell is accented with sparkling Cubic Zirconia stones. The bottom of the jhumkas feature gold bead dangles, adding movement and a playful charm.",
  "colors": [
    "Predominantly golden (bangaru)",
    "with a striking contrast created by the vibrant red rubies and the dazzling white Cubic Zirconia stones."
  ],
  "occasions": [
    "Perfect for traditional South Indian celebrations such as weddings (pellilu)",
    "festivals (pandugalu)",
    "and special occasions like Seemantham or Half-Saree Function (Langa Voni Function). Also suitable for contemporary events where you want to add a touch of ethnic elegance."
  ],
  "description": "These Jhumkas are a timeless representation of South Indian jewelry artistry. The high-quality 22K gold and meticulous craftsmanship ensure durability and lasting beauty. The combination of rubies, CZ, and intricate filigree makes this a truly unique piece, blending tradition with modern sparkle. The Hyderabadi polish gives it a luxurious shine and premium finish.",
  "tags": [
    "Jhumka",
    "Chellikalu",
    "Gold Earrings",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Ruby",
    "Ratna",
    "Cubic Zirconia",
    "CZ",
    "Hyderabadi Polish",
    "Telugu Jewelry",
    "Indian Earrings",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Ethnic Earrings",
    "Bridal Jewelry",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_d8e24d64-ffc1-42de-938c-da39ee443ab0_0213",
  "collection": "diamond"
}