{
  "id": "earrings-492",
  "title": "Heera-Moti Chandbali - Polki Diamond and Pearl Ear Pendant",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Natural Pearls",
    "Emerald Beads. The gold showcases a delicate Hyderabadi Polish for lasting luster."
  ],
  "features": "This Chandbali features an intricate crescent moon shape meticulously adorned with uncut Polki diamonds (Heera). The design incorporates traditional South Indian craftsmanship, enhanced by delicate emerald bead and pearl (Moti) drops. The setting highlights the natural beauty of the Polki diamonds. Each pearl is carefully selected for its luster and shape.",
  "colors": [
    "Warm Gold",
    "Sparkling White (Polki Diamonds)",
    "Lush Green (Emerald Beads)",
    "and Iridescent White (Pearls). This color combination embodies classic South Indian elegance."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "festivals (like Sankranthi and Ugadi)",
    "and special occasions like Seemantham or Half-Saree functions. Also suitable for adding a touch of heritage to modern celebrations."
  ],
  "description": "This Chandbali showcases authentic South Indian artistry with genuine Polki diamonds. Its timeless design ensures it remains a cherished heirloom for generations. The combination of diamonds, pearls, and emeralds symbolizes prosperity, purity, and new beginnings. The Hyderabadi polish guarantees enduring shine and protection.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Polki Diamonds",
    "Uncut Diamonds",
    "Heera",
    "Moti",
    "Pearls",
    "Emeralds",
    "Pachi Work",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Festive Jewelry",
    "Ethnic Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Antique Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1586_2619",
  "collection": "ear"
}