{
  "id": "earrings-063",
  "title": "Kundan Emerald Flora Studs - \"Pachala Poolu\"",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold (916 Gold) with Kundan Setting. Features vibrant green Emeralds (Pachalu) and sparkling Cubic Zirconia (CZ) stones. Boasts a premium Hyderabadi polish for enhanced luster and durability."
  ],
  "features": "Intricate floral (poolu) design with a central cluster of emeralds surrounded by a halo of brilliantly cut Cubic Zirconia. The Kundan setting, a traditional Indian gem-setting technique, adds a touch of regal elegance. Delicate petal-like arrangement of CZs and gold creates a modern yet timeless appeal. The back features a sturdy screw-back post for comfortable and secure wear.",
  "colors": [
    "Predominantly yellow gold",
    "accented by the vivid green of the emeralds and the dazzling white of the Cubic Zirconia."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "festive occasions",
    "weddings",
    "or gifting. The subtle yet elegant design makes it suitable for both traditional and modern ensembles. Ideal for events like sangeet",
    "mehendi",
    "or as a treasured gift for a special someone."
  ],
  "description": "These Kundan Emerald Studs are a harmonious blend of traditional craftsmanship and contemporary design. The use of high-quality materials ensures lasting beauty and value. The vibrant emeralds symbolize prosperity and good fortune (Subham), making this piece a meaningful addition to any jewelry collection. Crafted with meticulous attention to detail in Hyderabad, known for its rich jewelry heritage. A perfect embodiment of grace and timeless elegance.",
  "tags": [
    "Kundan Jewelry",
    "Emerald Earrings",
    "Gold Studs",
    "Indian Earrings",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Pachalu Poolu",
    "Kundan Poolu",
    "Wedding Jewelry",
    "Festive Earrings",
    "Traditional Jewelry",
    "CZ Studs",
    "Hyderabadi Polish"
  ],
  "original_id": "diamond_jewellery_83d3c814-f0b0-4db0-8300-4b75ade3b47c_0150",
  "collection": "diamond"
}