{
  "id": "necklaces-1058",
  "title": "Emerald & Polki Diamond Vanki Necklace - Shobha Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (Zambian origin",
    "round and pear cut)",
    "Polki Diamonds (uncut diamonds)",
    "Hyderabadi Polish"
  ],
  "features": "A stunning Vanki style necklace featuring a floral motif with emeralds and polki diamonds. The necklace has a central pendant of a slightly smaller floral motif which is also decorated by emeralds and uncut diamonds. The design is inspired by traditional Vanki armlets, adapted into a necklace. Features a delicate branch-like structure connecting the two floral pieces, highlighting the setting of the pear-shaped diamonds. The setting is designed to maximize the brilliance of the polki diamonds and the vibrant green of the emeralds.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and White (from the Polki Diamonds). The gold provides a warm",
    "traditional backdrop enhancing the vibrancy of the green emeralds and the subtle shine of the polki."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and traditional South Indian ceremonies like Seemantham",
    "Half-Saree Functions",
    "and Muhurtham. Also suitable for formal evening events where you want to showcase a blend of tradition and modern elegance."
  ],
  "description": "This unique Vanki Haaram is a modern take on a classic South Indian design. The combination of vibrant emeralds and uniquely shaped polki diamonds creates a statement piece. The Hyderabadi polish adds a touch of regal sophistication. A testament to impeccable craftsmanship and timeless design, offering both cultural significance and enduring value.",
  "tags": [
    "Vanki",
    "Haaram",
    "Necklace",
    "Emerald",
    "Polki Diamond",
    "Uncut Diamond",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Muhurtham",
    "Half Saree Function",
    "Pachala Haaram",
    "Polki Haaram"
  ],
  "original_id": "radhe_diam_DPNK8-1446_2471",
  "collection": "radhe"
}