{
  "id": "earrings-609",
  "title": "Enchanting Kusuma Jhumka - Floral Gemstone Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base metal with gold plating",
    "intricately set with mix of multi-colored gemstones and pearls. Features a delicate array of colorful gemstones",
    "including what appears to be sapphire and ruby",
    "accented by lustrous pearl moti. The earrings use a Hyderabadi-inspired finish to enrich the gold's tone."
  ],
  "features": "These designer jhumkas embody a contemporary floral design, featuring a cascading arrangement of floral motifs set with colorful gemstones. The delicate metal framework mimics the natural curves of flower stems, creating a sense of organic beauty. The stones are expertly set to maximize their brilliance and color, reflecting light with every movement.",
  "colors": [
    "Multi-colored gemstones with a palette of pink",
    "blue",
    "orange",
    "red",
    "and yellow",
    "contrasted with the golden sheen of the metal and pearl iridescence."
  ],
  "occasions": [
    "Perfect for both traditional celebrations and modern events. Ideal for weddings",
    "festivals like Diwali or Sankranti",
    "evening galas",
    "or as a statement piece for special occasions. Also suitable for Seemantham or half-saree functions."
  ],
  "description": "These earrings are a unique fusion of traditional South Indian aesthetics with a modern design sensibility. The intricate craftsmanship and the vibrant combination of gemstones and pearls create a captivating piece that is sure to turn heads. They represent a timeless investment in fine jewelry, perfect for those who appreciate both beauty and cultural heritage.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Floral Jewelry",
    "Gemstone Jewelry",
    "Pearl Jewelry",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Designer Earrings",
    "Temple Jewelry",
    "Moti"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-30-48 2_1828",
  "collection": "sjpl"
}