{
  "id": "necklaces-893",
  "title": "Devi Lakshmi Temple Haaram with Ruby and Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Cubic Zirconia (CZ)",
    "Ruby Cabochons",
    "Emerald",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Haaram features a traditional temple design pendant intricately crafted with a Devi Lakshmi motif. The pendant is encircled with sparkling CZ stones, further enhanced by ruby cabochon accents and a single emerald stone at the top. Gold bead dangles add movement and charm. The necklace chain itself features a unique floral pattern, enhanced with CZs and rubies. Features of Nakshi Work and traditional Telugu craftsmanship techniques.",
  "colors": [
    "Golden Yellow (Gold)",
    "Red (Ruby)",
    "Green (Emerald)",
    "White (CZ)"
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "festivals (like Diwali or Ugadi)",
    "religious ceremonies",
    "and traditional South Indian celebrations (Seemantham",
    "Half-Saree Function). Also suitable for high-end modern events where a touch of heritage is desired."
  ],
  "description": "Embrace divine elegance with this Lakshmi Haaram. The intricate temple design and vibrant gemstone accents make it a timeless heirloom piece. Handcrafted by skilled artisans in Hyderabad using traditional techniques, this necklace embodies cultural significance and unparalleled craftsmanship. The Hyderabadi polish ensures lasting brilliance and radiance. This piece is a symbol of prosperity and good fortune, making it the perfect gift for a loved one or a cherished addition to your own collection.",
  "tags": [
    "Haaram",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Lakshmi Pendant",
    "Ruby Necklace",
    "Emerald Necklace",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Muhurtham Jewelry",
    "Traditional Necklace",
    "Devotional Jewelry",
    "Nakshi Work",
    "CZ Jewelry",
    "Kasulaperu",
    "Gundla Mala",
    "Addigai"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0283_2354",
  "collection": "necklace"
}