{
  "id": "earrings-350",
  "title": "Azure Bloom Jhumka: Neelam and Diamond Cascade",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18 Karat Gold. Features captivating Neelam (Sapphire) gemstones",
    "totaling 2.04 carats",
    "paired with brilliant-cut diamonds",
    "weighing 0.77 carats (D-MQ clarity). Also",
    "6.02 carats Blue stones. Features a lustrous Hyderabadi polish for lasting radiance."
  ],
  "features": "A modern interpretation of the classic Jhumka, with a floral-inspired design. A cabochon Neelam sits atop a cluster of intricately set diamonds. The lower portion showcases a pear-shaped, bezel-set blue stone surrounded by diamond leaves, reminiscent of traditional South Indian motifs but with a contemporary flair.",
  "colors": [
    "Predominantly azure and white",
    "with the rich blue of the Neelam and the sparkling white of the diamonds against the warm glow of the 18K gold."
  ],
  "occasions": [
    "Perfect for engagements",
    "parties",
    "or festive occasions. Adds a touch of modern elegance to traditional attire",
    "making it suitable for events like weddings",
    "receptions",
    "or milestone celebrations."
  ],
  "description": "Exquisite craftsmanship combines traditional South Indian artistry with modern design sensibilities. The captivating Neelam gemstones and sparkling diamonds create a mesmerizing effect, ensuring you stand out. The earrings are lightweight and comfortable for extended wear, and the high-quality materials ensure durability and lasting beauty.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Neelam",
    "Sapphire",
    "Diamonds",
    "18K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Design",
    "Azure",
    "Floral",
    "Festive",
    "Wedding Jewelry",
    "engagement",
    "party",
    "reception",
    "gemstone earrings",
    "traditional",
    "partywear",
    "festivejewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-52_1398",
  "collection": "diamond"
}