{
  "id": "necklaces-800",
  "title": "Floral Symphony Haaram - A Modern Take on Traditional Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold. Features meticulously set Pink Sapphires",
    "Blue Sapphires",
    "Green Tourmalines",
    "Yellow Sapphires and brilliant-cut Diamonds. Total gross weight 97.090 grams with GH color. Features 8.13 carats of diamond with a total of 70 fancy diamonds"
  ],
  "features": "This statement necklace features a floral motif design, with each flower intricately crafted using a variety of colored sapphires and tourmalines and white diamonds. The rose gold setting provides a warm and romantic backdrop to the gemstone’s cool hues. The design beautifully merges modern aesthetics with traditional South Indian Haaram elements of layering and elaborate craftsmanship. Delicate Milgrain detailing accentuates the floral contours.",
  "colors": [
    "Rose Gold with a pastel palette of Pink",
    "Blue",
    "Green and Yellow Sapphires",
    "accented by the brilliance of White Diamonds."
  ],
  "occasions": [
    "Perfect for a modern bride or for making a statement at festive occasions like weddings",
    "receptions",
    "or a grand Sangeet ceremony. Also suitable for high-end parties and celebrations."
  ],
  "description": "This Haaram is a captivating fusion of traditional design and modern sensibilities, making it a truly unique piece. The use of high-quality gemstones and expert craftsmanship ensures lasting beauty and value. It's a statement piece that reflects both cultural heritage and contemporary style.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Rose Gold",
    "Sapphires",
    "Tourmalines",
    "Diamonds",
    "Floral Design",
    "Modern Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-48 3_1393",
  "collection": "diamond"
}