{
  "id": "necklaces-1125",
  "title": "Tourmaline Splendor: Contemporary Haaram with a Traditional Heart",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 hallmark)",
    "High-Quality Tourmaline (Mixed Hues: Green",
    "Pink",
    "Purple)",
    "Polki Diamonds (Uncut Diamonds)",
    "Expertly Crafted Hyderabadi Polish."
  ],
  "features": "A modern take on the classic Haaram, this necklace features a delightful color palette of Green, Pink and Purple tourmalines. The tourmalines are masterfully set with Polki diamonds in a floral-inspired design that is both striking and elegant. The graduated pendant design with a central square cut stone and teardrop-shaped stone ensures a bold yet sophisticated look. The piece showcases exceptional Hyderabadi craftsmanship, blending traditional techniques with contemporary sensibilities.",
  "colors": [
    "Gold",
    "Green",
    "Pink",
    "Purple",
    "White (Polki Diamonds)."
  ],
  "occasions": [
    "Ideal for modern brides",
    "reception wear",
    "engagement ceremonies",
    "and upscale social events. Can be paired with Kanjeevaram silk sarees or contemporary gowns for a striking look."
  ],
  "description": "This necklace is a statement piece that seamlessly blends tradition and modernity. The use of high-quality, multi-colored tourmalines makes it truly unique. The Polki diamonds add a touch of regal charm, and the impeccable craftsmanship ensures that it will be treasured for generations to come. The Hyderabadi polish enhances the gold's natural luster, creating a timeless appeal.",
  "tags": [
    "Haaram",
    "Necklace",
    "Tourmaline",
    "Polki",
    "Diamonds",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Contemporary",
    "Traditional",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Gemstone Necklace",
    "Gold Necklace",
    "Jadau Jewelry"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0021_2539",
  "collection": "radhe"
}