{
  "id": "necklaces-374",
  "title": "Divine Kundan Haaram Set with Emerald, Ruby, and Pearls - A Timeless Heirloom",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Crafted in high-quality gold-plated alloy",
    "intricately set with brilliant-cut Kundan stones. Features an oval-cut emerald (pachcha) at the center",
    "a pear-shaped ruby (ratan) pendant",
    "and lustrous freshwater pearls. Finished with a Hyderabadi polish for enduring shine."
  ],
  "features": "This exquisite haaram showcases the traditional Kundan setting technique, where uncut diamonds (Kundan) are meticulously embedded in gold foil. The design incorporates floral motifs along the necklace chain and pendant. A central emerald is framed by Kundan, while the ruby pendant adds a vibrant contrast. Delicate pearl drops enhance the overall elegance. The maang tikka (chutti) echoes the necklace design, completing the set.",
  "colors": [
    "Predominantly gold and white (Kundan)",
    "accented by the vivid green of the emerald",
    "the rich red of the ruby",
    "and the soft ivory of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (Pelli)",
    "engagements",
    "bridal wear",
    "grand celebrations",
    "and traditional functions like Seemantham",
    "half-saree function (Voni Function)",
    "and festivals."
  ],
  "description": "This Kundan Haaram set is a true masterpiece, combining traditional craftsmanship with timeless design. The use of high-quality materials and meticulous artistry ensures a piece of lasting beauty and value. The classic combination of emerald, ruby, Kundan, and pearls makes it an ideal choice for brides and anyone seeking a statement piece with cultural significance. A perfect blend of elegance and tradition to make any occasion special.",
  "tags": [
    "Kundan Jewelry",
    "Haaram",
    "Necklace Set",
    "Maang Tikka",
    "Chutti",
    "Emerald",
    "Ruby",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Pelli",
    "Seemantham",
    "Voni Function",
    "pachcha",
    "ratan"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0488_0670",
  "collection": "diamond"
}