{
  "id": "necklaces-1143",
  "title": "Emerald Radiance: Statement Necklace Set",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Base metal is an alloy. High-quality gold plated with a Hyderabadi polish. Set with Emeralds (oval cabochon cut",
    "vibrant green",
    "VS clarity) and Cubic Zirconia (CZ) for brilliant sparkle. Plating prevents easy tarnishing and requires only proper care."
  ],
  "features": "A modern take on the traditional Haaram, this necklace features a seamless arrangement of Emerald cabochons. The Y design is eye-catching and suits modern sensibilities. Each gemstone is encrusted by a halo of CZ stones which add brilliance and definition. The matching earrings, with a vertical Emerald and CZ design, complete the look.",
  "colors": [
    "Emerald green and brilliant white CZ stones contrast against the golden hue of the Hyderabadi polish",
    "creating a sophisticated and vibrant color palette."
  ],
  "occasions": [
    "Perfect for engagements",
    "parties",
    "receptions",
    "cocktail events",
    "and special festive occasions. The Emerald lends itself well to evening wear and can also be used for more casual settings for added elegance."
  ],
  "description": "This set combines the timeless elegance of Emeralds with a modern, versatile design. The Hyderabadi polish ensures a long-lasting shine, while the Emeralds offer a vibrant and sophisticated look. The set is perfect for those who appreciate fine craftsmanship and contemporary jewelry.",
  "tags": [
    "Necklace",
    "Haaram",
    "Emerald",
    "Pachala",
    "CZ",
    "Cubic Zirconia",
    "Statement Necklace",
    "Modern Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Party Wear",
    "Earrings",
    "Set",
    "South Indian Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0046_2562",
  "collection": "radhe"
}