{
  "id": "necklaces-202",
  "title": "Heirloom Ruby & Polki Diamond Gutapusalu Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Premium Quality Burmese Rubies (Manikyam)",
    "Uncut Polki Diamonds (Vaajraalu)",
    "Seed Pearls. Features authentic Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite Gutapusalu Haaram showcases a cascading pendant meticulously crafted with intricate floral motifs using uncut Polki diamonds. A central, cabochon-cut Burmese ruby steals the show, surrounded by delicate seed pearl accents. The multi-strand necklace features tightly strung ruby beads interspersed with tiny seed pearls, culminating in a royal and opulent design.",
  "colors": [
    "Rich ruby red",
    "brilliant white (Polki diamonds & pearls)",
    "and warm gold tones create a regal and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "bridal showers",
    "Seemantham (Godh Bharai)",
    "and grand festive occasions. A statement piece for Muhurtham ceremonies and significant celebrations."
  ],
  "description": "This Haaram is more than just jewelry; it's an heirloom piece. The exquisite craftsmanship, using high-quality Burmese rubies and uncut Polki diamonds, ensures enduring beauty and value. The Gutapusalu design symbolizes prosperity and abundance, making it an auspicious choice for brides and celebratory events. A true testament to South Indian artistry and elegance.",
  "tags": [
    "Haaram",
    "Gutapusalu",
    "Ruby",
    "Polki Diamond",
    "Uncut Diamond",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Manikyam",
    "Vaajraalu",
    "Kanthabharanam",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Heirlooom Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0053_0461",
  "collection": "diamond"
}