{
  "id": "necklaces-821",
  "title": "Exquisite Diamond and Emerald Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity White Gold",
    "this haaram showcases brilliant-cut diamonds and a vibrant oval-cut Emerald (7.61 carats). The diamonds are meticulously set with close attention to detail",
    "totaling 1.98 carats",
    "pan diamonds weighing 6.50 (186) and 3.30 (57) carats",
    "marquise diamonds weighing 4.00 (157) carats. Additionally",
    "the haaram is adorned with a Ruby(10.50 carats)."
  ],
  "features": "This stunning diamond Haaram features a delicate, cascading design that culminates in a striking oval Emerald pendant. The intricate diamond setting surrounding the Emerald showcases exceptional craftsmanship. The cascading design is reminiscent of traditional South Indian bridal necklaces, while the clean lines offer a modern touch.",
  "colors": [
    "The color palette is dominated by the brilliance of the white diamonds",
    "complemented by the rich green of the Emerald and the depth of the Ruby accents."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaah)",
    "receptions",
    "and milestone celebrations. A magnificent piece for a bride's muhurtham or a lavish reception. Also suitable for high-end parties and cultural events."
  ],
  "description": "This exquisite Diamond and Emerald Haaram is a statement piece that embodies both tradition and modern elegance. Its exceptional craftsmanship, high-quality gemstones, and timeless design make it a valuable heirloom to be cherished for generations. The unique combination of a cascading diamond design with a central Emerald pendant makes it a truly unforgettable piece.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Necklace",
    "Vivaah",
    "Reception Jewelry",
    "White Gold",
    "Gemstone Jewelry",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "Diamond Haaram",
    "Emerald Haaram"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-48 3_1415",
  "collection": "diamond"
}