{
  "id": "necklaces-423",
  "title": "Vaibhavi Emerald Diamond Haaram - A Royal Ensemble",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Natural Emeralds (28.84ct total)",
    "Polki Diamonds",
    "South Sea Pearls (25.35ct total). Exquisite Hyderabadi Polish for lasting brilliance."
  ],
  "features": "A breathtaking three-tiered Haaram featuring floral motifs intricately studded with Polki diamonds and accented with vibrant natural emeralds. The antique-inspired design with flower motifs is a testament to traditional South Indian craftsmanship. Locket is intricately desiged with diamonds and a center emerald, with South Sea pearls hanging at the bottom.",
  "colors": [
    "Predominantly gold and diamond white",
    "enhanced by the rich green of the emeralds and the lustrous white of the South Sea pearls. A classic South Indian color palette signifying prosperity and new beginnings."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "engagements",
    "Seemantham",
    "half-saree function (Voni Function)",
    "or any significant celebration where you want to make a statement. Equally stunning for high-profile social events."
  ],
  "description": "This Vaibhavi Emerald Diamond Haaram is a true heirloom piece. The blend of traditional design with high-quality materials ensures lasting beauty and value. The craftsmanship and the symbolism of emeralds for growth and prosperity make it a truly special piece. Owning this is owning a piece of South Indian heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emeralds",
    "Diamonds",
    "Polki",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Kantaabharanam",
    "Meda Necklace",
    "Voni Function",
    "Muhurtham",
    "Seemantham",
    "Heritage Jewelry",
    "Antique Finish"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-02_0864",
  "collection": "diamond"
}