{
  "id": "necklaces-163",
  "title": "Golden Kalasam Pendant with Sparkling CZ Stones - Auspicious Mangalsutra Design",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold Plated Base Metal",
    "High-Quality Cubic Zirconia (CZ) Stones. Features a flawless Hyderabadi Polish for enduring radiance."
  ],
  "features": "This exquisite pendant showcases the traditional Kalasam motif, revered as a symbol of prosperity and new beginnings. The intricate filigree design is adorned with sparkling CZ stones, creating a harmonious blend of tradition and modern elegance. The Kalasam is delicately engraved with a Swastika symbol. Finished with a traditional gold ball dangling at the bottom to complete the design. Suitable to make any chain/mangalsutra look elegant.",
  "colors": [
    "Predominantly gold with the brilliant white sparkle of the CZ stones."
  ],
  "occasions": [
    "Perfect for weddings",
    "anniversaries",
    "housewarmings",
    "or any auspicious occasion. This pendant adds a touch of sacred elegance to any ensemble and makes for a thoughtful gift."
  ],
  "description": "This pendant is a timeless piece that blends traditional symbolism with contemporary design. The high-quality materials and Hyderabadi polish ensure lasting brilliance, making it a valuable addition to any jewelry collection. It holds cultural significance as a representation of prosperity and good fortune, making it a meaningful and cherished piece.",
  "tags": [
    "Pendant",
    "Locket",
    "Mangalsutra",
    "Kalasam",
    "Swastika",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Polish",
    "22K Gold",
    "Cubic Zirconia",
    "Auspicious Jewelry",
    "Wedding Jewelry",
    "Anniversary Gift",
    "Gold Pendant",
    "Diamond Pendant",
    "Ethnic Jewelry",
    "Bharatiya Abharanamulu",
    "শুভ অলঙ্কার",
    "தென்னிந்திய நகை"
  ],
  "original_id": "diamond_jewellery_eebebbc1-a8d5-403c-9754-5d03688832e9_0401",
  "collection": "diamond"
}