{
  "id": "necklaces-1124",
  "title": "The Queen's Diamond Haaram: A Legacy of Splendor",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Rose Cut",
    "Table Cut)",
    "Hyderabadi Polish. Handcrafted settings using traditional lac technique."
  ],
  "features": "A breathtaking diamond Haaram featuring a cascading design with clusters of Polki diamonds. The necklace exhibits exquisite craftsmanship with intricate floral motifs inspired by Mughal artistry. Features multiple diamond-studded pendants with droplet designs for graceful movement. Handcrafted gold settings ensure maximum brilliance from each diamond. The intricate layout and setting are done to maximize the size appearance and light reflection of the polki diamonds.",
  "colors": [
    "Predominantly golden hue with a dazzling white sparkle from the Polki diamonds. The diamonds have a natural",
    "subtle tint that adds to the antique character of the piece."
  ],
  "occasions": [
    "Perfect for bridal wear (pellikuturu)",
    "grand receptions",
    "or any auspicious occasion (Subhakaryam) where a statement piece is desired. Equally suitable for elegant evening events and high-society gatherings."
  ],
  "description": "This Haaram is a true heirloom piece, blending timeless design with the unmatched brilliance of Polki diamonds. The Hyderabadi polish gives it a rich, luxurious finish. The antique design and expert craftsmanship make it a unique and highly sought-after treasure. Excellent investment piece and heirloom quality. The design is flattering to all face shapes and necklines.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Polki Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Mughal Inspired",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Uncut Diamonds",
    "Antique Jewelry",
    "Heirloom Jewelry",
    "Pellikuturu",
    "Subhakaryam",
    "Indian Wedding",
    "Jewelry",
    "Jewellery"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0020_2538",
  "collection": "radhe"
}