{
  "id": "necklaces-226",
  "title": "Muthyala Kasulaperu Haaram - Exquisite Gemstone Lakshmi Kasu Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "studded with high-quality Cubic Zirconia (CZ)",
    "vibrant Ruby (red)",
    "and Emerald (green) gemstones. Features delicate pearl drops (Muthyalu). Hyderabadi Polish for a lasting",
    "radiant shine."
  ],
  "features": "This classic Kasulaperu Haaram showcases the revered Lakshmi coin design, intricately arranged with floral motifs embellished with CZ, rubies and emeralds. The elegant pendant adds a focal point, echoing the floral motif. Each kasu (coin) is meticulously crafted and spaced to create a harmonious and regal look. Delicate pearl drops further enhance its allure. Handcrafted by skilled artisans.",
  "colors": [
    "Predominantly gold with vibrant ruby red and emerald green accents",
    "complemented by the soft luster of pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "Seemantham (baby shower)",
    "bridal wear",
    "festivals (like Ugadi or Sankranti)",
    "or any traditional South Indian ceremony. Its timeless elegance also makes it suitable for grand receptions and milestone celebrations."
  ],
  "description": "A symbol of prosperity and tradition, this Kasulaperu Haaram is not just jewelry; it's an heirloom. The combination of genuine 22K gold, sparkling CZ, and vibrant gemstones ensures lasting value and brilliance. Meticulously handcrafted in Hyderabad by skilled artisans, it embodies cultural heritage and timeless beauty. A perfect investment for generations to cherish.",
  "tags": [
    "Kasulaperu",
    "Haaram",
    "Necklace",
    "Lakshmi",
    "Coin Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "22K Gold",
    "Ruby",
    "Emerald",
    "CZ",
    "Muthyalu",
    "Pearl",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "Devotional",
    "Temple Jewelry",
    "Ethnic Jewelry",
    "Vivahaalu",
    "Seemantham"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0306_0503",
  "collection": "diamond"
}