{
  "id": "necklaces-021",
  "title": "Floral Cascade Haar and Jhumka Set",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "Crafted with a blend of Rose Gold and Platinum plating over a durable alloy base. Features square-cut CZ stones (Cubic Zirconia) with exceptional brilliance and clarity. Finished with a Hyderabadi polish to enhance its luster and longevity."
  ],
  "features": "This stunning set boasts a delicate floral motif, skillfully arranged in a cascading pattern. The Haar showcases a symmetrical design, culminating in a striking pendant with a central square setting for a CZ stone. The matching Jhumkas mirror this design, creating a cohesive and elegant look. The cutwork designs add sophistication.",
  "colors": [
    "Predominantly features a two-tone color scheme with a gentle contrast between Rose Gold and Platinum. The CZ stones add a touch of brilliance with their crystalline shine."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "engagements",
    "or any special occasion where you want to make a statement. Perfect for pairing with both traditional silk sarees and modern contemporary outfits."
  ],
  "description": "This set offers a modern take on traditional South Indian jewelry. The two-tone plating provides a touch of contemporary elegance while retaining the grandeur associated with Haar sets. The meticulous craftsmanship ensures durability and lasting shine. The lightweight design ensures comfort, allowing you to wear it for extended periods. The set enhances your grace.",
  "tags": [
    "Haar",
    "Jhumka",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Contemporary Jewelry",
    "Floral Design",
    "Rose Gold",
    "Platinum",
    "CZ",
    "Cubic Zirconia",
    "Set",
    "Pendant Set",
    "Reception Jewelry",
    "Engagement Jewelry",
    "Aabharanam",
    "Haram"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0027_0056",
  "collection": "choker"
}