{
  "id": "bangles-339",
  "title": "Dazzling Diamond Bangles: A Touch of Modern Elegance",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "18K Gold",
    "meticulously crafted and studded with high-quality Cubic Zirconia (CZ) stones. Features a Hyderabadi Polish for a lasting",
    "radiant shine. Gold weight approximately 20 grams per bangle."
  ],
  "features": "These exquisitely designed bangles feature a modern aesthetic with a repeating geometric pattern encrusted with sparkling Cubic Zirconia. The design seamlessly blends traditional Indian bangle styles with a contemporary edge, making it a versatile addition to any jewelry collection. Secure clasp closure for easy wear.",
  "colors": [
    "Predominantly gold with dazzling white from the CZ stones."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "anniversaries",
    "parties",
    "or any special occasion. Suitable for both traditional Indian attire and modern ensembles. Can be worn for Sangeet",
    "reception events",
    "or daily wear."
  ],
  "description": "These bangles represent a fusion of traditional aesthetics and modern design. The brilliant Cubic Zirconia stones provide a luxurious sparkle at an accessible price point. The secure clasp ensures comfortable and worry-free wear. The Hyderabadi Polish adds an extra layer of durability and radiance, ensuring this piece will be cherished for years to come. This is a unique design not found elsewhere.",
  "tags": [
    "Bangles",
    "Kadas",
    "Gowansulu",
    "Gold Bangles",
    "Diamond Bangles",
    "Cubic Zirconia",
    "CZ",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Modern Jewelry",
    "Contemporary Jewelry",
    "Festive Wear",
    "Gift for Her",
    "Fine Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry"
  ],
  "original_id": "stock_in_india_IMG-20241130-WA0031_2790",
  "collection": "stock"
}