{
  "id": "necklaces-942",
  "title": "Divyamani Temple Haaram with Polki Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (faceted)",
    "Ruby and Pearl accents. Features traditional Hyderabadi polish for a lustrous finish."
  ],
  "features": "A classic 'Temple Haaram' (necklace) featuring a central pendant of Goddess Lakshmi, rendered in intricate repoussé work. The necklace strand is adorned with alternating floral and teardrop motifs set with shimmering Polki diamonds. Delicate pearl drops add a touch of elegance and movement to each pendant. Handcrafted Nakshi work showcases the divine deity. The setting highlights the brilliance of the polki diamonds.",
  "colors": [
    "Predominantly gold with white polki diamonds",
    "complemented by the warm red of ruby accents and the soft luster of the pearls."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "festivals like Diwali and Dussehra",
    "and other special occasions. Perfect for Muhurtham or Seemantham ceremonies."
  ],
  "description": "This Temple Haaram is a timeless heirloom piece, reflecting the rich cultural heritage of South India. The use of high-quality Polki diamonds and 22K gold ensures enduring beauty and value. Handcrafted with meticulous attention to detail, this necklace is a symbol of prosperity and divine blessings. The Temple design makes it a truly unique and meaningful piece of jewelry.",
  "tags": [
    "Temple Jewellery",
    "Haaram",
    "Gundla Mala",
    "Polki Diamond",
    "Nakshi Work",
    "Goddess Lakshmi",
    "South Indian Jewellery",
    "Wedding Jewellery",
    "Bridal Necklace",
    "Traditional Jewellery",
    "Hyderabad Jewellery",
    "Telugu Jewellery",
    "Indian Jewelry",
    "Indian Wedding"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0336_2403",
  "collection": "necklace"
}