{
  "id": "necklaces-831",
  "title": "Heera & Manikyam Chandbali Pendant: A Timeless Telugu Treasure",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features two Ruby (Manikyam) cabochons of fine quality. Embellished with intricately set Polki Diamonds (Heera)",
    "showcasing exceptional luster and clarity."
  ],
  "features": "This Chandbali pendant epitomizes traditional South Indian craftsmanship. The design showcases a crescent moon (Chand) shape adorned with Polki diamonds. The central Ruby cabochons add a regal touch. Features a traditional cluster setting with open back allowing light to maximize the natural brilliance of each diamond. The piece employs meticulous 'Kundankari' style setting, further accentuating the rich heritage of Hyderabadi jewelry.",
  "colors": [
    "Predominantly gold with a rich",
    "warm tone. The Rubies offer a vibrant pop of red",
    "beautifully contrasted by the clear",
    "sparkling Polki diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "bridal wear",
    "festivals like Sankranthi and Ugadi",
    "and traditional ceremonies such as Seemantham or Half-Saree Function (Langa Voni Function). Also suitable for formal occasions and adding a touch of cultural elegance to contemporary outfits."
  ],
  "description": "This exquisite Chandbali pendant is a true heirloom piece, meticulously handcrafted by skilled artisans from Hyderabad. The combination of rich 22K gold, genuine Rubies, and dazzling Polki diamonds makes it a valuable investment. Its timeless design reflects the grandeur of South Indian heritage and offers unmatched sophistication. The Hyderabadi polish enhances the luster and longevity of the gold.",
  "tags": [
    "Chandbali",
    "Pendant",
    "Polki",
    "Diamond",
    "Ruby",
    "Manikyam",
    "Gold",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Kundan",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Heirloom Jewelry",
    "చాంద్ బాలి",
    "మణిక్యం",
    "హీరా",
    "బంగారం",
    "పెండెంట్"
  ],
  "original_id": "ear_rings_DPER8-1563_2610",
  "collection": "ear"
}