{
  "id": "earrings-633",
  "title": "The \"Vaibhavam\" Jhumka: Emerald & Pearl Cascade",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base Metal with Gold Plating",
    "embellished with Cubic Zirconia (CZ)",
    "Faceted Emerald Central Stone",
    "and Freshwater Pearls. Features Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "Classic South Indian Jhumka design featuring a domed structure intricately adorned with CZ stones. Delicate lattice work creates a regal appearance. Cascade of lustrous freshwater pearls enhances the earring's beauty, adding a touch of elegance. The design is a modern adaptation of traditional Temple Jewellery. The top features filigree with a center emerald.",
  "colors": [
    "Predominantly gold with sparkling clear CZ stones",
    "accented by a vibrant green emerald and creamy white pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "Seemantham",
    "Half-Saree functions (Voni function)",
    "and other festive occasions. These earrings also make a statement for grand parties and celebrations."
  ],
  "description": "These Jhumkas combine traditional South Indian design with modern elegance, making them versatile for various occasions. The use of high-quality CZ stones ensures a brilliant sparkle, while the genuine freshwater pearls add a touch of luxury. The Hyderabadi Polish ensures long-lasting shine and durability. The cascade of pearls gives this piece the 'Vaibhavam' (Grandeur) of traditional South Indian jewelry. The emerald center gives it an elegant touch.",
  "tags": [
    "Jhumka",
    "Jhumkas",
    "Earrings",
    "Chevi Duddulu",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional Earrings",
    "Indian Earrings",
    "Wedding Jewelry",
    "Bridal Earrings",
    "Gold Plated",
    "CZ Earrings",
    "Cubic Zirconia",
    "Emerald",
    "Pearl Jhumkas",
    "Freshwater Pearls",
    "Hyderabadi Polish",
    "Festive Jewelry",
    "Ethnic Earrings"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 17_2210",
  "collection": "sjpl"
}