{
  "id": "necklaces-414",
  "title": "Divine Lakshmi Devi Pendant - Antique Finish Nakshi Work with Pearls",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (approx. 16.350 grams gross weight)",
    "63 Diamonds (approx. 0.930 carats)",
    "2 Rubies (approx. 0.100 carats)",
    "1 Emerald (approx. 0.300 carats)",
    "7 South Sea Pearls (approx. 6.350 carats total weight). Hyderabadi Polish finish."
  ],
  "features": "Intricately handcrafted pendant featuring Goddess Lakshmi seated within a divine halo. Exquisite nakshi work brings the deity to life with fine detailing. The design includes stylized peacock motifs on either side of Lakshmi. The pendant is framed with brilliant cut diamonds, and dangles of lustrous South Sea pearls enhance its grace. Antique finish lends a timeless appeal.",
  "colors": [
    "Golden yellow (gold)",
    "brilliant white (diamonds)",
    "deep red (rubies)",
    "vibrant green (emerald)",
    "and iridescent white (pearls)."
  ],
  "occasions": [
    "Ideal for traditional occasions like weddings",
    "festivals (like Diwali and Dasara)",
    "religious ceremonies",
    "muhurtham",
    "seemantham",
    "and half-saree functions. Also a stunning statement piece for special evening events."
  ],
  "description": "This pendant is a masterpiece of traditional South Indian craftsmanship, showcasing the divine Lakshmi, the goddess of prosperity. The nakshi work is meticulously detailed, and the combination of gold, diamonds, rubies, emeralds and pearls creates a harmonious and auspicious design. This is more than just jewelry; it is a valuable heirloom piece to be cherished for generations. The design blends heritage with a touch of contemporary elegance.",
  "tags": [
    "Lakshmi Pendant",
    "Temple Jewelry",
    "Nakshi Work",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Gold Pendant",
    "Diamond Pendant",
    "Ruby",
    "Emerald",
    "Pearl",
    "Antique Finish",
    "Heirloom Jewelry",
    "Devi",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "festival",
    "wedding"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-08-26-14-08-18_0855",
  "collection": "diamond"
}