{
  "id": "necklaces-1396",
  "title": "Emerald Vaalai Haaram with Diamond Lattice and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold with Hyderabadi Polish. Adorned with brilliant-cut Diamonds (VVS Clarity",
    "EF Color) and stunning pear-shaped Emeralds. Features freshwater Pearls with high luster."
  ],
  "features": "This contemporary Haaram blends classic South Indian design with modern elegance. The intricate diamond lattice work showcases exceptional craftsmanship. Pear-shaped emeralds provide a vibrant focal point, while the pearl drops add a touch of grace. The pendant is detachable, allowing for versatility in styling. The lattice design is reminiscent of traditional 'Jali' patterns, reinterpreted with a modern aesthetic.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant emerald green accents and soft pearl white."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and special occasions like Seemantham (శ్రీమంతం) or half-saree function (పావడా). Also suitable for upscale social events and evening galas."
  ],
  "description": "This exquisite Haaram offers a unique blend of traditional South Indian aesthetics and modern design sensibilities. The high-quality diamonds and vibrant emeralds ensure lasting brilliance and value. The detachable pendant allows for flexible styling, making it a versatile addition to any jewelry collection. Crafted with meticulous attention to detail, it showcases superior craftsmanship and timeless elegance, embodying the rich heritage of Hyderabad jewelry.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "కంఠాభరణం",
    "Seemantham",
    "శ్రీమంతం",
    "Pavada",
    "పావడా",
    "Emerald",
    "Diamonds",
    "Pearls"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-08 3_2014",
  "collection": "sjpl"
}