{
  "id": "necklaces-208",
  "title": "Exquisite Mayura Nakshi Haaram with Emerald Centerpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Premium Quality CZ Stones (American Diamonds)",
    "Natural Emerald (Panna)",
    "Natural Rubies",
    "Hyderabadi Polish"
  ],
  "features": "Features a classic South Indian design with intricately carved peacocks (Mayura Nakshi) adorning the pendant. The pendant is set with high-quality CZ stones in a filigree pattern, surrounding a vibrant emerald center stone. Delicate flower motifs with ruby accents dangle along the necklace, adding a touch of feminine charm. The chain showcases a unique, interconnected circular link design, reflecting expert craftsmanship.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "Sparkling White (CZ stones)"
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "traditional Telugu ceremonies like Seemantham",
    "Half-Saree Function (Langa Voni)",
    "and festive occasions like Diwali or Sankranthi. Also suitable for upscale evening events where a touch of traditional elegance is desired."
  ],
  "description": "This Haaram is a testament to timeless South Indian jewelry artistry. The intricate Mayura Nakshi work and the vibrant gemstone combination create a piece that is both visually stunning and culturally significant. The Hyderabadi polish ensures a lasting shine and durability. The use of premium quality CZ stones offers the brilliance of diamonds at an accessible price point. A true heirloom piece to be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Mayura",
    "Peacock Design",
    "Emerald",
    "Ruby",
    "CZ Stones",
    "Indian Wedding Jewelry",
    "Telugu Jewelry",
    "Seemantham",
    "Golusu",
    "22K Gold",
    "Hyderabadi Polish",
    "Ethnic Jewelry",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0284_0482",
  "collection": "diamond"
}