{
  "id": "necklaces-1459",
  "title": "Elegant Diamond and Emerald Kasulaperu Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Emerald (Pear Cut)",
    "South Sea Pearls. Features Hyderabadi Polish for enhanced luster."
  ],
  "features": "Classic Kasulaperu design with intricately crafted diamond-studded motifs. The central pendant showcases a pear-cut emerald surrounded by delicate diamond filigree work, reminiscent of traditional South Indian temple jewelry. The pendant is adorned with lustrous South Sea pearls. The necklace chain features a cascading teardrop design adorned with diamonds.",
  "colors": [
    "Predominantly gold and white (diamonds) with a vibrant green accent from the emerald and creamy white pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "festivals (Sankranti",
    "Diwali)",
    "or any special occasion where you want to make a statement. Also suitable for upscale modern events."
  ],
  "description": "This stunning Kasulaperu is a perfect blend of traditional South Indian aesthetics and modern jewelry design. The high-quality diamonds and lustrous South Sea pearls add a touch of luxury, while the intricate craftsmanship ensures lasting beauty and durability. The Hyderabadi polish guarantees a brilliant shine that will capture attention. The inclusion of a natural emerald, considered an auspicious gem, makes it a truly special piece.",
  "tags": [
    "Kasulaperu",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Vivahaalu",
    "Nischitartham",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Haaram",
    "కాసుల పేరు",
    "Wedding Necklace"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-53 3_2077",
  "collection": "sjpl"
}