{
  "id": "necklaces-1372",
  "title": "Dazzling Double-Strand Mangalsutra with Diamond-Accented Pendants",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality rose gold plated alloy",
    "adorned with faceted black onyx beads. Features sparkling cubic zirconia (CZ) diamonds for brilliant shimmer. Hypoallergenic and tarnish-resistant."
  ],
  "features": "This modern mangalsutra presents a chic, double-layered design. The upper strand features a delicate star-shaped CZ-studded pendant, while the lower strand showcases a larger, floral-inspired CZ pendant. The precise placement of the black onyx beads adds a touch of traditional elegance to the contemporary design.",
  "colors": [
    "Rose gold provides a warm and romantic hue",
    "beautifully contrasting with the deep black onyx beads and the brilliant white sparkle of the cubic zirconia diamonds."
  ],
  "occasions": [
    "Perfect for daily wear",
    "festive occasions",
    "or as a thoughtful gift for anniversaries",
    "weddings",
    "or other special celebrations. Its contemporary design also makes it suitable for modern outfits and fusion ensembles."
  ],
  "description": "This double-strand mangalsutra offers a fresh take on a traditional symbol of marriage. Its lightweight design ensures comfortable all-day wear, while the cubic zirconia diamonds provide a luxurious touch at an accessible price point. Its modern design allows it to be paired easily with both traditional and contemporary outfits, making it a versatile addition to any jewelry collection.",
  "tags": [
    "Mangalsutra",
    "Rose Gold",
    "Black Onyx",
    "Cubic Zirconia",
    "CZ Diamonds",
    "Double Strand",
    "Pendant Necklace",
    "Indian Jewelry",
    "Contemporary Jewelry",
    "Anniversary Gift",
    "Wedding Gift",
    "Telugu Jewelry",
    "Hyderabad Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-13-41-25_1970",
  "collection": "sjpl"
}