{
  "id": "necklaces-485",
  "title": "Emerald and Diamond Floral Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold (96.190 GH Gross Weight)",
    "Featuring 18.26 Carats of Natural Emeralds and 3.11 Carats of brilliant-cut Diamonds. Diamonds display exceptional brilliance",
    "color GH."
  ],
  "features": "This exquisite necklace features a floral motif with delicately arranged diamonds surrounding vibrant emerald teardrop stones. The design blends traditional South Indian floral aesthetics with a modern diamond setting, creating a piece that is both classic and contemporary. Notice the intricate diamond clusters that form flower-like patterns, enhancing the overall brilliance and sophisticated look. Delicate diamond fringes highlight the central teardrop gemstone.",
  "colors": [
    "Primarily white and green. The white gold provides a cool",
    "modern backdrop for the brilliant diamonds and the rich green hues of the emeralds."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Vivaha)",
    "receptions",
    "upscale parties",
    "or any event where you desire to make a grand statement. A contemporary design that is suitable for both traditional and modern attire."
  ],
  "description": "This Haaram is a striking blend of traditional South Indian design and modern craftsmanship. The high-quality emeralds and diamonds guarantee an eye-catching sparkle and a luxurious feel. Its unique floral pattern symbolizes prosperity and new beginnings, making it a memorable addition to any fine jewelry collection. The comfortable design ensures a secure and elegant fit.",
  "tags": [
    "Haaram",
    "Emerald Necklace",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "White Gold Necklace",
    "Floral Design",
    "Fine Jewelry",
    "Contemporary Jewelry",
    "Vivaha",
    "Reception Jewelry",
    "Women's Jewelry",
    "Modern Haaram"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-45-07_0963",
  "collection": "diamond"
}