{
  "id": "earrings-099",
  "title": "Exquisite Chandbali Jhumka - A Timeless Masterpiece",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish for a radiant finish. Embellished with brilliant-cut Diamonds",
    "a central Emerald (Panna)",
    "and subtle Ruby (Manikyam) accents. Features dangling South Sea Pearls."
  ],
  "features": "Intricate Chandbali (crescent moon) design with a delicate, floral-inspired top featuring Emerald and Ruby accents. Fine filigree work surrounds the Chandbali frame, adorned with sparkling diamonds. The suspended jhumka elements feature lustrous South Sea pearl drops, creating graceful movement. The traditional design is perfect for adding a touch of regal elegance.",
  "colors": [
    "Primarily gold",
    "with vibrant pops of green from the Emerald",
    "red from the Ruby",
    "and the soft",
    "creamy hue of the South Sea Pearls. The diamonds add brilliant white sparkle."
  ],
  "occasions": [
    "Perfect for weddings (Vivahalu/పెళ్లి)",
    "engagement ceremonies",
    "festivals like Diwali/Ugadi",
    "and other special occasions. A stunning choice for the modern bride or for any woman who appreciates timeless elegance and South Indian heritage."
  ],
  "description": "This Chandbali Jhumka is a testament to exceptional craftsmanship and timeless South Indian design. The Hyderabadi Polish gives it a rich, luxurious luster. The combination of precious gemstones and lustrous pearls makes it a valuable heirloom piece to be cherished for generations. The blend of traditional design with modern elegance makes it versatile for both traditional and contemporary settings. A true statement piece that exudes sophistication and grace.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "Gold Jewelry",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "South Sea Pearl",
    "Hyderabadi Polish",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Telugu Jewelry",
    "చెవి దుద్దులు",
    "పెళ్లి",
    "వివాహాలు",
    "Vivahalu",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Heirloom Jewelry"
  ],
  "original_id": "diamond_jewellery_c9a5427c-f387-4bbf-9579-b6e2d93e14e2_0198",
  "collection": "diamond"
}