{
  "id": "rings-051",
  "title": "Exquisite Diamond Vaddanam (Belt) with Emerald and Pearl Accents",
  "category": "rings",
  "original_type": "Waist Belt",
  "materials": [
    "High-quality Gold setting (purity not specified)",
    "meticulously studded with brilliant-cut Diamonds (approx. 14.30 carats). Features a central Pear-shaped Ruby (approx. 4.70 carats)",
    "accented by lustrous Emeralds (approx. 9.23 carats) and dangling South Sea Pearls (approx. 23.95 carats) for added elegance."
  ],
  "features": "This Vaddanam showcases intricate floral and paisley motifs, intricately set with sparkling diamonds. The design includes a central large Emerald stone that is a unique design element to this Vadannem. Dangling South Sea Pearls add a touch of classic grace. The craftsmanship reflects traditional South Indian jewelry making with its elaborate patterns and emphasis on gemstone brilliance.",
  "colors": [
    "Predominantly white (diamonds) and gold",
    "complemented by the vibrant green of the Emerald and the rich red of the Ruby. The soft luster of the pearls adds a delicate contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "traditional ceremonies (like Seemantham or Half-Saree Function)",
    "and grand celebrations. Its modern elegance also makes it suitable for high-end fashion events and parties."
  ],
  "description": "This Vaddanam is a statement piece that seamlessly blends traditional South Indian aesthetics with modern elegance. The combination of diamonds, rubies, emeralds and pearls makes it an heirloom-worthy treasure. Its exquisite craftsmanship and timeless design ensure it will be cherished for generations.",
  "tags": [
    "Vaddanam",
    "Kamarbandh",
    "Diamond Belt",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Ruby",
    "Emerald",
    "Pearl",
    "Telugu Jewelry",
    "Gold Belt",
    "waist chain",
    "kempu",
    "pachi",
    "navratna",
    "antique finish",
    "Hyderabadi Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-11-18-04 2_2175",
  "collection": "sjpl"
}