{
  "id": "bangles-142",
  "title": "Lakshmi Kada: Ruby & Diamond Floral Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features brilliant-cut diamonds (VS clarity",
    "G color) and natural Burmese Rubies with excellent color saturation."
  ],
  "features": "Intricately designed bangle featuring a prominent floral motif at the center, surrounded by delicate diamond-studded swirls. Red Rubies strategically placed to enhance the design and bring 'Sowbhagyam' (prosperity). The bangle showcases a 'bezel setting' for the diamonds and rubies, providing maximum security and a smooth, contemporary look to the traditional design.",
  "colors": [
    "Golden Yellow",
    "Sparkling White (Diamonds)",
    "and Deep Red (Rubies). A classic South Indian color palette symbolizing wealth",
    "purity",
    "and auspiciousness."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "festivals (Sankranti",
    "Diwali)",
    "and special occasions like anniversaries or milestone celebrations. Its elegant design also makes it suitable for modern cocktail parties and formal events."
  ],
  "description": "This Lakshmi Kada embodies a perfect fusion of tradition and modern aesthetics. The intricate floral design represents the Goddess Lakshmi, bestowing blessings of prosperity and abundance. The Hyderabadi polish ensures a lasting shine, while the high-quality diamonds and rubies add an undeniable touch of luxury. A timeless piece that will be cherished for generations.",
  "tags": [
    "Bangle",
    "Kada",
    "22K Gold",
    "Diamonds",
    "Rubies",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Lakshmi",
    "Floral Design",
    "VS Clarity",
    "G Color",
    "Gemstone Jewelry",
    "Bharatiya Abharanam",
    "Kangan"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0412_0609",
  "collection": "diamond"
}