{
  "id": "earrings-629",
  "title": "Emerald and Diamond Peacock Jhumka - Exquisite Bridal Chandbali (చేయని జుంకాలు)",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated. High-quality Cubic Zirconia (CZ) stones. Faceted Emerald Center Stone. Rhodium plating to prevent tarnishing."
  ],
  "features": "Intricately designed peacock motif (Mayura design). Openwork jhumka bell embellished with countless CZs. Delicate filigree detailing showcasing unparalleled craftsmanship. Features a vibrant emerald center stone to catch the light. Handcrafted with traditional Telugu detailing and a modern lightweight design. These jhumkas offer a modern design element while maintaining a sense of South Indian culture.",
  "colors": [
    "Gold (bright yellow) with green emerald and sparkling white Cubic Zirconia accents."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement parties",
    "festivals like Diwali and Sankranti",
    "and special occasions like Seemantham or half-saree functions. Ideal for modern brides looking to blend tradition with contemporary style."
  ],
  "description": "A stunning fusion of traditional South Indian design and modern elegance. The brilliant sparkle of CZs combined with the rich emerald adds a touch of regal beauty. Lightweight and comfortable for extended wear. Crafted with precision and care, guaranteeing exceptional quality and lasting beauty. Symbolizes grace, beauty, and prosperity. The peacock is a symbol of the wealth and prosperity.",
  "tags": [
    "Jhumka",
    "Chandbali",
    "Earrings",
    "Gold Plated",
    "Emerald",
    "CZ",
    "Peacock",
    "Mayura",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Fashion Jewelry",
    "New design",
    "Openwork",
    "filigree",
    "lightweight"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 13_2206",
  "collection": "sjpl"
}