{
  "id": "earrings-129",
  "title": "Manohari Kundan Jhumka Earrings - A Timeless Telugu Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with meticulous Kundan Setting. Features uncut Polki diamonds with rose-cut style",
    "vibrant ruby accents",
    "and a central emerald gemstone. Hyderabadi Polish enhances the gold's lustrous sheen. Includes high quality simulated stones."
  ],
  "features": "These handcrafted Jhumka earrings feature a classic floral design with intricate Kundan work. The peacock motif at the top with bright ruby stones and a centrally placed emerald. The Jhumka's bell-shaped bottom showcases cascading ruby beads, creating a graceful sway with every movement. The Kundan stones are carefully placed within the gold framework, showcasing traditional Indian craftsmanship.",
  "colors": [
    "Gold (yellow)",
    "Pink (ruby)",
    "Green (emerald)",
    "White (Kundan diamonds). The vibrant color combination is traditionally auspicious."
  ],
  "occasions": [
    "Perfect for weddings (Vivahalu)",
    "engagements",
    "Seemantham",
    "half-saree functions (Voni Function)",
    "and other festive occasions. Also suitable for upscale events where you wish to make a statement with traditional Indian elegance."
  ],
  "description": "These Jhumka earrings are a testament to exquisite South Indian artistry, combining the timeless elegance of Kundan with the vibrant colors of traditional gemstones. The Hyderabadi polish ensures a lasting luster. Each piece is carefully handcrafted by skilled artisans, making it a valuable heirloom to be treasured for generations. Comfortable to wear despite its rich appearance. Adds an ethereal element to your look.",
  "tags": [
    "Jhumka",
    "Kundan",
    "Earrings",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Gold Earrings",
    "Ruby",
    "Emerald",
    "Polki Diamonds",
    "Temple Jewelry",
    "చెవి దిద్దులు",
    "కుందన్",
    "జుమ్కా",
    "తెలుగు ఆభరణాలు",
    "బంగారం చెవి దిద్దులు",
    "పెళ్లి నగలు",
    "Vivahalu"
  ],
  "original_id": "diamond_jewellery_DPER8-1244_0252",
  "collection": "diamond"
}