{
  "id": "necklaces-488",
  "title": "Enchanting Emerald & Diamond Floral Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold. Features vibrant",
    "pear-shaped Emeralds (Eme: 8.19ct) of exceptional clarity and brilliance",
    "complemented by sparkling round brilliant-cut diamonds (D.pan(+7): 3.12ct",
    "D.mq(-7): 0.96ct",
    "D.mq(+7): 1.92ct)."
  ],
  "features": "This necklace showcases a delicate floral design, meticulously crafted with prong and pave settings to maximize the brilliance of the diamonds and emeralds. The central emeralds are adorned with pear shape emerald drops, creating a focal point of elegance and sophistication. Modern design with timeless appeal, perfect for the contemporary woman.",
  "colors": [
    "Lustrous white gold creates a stunning contrast with the intense green of the emeralds and the fiery white of the diamonds. Classic color combination for high jewelry."
  ],
  "occasions": [
    "Perfect for grand celebrations",
    "weddings (vaduuvu)",
    "receptions",
    "or any special event where you want to make a lasting impression. Its modern design also makes it suitable for upscale parties and black-tie affairs."
  ],
  "description": "A true statement piece, this necklace effortlessly blends contemporary design with classic elegance. The vibrant emeralds, carefully selected for their exceptional color and clarity, symbolize prosperity and new beginnings. The intricate diamond work enhances the overall brilliance, making this a valuable addition to any jewelry collection. Its versatile design ensures it can be worn with both traditional and modern attire.",
  "tags": [
    "Emerald Necklace",
    "Diamond Necklace",
    "White Gold Necklace",
    "Haaralu",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Contemporary Jewelry",
    "South Indian Jewelry",
    "Vaduvu",
    "Reception Jewelry",
    "Fine Jewelry",
    "Gemstone Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-45-08_0966",
  "collection": "diamond"
}