{
  "id": "necklaces-823",
  "title": "Emerald Blossom Panchlada Haar - Emerald & Diamond 3-Layer Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 hallmark)",
    "Natural Emeralds (Oval Cut",
    "Vivid Green)",
    "Sparkling CZ Diamonds",
    "Hyderabadi Polish"
  ],
  "features": "This stunning Panchlada Haar features three cascading layers of meticulously crafted floral motifs. Each 'flower' is centered with a vibrant oval-cut Emerald, surrounded by a halo of dazzling CZ diamonds set in a floral design. The traditional Hyderabadi polish enhances the gold's rich luster, creating an antique yet modern appeal. The cascading design evokes the richness of South Indian heritage with a modern flair. It features a secure and comfortable chain, carefully crafted to bear the weight and ensure effortless elegance.",
  "colors": [
    "Emerald Green",
    "Diamond White",
    "Gold"
  ],
  "occasions": [
    "Perfect for weddings (Vivaahaalu)",
    "receptions",
    "grand celebrations",
    "Seemantham (baby shower)",
    "half-saree function",
    "and special family events. Also suitable for making a statement at modern galas and high-profile events."
  ],
  "description": "This Panchlada Haar is a timeless masterpiece, blending traditional South Indian design with modern elegance. The high-quality Emeralds and sparkling CZ Diamonds create a luxurious look. The three-layer design makes a bold statement, symbolizing prosperity and abundance. It's a heirloom piece that will be treasured for generations, embodying the rich cultural heritage of Hyderabad's jewelry craftsmanship. Lightweight and comfortable to wear despite its statement size. The classic design and exceptional quality ensure that it will remain a valuable addition to your collection for years to come.",
  "tags": [
    "Panchlada Haar",
    "Emerald Necklace",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Vivaahaalu",
    "Seemantham",
    "Half Saree Function",
    "Statement Necklace",
    "Indian Jewellery",
    "Traditional Jewelry",
    "Bridal Haar"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-49 2_1417",
  "collection": "diamond"
}