{
  "id": "necklaces-908",
  "title": "Manohari Peacock Haaram with Coral Dangles",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Coral Beads",
    "CZ Diamonds",
    "Emerald",
    "Ruby. Features our signature Hyderabadi Polish for a lasting luster."
  ],
  "features": "This stunning short Haaram features a meticulously crafted peacock motif pendant, symbolizing beauty and grace. Adorned with sparkling CZ diamonds, delicate emerald and ruby accents, and finished with coral bead dangles. The intricate gold chain showcases a floral pattern adding to its exquisite detail. A classic temple jewelry inspired design element combines tradition with elegance.",
  "colors": [
    "Radiant Gold",
    "Vibrant Coral",
    "Emerald Green",
    "Ruby Red",
    "and brilliant White (CZ diamonds)."
  ],
  "occasions": [
    "Perfect for weddings (వివాహానికి)",
    "engagements (నిశ్చితార్థం)",
    "festive celebrations (పండుగలు)",
    "and special occasions. A cherished addition to your heirloom jewelry collection",
    "ideal for muhurtham ceremonies and half-saree functions (లంగవోణి వేడుక). Can also be styled with contemporary outfits for a touch of ethnic flair."
  ],
  "description": "A testament to superior craftsmanship, this haaram beautifully blends traditional South Indian motifs with modern elegance. The vibrant coral beads provide a pop of color and are believed to bring good luck. The high-quality CZ diamonds offer the brilliance of diamonds at an accessible price. Durable and timeless, this piece is a valuable investment that can be passed down through generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Peacock Design",
    "Coral Beads",
    "CZ Diamonds",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Ethnic Jewelry",
    "కంఠాభరణం",
    "పండుగలు",
    "వివాహానికి",
    "లంగవోణి వేడుక",
    "నిశ్చితార్థం",
    "பாரம்பரிய நகைகள்",
    "దక్షిణ இந்திய ஆபரணங்கள்"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0302_2369",
  "collection": "necklace"
}