{
  "id": "necklaces-445",
  "title": "Emerald & Diamond Floral Grand Haaram with Pearls - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity yellow gold",
    "meticulously set with brilliant-cut diamonds. Features a central",
    "vibrant green emerald of 2.32 carats. Adorned with five lustrous South Sea pearls",
    "each approximately 7.70mm. Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This stunning haaram showcases a delicate floral design, expertly handcrafted to exude both elegance and sophistication. The intricate setting highlights the brilliance of each diamond. The central emerald draws the eye, while the pearls add a touch of classic charm. The open-work design offers a modern twist to a traditional style.",
  "colors": [
    "Radiant yellow gold",
    "dazzling white diamonds",
    "a lush green emerald",
    "and creamy white pearls create a harmonious and eye-catching palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "anniversaries",
    "and other special occasions. An exquisite choice for a bride's muhurtham or reception. Its modern design makes it suitable for high-end social gatherings as well."
  ],
  "description": "This haaram is a statement piece that seamlessly blends traditional grandeur with contemporary design. The exceptional craftsmanship ensures its durability and lasting beauty. The combination of emeralds, diamonds, and pearls symbolizes prosperity, love, and purity, making it a meaningful heirloom piece. A true testament to Hyderabadi jewelry artistry.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Engagement Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Fine Jewelry",
    "Muhurtham Jewelry",
    "Grand Necklace",
    "Jewelry",
    "ఆభరణాలు",
    "నగలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-46_0908",
  "collection": "diamond"
}