{
  "id": "earrings-120",
  "title": "Vaajra Neelam & Emerald Chandbali Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Blue Sapphire",
    "Emeralds",
    "Polki Diamonds",
    "South Sea Pearls. Hyderabadi Polish. The gold has been meticulously crafted to achieve a rich",
    "warm tone."
  ],
  "features": "These exquisite Chandbali earrings showcase a harmonious blend of traditional design and modern elegance. The central circular design is intricately set with Polki diamonds, complemented by vibrant emeralds in a teardrop shape. The design also features a striking pear-shaped blue sapphire at the top, surrounded by a halo of Polki diamonds. Lustrous South Sea pearls dangle gracefully, adding a touch of sophistication. A smaller sapphire drop in the center adds another layer of intricacy.",
  "colors": [
    "Gold",
    "Blue (Sapphire)",
    "Green (Emerald)",
    "White (Polki Diamonds & Pearls)"
  ],
  "occasions": [
    "Ideal for weddings",
    "engagements",
    "receptions",
    "and special occasions. Perfect for bridal wear or as a statement piece for festive celebrations like Diwali and Sankranthi. Suitable for both traditional Telugu events and contemporary gatherings."
  ],
  "description": "These Chandbali earrings are a testament to exceptional craftsmanship, boasting genuine gemstones and high-quality materials. The Hyderabadi polish enhances the gold's luster, ensuring lasting beauty. The combination of blue sapphire, emeralds, polki diamonds, and South Sea pearls creates a unique and luxurious aesthetic. The earrings are designed for comfort and durability, making them a cherished heirloom for generations to come. The traditional design is subtly updated for a modern appeal.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Polki",
    "Sapphire",
    "Emerald",
    "Pearl",
    "Gold",
    "Traditional",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Statement Earrings",
    "Ethnic Jewelry",
    "భారతీయ ఆభరణాలు",
    "చెవి దుద్దులు",
    "కెంపు",
    "పచ్చ"
  ],
  "original_id": "diamond_jewellery_DPCB8-1658_0227",
  "collection": "diamond"
}