{
  "id": "necklaces-1530",
  "title": "Chandrika Diamond Haaram - Exquisite Telugu Bridal Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base",
    "meticulously set with brilliant-cut diamonds (VS clarity",
    "G-H color). Accented with natural Emeralds and Pink Sapphires. Finished with Hyderabadi Polish for a lustrous sheen."
  ],
  "features": "This Chandrika Haaram features an elaborate floral and paisley design, showcasing intricate openwork and exceptional diamond setting. The central pendant is a masterpiece of traditional Telugu craftsmanship, culminating in delicate sapphire drops. The necklace's design includes traditional South Indian 'vanki' inspired elements near the neck area. The emeralds and pink sapphires are carefully placed to highlight the diamond's brilliance and add a touch of color and sophistication.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "with vibrant accents of green (emeralds) and pink (sapphires)",
    "subtly complemented by the blue sapphire drops."
  ],
  "occasions": [
    "Perfect for weddings (Vivah)",
    "receptions",
    "Seemantham (baby shower)",
    "and other grand traditional ceremonies. Also suitable for high-profile events where a statement piece is desired."
  ],
  "description": "A true heirloom piece, the Chandrika Haaram is more than just jewelry; it's an investment in artistry and tradition. The high-quality diamonds and vibrant gemstones, combined with impeccable craftsmanship, ensure lasting beauty and value. The intricate detailing and Hyderabadi polish reflect the rich cultural heritage of South Indian jewelry. It embodies the grandeur and elegance expected of bridal jewelry in Telugu tradition (పెళ్లి నగల సంప్రదాయం).",
  "tags": [
    "Haaram",
    "కంఠాభరణం",
    "Diamond Necklace",
    "Bridal Jewelry",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Necklace",
    "Emerald",
    "Pink Sapphire",
    "Sapphire",
    "Vanki Design",
    "Traditional Jewelry",
    "పెళ్లి నగలు",
    "Seemantham Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-06_2148",
  "collection": "sjpl"
}