{
  "id": "necklaces-1405",
  "title": "Exquisite Floral Diamond and Emerald Haar with Pearl Drops - Vandanalu Fine Jewelry",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "high-quality CZ diamonds with brilliant cut",
    "natural emerald of significant carat weight",
    "and freshwater pearls. Features Hyderabadi polish for enhanced luster and durability."
  ],
  "features": "Features intricate floral patterns throughout the necklace, meticulously embellished with sparkling CZ diamonds. The central pendant boasts a prominent pear-shaped emerald surrounded by diamond-studded floral motifs. Delicate pearl drops add a touch of timeless elegance. The design is a modern interpretation of traditional South Indian Haar styles, showcasing a blend of contemporary and classic aesthetics. Setting style is prong and pave.",
  "colors": [
    "Predominantly gold and white (diamond)",
    "with a striking green emerald centerpiece and lustrous white pearls. The color combination provides a rich",
    "luxurious",
    "and balanced aesthetic."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "anniversaries",
    "and upscale social gatherings. This statement piece elevates any special occasion attire and embodies both tradition and modern elegance."
  ],
  "description": "This haar offers a unique blend of traditional South Indian design and contemporary aesthetics. The high-quality CZ diamonds provide exceptional sparkle, while the vibrant emerald and pearl accents add character. The Hyderabadi polish ensures long-lasting shine and durability. It is a statement piece that captures attention and celebrates timeless beauty, crafted by skilled artisans.",
  "tags": [
    "Haar",
    "Diamond Necklace",
    "Emerald",
    "Pearl",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Wedding Necklace",
    "Reception Jewelry",
    "Hyderabadi Jewelry",
    "CZ Diamond",
    "Vandanalu",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "Vivaha",
    "Necklace",
    "emerald pendant",
    "pearl drops",
    "floral necklace",
    "Telugu Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-18 3_2023",
  "collection": "sjpl"
}