{
  "id": "earrings-073",
  "title": "Aadhya Kundan Stud Earrings - A Timeless Radiance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Premium Quality Kundan stones",
    "Ruby",
    "Emerald. Hyderabadi Polish for enduring shine."
  ],
  "features": "Intricately handcrafted floral design inspired by traditional Telugu temple architecture. Features a central Kundan setting surrounded by delicately placed rubies and a vibrant emerald center. The openwork gold filigree adds a modern, airy feel while maintaining traditional charm. Stud earrings suitable for pierced ears. The kundan stones are set using the traditional 'pakki' setting, ensuring durability and brilliance.",
  "colors": [
    "Gold (yellow)",
    "White (Kundan)",
    "Red (Ruby)",
    "Green (Emerald). A classic South Indian color palette symbolizing prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for weddings",
    "pujas",
    "festive occasions like Sankranthi and Dussehra",
    "or to add a touch of tradition to your everyday attire. Suitable for Muhurtham ceremonies and traditional family gatherings. Also ideal for gifting during special occasions."
  ],
  "description": "These Aadhya Kundan Stud Earrings are more than just jewelry; they are a statement of heritage and elegance. The meticulous craftsmanship and the use of premium materials ensure that these earrings will be cherished for generations. Their unique blend of traditional design and modern sensibilities makes them a versatile addition to any jewelry collection. Durable and comfortable for all-day wear.",
  "tags": [
    "Earrings",
    "Kundan",
    "Studs",
    "Gold",
    "Ruby",
    "Emerald",
    "Traditional",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad",
    "Indian Wedding",
    "Festive",
    "Ethnic",
    "Kundanalankaram",
    "Butta",
    "Jhumka"
  ],
  "original_id": "diamond_jewellery_9a4bdd77-1828-4c87-aab2-a0bc237440d6_0164",
  "collection": "diamond"
}