{
  "id": "necklaces-773",
  "title": "Enchanting Emerald & Diamond Bridal Collar Necklace - The \"Aishwarya Haaram\"",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Yellow Gold",
    "adorned with brilliant-cut Diamonds (VVS clarity",
    "EF color). Features genuine Emeralds",
    "showcasing a vivid green hue. The necklace is embellished with Freshwater Pearls for added elegance. Has a Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This exquisite collar necklace features an intricate floral and paisley motif entirely set with shimmering diamonds. A central emerald adds a regal touch. The design is complemented by cascading freshwater pearls, creating a mesmerizing drape. The pendant section is removable, offering versatility. The piece features a classic open setting to maximize the brilliance of the diamonds. The design takes inspiration from traditional South Indian temple jewelry while maintaining a contemporary elegance.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented by vibrant green emeralds and the soft luster of white pearls. This color palette evokes a sense of timeless elegance."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "and grand festive occasions. Also suitable for milestone events like Seemantham",
    "half-saree function (Voni Function)",
    "and formal celebrations."
  ],
  "description": "A testament to superior craftsmanship, this diamond and emerald collar necklace is a captivating blend of traditional and contemporary design. The high-quality diamonds and genuine emeralds ensure lasting value. The removable pendant offers versatility, making it suitable for various occasions. The necklace embodies cultural richness and reflects timeless elegance, making it a cherished heirloom piece.",
  "tags": [
    "Diamond Necklace",
    "Emerald Necklace",
    "Collar Necklace",
    "Haaram",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Voni Function",
    "Seemantham",
    "Pearls",
    "Hyderabadi Jewelry",
    "18K Gold",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Festival Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-08 3_1279",
  "collection": "diamond"
}