{
  "id": "necklaces-1556",
  "title": "Exquisite Navratna Kundan Haar - A Symphony of Tradition & Gemstones",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (91.800 GH Gross Weight)",
    "Set with meticulously selected Navratna Gemstones (Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "accented with glittering Diamonds. Features a Hyderabadi Polish for a timeless luster."
  ],
  "features": "This breathtaking Haar features a classic V-shaped design adorned with the sacred Navratnas. Each gemstone is expertly set in a Kundan style, showcasing the richness of traditional Indian jewelry making. The surrounding diamond accents add a touch of modern sparkle, elevating the design to a masterpiece. Includes floral motifs intricately set within the design.",
  "colors": [
    "Multicolor - vibrant hues of red",
    "pink",
    "yellow",
    "green",
    "blue",
    "white",
    "and peach from the Navratna gemstones",
    "set against the warm glow of the 22K gold. The diamonds provide brilliant white accents."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (vivahaalu)",
    "receptions",
    "anniversaries",
    "and traditional Telugu ceremonies like seemantham or half-saree functions (avasaram). A statement piece for the discerning woman who appreciates timeless elegance."
  ],
  "description": "This Navratna Kundan Haar is a symbol of prosperity, good health, and auspicious beginnings. The use of meticulously selected Navratna gemstones makes it not just a piece of jewelry but also a valuable investment. Crafted with the finest materials and traditional techniques, this piece is built to last for generations. Its unique blend of traditional and contemporary design elements ensures it will be cherished for years to come.",
  "tags": [
    "Navratna Haar",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Diamond Necklace",
    "Gemstone Necklace",
    "Hyderabadi Jewelry",
    "India Jewelry",
    "avasaram",
    "vivahaalu",
    "seemantham",
    "gold necklace",
    "PMQN00130"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-32 3_2235",
  "collection": "sjpl"
}