{
  "id": "necklaces-560",
  "title": "Diamond Vanki Pendant - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18k Rose Gold with meticulously hand-set Brilliant Cut Diamonds. Each diamond is of VS clarity and GH color",
    "ensuring exceptional sparkle and brilliance. Finished with a smooth Hyderabadi polish for enhanced luster."
  ],
  "features": "Inspired by the traditional Vanki design, this pendant features a delicate, wing-like silhouette. The intricate diamond setting showcases a geometric pattern, enhanced with smaller diamonds highlighting the curves. The center features a slightly elevated arrangement of diamonds in a circular halo, adding depth and dimension. It features two loops on either side that easily slides through any chain.",
  "colors": [
    "Warm rose gold paired with the dazzling white of the diamonds creates a soft and sophisticated aesthetic."
  ],
  "occasions": [
    "Ideal for daily wear",
    "special occasions",
    "and formal gatherings. Can be paired with a simple gold chain or a more elaborate necklace for a traditional look during weddings and festivals (like Sankranthi or Diwali). Suitable as a gift for birthdays",
    "anniversaries",
    "or any cherished milestone."
  ],
  "description": "This pendant seamlessly blends traditional South Indian design with modern elegance. The high-quality diamonds and fine craftsmanship ensure lasting beauty and value. It's a versatile piece that can be dressed up or down, making it a timeless addition to any jewelry collection. Its distinctive Vanki design represents prosperity and good fortune.",
  "tags": [
    "Diamond Pendant",
    "Vanki",
    "Rose Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Temple Jewelry Inspired",
    "Modern Pendant",
    "Daily Wear",
    "Gift",
    "Hyderabadi Polish",
    "Brilliant Cut Diamonds",
    "Fine Jewelry",
    "Women's Jewelry",
    "Fashion Pendant"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-41 3_1043",
  "collection": "diamond"
}