{
  "id": "necklaces-232",
  "title": "Divya Chandrika: Diamond & Gemstone Bridal Haaram with Golden Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Saffron Hue)",
    "Brilliant Cut Diamonds (SI Clarity",
    "G-H Color)",
    "Natural Emeralds",
    "Ruby Cabochon",
    "Cultured Golden South Sea Pearls. Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This breathtaking haaram features a layered design, combining geometric patterns with ornate floral motifs. The central pendant showcases a teardrop ruby cabochon surrounded by sparkling diamonds and emerald accents. The necklace is punctuated by lustrous golden South Sea pearls, adding a touch of timeless elegance. Intricate filigree work throughout the design adds depth and sophistication.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "White Diamonds",
    "and Creamy Golden Pearls."
  ],
  "occasions": [
    "Perfect for a grand Indian wedding (Vivahaalu)",
    "engagement ceremonies",
    "a significant festival (Pandaga)",
    "or a traditional dance performance (Kuchipudi",
    "Bharatanatyam). Also suitable for high-end cultural events."
  ],
  "description": "This haaram is a masterpiece of South Indian craftsmanship, blending traditional design elements with modern sensibilities. The use of high-quality gemstones and lustrous South Sea pearls ensures a piece that will be cherished for generations. The meticulous detailing and Hyderabadi polish elevate its aesthetic appeal, making it a true statement piece and a valuable addition to any bridal trousseau. A testament to timeless beauty and cultural heritage.",
  "tags": [
    "Haaram",
    "South Indian Jewelry",
    "Diamond Necklace",
    "Emerald Jewelry",
    "Ruby Necklace",
    "Pearl Necklace",
    "Bridal Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Vivahaalu",
    "కంఠాభరణము",
    "பாரம்பரிய ஆபரணங்கள்",
    "traditional jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0312_0509",
  "collection": "diamond"
}