{
  "id": "necklaces-694",
  "title": "Vasantika Haaram: Diamond & Emerald Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Carved Emeralds",
    "Natural Sapphire Beads. Hyderabadi Polish for a lasting luster."
  ],
  "features": "Intricately handcrafted Haaram featuring a floral motif centerpiece adorned with a carved emerald. The neckline showcases a graduating arrangement of emeralds and diamonds, leading to a dazzling pendant. Delicately dangling sapphire beads add a touch of royalty. The setting is a classic prong and pave setting to maximize the brilliance of the diamonds. Features a stylized paisley design (kalki)",
  "colors": [
    "Gold",
    "Emerald Green",
    "Sapphire Blue",
    "Diamond White"
  ],
  "occasions": [
    "Ideal for weddings (Vivaham)",
    "receptions",
    "Seemantham",
    "Voni Function (half-saree function)",
    "and other grand celebrations. A perfect heirloom piece for generations to come."
  ],
  "description": "This Vasantika Haaram is a testament to timeless elegance and superior craftsmanship. The combination of high-quality diamonds, vibrant emeralds, and rich sapphire beads creates a captivating visual appeal. The piece embodies traditional South Indian aesthetics while maintaining a modern sensibility, making it a versatile addition to any jewelry collection. The Hyderabadi polish ensures a long-lasting shine, preserving the beauty of the necklace for years to come.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "కంఠాభరణం",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Necklace",
    "Antique Finish",
    "Temple Jewelry",
    "VVS Diamonds",
    "22K Gold",
    "Sapphire Beads"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-52_1200",
  "collection": "diamond"
}