{
  "id": "necklaces-1479",
  "title": "Regal Emerald and Ruby Kundan Haaram - A Timeless Telugu Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Emeralds (faceted & cabochon cut)",
    "Natural Rubies (faceted)",
    "Polki Diamonds (Uncut Diamonds). Features exquisite Kundan setting with Hyderabadi Polish."
  ],
  "features": "This stunning Haaram showcases a classic South Indian design. It features a meticulously handcrafted gold framework, adorned with Polki diamonds in the traditional Kundan setting. The central pendant features a vibrant combination of emeralds and rubies arranged in a floral motif, complemented by emerald drops. The geometric gold framework adds a contemporary twist to the traditional design. Nakshi work detailing enhances the overall regal appearance.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "and Diamond White."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements",
    "festive occasions",
    "traditional ceremonies like Seemantham",
    "and special celebrations. A statement piece for any grand event."
  ],
  "description": "This Haaram is a testament to timeless elegance and exquisite craftsmanship. The combination of precious gemstones like emeralds and rubies with the allure of Polki diamonds makes it a captivating piece of jewelry. The Hyderabadi Polish adds a unique luster, reflecting the rich heritage of the region. This is an investment piece that can be passed down through generations, carrying with it cultural significance and beauty. The unique geometric structure with floral motifs blends tradition and modernity.",
  "tags": [
    "Haaram",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Emerald Necklace",
    "Ruby Necklace",
    "Polki Diamonds",
    "Nakshi Work",
    "Hyderabadi Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Traditional Jewelry",
    "Gold Necklace",
    "Jadau Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-41-00_2097",
  "collection": "sjpl"
}