{
  "id": "necklaces-755",
  "title": "Emerald & Diamond Mango Mala - Mesmerizing Mogali Rekulu Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Premium Quality Gold Plating",
    "Sparkling Cubic Zirconia",
    "Faceted Emerald Green Simulated Stones. Features a Hyderabadi Polish for a lasting shine."
  ],
  "features": "Classic Mango Mala design featuring alternating floral and paisley (Mogali Rekulu) motifs. The floral motifs are intricately embellished with Cubic Zirconia stones. The Pendant in the center is beautifully crafted in a paisley shape and is decorated with cubic zirconia and a simulated emerald green stone. The detailed filigree work and precise stone setting demonstrate superior craftsmanship.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and Brilliant White (Cubic Zirconia)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals (Pandugalu)",
    "and traditional South Indian ceremonies like Seemantham",
    "and Half-Saree Function (Pelli sambaralu). Also suitable for formal events and sophisticated evening wear."
  ],
  "description": "This Mango Mala combines traditional Telugu jewelry design with modern sparkle. The high-quality gold plating ensures durability and a luxurious look. The brilliant Cubic Zirconia stones mimic the shimmer of real diamonds, creating a striking statement piece. The deep emerald green accents add a touch of regal elegance, making it a cherished heirloom.",
  "tags": [
    "Mango Mala",
    "Haaram",
    "Mogali Rekulu",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Ethnic Jewelry",
    "Cubic Zirconia",
    "CZ",
    "Emerald",
    "Gold Plated",
    "Hyderabadi Polish",
    "కంఠాభరణము",
    "మామిడి పిందెలు హారం",
    "వివాహ ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-40_1261",
  "collection": "diamond"
}