{
  "id": "necklaces-1441",
  "title": "Emerald Drop Diamond Haaram: The 'Aabharana Vanamali'",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold. Features a captivating Pear-shaped Emerald with Excellent Clarity",
    "accented by meticulously set Brilliant-cut Diamonds. The gold has a subtle Hyderabadi Polish for a lasting shine."
  ],
  "features": "This Haaram showcases a modern take on traditional floral motifs. The delicate vine-like design is encrusted with diamonds, leading to a stunning emerald pendant. The pendant features a halo setting, accentuating the emerald's vibrant green hue. The diamond settings are designed to maximize brilliance, creating a dazzling effect. Showcases contemporary design with a nod to traditional 'Moggu' designs.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with a striking emerald green centerpiece. The contrast creates a visually appealing and luxurious aesthetic."
  ],
  "occasions": [
    "Perfect for modern brides",
    "engagement parties",
    "cocktail events",
    "or as a statement piece for special occasions. Suitable for grand receptions and contemporary weddings",
    "and also pairs wonderfully with traditional Indian attire for a sophisticated look."
  ],
  "description": "This Diamond Haaram balances modern aesthetics with timeless elegance. The emerald is a symbol of prosperity and growth, while the diamonds represent eternal love and commitment. Crafted with meticulous attention to detail, this piece is a true heirloom that can be passed down through generations. The exquisite craftsmanship and high-quality materials ensure both beauty and durability.",
  "tags": [
    "Diamond Necklace",
    "Emerald Pendant",
    "Haaram",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Engagement Jewelry",
    "Bridal Jewelry",
    "Moggu Design",
    "Aabharana",
    "Vanamali",
    "Contemporary Jewelry",
    "Fine Jewelry",
    "Telugu Jewelry",
    "Indian Wedding",
    "Pear Cut Emerald"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-46_2059",
  "collection": "sjpl"
}