{
  "id": "necklaces-890",
  "title": "Enchanting Emerald Kundan Haar Set - పచ్చ కుందన్ హారం సెట్",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold Plated Alloy",
    "High-Quality Kundan Stones",
    "Emerald Green Simulated Stones",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite haar features intricate Kundan setting, a traditional art form renowned for its elaborate detail and gemstone placement. The necklace is adorned with simulated emerald green stones surrounded by shimmering Kundan, creating a regal and timeless design. The matching jhumka earrings mirror the necklace's design, enhancing the overall set's allure. The necklace's design includes delicate droplet embellishments, reminiscent of traditional South Indian 'kasu mala' elements.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Kundan)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "bridal wear",
    "engagements (Nischitartham)",
    "festive celebrations (Dasara",
    "Diwali",
    "Sankranthi)",
    "and traditional events like Seemantham or Half-Saree Function. Also suitable for upscale modern events where a touch of tradition is desired."
  ],
  "description": "This Kundan Haar set embodies the rich heritage of South Indian jewelry artistry. The Hyderabadi polish lends a luxurious shine, ensuring lasting brilliance. The intricate Kundan setting and vibrant emerald green stones create a statement piece that will be treasured for generations. A true heirloom-quality set that seamlessly blends tradition and elegance.",
  "tags": [
    "Kundan Haar",
    "Necklace Set",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Jhumka Earrings",
    "Temple Jewelry",
    "Traditional Jewelry",
    "పచ్చ హారం",
    "కుందన్ నగలు",
    "పెళ్లి నగలు",
    "దక్షిణ భారత ఆభరణాలు"
  ],
  "original_id": "jewellery_IMG-20241219-WA0023_1602",
  "collection": "jewellery"
}