{
  "id": "earrings-317",
  "title": "Emerald Cascade Jhumkas: A Timeless Telugu Bridal Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Finely crafted in 22K Gold with a Hyderabadi polish to enhance its luster. The Jhumkas feature a vibrant emerald cabochon centerpiece",
    "complemented by shimmering",
    "meticulously set cubic zirconia stones for unparalleled brilliance."
  ],
  "features": "These exquisite Jhumkas showcase a delicate floral top design followed by the intricate pattern, leading to a spherical, cage-like Jhumka. The design allows the light to refract through the zirconia, creating a captivating sparkle. The base of the Jhumka is adorned with tiny pearl drops, adding a touch of elegance and movement.",
  "colors": [
    "Classic combination of radiant gold and the rich green of the emerald",
    "further highlighted by the dazzling white of the cubic zirconia. A truly regal palette."
  ],
  "occasions": [
    "Perfect for traditional South Indian occasions like weddings (పెళ్లి)",
    "engagements",
    "and festivals (పండుగలు). Also makes a statement piece for modern events and parties."
  ],
  "description": "These Jhumkas are more than just jewelry; they are an heirloom-worthy investment. Their traditional design, combined with modern elements like the dazzling zirconia, makes them incredibly versatile. The high-quality gold and meticulous craftsmanship ensure lasting beauty and durability. Embrace the charm of Hyderabad's jewelry heritage with this breathtaking piece.",
  "tags": [
    "Jhumka",
    "Jhumkas",
    "Earrings",
    "Gold Earrings",
    "Emerald",
    "Zirconia",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "పెళ్లి నగలు",
    "చెవి దిద్దులు",
    "Hyderabad Jewelry",
    "Indian Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-35 5_1346",
  "collection": "diamond"
}