{
  "id": "necklaces-200",
  "title": "Navaratna Kundan Haaram - A Kaleidoscope of Tradition",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Natural Navaratna Gemstones (Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "Kundan Setting with Uncut Diamonds (Polki). Features Hyderabadi Polish for enduring luster."
  ],
  "features": "Classic Navaratna design, featuring nine auspicious gemstones set in a symmetrical arrangement. The gemstones are intricately carved and surrounded by Polki diamonds in a Kundan setting. The links are adorned with small Polki diamonds for added sparkle. Design is inspired by traditional South Indian temple jewelry.",
  "colors": [
    "Multi-colored gemstones (Red",
    "White",
    "Orange",
    "Green",
    "Yellow",
    "Blue",
    "Purple",
    "Gray)",
    "Gold metal",
    "and brilliant white Polki diamonds."
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "Seemantham (Baby Shower)",
    "Half-Saree Function (Voni Function)",
    "temple visits",
    "and other auspicious traditional ceremonies. Also suitable for upscale modern events where a touch of cultural elegance is desired."
  ],
  "description": "This Navaratna Haaram is more than just a necklace; it's an heirloom. Each gemstone is carefully selected for its quality and auspicious properties, believed to bring prosperity and good fortune. The Kundan setting, a hallmark of Hyderabad's rich jewelry tradition, showcases the exceptional craftsmanship. The Hyderabadi polish ensures a lasting shine. A perfect blend of tradition and elegance, making it a prized possession for generations to come.",
  "tags": [
    "Navaratna Haaram",
    "Kundan Jewelry",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Temple Jewelry",
    "Hyderabad Jewelry",
    "Traditional Necklace",
    "Wedding Jewelry",
    "Auspicious Jewelry",
    "Gemstone Necklace",
    "22K Gold",
    "Voni Function",
    "Muhurtham",
    "Seemantham",
    "Sattvika",
    "Shubha"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0051_0459",
  "collection": "diamond"
}