{
  "id": "necklaces-1674",
  "title": "Rajeshwari Haaram: Emerald and Ruby Regal Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Natural Rubies (Cabochon Cut",
    "Fine Color)",
    "Faceted Diamonds (SI Clarity",
    "G Color)",
    "Carved Emerald (Square Cushion Cut",
    "Good Clarity)"
  ],
  "features": "Graduated ruby stations accented with diamond clusters lead to a stunning pendant featuring a hand-carved emerald. The pendant’s setting showcases an elaborate diamond halo, enhancing the emerald's brilliance. The intricate craftsmanship reflects traditional Telugu artistry, while the clean lines offer a modern sensibility.",
  "colors": [
    "Dominant colors include vibrant ruby red",
    "lush emerald green",
    "and the warm glow of yellow gold. The diamonds add a sparkling white contrast",
    "creating a visually rich and harmonious palette."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (Vivahaalu)",
    "engagements (Nischayalu)",
    "grand receptions",
    "and festive celebrations. Also suitable for formal gatherings and cultural events where a statement piece is desired."
  ],
  "description": "This Rajeshwari Haaram is a testament to timeless elegance and exquisite craftsmanship. The combination of rubies, diamonds, and a carved emerald makes it a rare and valuable piece. The Hyderabadi gold polish enhances its antique charm, making it a treasured heirloom for generations to come. The intricate design and vibrant colors reflect the rich cultural heritage of South India, while the modern silhouette adds a touch of sophistication.",
  "tags": [
    "Haaram",
    "Necklace",
    "Ruby",
    "Emerald",
    "Diamond",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Nischayalu",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Statement Necklace",
    "Statement Piece",
    "Carved Emerald",
    "22K Gold",
    "Jadau Jewelry"
  ],
  "original_id": "stock_in_india_IMG-20241218-WA0011_2856",
  "collection": "stock"
}