{
  "id": "waistbands-022",
  "title": "The Emerald and Diamond Peacock Vaddanam - Kamarband",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold",
    "21.84 carats of brilliant-cut Diamonds (1116 stones)",
    "6.82 carats of Emeralds (6 stones)",
    "9.89 Carats of Rubies (6 stones). Features the renowned Hyderabadi Polish for a lasting shine."
  ],
  "features": "Intricately designed Vaddanam featuring a central series of peacock motifs, a symbol of beauty and grace. Each peacock is adorned with sparkling diamonds and set within a circular frame. The waist belt is further embellished with round-cut emeralds strategically placed amidst the diamond setting, adding vibrant green accents. A delicate row of gold beads hangs along the lower edge, enhancing its traditional appeal.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant green emerald accents. The Hyderabadi Polish gives the gold a rich",
    "warm tone."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "bridal showers",
    "Seemantham (pregnancy celebration)",
    "and other grand celebrations. A statement piece that can also be worn to modern upscale events to showcase cultural heritage."
  ],
  "description": "This Vaddanam is a true masterpiece of South Indian craftsmanship, blending traditional design with contemporary elegance. The use of high-quality diamonds, radiant emeralds, and pure gold creates a timeless piece of jewelry. The peacock motif symbolizes prosperity and good fortune, making it an auspicious choice for brides and special occasions. Its durable construction ensures it will be a cherished heirloom for generations to come. The emeralds are beautifully selected to provide striking contrast.",
  "tags": [
    "Vaddanam",
    "Kamarband",
    "Waist Belt",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Gold Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Peacock Motif",
    "Kattu Vaddanam",
    "కట్టు వడ్డాణం",
    "Seemantham Jewelry",
    "Vivaham Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-24-13-54-27 3_1319",
  "collection": "diamond"
}