{
  "id": "necklaces-838",
  "title": "Navratan Floral Pendant - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (approximately 91.6% pure)",
    "Rose Quartz",
    "Tanzanite",
    "Green Amethyst",
    "Freshwater Pearls",
    "Polki Diamonds (Uncut Diamonds). Features exquisite Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "This captivating pendant boasts a traditional floral design, meticulously handcrafted by skilled artisans. The central Tanzanite gemstone is surrounded by a halo of Polki diamonds in an open setting, enhancing its natural brilliance. Delicate freshwater pearl clusters are artfully arranged below. The top showcases a rose quartz cabochon encircled by more polki diamonds. This creation evokes the traditional 'Navratna' style, blending classic motifs with contemporary elegance. It can be worn as a pendant on the necklace.",
  "colors": [
    "The color palette is a harmonious blend of pastel shades with rose quartz",
    "blue tanzanite",
    "and green amethyst. The warm yellow gold complements the gemstones beautifully",
    "creating a rich and inviting aesthetic."
  ],
  "occasions": [
    "Perfect for a variety of special occasions",
    "including weddings (Vivaaham)",
    "engagements",
    "festive celebrations (Ugadi",
    "Diwali)",
    "and family gatherings. Its timeless design makes it equally suitable for contemporary parties and formal events."
  ],
  "description": "This pendant is a testament to exceptional craftsmanship and artistry. The use of high-quality gemstones and the meticulous Hyderabadi polish ensure its durability and lasting beauty. The traditional floral design holds cultural significance, making it a cherished heirloom for generations. The Navratan style is known for its auspiciousness and positive energy.",
  "tags": [
    "Pendant",
    "Navratan",
    "Polki Diamonds",
    "Rose Quartz",
    "Tanzanite",
    "Green Amethyst",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Vivaaham Jewelry",
    "Wedding Jewelry",
    "Ugadi",
    "Diwali",
    "Heirlooms",
    "Floral Design",
    "Gemstone Pendant",
    "Telugu Jewelry",
    "Pearl",
    "Jewellery"
  ],
  "original_id": "ear_rings_DPER8-1789_2640",
  "collection": "ear"
}