{
  "id": "necklaces-1044",
  "title": "Apoorva Polki Gundla Haaram - Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Emeralds",
    "Rubies",
    "Seed Pearls. Features Hyderabadi Polish for lasting shine. Each Polki diamond is hand-selected for its brilliance and unique character."
  ],
  "features": "Classic Gundla Haaram design with alternating Polki diamond and Emerald accents. The central pendant features a radiant deity design (Lakshmi or similar), surrounded by meticulously set Polki diamonds and embellished with rubies. Delicate seed pearls are strung along the haaram for a graceful, traditional touch. The Polki setting is expertly crafted with a closed-back setting to enhance the gem's luster.",
  "colors": [
    "Gold (yellow gold)",
    "White (Polki diamonds)",
    "Green (Emeralds)",
    "Red (Rubies)",
    "White (Seed Pearls). This palette represents prosperity and auspiciousness in South Indian culture."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "engagements",
    "bridal showers",
    "seemantham (baby shower)",
    "half-saree functions",
    "and other grand celebrations. This haaram adds a touch of regal elegance to any traditional ensemble."
  ],
  "description": "This Gundla Haaram is a true heirloom piece, handcrafted by skilled artisans in Hyderabad. The use of high-quality Polki diamonds, emeralds, and seed pearls ensures a timeless beauty and lasting value. The design is inspired by traditional South Indian jewelry, making it a meaningful and culturally significant piece. The Hyderabadi polish guarantees a brilliant, long-lasting shine. It represents the perfect blend of tradition and luxury.",
  "tags": [
    "Gundla Haaram",
    "Polki Diamond Necklace",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Emeralds",
    "Rubies",
    "Seed Pearls",
    "Indian Bridal Jewelry",
    "Heirloom Jewelry",
    "ముత్యాల హారం",
    "Polki Necklace",
    "Gold Necklace",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Seemantham Jewelry",
    "Half Saree Function Jewelry"
  ],
  "original_id": "radhe_diam_DPHR8-1775_2457",
  "collection": "radhe"
}