{
  "id": "necklaces-1014",
  "title": "Diamond Cascade: Contemporary Grand Haaram with Gemstone Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted with 18K Yellow Gold",
    "meticulously set with brilliant-cut Diamonds of VS clarity and G color. Features a central Ruby and Emerald",
    "both of exceptional quality. Finished with lustrous",
    "high-quality Pearls. Has Hyderabadi Polish."
  ],
  "features": "This contemporary Haaram features an intricate floral design, handcrafted with delicate openwork detailing. The design incorporates traditional South Indian floral motifs with a modern, lightweight feel. The central pendant features a Ruby and Emerald, symbols of prosperity and growth respectively. Delicate pearl drops add a touch of elegance. The chain has a braided rope style.",
  "colors": [
    "Primarily Gold and White (Diamonds)",
    "accented by vibrant Ruby Red",
    "Emerald Green",
    "and the soft luster of Pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand celebrations like Seemantham or upscale parties. A statement piece that elevates any outfit",
    "suitable for both traditional and modern attire."
  ],
  "description": "A stunning blend of tradition and contemporary design, this Haaram offers unparalleled elegance and sparkle. The exceptional craftsmanship ensures both beauty and durability. The auspicious combination of ruby and emerald adds cultural significance. A cherished heirloom piece that will be treasured for generations.",
  "tags": [
    "Haaram",
    "Gadina",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "Floral Design",
    "Contemporary Haaram",
    "Bridal Necklace",
    "VS Diamonds",
    "18K Gold",
    "Traditional Jewelry",
    "Grand Necklace"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0473_2335",
  "collection": "necklace"
}