{
  "id": "earrings-240",
  "title": "Aarya Studs: Floral Navratna Earrings with Diamond Accent",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "Navratna Gemstones (Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "Cubic Zirconia (CZ)"
  ],
  "features": "Classic floral design featuring the auspicious Navratna gemstones in a clustered arrangement. The gold setting showcases fine milgrain detailing and an open-back setting to maximize gemstone brilliance. The outer frame is embellished with sparkling cubic zirconia to add a modern touch. These earrings are designed with a sturdy post and screw-back closure for secure wear.",
  "colors": [
    "Predominantly gold with a vibrant mix of gemstone colors: ruby red",
    "pearl white",
    "coral orange",
    "emerald green",
    "yellow sapphire yellow",
    "diamond white",
    "blue sapphire blue",
    "hessonite brown",
    "and cat's eye grey. The CZ stones provide additional sparkle."
  ],
  "occasions": [
    "Perfect for festive occasions like Diwali",
    "Ugadi",
    "and Sankranthi. Also suitable for modern events like weddings",
    "parties",
    "and everyday wear. Ideal as a special gift for anniversaries or birthdays."
  ],
  "description": "These Aarya studs are a testament to timeless elegance, blending the traditional Navratna concept with contemporary design. The use of high-quality 22K gold and carefully selected gemstones ensures lasting beauty and value. The Navratna stones are believed to bring prosperity, health, and good fortune, making these earrings a meaningful and stylish investment. The Hyderabadi polish adds a luxurious sheen.",
  "tags": [
    "Earrings",
    "Studs",
    "Navratna",
    "Kanthi Bottu",
    "22K Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Diamond",
    "Cubic Zirconia",
    "Festive Jewelry",
    "Ugadi",
    "Diwali",
    "Sankranthi",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241219-WA0025_0805",
  "collection": "diamond"
}