{
  "id": "necklaces-265",
  "title": "Vaishnavi Kasulaperu Haaram with Ruby Pendant - Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-quality Rubies (Pear Cut)",
    "Emeralds (Pear Cut)",
    "CZ Stones (Cubic Zirconia)",
    "Freshwater Pearls. Features a lustrous",
    "durable Hyderabadi Polish."
  ],
  "features": "A beautifully crafted Kasulaperu haaram, meticulously strung with delicate coin motifs enhanced with CZ stones. The elaborate pendant showcases a central pear-shaped ruby, surrounded by emerald accents and intricate filigree detailing. The bottom is embellished with delicate pearl drops. Design inspired by traditional South Indian temple jewelry. The clasp is secured with a traditional 'Addigai' style hook, ensuring safety and comfort.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Emerald Green",
    "Pearl White. A classic South Indian color palette signifying prosperity and auspiciousness."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "bridal wear",
    "festivals (like Sankranti",
    "Ugadi",
    "Diwali)",
    "and special occasions (Seemantham",
    "Voni Function/Half-Saree Function). Also suitable for formal events where a statement piece is desired."
  ],
  "description": "This exquisite Kasulaperu Haaram is a true testament to the rich heritage of South Indian jewelry craftsmanship. The genuine 22K gold ensures lasting value and a radiant shine. The carefully selected rubies and emeralds add a touch of regal elegance. The design blends traditional motifs with contemporary appeal, making it a versatile addition to any jewelry collection. Own a piece of Hyderabadi artistry – a cherished heirloom to be passed down through generations.",
  "tags": [
    "Haaram",
    "Kasulaperu",
    "Necklace",
    "Ruby",
    "Emerald",
    "Gold",
    "22K Gold",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Jewelry",
    "Addigai",
    "Pearl",
    "Vivahaalu",
    "Seemantham",
    "Voni Function",
    "Half-Saree Function",
    "Jewellery",
    "Haram"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0345_0542",
  "collection": "diamond"
}