{
  "id": "necklaces-360",
  "title": "Chandrika Diamond and Pearl Haaram Set - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Yellow Gold",
    "Brilliant-cut Diamonds (VS Clarity",
    "G Color)",
    "Cultured South Sea Pearls. Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite haaram features a delicate filigree design adorned with shimmering brilliant-cut diamonds. Each motif is intricately crafted, showcasing a blend of traditional floral patterns with a modern aesthetic. Lustrous South Sea pearls are gracefully suspended from each pendant, adding a touch of sophistication. The matching earrings echo the necklace's design, creating a cohesive and elegant set.",
  "colors": [
    "Golden yellow",
    "brilliant white (diamonds)",
    "and iridescent white (pearls). The classic combination exudes warmth and radiance."
  ],
  "occasions": [
    "Perfect for engagements",
    "weddings (muhurtham)",
    "receptions",
    "and upscale social gatherings. Also suitable for formal events where you want to make a refined statement."
  ],
  "description": "This Chandrika Haaram Set seamlessly blends traditional South Indian design elements with a contemporary flair. The brilliance of the diamonds, combined with the luxurious South Sea pearls, creates a captivating look. Crafted with meticulous attention to detail and Hyderabadi polish, this set is a valuable addition to any jewelry collection. A statement piece that radiates elegance and sophistication.",
  "tags": [
    "Diamond Necklace",
    "Pearl Necklace",
    "Haaram",
    "Jhumka",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "Diamond Set",
    "Pearls",
    "Gold",
    "filigree",
    "contemporary",
    "tradition",
    "engagement",
    "muhurtham",
    "పెళ్లి నగల",
    "వజ్రాల హారం",
    "ముత్యాల హారం"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0474_0656",
  "collection": "diamond"
}