{
  "id": "necklaces-013",
  "title": "Rose-Tinted Diamond Cascade Haaram Set with Statement Earrings",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "18K Rose and White Gold",
    "High-Quality Cubic Zirconia (CZ) Diamonds with Excellent Cut and Clarity. Features a durable Hyderabadi Polish for lasting luster and shine."
  ],
  "features": "This stunning set features a contemporary Haaram design, with a cascading arrangement of intricately designed diamond-studded links. The necklace culminates in a magnificent, diamond-studded pendant. The diamond lattice pattern is interspersed with geometric shapes with floral accents. The accompanying earrings mirror the necklace's design, featuring a diamond-studded motif with a geometric drop. The links provide flexibility and comfort while wearing.",
  "colors": [
    "Rose Gold and White Gold with brilliant white diamond accents",
    "creating a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "grand parties",
    "or any special occasion where you want to make a statement. Its modern design also suits contemporary events and celebrations."
  ],
  "description": "This exquisite set combines modern aesthetics with timeless elegance. The high-quality CZ diamonds provide exceptional sparkle and brilliance, mimicking the look of real diamonds at an accessible price point. The Hyderabadi Polish ensures long-lasting shine and durability. The rose and white gold combination adds a touch of contemporary sophistication, making it a versatile addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace Set",
    "Earrings",
    "Diamond Jewelry",
    "Rose Gold Jewelry",
    "White Gold Jewelry",
    "CZ Diamonds",
    "Hyderabadi Jewelry",
    "Contemporary Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Party Wear",
    "Vivaaham",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Geometric Jewellery"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0019_0048",
  "collection": "choker"
}