{
  "id": "necklaces-965",
  "title": "Kundan Emerald Floral Kasu Haaram - A Timeless Heritage Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Kundan Stones (Diamond Simulants)",
    "Natural Emeralds (Pachala)",
    "Natural Rubies (Garuda Pasupu). Hyderabad Polish for lasting shine and durability."
  ],
  "features": "Intricate Kundan setting with delicate floral motifs. Features central emerald pendant with traditional 'kasu' or coin details integrated into the design. Each floral element is meticulously hand-placed. The pendant has small round drops that give movement and light.",
  "colors": [
    "Golden Yellow",
    "Emerald Green",
    "Ruby Red",
    "Sparkling White (Kundan). The green and red offer a beautiful contrast against the gold."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu/పెళ్లి)",
    "engagement ceremonies",
    "bridal wear",
    "and traditional South Indian celebrations like Seemantham (సీమంతం)",
    "Half-Saree function (Langa Voni Function/లంగా వోణి వేడుక). Also suitable for grand evening events and festive occasions."
  ],
  "description": "This Kundan Emerald Floral Kasu Haaram is a statement piece, embodying the rich cultural heritage of South India. The exquisite craftsmanship and high-quality materials ensure lasting beauty and value. It is a symbol of prosperity and good fortune, making it a cherished heirloom. The combination of Kundan and traditional South Indian design ensures a piece that is both timeless and elegant.",
  "tags": [
    "Kundan Necklace",
    "Haaram",
    "Kasu Mala",
    "Emerald Necklace",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Indian Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Pachala",
    "Garuda Pasupu",
    "Vivahaalu",
    "Seemantham",
    "Contabharanam",
    "కంఠాభరణం",
    "కుందన్ హారం",
    "పెళ్లి",
    "సీమంతం"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0363_2426",
  "collection": "necklace"
}