{
  "id": "necklaces-1453",
  "title": "Emerald & Diamond Nakshi Inspired \"Addigai\" Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Emeralds (faceted cut",
    "vibrant green)",
    "Polki Diamonds (Uncut",
    "GH clarity). Hyderabadi Polish for a luxurious finish."
  ],
  "features": "A modern interpretation of the traditional Addigai. Features a choker-style neckpiece transitioning into a floral motif pendant design adorned with emeralds and polki diamonds. Intricate filigree work surrounds the emeralds, highlighting their brilliance. The necklace is embellished with gold bead tassels, adding a touch of traditional charm. Features a unique textured gold band with diamond accents. ",
  "colors": [
    "Primarily Gold with vibrant Green Emeralds and sparkling White (Polki) Diamonds."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu/పెళ్లి)",
    "receptions",
    "engagement ceremonies",
    "and other grand celebrations. Also suited for contemporary events where you want to make a sophisticated statement. Perfect for Seemantham (సీమంతం) or any auspicious ceremony."
  ],
  "description": "This Addigai necklace seamlessly blends traditional South Indian craftsmanship with contemporary aesthetics. The use of high-quality emeralds and polki diamonds ensures a dazzling display of luxury. The Hyderabadi polish gives the gold a rich, enduring luster, making it a cherished heirloom piece. The design is not only aesthetically pleasing but also culturally significant, reflecting the rich heritage of South Indian jewelry.",
  "tags": [
    "Addigai",
    "కంఠాభరణం",
    "Necklace",
    "Emerald",
    "Pachala Haaram",
    "పచ్చల హారం",
    "Polki Diamonds",
    "Uncut Diamonds",
    "Wedding Jewelry",
    "Vivahaalu",
    "పెళ్లి",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Contemporary Design",
    "Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-51 2_2071",
  "collection": "sjpl"
}