{
  "id": "bangles-127",
  "title": "Emerald Bloom Kangan - A Touch of Tradition",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Yellow Gold (Swarna)",
    "Natural Emerald (Panna) of notable clarity",
    "Hand-selected Sparkling Diamonds (Vajralu). Features Hyderabadi Polish for lasting brilliance."
  ],
  "features": "Intricately crafted openwork design, blending traditional Indian floral motifs with modern geometric patterns. The central emerald is set in a secure bezel setting (pakka setting) and is surrounded by a halo of diamonds. The repeating diamond motif throughout the bracelet adds a touch of elegance and the band has a hinge with a pressure clasp for easy and secure wear.",
  "colors": [
    "Rich yellow gold with a vibrant green emerald centerpiece and brilliant white diamonds",
    "creating a harmonious and auspicious color combination."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festive occasions (Pandugalu)",
    "and celebratory events. A statement piece for traditional attire like sarees and lehengas",
    "and a unique addition to modern formal wear."
  ],
  "description": "This Kangan embodies the timeless elegance of South Indian jewelry. The high-quality materials and meticulous craftsmanship ensure a lasting treasure. The emerald is a symbol of prosperity and the diamonds are symbols of strength and purity. This piece is designed for comfort and durability, and is a guaranteed conversation starter.",
  "tags": [
    "Bracelet",
    "Bangle",
    "Kangan",
    "Gajulu",
    "Emerald",
    "Panna",
    "Diamond",
    "Vajram",
    "Gold",
    "Swarna",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Festive Jewelry",
    "Gift",
    "Handcrafted",
    "Artisan Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0280_0478",
  "collection": "diamond"
}