{
  "id": "necklaces-1030",
  "title": "Heera Moti Jadau Haaram - A Timeless Diamond and Pearl Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish for enduring luster. Adorned with brilliant-cut diamonds",
    "ethically sourced",
    "with VS clarity. Features genuine South Sea pearls known for their exceptional nacre and iridescence. Accented with vibrant ruby stones for a touch of traditional auspiciousness."
  ],
  "features": "This exquisite Haaram features an elaborate design with intricate filigree work. The two-layered chain design, inspired by traditional Telugu vaddanam patterns, is enhanced with diamond-studded floral motifs. The central pendant showcases a radiant ruby surrounded by a halo of diamonds, cascading into delicate pearl drops, a hallmark of South Indian bridal jewelry. The design blends vintage charm with contemporary elegance.",
  "colors": [
    "Radiant gold",
    "sparkling white diamonds",
    "vibrant ruby red",
    "and creamy white pearls create a harmonious and luxurious color palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivahaalu)",
    "receptions",
    "engagement ceremonies (Nischitartham)",
    "and important festivals like Ugadi and Sankranti. Also suitable for high-end social gatherings and celebrations where you want to make a statement."
  ],
  "description": "A testament to timeless elegance, this Haaram embodies the rich heritage of South Indian jewelry craftsmanship. The combination of radiant diamonds, lustrous pearls, and vibrant rubies symbolizes prosperity, purity, and good fortune. Its Hyderabadi polish ensures a lasting shine, while the intricate design makes it a valuable heirloom piece to be treasured for generations. A perfect blend of traditional artistry and modern sensibilities.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Pearl Jewelry",
    "Jadau Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Ugadi",
    "Sankranti",
    "Nischitartham",
    "Heera",
    "Moti",
    "Gold Jewelry",
    "22K Gold",
    "Fine Jewelry",
    "Handcrafted",
    "Indian Jewellery"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0489_2351",
  "collection": "necklace"
}