{
  "id": "earrings-092",
  "title": "Pushpakamal Kundanalu: Emerald, Ruby, and Diamond Flower Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Natural Emeralds (Oval Cut",
    "Good Clarity)",
    "Natural Rubies (Round Cut",
    "Good Clarity)",
    "Uncut Diamonds (Polki/Chakri Cut)"
  ],
  "features": "Floral motif inspired by traditional South Indian temple jewelry. Features a central ruby cluster surrounded by diamonds, with oval-cut emeralds accentuating the outer edges. The gold is intricately crafted with delicate filigree work along the edges, providing a light and airy feel. Handcrafted in Hyderabad using traditional techniques.",
  "colors": [
    "Predominantly gold with vibrant green emeralds",
    "deep red rubies",
    "and sparkling white diamonds. The contrast creates a visually appealing and regal look."
  ],
  "occasions": [
    "Ideal for weddings",
    "festive celebrations like Sankranti and Ugadi",
    "traditional ceremonies",
    "and special occasions. Perfect for pairing with Kanjeevaram sarees or lehengas. Can also be styled with contemporary outfits for a touch of ethnic elegance."
  ],
  "description": "These 'Pushpakamal Kundanalu' are a testament to exquisite Hyderabadi craftsmanship, combining traditional design with modern appeal. The vibrant gemstone combination holds cultural significance, symbolizing prosperity and good fortune. The use of high-quality materials ensures durability and lasting beauty. Lightweight and comfortable for all-day wear, making them a perfect addition to your jewelry collection. A timeless heirloom piece to be cherished for generations.",
  "tags": [
    "Earrings",
    "Kundanalu",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emerald Earrings",
    "Ruby Earrings",
    "Diamond Earrings",
    "Gold Earrings",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Pushpakamal",
    "Telugu Jewelry",
    "Kundan Work"
  ],
  "original_id": "diamond_jewellery_c005522f-74c8-46a3-a401-c3f5477bd500_0190",
  "collection": "diamond"
}