{
  "id": "necklaces-1433",
  "title": "Emerald Radiance Diamond Collar - Unveiling the Vaibhavam Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (stamp verified) with Hyderabadi Polish",
    "featuring a central Emerald of exceptional green color and clarity. Embellished with brilliant-cut diamonds (VS clarity",
    "G color) and vibrant pink sapphires with a round cut."
  ],
  "features": "This stunning collar necklace showcases a harmonious blend of traditional Telugu jewelry design with modern aesthetics. The floral motif design is intricately crafted with pave-set diamonds, leading to a striking Emerald centerpiece. Five delicate drops, each featuring a cluster of pink sapphires set in a floral pattern and framed with diamonds, add a touch of femininity and grace. The Hyderabadi polish enhances the gold's luster, giving it a rich, warm glow.",
  "colors": [
    "Emerald Green",
    "Diamond White",
    "Pink Sapphire",
    "and Warm Gold"
  ],
  "occasions": [
    "Perfect for special occasions like weddings (vratam)",
    "receptions",
    "milestone birthdays",
    "or any grand celebration where you want to make a statement. Its modern design also allows it to be worn at upscale social events or cocktail parties."
  ],
  "description": "This Vaibhavam Haaram is more than just jewelry; it's a wearable piece of art. The combination of high-quality diamonds, a captivating Emerald, and vibrant pink sapphires makes it a truly unique and valuable piece. The intricate craftsmanship reflects the rich heritage of Hyderabadi jewelry making. The design is versatile, blending traditional South Indian elements with a modern silhouette.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pink Sapphire",
    "Collar Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Fine Jewelry",
    "18K Gold",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Floral Design",
    "Partywear"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-43_2051",
  "collection": "sjpl"
}