{
  "id": "rings-001",
  "title": "Raashi Pushpa Vanki Rings - Embellished Bandhi",
  "category": "rings",
  "original_type": "Rings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Ruby Cabochon Center",
    "Emerald accents",
    "and Cubic Zirconia pavé setting. Gold purity guaranteed. Superior craftsmanship for long lasting brilliance."
  ],
  "features": "Intricate floral design inspired by traditional South Indian 'Raashi Pushpa' motifs. The circular arrangement features a Ruby center encircled by Emeralds and sparkling Cubic Zirconia. The 'vanki' style openwork design provides a unique look that blends traditional aesthetics with modern comfort and wearability.",
  "colors": [
    "Predominantly Gold with vibrant Ruby Red and Emerald Green accents. The Cubic Zirconia offers a dazzling white sparkle. Classic and auspicious color palette for traditional occasions."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "festivals (Pandugalu)",
    "and special celebrations. Also suitable as a statement piece for contemporary events and gatherings. A thoughtful gift for Seemantham or other auspicious ceremonies."
  ],
  "description": "This ring is a contemporary take on the classic vanki armlet, offering the same timeless appeal in a more wearable design. Crafted with high-quality materials and meticulous attention to detail, this ring embodies the rich heritage of South Indian jewelry. Its unique design and vibrant color palette make it a statement piece that is sure to turn heads. Guaranteed to retain its luster and value over time.",
  "tags": [
    "Vanki",
    "Ring",
    "Gold Ring",
    "Ruby",
    "Emerald",
    "Cubic Zirconia",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Raashi Pushpa",
    "Embellished Bandhi",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Bridal Jewelry",
    "Pandugalu",
    "Vivahaalu",
    "Seemantham",
    "Women's Ring",
    "Statement Ring"
  ],
  "original_id": "diamond_jewellery_0eaea4f5-8dd7-443c-a003-b8993751cb5c_0078",
  "collection": "diamond"
}