{
  "id": "necklaces-809",
  "title": "Emerald Radiance: Three-Layered Emerald and Diamond Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-purity Gold (22K)",
    "Faceted Emeralds (High Clarity",
    "Deep Green Hue)",
    "Brilliant-cut Diamonds (SI Clarity",
    "G Color). Hyderabadi Kundan setting with intricate detailing."
  ],
  "features": "This exquisite three-layered Haaram features a mesmerizing pattern of square-cut emeralds interspersed with delicate floral motifs completely paved with diamonds. The emeralds are bezel set while the diamonds are placed in a pave setting style, enhancing their brilliance and creating a harmonious balance between color and sparkle. The reverse of the piece shows traditional meenakari work showcasing meticulous attention to detail.",
  "colors": [
    "Deep Green (Emeralds)",
    "Sparkling White (Diamonds)",
    "and Warm Gold."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "Seemantham ceremonies",
    "and grand celebrations. Also suitable as a statement piece for high-profile events and formal gatherings."
  ],
  "description": "This Haaram is a testament to timeless elegance and exceptional craftsmanship. The combination of emeralds and diamonds signifies prosperity, love, and commitment. The multi-layered design offers versatility, allowing it to be worn as a single-strand necklace or a show-stopping three-layer statement piece. The piece showcases Hyderabadi craftsmanship and embodies the rich cultural heritage of South Indian jewelry.",
  "tags": [
    "Haaram",
    "Emerald Necklace",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Layered Necklace",
    "Statement Necklace",
    "Seemantham Jewelry",
    "Muhurtham Jewelry",
    "Pelli Jewelry",
    "Kundan",
    "Pachalu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-43 4_1403",
  "collection": "diamond"
}