{
  "id": "necklaces-1018",
  "title": "Enchanting Emerald and Diamond Vaajra Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold",
    "studded with brilliant-cut Diamonds (VS Clarity",
    "G-H Color) and vibrant Emeralds (heart-shaped cut). Features a meticulously woven gold chain. Hyderabadi Gold Polish for a lasting shine."
  ],
  "features": "A delicately crafted necklace featuring a repeating motif of floral elements and teardrop shapes. The necklace boasts a modern take on traditional aesthetics, with heart-shaped emeralds adding a touch of contemporary elegance. The diamond setting showcases meticulous craftsmanship, ensuring maximum sparkle. The fine gold chain offers a comfortable and secure fit. Intricate filigree detailing adds subtle charm.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "accentuated by the rich green of the emeralds. This classic color combination exudes luxury and sophistication."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "engagement ceremonies",
    "or any special occasion where you want to make a statement. A stunning choice for modern brides or as a cherished gift for Seemantham or Half-Saree functions."
  ],
  "description": "This Vaajra Haaram beautifully balances tradition with modern style. The high-quality diamonds and vibrant emeralds ensure a lasting brilliance and timeless appeal. Its intricate design and Hyderabadi Gold Polish make it a truly unique and heirloom-worthy piece. The secure and comfortable fit ensures you can wear it with confidence.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "Gold Necklace",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Bridal Jewelry",
    "Vaajraalu",
    "Pachalu",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0477_2339",
  "collection": "necklace"
}