{
  "id": "necklaces-1193",
  "title": "Mayura Mohana Haaram: Exquisite Peacock Diamond Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "High-Quality Cubic Zirconia (CZ) Diamonds",
    "Natural Ruby accents (1.58 carats",
    "2 pieces)",
    "Natural Emerald accents (5.80 carats",
    "28 pieces). Features Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "This striking haaram features an intricate peacock (Mayura) design, a symbol of beauty and grace in South Indian culture. The peacocks are adorned with dazzling CZ diamonds, complemented by genuine rubies and emeralds. The design showcases detailed filigree work and delicate diamond settings, exemplifying fine South Indian craftsmanship. The necklace has a modern layered design with a traditional motif.",
  "colors": [
    "Predominantly gold with shimmering white CZ diamonds",
    "vibrant ruby red accents",
    "and lush emerald green detailing. The traditional color combination of red",
    "green",
    "and gold is highly auspicious."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha Mahotsavam)",
    "engagement ceremonies (Nischitartham)",
    "festivals (like Sankranthi or Diwali)",
    "Seemantham (baby shower)",
    "half-saree functions (Voni Function)",
    "and other grand celebrations. Its modern design also makes it suitable for sophisticated evening events."
  ],
  "description": "This Mayura Mohana Haaram is a stunning blend of tradition and contemporary design. The use of high-quality CZ diamonds offers a brilliant sparkle at an accessible price point. The genuine rubies and emeralds add a touch of authentic luxury. The intricate peacock design holds cultural significance, making it a cherished heirloom piece. The Hyderabadi polish ensures long-lasting shine and durability. A true statement piece that embodies South Indian elegance and sophistication.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Peacock Jewelry",
    "Mayura",
    "CZ Diamonds",
    "Ruby",
    "Emerald",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Vivaaha",
    "Seemantham",
    "Ethnic Jewelry",
    "Telugu Jewelry",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Design-Oct-2784",
    "Har01001"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-11_1745",
  "collection": "sjpl"
}