{
  "id": "necklaces-1208",
  "title": "Emerald & Diamond U-Shaped Necklace: The \"Manoharam\" Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold (6.38 g)",
    "featuring brilliant-cut diamonds (2.57 ct)",
    "ten vibrant emeralds (10.24 ct)",
    "and twelve lustrous South Sea Pearls (23.15 ct). Boasts the signature Hyderabadi Polish for enhanced brilliance and durability."
  ],
  "features": "This exquisite U-shaped necklace features a delicate lattice-like design meticulously crafted with diamonds, interspersed with vivid teardrop-shaped emeralds and accented with dangling South Sea pearls. The central pendant showcases a larger emerald embraced by a halo of diamonds in a floral motif, culminating in a single, prominent pearl. The intricate setting enhances the sparkle of each diamond, creating a captivating display of light.",
  "colors": [
    "Primarily rose gold",
    "with the dazzling white of the diamonds",
    "the rich green of the emeralds",
    "and the soft creamy white of the pearls creating a harmonious and luxurious color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions (Sangeeth)",
    "and other special occasions",
    "including bridal wear (Muhurtham) and milestone celebrations. Its elegant design also makes it suitable for sophisticated evening events."
  ],
  "description": "This 'Manoharam' necklace is a harmonious blend of traditional South Indian aesthetics and modern design. The combination of diamonds, emeralds, and pearls offers a unique and timeless appeal, making it a treasured heirloom. The intricate craftsmanship and high-quality materials ensure lasting beauty and value. The U-shape design beautifully adorns the neckline, enhancing any outfit with its regal charm.",
  "tags": [
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "Kanti",
    "Haaram",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Fine Jewelry",
    "Rose Gold",
    "Diamonds",
    "Emeralds",
    "Pearls",
    "Luxury Jewelry",
    "traditional jewellery",
    "pendili jewellery"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-48_1782",
  "collection": "sjpl"
}