{
  "id": "bangles-112",
  "title": "Vaibhavam Bangle: Kundan Elegance in Contemporary Design",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Gold Plated Base. Features high-quality Polki Kundan stones and shimmering cubic zirconia accents. Expertly crafted with a durable Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisitely designed bangle seamlessly blends traditional Kundan craftsmanship with a modern aesthetic. The openwork design showcases intricate floral motifs surrounding each Polki Kundan stone. The secure clasp ensures a comfortable and confident fit. The geometric back adds sophistication. This 'Kanganam' (Telugu term for bangle) is the perfect embodiment of heritage and contemporary style.",
  "colors": [
    "Predominantly gold with the clear sparkle of the Polki Kundan stones and cubic zirconia."
  ],
  "occasions": [
    "Ideal for weddings (Vivahāṁ)",
    "receptions",
    "festivals (like Ugadi or Sankranthi)",
    "and special occasions. Its versatile design also makes it perfect for adding a touch of elegance to formal events and contemporary celebrations."
  ],
  "description": "Experience the timeless beauty of Kundan in a contemporary form. This bangle showcases the rich cultural heritage of Hyderabad, combined with modern design sensibilities. Its durable construction and high-quality materials ensure it will be a cherished heirloom for generations. The Hyderabadi Polish guarantees a long-lasting luster. Offers superior value and style compared to pure gold alternatives. This is an 'Adhbutham' (Telugu for 'amazing') investment piece!",
  "tags": [
    "Kundan Bangle",
    "Hyderabad Jewelry",
    "South Indian Jewelry",
    "Wedding Bracelet",
    "Indian Bracelet",
    "Ethnic Jewelry",
    "Polki",
    "Kanganam",
    "Vaibhavam",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Adhbutham"
  ],
  "original_id": "diamond_jewellery_DPBR8-1671_0223",
  "collection": "diamond"
}