{
  "id": "necklaces-049",
  "title": "Mayura Kasu Pendant - A Regal Touch of Tradition",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (916 Hallmark)",
    "High-Quality Cubic Zirconia (CZ) Diamonds",
    "Ruby Accent Stone. Meticulously crafted with traditional Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite pendant features a stunning peacock (Mayura) motif, a symbol of beauty and royalty in South Indian culture. The intricate filigree work and pave-set CZ diamonds emulate the grandeur of traditional Kasu Haram designs. The ruby accent stone adds a pop of color and elegance. The design allows this piece to be added to an existing haram or choker.",
  "colors": [
    "Radiant Yellow Gold",
    "Sparkling White Cubic Zirconia",
    "Vibrant Ruby Red"
  ],
  "occasions": [
    "Ideal for weddings",
    "festive occasions like Ugadi and Sankranti",
    "traditional dance performances (Kuchipudi",
    "Bharatanatyam)",
    "and special events where you want to showcase your heritage with grace. Perfect for pairing with a Kanjeevaram saree or a traditional Langa Voni."
  ],
  "description": "This Mayura Kasu Pendant is more than just jewelry; it's a statement of cultural pride and timeless elegance. The superior craftsmanship, combined with high-quality materials, ensures a piece that will be cherished for generations. The versatile design allows it to be styled with various outfits, blending seamlessly with both traditional and contemporary aesthetics. Own a piece of Hyderabad's rich jewelry heritage.",
  "tags": [
    "Pendant",
    "Kasu Haram",
    "Mayura",
    "Peacock",
    "Addigai",
    "Choker",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Cubic Zirconia",
    "Ruby",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Ugadi",
    "Sankranti",
    "Muhurtham",
    "Langa Voni",
    "Kanjeevaram",
    "Jewellery",
    "Bharatanatyam",
    "Kuchipudi",
    "Alankarana",
    "Abharana"
  ],
  "original_id": "diamond_jewellery_54f6c32a-f9ed-4aab-86e9-caf687b39fcf_0122",
  "collection": "diamond"
}