{
  "id": "necklaces-274",
  "title": "Elegant Navaratna Kasu Mala Inspired Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Brilliant Cut CZ Diamonds",
    "High Quality Ruby",
    "Emerald. Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite necklace features a modern take on the traditional Kasu Mala, incorporating intricately designed circular pendants, each studded with brilliant cut CZ diamonds. The center pendant highlights a striking rectangular Ruby complemented with emeralds on the adjacent pendants. Delicate gold balls, reminiscent of traditional Lakshmi Kasu, dangle gracefully from the center pendant, adding a touch of heritage. The openwork design of the pendants allows light to dance through the gems, creating a mesmerizing effect.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Emerald Green",
    "Diamond White."
  ],
  "occasions": [
    "Perfect for modern brides",
    "engagement ceremonies",
    "wedding receptions",
    "or special occasions like a Sangeet. Also suitable for contemporary formal events and festive celebrations like Ugadi or Sankranti."
  ],
  "description": "This necklace seamlessly blends traditional South Indian aesthetics with contemporary design. The brilliant cut diamonds provide exceptional sparkle, while the high-quality ruby and emeralds add a pop of color and value. The 22K gold ensures lasting beauty and investment value. Its delicate design makes it comfortable to wear while still making a statement. The subtle incorporation of Kasu elements pays homage to Telugu heritage.",
  "tags": [
    "Necklace",
    "Haaram",
    "Kasu Mala",
    "CZ Diamond",
    "Ruby",
    "Emerald",
    "22K Gold",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Contemporary Jewelry",
    "Temple Jewelry Inspired",
    "Gemstone Necklace",
    "Andhra Jewelry",
    "Telangana Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0355_0552",
  "collection": "diamond"
}