{
  "id": "necklaces-1576",
  "title": "Emerald Blossom Cascade: Diamond & Emerald Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold",
    "Brilliant Cut Diamonds (VS Clarity)",
    "Emerald Cut Natural Emeralds (Vivid Green",
    "SI Clarity). Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This exquisite three-layered Haaram showcases a captivating cascade of emeralds and diamonds. Each layer features emerald-cut emeralds bezel-set in white gold, separated by intricate floral diamond clusters. The diamond clusters are pavé-set for maximum brilliance, evoking traditional South Indian flower motifs. The arrangement creates a dramatic yet elegant silhouette.",
  "colors": [
    "Vivid Green (Emeralds)",
    "Sparkling White (Diamonds)",
    "Luminous White Gold."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (పెళ్లి)",
    "receptions",
    "Seemantham (సీమంతం)",
    "or any celebration where you want to make a statement. Its modern elegance also makes it suitable for high-profile events and gala dinners."
  ],
  "description": "This Haaram is a testament to exceptional craftsmanship, blending traditional South Indian aesthetics with modern jewelry design. The vibrant emeralds and dazzling diamonds create a mesmerizing visual impact, symbolizing prosperity and good fortune. The Hyderabadi polish ensures lasting brilliance, making it a treasured heirloom for generations. Invest in timeless elegance and cultural significance with this stunning piece.",
  "tags": [
    "Haaram",
    "Haram",
    "Necklace",
    "Emerald Necklace",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "Luxury Jewelry",
    "కంఠాభరణం",
    "పెళ్లి",
    "సీమంతం",
    "Emeralds",
    "Diamonds",
    "White Gold"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-43 4_2281",
  "collection": "sjpl"
}