{
  "id": "necklaces-930",
  "title": "Lakshmi Kasu Haaram with Emeralds and Polki Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Finest Quality Polki Diamonds (Uncut Diamonds)",
    "Emeralds (Oval Cabochon Cut)",
    "Coral Beads. Hyderabadi Gold Polish for lasting brilliance."
  ],
  "features": "This exquisite Kasu Haaram showcases a traditional design featuring intricately detailed Lakshmi coins interspaced with Polki diamonds. The central pendant features a finely crafted Lakshmi idol in pure gold. Green emeralds and Coral Beads are bezel set along the pendant drop, accentuating the elegance. The design is inspired by Temple Jewellery. Handcrafted by skilled artisans from Hyderabad.",
  "colors": [
    "Yellow Gold",
    "White (Polki Diamonds)",
    "Green (Emeralds)",
    "Orange-Red (Coral Beads). A harmonious blend of traditional South Indian colours."
  ],
  "occasions": [
    "Perfect for weddings",
    "bridal wear (Muhurtham)",
    "Seemantham",
    "festivals",
    "and other auspicious occasions. Can also be styled with contemporary outfits for a fusion look."
  ],
  "description": "A symbol of prosperity and blessings, this Kasu Haaram embodies the rich cultural heritage of South India. The use of Polki diamonds, emeralds, and gold reflects unparalleled craftsmanship and timeless beauty. It's a heirloom piece to be treasured for generations. The combination of traditional design and high-quality materials makes it a valuable investment.",
  "tags": [
    "Kasu Haram",
    "Lakshmi Haaram",
    "Polki Diamond Necklace",
    "Emerald Necklace",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Necklace",
    "Hyderabadi Jewelry",
    "Muhurtham Jewelry",
    "Seemantham",
    "guttapusalu",
    "addigai",
    "pendant",
    "guttapusalu haram"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0324_2391",
  "collection": "necklace"
}