{
  "id": "necklaces-316",
  "title": "Ethereal Diamond & Gemstone Flower Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold. Adorned with brilliant-cut diamonds (SI clarity",
    "G-H color)",
    "a central pear-shaped ruby",
    "vibrant green emeralds and lustrous freshwater pearls. Showcases the renowned Hyderabadi polish for a lasting shine."
  ],
  "features": "This exquisite Haaram features a delicate floral design motif along the necklace chain. Intricate filigree work surrounds each gemstone, emphasizing its sparkle. The pendant showcases traditional paisley and floral design, enhanced with pearl drops for a touch of elegance. The setting ensures maximum light reflection for optimal brilliance, resulting in a truly captivating look.",
  "colors": [
    "Primarily gold with the dazzling brilliance of diamonds. The focal point is the rich red of the ruby",
    "contrasted with the lush green of the emeralds",
    "further softened by the creamy white of the freshwater pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "Seemantham",
    "or any grand celebration. It adds a touch of traditional elegance with a modern flair to your special moments."
  ],
  "description": "This Haaram seamlessly blends traditional South Indian design with modern aesthetics. The brilliant-cut diamonds and colorful gemstones create a captivating contrast, making it a statement piece that will be treasured for generations. Its exceptional craftsmanship ensures durability, while its timeless design makes it a valuable addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Floral Design",
    "Seemantham Jewelry",
    "Muhurtham Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0405_0602",
  "collection": "diamond"
}