{
  "id": "earrings-098",
  "title": "Diamond-Studded Golden Jhumka Earrings with Pearl Drops",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold (Bangaram)",
    "Natural Diamonds (Vajralu) with excellent cut and clarity",
    "South Sea Pearls. Features a Hyderabadi Polish for a lasting shine."
  ],
  "features": "Intricately crafted Jhumka design with delicate filigree work enhanced with glittering diamonds. The top portion has floral design, with the main body of the Jhumka adorned with a lattice pattern of gold and diamonds. Finished with delicate pearl drops (Mutyala) at the bottom for added elegance. Features a secure post and screw-back closure.",
  "colors": [
    "Warm Golden Yellow (Bangaram) from the gold",
    "brilliant White (Thella) from the Diamonds",
    "and a soft",
    "creamy white from the South Sea Pearls."
  ],
  "occasions": [
    "Perfect for traditional South Indian occasions like weddings (Vivahamu)",
    "festivals (Pandugalu)",
    "engagements (Nischitartham)",
    "and half-saree functions (Half Saree Function). Equally suitable for adding a touch of ethnic elegance to modern parties and celebrations."
  ],
  "description": "A timeless classic, these Jhumka earrings seamlessly blend traditional South Indian design with modern craftsmanship. The high-quality diamonds and lustrous pearls offer a touch of luxury, while the intricate gold work showcases the skill of Hyderabad's finest artisans. These are not just earrings; they are a statement of cultural pride and enduring beauty (Chirakala Soundaryam).",
  "tags": [
    "Jhumka",
    "Chettu Kammalu",
    "Diamond Earrings",
    "Pearl Earrings",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Gold Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Indian Earrings",
    "Ethnic Earrings",
    "Fine Jewelry",
    "22K Gold",
    "Vajralu",
    "Bangaram",
    "Mutyala",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_c88db040-09e2-4796-a71b-212e71fda7ec_0197",
  "collection": "diamond"
}