{
  "id": "necklaces-1492",
  "title": "Maharani Emerald Diamond Haaram - A Regal Cascade of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features meticulously set",
    "high-quality brilliant-cut diamonds and vibrant",
    "natural emeralds. Emeralds are of Zambian origin with excellent clarity and color saturation."
  ],
  "features": "This magnificent haaram showcases a central, intricately designed pendant with floral motifs meticulously encrusted with diamonds. The pendant features a prominent square-cut emerald at its center, surrounded by smaller emerald drops. The multi-strand design incorporates four delicate strands of shimmering diamonds, culminating in emerald accents near the clasp. The filigree work exudes a sense of vintage charm and intricate craftsmanship.",
  "colors": [
    "Predominantly gold and white (diamonds) with striking emerald green accents. This classic South Indian color combination symbolizes prosperity and growth."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (kalyanam)",
    "receptions",
    "and other celebratory events. An exquisite piece for brides during their muhurtham ceremony or for family members attending a significant milestone event. Also suitable for high-end formal gatherings and cultural events."
  ],
  "description": "This haaram is a testament to the timeless beauty of South Indian jewelry. The use of high-quality materials and exquisite craftsmanship ensures a piece of lasting value. The design blends traditional motifs with a contemporary sensibility, making it a versatile addition to any jewelry collection. The emeralds symbolize prosperity and new beginnings, making this haaram a meaningful and cherished heirloom.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Kalyanam",
    "Muhurtham",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Zambian Emerald",
    "Filigree",
    "Grand Necklace",
    "Temple Jewelry",
    "వడ్డాణం",
    "నగలు",
    "పెళ్లి నగలు",
    "ముత్యాల నగలు"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-31_2110",
  "collection": "sjpl"
}