{
  "id": "necklaces-1190",
  "title": "Exquisite Emerald and Diamond Haaram with Pearl Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (estimated)",
    "Sparkling Diamonds (Dwt: 13.91 carats)",
    "Rich Green Emeralds (Eme: 8.02 carats + 1.08 carats in Locket)",
    "Lustrous South Sea Pearls (Moti: 52.05 carats)",
    "Accented with Rubies (Ruby: 6.61 carats + 1.56 carats in Locket). Expertly finished with a classic Hyderabadi Polish."
  ],
  "features": "A stunning three-layer Haaram featuring intricate floral and paisley diamond settings. Each layer is carefully designed to cascade beautifully. The second layer features emerald floral accents. The third layer features vibrant green emeralds and delicate pearl drops. The focal point is the ornate pendant with a central emerald, surrounded by a floral arrangement of diamonds and finished with pearl drops. Classic South Indian design with modern sensibility.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant pops of green from the emeralds and the soft glow of the pearls."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaham)",
    "receptions",
    "Seemantham (baby shower)",
    "and other traditional celebrations. Also makes a statement piece for high-profile social events and galas."
  ],
  "description": "A timeless heirloom piece that blends traditional South Indian aesthetics with contemporary elegance. The use of high-quality diamonds, vibrant emeralds, and lustrous pearls ensures a luxurious feel. The intricate craftsmanship and attention to detail make this Haaram a true work of art. A valuable investment and a symbol of enduring beauty and prosperity.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Moti Mala",
    "Vaddanam",
    "Kasulaperu",
    "Seemantham Jewelry",
    "Vivaham",
    "Telugu Jewelry",
    "Emeralds",
    "Diamonds",
    "Pearls",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Har00982"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-10_1742",
  "collection": "sjpl"
}