{
  "id": "necklaces-1512",
  "title": "Emerald Diamond Grandeur: Traditional Kempu Rasi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold (916 Gold Hallmark) with Hyderabadi Polish",
    "featuring high-quality brilliant-cut Diamonds (VS Clarity",
    "GH Color) and vibrant",
    "ethically-sourced Emeralds of exceptional color and luster."
  ],
  "features": "This exquisite Haaram showcases a mesmerizing floral design motif, intricately set with dazzling diamonds and complemented by striking emerald accents. The pendant boasts a regal, cascading structure with delicate gold bead hangings, embodying the classic Kempu Rasi style. The setting utilizes both prong and bezel settings to maximize gemstone brilliance and security. The entire piece reflects the impeccable craftsmanship for which Hyderabad is renowned.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with a bold contrast provided by the rich",
    "deep green of the emeralds. This color palette is deeply rooted in South Indian tradition and symbolizes prosperity and new beginnings."
  ],
  "occasions": [
    "Perfect for grand celebrations such as weddings (Muhurtham)",
    "receptions",
    "milestone anniversaries",
    "and significant cultural events. Also ideal for adding a touch of regal elegance to contemporary formal gatherings."
  ],
  "description": "This Haaram is more than just jewelry; it's an heirloom. The piece represents a blend of timeless design and superior craftsmanship, making it a valuable addition to any discerning jewelry collection. The dazzling diamonds and vibrant emeralds create a captivating visual impact. Its substantial gold weight ensures lasting value, while its traditional design holds deep cultural significance.",
  "tags": [
    "Haaram",
    "Kempu",
    "Emerald",
    "Diamond",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Indian Jewellery",
    "कंठहारं",
    "VS Clarity",
    "22K Gold",
    "Traditional Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-38_2130",
  "collection": "sjpl"
}