{
  "id": "necklaces-172",
  "title": "The Mohini Kundan Jadau Choker: A Timeless Telugu Heritage Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features meticulously set Kundan stones",
    "Rose Cut Diamonds",
    "and lustrous South Sea Pearls. The Kundan stones exhibit exceptional clarity and are carefully selected for their brilliance."
  ],
  "features": "This exquisite choker showcases the revered Kundan Jadau craftsmanship, a hallmark of Hyderabad's rich jewelry tradition. The design features a graduated arrangement of Kundan stones and diamonds, culminating in a delicate cascade of pearl drops. The setting meticulously protects each stone, ensuring longevity and brilliance. The reverse features intricate Meenakari enamel work.",
  "colors": [
    "Antique Gold finish",
    "white diamonds",
    "and creamy white pearls create a classic and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "Seemantham ceremonies",
    "and high-profile social gatherings. It adds a touch of regal elegance to any bridal ensemble or traditional attire."
  ],
  "description": "This is a truly heirloom-worthy piece that embodies the cultural heritage of Hyderabad. The meticulous craftsmanship ensures durability and lasting beauty. The Kundan Jadau setting provides unparalleled sparkle and is highly sought after by connoisseurs of fine jewelry. It's a statement piece that exudes sophistication and timeless elegance.",
  "tags": [
    "Kundan Jadau",
    "Choker",
    "Haaram",
    "కంఠాభరణము",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Indian Jewelry",
    "Kundan Necklace",
    "Antique Gold Jewelry",
    "Pearl Necklace",
    "Rose Cut Diamonds",
    "Meenakari",
    "Muhurtham Jewelry",
    "Seemantham",
    "Heirloom Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0011_0420",
  "collection": "diamond"
}