{
  "id": "bangles-132",
  "title": "Lakshmi Kasu Kankanam - Divine Diamond-Studded Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "Brilliant-cut Diamonds (VVS Clarity",
    "G Color). Features traditional Hyderabadi Polish for a rich",
    "enduring luster. The Lakshmi kasu is crafted with antique gold finish."
  ],
  "features": "Openwork bangle design featuring intricately detailed floral motifs embellished with shimmering diamonds. The centerpiece showcases a handcrafted Lakshmi Kasu, embodying prosperity and blessings. The kankanam showcases meticulous filigree work, a hallmark of South Indian artistry.",
  "colors": [
    "Warm gold tones accented by the bright white sparkle of the diamonds",
    "creating a captivating contrast. The antique gold finish of the Lakshmi Kasu adds depth and dimension to the design."
  ],
  "occasions": [
    "Perfect for auspicious occasions such as weddings (Vivaha Mahotsavam)",
    "festivals (like Diwali and Dasara)",
    "and traditional ceremonies (Seemantham",
    "Voni Function). A valuable family heirloom to pass down through generations."
  ],
  "description": "Exquisite blend of traditional South Indian design and modern diamond setting. The Lakshmi Kasu symbolizes wealth and good fortune, making it an auspicious gift. Meticulously handcrafted by skilled artisans in Hyderabad, ensuring superior quality and lasting beauty. The openwork design ensures comfort and breathability.",
  "tags": [
    "Bangle",
    "Kankanam",
    "Lakshmi",
    "Kasu",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Diamond Bangle",
    "22K Gold",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Festive Jewelry",
    "Diwali",
    "Dasara",
    "Seemantham",
    "Voni Function",
    "Vivaha Mahotsavam"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0357_0554",
  "collection": "diamond"
}