{
  "id": "necklaces-872",
  "title": "Exquisite Diamond Ruby Necklace - A Modern Rendition of the Traditional Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold base intricately set with brilliant-cut Diamonds (VS clarity",
    "G color). Features a central",
    "pear-shaped Ruby gemstone",
    "accented with Emeralds and lustrous South Sea Pearls. Hyderabadi Polish ensures lasting shine and vibrancy."
  ],
  "features": "This striking necklace showcases a contemporary interpretation of the classic Haaram. It features a delicate, flower-linked diamond chain leading to a more elaborate pendant. The pendant incorporates a filigree design encrusted with diamonds around a central ruby. Emeralds and South Sea Pearls add a touch of regal elegance. The design beautifully blends modern sensibilities with traditional South Indian motifs.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant accents of red (ruby) and green (emeralds). The pearls add a soft",
    "creamy white contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and special occasions. This versatile piece can be worn with traditional silk sarees for a classic look",
    "or paired with modern evening gowns for a touch of sophisticated glamour. Ideal for Muhurtham",
    "Sangeet",
    "or even a high-end cocktail party."
  ],
  "description": "This necklace is a testament to exquisite craftsmanship and timeless design. The use of high-quality diamonds, ruby and emerald ensures enduring beauty and value. The fusion of traditional Haaram elements with a contemporary design makes it a truly unique and statement-making piece. Possessing this necklace is like owning a piece of Hyderabad's rich jewelry heritage reimagined for the modern era.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond Necklace",
    "Ruby Necklace",
    "Emeralds",
    "Pearls",
    "South Sea Pearls",
    "Gold Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Reception",
    "South Indian Wedding",
    "Contemporary Design",
    "Fine Jewelry",
    "Andhra Jewellery",
    "Kasulaperu"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0405_1559",
  "collection": "haaram"
}