{
  "id": "necklaces-1501",
  "title": "Emerald and Diamond Mango Mala - The Rajyalakshmi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Premium Emeralds (Zambian origin)",
    "Certified VVS Clarity Diamonds. Gold weight: 65 grams",
    "Diamond Weight: 7.5 carats",
    "Emerald Weight: 4.2 carats"
  ],
  "features": "Intricately crafted Mango Mala design, featuring a central paisley pendant. Each mango motif is adorned with brilliant cut diamonds and vibrant emeralds. The pendant showcases a stylized peacock motif representing prosperity and beauty. The necklace utilizes a closed setting for the diamonds to ensure maximum brilliance and security. Handcrafted by skilled artisans using traditional 'Nakshi' techniques passed down through generations, ensuring a high level of detail and a rich antique look.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and Diamond White. The vibrant green of the emeralds contrasts beautifully with the warm yellow gold and the sparkle of the diamonds",
    "a classic and timeless South Indian color combination."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "Muhurtham",
    "Seemantham ceremonies",
    "grand celebrations",
    "and upscale social events. Its timeless design also makes it a treasured family heirloom to be passed down for generations."
  ],
  "description": "This Rajyalakshmi Haaram is a statement piece that embodies South Indian heritage and artistry. The use of high-quality emeralds and diamonds, combined with the meticulous craftsmanship, makes it a valuable investment. The peacock motif symbolizes auspiciousness and grace, adding a layer of cultural significance. Its versatile design ensures it can be worn on both traditional and modern occasions. Each gemstone is carefully selected for its color, cut, and clarity, ensuring maximum brilliance and value.",
  "tags": [
    "Necklace",
    "Haaram",
    "Mango Mala",
    "Maangaai Maalai",
    "Emeralds",
    "Diamonds",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Nakshi Work",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Muhurtham",
    "Seemantham",
    "Heirloom Jewelry",
    "Indian Jewelry",
    "Peacock Design",
    "Statement Necklace",
    "Rajyalakshmi",
    "VVS Diamonds"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-35 2_2119",
  "collection": "sjpl"
}