{
  "id": "necklaces-1215",
  "title": "Emerald Blossom Maangai Necklace - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Certified Natural Emeralds (1.84 cts total weight",
    "sourced from Zambia)",
    "High-quality Cubic Zirconia (CZ) set in a Pave setting. Weight is 45.580 grams. Diamond weight: 4.53 cts. Gemstones details Ruby: 3.02 cts",
    "Blue stones 3.20 cts. Features a lustrous Hyderabadi Polish",
    "ensuring a brilliant and long-lasting shine."
  ],
  "features": "This exquisite necklace features a captivating maangai (mango) design element, a timeless symbol of prosperity and fertility in South Indian culture. The delicate vine-like gold work is meticulously studded with brilliant-cut CZ stones, culminating in a breathtaking Emerald Blossom pendant. The pendant showcase's a central square emerald gemstone and is encircled by a halo of smaller cubic zirconia, creating a mesmerizing play of light. A delicate blue stone drop adds a touch of playful modernity.",
  "colors": [
    "Primarily gold with vibrant emerald green accents. The white sparkle of the CZ provides a stunning contrast",
    "highlighting the richness of the gold and the depth of the emeralds. The pale blue drop adds a touch of contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand celebrations like muhurtham",
    "seemantham",
    "and half-saree function. Its contemporary design also makes it suitable for upscale modern events and formal gatherings."
  ],
  "description": "This Emerald Blossom Maangai Necklace is a testament to timeless elegance. It seamlessly blends traditional South Indian motifs with modern design sensibilities. The high-quality materials and expert craftsmanship ensure a durable and luxurious piece that will be treasured for generations. The emeralds, known for their association with wisdom and growth, make this necklace a meaningful and stylish addition to any jewelry collection. Owning it is like owning a piece of Hyderabad’s heritage.",
  "tags": [
    "Necklace",
    "Haaram",
    "Emerald",
    "CZ",
    "Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Maangai",
    "traditional",
    "modern",
    "festive",
    "women",
    "pendant"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-51 3_1789",
  "collection": "sjpl"
}