{
  "id": "earrings-591",
  "title": "Emerald Lavanya Jhumka – A Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in high-quality gold-plated metal",
    "embellished with brilliant-cut simulated diamonds and a striking pear-shaped emerald simulant. Finished with luminous freshwater pearls. Features a durable and lustrous finish with Hyderabadi Polish."
  ],
  "features": "These enchanting Jhumkas feature an intricate filigree design, reminiscent of delicate vines and blossoms. The central pear-shaped emerald simulant is framed by a halo of dazzling simulated diamonds, enhancing its vibrant green hue. The Jhumkas are finished with a delicate cascade of lustrous freshwater pearls, adding a touch of traditional elegance. The design showcases the best of traditional South Indian craftsmanship with a modern, lightweight feel.",
  "colors": [
    "Predominantly gold and white with a vibrant splash of emerald green. The pearls add a soft",
    "creamy contrast",
    "making the piece versatile and eye-catching."
  ],
  "occasions": [
    "Perfect for both grand celebrations and sophisticated gatherings. Ideal for weddings (vivaha)",
    "receptions",
    "Sangeet",
    "traditional festivals (like Sankranthi and Diwali)",
    "and even adds a touch of glamour to evening parties."
  ],
  "description": "These Jhumkas blend traditional South Indian aesthetics with modern design sensibilities, making them a timeless addition to any jewelry collection. The use of high-quality simulated diamonds and pearls offers exceptional sparkle and elegance at an accessible price point. Lightweight and comfortable to wear, these earrings are perfect for those who appreciate both style and comfort. The Hyderabadi Polish ensures lasting shine and durability.",
  "tags": [
    "Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Emerald Jewelry",
    "Pearl Earrings",
    "Gold Plated",
    "Simulated Diamonds",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Vivaha",
    "Sankranthi",
    "Diwali",
    "Jewellry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-32 3_1763",
  "collection": "sjpl"
}