{
  "id": "necklaces-775",
  "title": "Emerald & Diamond Nakshi Work Bridal Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "Premium Quality Emeralds ( Zambian ) with excellent clarity and vibrant green color",
    "High-Quality Cubic Zirconia (CZ) stones",
    "Natural Freshwater Pearls."
  ],
  "features": "Elaborate Nakshi work (నక్షి పని) showcasing traditional South Indian craftsmanship. Features a tiered design with a central pendant and intricate detailing. The Emeralds are set in a closed setting (kundan style hints present). The design includes a 'kundan' style setting in some areas, creating a rich and textured look. The pearl drops add a touch of elegance and movement to the piece.",
  "colors": [
    "Predominantly gold with vibrant green Emerald accents and the soft",
    "creamy white of the freshwater pearls. A harmonious combination representing prosperity and purity."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "engagement ceremonies (Nischitartham)",
    "weddings (Vivah)",
    "and other grand celebrations. Also suitable for upscale parties and cultural events."
  ],
  "description": "This Haaram is a testament to exquisite South Indian artistry. The rich Nakshi work, combined with the vibrant Emeralds and lustrous pearls, makes it a truly unforgettable piece. The 22K gold ensures lasting value and a luxurious feel. A heirloom quality piece that can be passed down through generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Emeralds",
    "Pearls",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Vivah",
    "kantaabharanamu",
    "కంఠాభరణం",
    "bangaru",
    "బంగారు",
    "patti",
    "పట్టి"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-08_1281",
  "collection": "diamond"
}