{
  "id": "bangles-100",
  "title": "Chandrika Kangan: Diamond & Ruby Bangle of Timeless Elegance",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Fine Quality Round Brilliant Cut Diamonds (SI Clarity",
    "G Color)",
    "Natural Rubies. Features the signature Hyderabadi Kundan Polish."
  ],
  "features": "This exquisite bangle showcases a captivating floral motif, meticulously crafted with bezel-set diamonds and interspersed with vibrant rubies. The central focal point features a radiant rosette of diamonds surrounding a central ruby, creating a harmonious blend of tradition and sophistication. The delicate filigree work and scalloped edges add a touch of vintage charm, characteristic of classic South Indian jewelry. The bangle opens on a hinge with a secure clasp.",
  "colors": [
    "Yellow Gold",
    "Brilliant White (Diamonds)",
    "Rich Red (Rubies). The color combination is considered auspicious in many South Indian traditions."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements",
    "festivals like Diwali and Sankranthi",
    "and significant family celebrations like seemantham or naming ceremonies (Puttina Roju). Also suitable for adding a touch of timeless elegance to modern formal attire."
  ],
  "description": "This Chandrika Kangan is more than just a piece of jewelry; it's an heirloom. The exceptional craftsmanship, combined with the purity of the gold and the brilliance of the diamonds and rubies, makes it a valuable investment. Its timeless design ensures it will be cherished for generations. The Hyderabadi Kundan polish enhances the luster and richness of the gold. Wearing this Kangan is a statement of refined taste and appreciation for South Indian heritage.",
  "tags": [
    "Bangle",
    "Kangan",
    "Kadayam",
    "Diamond",
    "Ruby",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Kundan",
    "Indian Wedding",
    "Festive Jewelry",
    "Engagement Jewelry",
    "Fine Jewelry",
    "Vivahaalu",
    "Puttina Roju",
    "Seemantham",
    "Chandrika"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0412_0028",
  "collection": "bracelets"
}