{
  "id": "necklaces-1096",
  "title": "Maharani Polki & Ruby Cascade Haaram - A Regal Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (approx. 3 carats)",
    "Natural Rubies (Burmese Origin)",
    "Freshwater Pearls. Features our signature Hyderabadi Polish for a lasting gleam."
  ],
  "features": "This unique Haaram blends traditional Polki setting with a contemporary cascade design. The floral pendant centerpiece features a central square-cut Polki, surrounded by smaller Polkis and delicate ruby accents. The cascade is meticulously strung with strands of lustrous freshwater pearls, gradually transitioning into vibrant ruby beads. The chain is interspersed with pearls and rubies, adding a touch of elegance. The polki setting is done in a closed setting with intricate detailing, showcasing the craftsmanship of our artisans.",
  "colors": [
    "Dominant gold with sparkling white Polki diamonds",
    "vibrant ruby red accents",
    "and the soft iridescence of freshwater pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "receptions",
    "grand celebrations",
    "and high-end parties. A stunning choice for Seemantham or a special half-saree function."
  ],
  "description": "This Haaram is a conversation starter, seamlessly blending traditional South Indian aesthetics with a modern, wearable design. The high-quality Polki diamonds and natural rubies ensure lasting brilliance. The Hyderabadi polish guarantees the gold's luster will endure for generations. The cascade design adds movement and sophistication, making it a truly unique and valuable heirloom.",
  "tags": [
    "Haaram",
    "Polki Necklace",
    "Ruby Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Ethnic Jewelry",
    "Gold Necklace",
    "Diamond Necklace",
    "Rubies",
    "Pearls",
    "Vivaha Mahotsavam",
    "Seemantham",
    "Kasulaperu",
    "Addigai"
  ],
  "original_id": "radhe_diam_DPPD8-1626_2509",
  "collection": "radhe"
}