{
  "id": "necklaces-1142",
  "title": "The \"Indradhanush Haaram\" - Rainbow Gemstone Cascade Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Emerald (Central stone - estimated at 5 carats)",
    "Polki Diamonds",
    "Rubies",
    "Freshwater Pearls",
    "Tanzanite",
    "Pink Tourmaline",
    "Green Tsavorite Garnets. Crafted using traditional Kundan setting techniques",
    "with a delicate Hyderabadi polish."
  ],
  "features": "A breathtaking statement necklace featuring a central floral motif of a vibrant Emerald surrounded by Polki diamonds and lustrous pearls. Cascading strands of meticulously hand-strung tanzanite and tourmaline beads create a mesmerizing rainbow effect (Indradhanush). The necklace is adorned with intricate gold birds embellished with rubies and emeralds. The use of traditional Kundan setting and the floral motif are reminiscent of Mughal-inspired artistry, subtly blended with South Indian design sensibilities.",
  "colors": [
    "The overall color scheme is a vibrant spectrum",
    "with a focus on blue (Tanzanite)",
    "pink (Tourmaline)",
    "green (Emerald",
    "Garnet)",
    "red (Ruby)",
    "and the warm luster of 22K gold."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha)",
    "receptions",
    "Seemantham (baby shower)",
    "or any event where you want to make an unforgettable impression. Its regal design makes it ideal for formal Indian attire",
    "especially silk sarees like Kanjeevaram or Paithani."
  ],
  "description": "This Indradhanush Haaram is a true masterpiece of craftsmanship. It seamlessly blends traditional South Indian design elements with a modern sensibility. The high-quality gemstones, meticulous hand-stringing, and the use of 22K gold ensure its enduring beauty and value. This is not just a necklace; it's an heirloom piece to be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Kundan",
    "Emerald",
    "Polki Diamond",
    "Ruby",
    "Tanzanite",
    "Tourmaline",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Statement Necklace",
    "Vivaha",
    "Seemantham",
    "Gemstone Necklace",
    "Indian Jewelry"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0045_2561",
  "collection": "radhe"
}