{
  "id": "necklaces-071",
  "title": "Elegant Navratna Kundan Choker - Panchala Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Pearls",
    "Emeralds (Marakata Mani)",
    "Rubies (Manikyam)",
    "Uncut Diamonds (Polki Diamonds)",
    "Hyderabadi Polish"
  ],
  "features": "A breathtaking choker featuring a center pendant with a floral motif crafted in intricate Kundan setting with uncut diamonds. The pendant is adorned with a central ruby and surrounded by emerald accents. The multi-strand necklace combines lustrous freshwater pearls and vibrant green emerald beads. Delicate emerald droplets dangle from the pendant, each accented with a tiny pearl. Handcrafted in Hyderabad using traditional techniques, showcasing exemplary 'nakshi' work.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Emerald Green",
    "Pearl White",
    "Diamond White"
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements",
    "receptions",
    "and traditional South Indian ceremonies like muhurtham",
    "seemantham",
    "or half-saree function (Voni Function). Can also be styled for sophisticated evening events."
  ],
  "description": "This exquisite choker seamlessly blends traditional South Indian design with modern elegance. The lustrous combination of pearls, emeralds, and rubies, set in gold with a Hyderabadi polish, offers a timeless and luxurious appeal. The intricate Kundan work demonstrates exceptional craftsmanship and adds cultural significance to the piece. The necklace’s durability ensures it will be a cherished heirloom for generations to come.",
  "tags": [
    "Choker",
    "Haaram",
    "Panchala Haaram",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Pearls",
    "Emeralds",
    "Rubies",
    "Polki Diamonds",
    "Nakshi Work",
    "Hyderabadi Jewelry",
    "Manikyam",
    "Marakata Mani",
    "Vivaham",
    "Seemantham",
    "Voni Function",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_DPCK8-120_0230",
  "collection": "diamond"
}