{
  "id": "earrings-072",
  "title": "Divya Jhumar Jhumkaalu: Exquisite Diamond & Pearl Embellished Gold Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (approximately 91.6% pure)",
    "High-quality Diamonds (SI clarity",
    "G color)",
    "Natural Pearls (South Sea",
    "Creamy Yellow hue). Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "Intricately designed openwork Jhumka structure adorned with delicate diamond settings. The upper stud features a floral motif studded with diamonds. The jhumka bell boasts a filigree pattern embellished with strategically placed sparkling diamonds. Dangles of creamy yellow South Sea pearls are suspended at the base, each crowned with a miniature gold accent. The design beautifully marries traditional aesthetics with contemporary detailing.",
  "colors": [
    "Predominantly Gold with accents of white from the diamonds and creamy yellow from the pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "Seemantham (baby shower)",
    "Half-Saree function (Langa Voni Function)",
    "Diwali",
    "Sankranthi",
    "or any grand celebration. Adds a touch of timeless elegance to both traditional South Indian attire and modern evening wear."
  ],
  "description": "These 'Divya Jhumar Jhumkaalu' embody the rich heritage of South Indian jewelry making. The use of high-quality gold, dazzling diamonds, and lustrous pearls ensures a luxurious and enduring piece. The intricate design and Hyderabadi polish highlight exceptional craftsmanship, making this a truly special heirloom-worthy possession. The lightweight design ensures comfortable wear, even for extended periods.",
  "tags": [
    "Jhumka",
    "Jhumkaalu",
    "Earrings",
    "Gold Earrings",
    "Diamond Earrings",
    "Pearl Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Filigree",
    "22K Gold",
    "Bridal",
    "Wedding",
    "Seemantham",
    "Muhurtham",
    "Half Saree"
  ],
  "original_id": "diamond_jewellery_95d23467-a82e-46e9-a918-a115d60d738d_0163",
  "collection": "diamond"
}