{
  "id": "necklaces-960",
  "title": "Divya Nakshatra Kundan Haaram - A Celestial Necklace for the Modern Devi",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Finest Quality Kundan Stones",
    "Emeralds",
    "and Ruby. Features Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite Kundan Haaram features a celestial design with intricately set Kundan stones. The central pendant showcases a rich ruby, beautifully framed by delicate Kundan work and cascading gold beads. Emeralds accent each circular design, creating a harmonious balance of color and light. The necklace showcases filigree work that represents classic Telugu designs.",
  "colors": [
    "Gold (yellow)",
    "Ruby (red)",
    "Emerald (green)",
    "Kundan (white). These colors are traditionally considered auspicious in South Indian culture."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "receptions",
    "and special occasions like festivals",
    "Seemantham or Voni function. Its modern design also makes it suitable for upscale events."
  ],
  "description": "This Kundan Haaram is a testament to the artistry of Hyderabadi craftsmanship. Its traditional design, combined with the brilliance of high-quality Kundan stones, ensures it will be a treasured heirloom for generations. The use of 22K gold guarantees lasting value and beauty. The color combination is not only beautiful, but is also deeply rooted in South Indian auspicious symbolism.",
  "tags": [
    "Kundan Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Gold Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "Vivahaalu",
    "Voni function",
    "Seemantham",
    "Kankanala",
    "Kundan Kaarya",
    "Andhra Jewellery",
    "Telangana Jewellery",
    "Nakshatra",
    "Filigree"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0355_2421",
  "collection": "necklace"
}