{
  "id": "necklaces-956",
  "title": "Vaishnavi Kempu & Kundan Antique Finish Short Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated. Adorned with high-quality Kempu stones (synthetic rubies)",
    "Emeralds",
    "Kundan settings",
    "and faux seed pearls. Expert Hyderabadi polish for a lasting antique luster."
  ],
  "features": "This exquisite short Haaram features a classic South Indian design. The central pendant showcases a teardrop design surrounded by white Kundan stones and with dangling golden beads.The intricate floral motifs are embellished with Kempu rubies and Emeralds, creating a harmonious blend of tradition and elegance. The Kundan settings ensure the stones shimmer brilliantly.The small pearl accents add to its timeless beauty",
  "colors": [
    "Dominant gold with vibrant red (Kempu)",
    "green (Emerald)",
    "and subtle white (Kundan) accents. The faux seed pearls add a soft",
    "creamy touch."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu / పెళ్ళి)",
    "receptions",
    "festivals (Pandugalu / పండుగలు)",
    "and traditional South Indian celebrations like Seemantham (సీమంతం) or Half-Saree function (Half-Saree ఫంక్షన్). Also suitable for adding a touch of traditional elegance to modern ensembles."
  ],
  "description": "This Short Haaram is a timeless piece that blends South Indian heritage with enduring beauty. The combination of Kempu, Emeralds, and Kundan stones symbolizes prosperity and good fortune. The handcrafted design ensures that each piece is unique and reflects the skilled craftsmanship of Hyderabad artisans. The antique finish gives it a regal and sophisticated look, while the high-quality materials ensure lasting durability. It's a treasure to be cherished for generations.",
  "tags": [
    "Haaram",
    "Short Necklace",
    "Kempu Jewelry",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Antique Finish",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Traditional Necklace",
    "కంఠాభరణం",
    "చిన్న హారం",
    "పెళ్ళి ఆభరణాలు",
    "భారతీయ వివాహ నగల"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0350_2417",
  "collection": "necklace"
}