{
  "id": "necklaces-298",
  "title": "Diamond Floral Haaram Set with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Yellow Gold",
    "Certified Diamonds (VS Clarity",
    "G Color)",
    "Natural Pearls",
    "Ruby",
    "Emerald. Hyderabadi Polish finish."
  ],
  "features": "Intricate floral design with cascading diamond-studded motifs. The central pendant features a larger floral motif with a central emerald stone. Small pearls are dangling on both ends of the floral design to give more elegance. The jhumka earrings complement the haaram with matching floral design and a dangling pearl, mirroring the Haaram's aesthetic. The craftsmanship showcases a fine balance of traditional South Indian design with modern setting techniques.",
  "colors": [
    "Yellow Gold",
    "White (Diamonds)",
    "Green (Emerald)",
    "Red (Ruby)",
    "Ivory (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "Seemantham",
    "and grand celebrations. Also suitable for upscale social gatherings and cultural events where a touch of traditional elegance is desired."
  ],
  "description": "This diamond haaram set is a masterpiece of Hyderabadi craftsmanship. The use of high-quality diamonds and natural pearls, combined with the timeless floral design, makes it a valuable heirloom. The intricate detailing and perfect color coordination elevate its aesthetic appeal, ensuring it will be a cherished piece for generations. The set's design blends traditional and modern elements for versatility, and can be customized.",
  "tags": [
    "Diamond Haaram",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Pearl Necklace",
    "Floral Design",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Bridal Set",
    "Vivahaalu",
    "Seemantham",
    "Temple Jewelry",
    "Diamond Necklace Set"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0387_0584",
  "collection": "diamond"
}