{
  "id": "necklaces-1033",
  "title": "Rajputana Ruby Polki Choker: A Regal Bridal Adornment",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (approx. VVS clarity)",
    "Faceted Ruby Beads (Burmese Ruby Origin)",
    "Seed Pearls."
  ],
  "features": "A meticulously crafted polki pendant forms the focal point, surrounded by four rows of strung ruby beads. The pendant features an intricately floral motif with polki diamonds set in a closed setting, typical of Mughal-inspired jewelry. The central ruby is bezel-set and beautifully carved. The choker also features delicate ruby bead and pearl dangles, adding a touch of ethereal charm. The 'ghat' or stringing style is traditional Telugu craftsmanship ensuring comfort and elegance.",
  "colors": [
    "Predominantly Ruby Red and Gold",
    "with the contrasting brilliance of colorless Polki diamonds and subtle white of the seed pearls. The Hyderabadi polish gives the gold a rich",
    "warm tone."
  ],
  "occasions": [
    "Perfect for weddings",
    "bridal wear (Muhurtham)",
    "Seemantham",
    "formal receptions",
    "and other grand celebrations. Its regal design also makes it a statement piece for sophisticated evening events."
  ],
  "description": "This choker is an exquisite blend of traditional craftsmanship and timeless elegance. The use of high-quality rubies and uncut polki diamonds makes it a valuable investment. The Hyderabadi polish adds a unique luster and character. Its design is culturally significant, evoking the opulence of royal heritage, and can be passed down as a treasured heirloom. This is more than just jewelry; it's a piece of art with a story.",
  "tags": [
    "Choker",
    "Kanthi",
    "Polki",
    "Ruby",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Necklace",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Uncut Diamonds",
    "Ruby Beads",
    "Mughal Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "Heirloom Jewelry",
    "Rajwadi",
    "Nizam Jewellery",
    "Seemantham",
    "Muhurtham",
    "Bridal Collection"
  ],
  "original_id": "radhe_diam_DPCK8-1239_2446",
  "collection": "radhe"
}