{
  "id": "necklaces-451",
  "title": "Enchanting Emerald & Pearl Chandramukhi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Rose Gold (Grwt: 59.470 gms)",
    "this exquisite piece features 10 pear-shaped Emeralds (Eme: 10.24 carats)",
    "a single round Ruby (Ruby: 2.57 carats)",
    "and 12 lustrous South Sea Pearls (Moti: 23.15 carats). Dwt: 6.38(837). The necklace boasts a Hyderabadi Polish for a rich",
    "lasting shine."
  ],
  "features": "This modern haaram takes inspiration from traditional temple jewelry, showcasing intricate diamond-studded patterns reminiscent of ancient South Indian motifs. The design features a central floral pendant adorned with a teardrop-shaped emerald and a single pearl drop. The emeralds are meticulously set in a bezel setting, highlighting their vibrant color. The graduated design with diamond clusters and delicate pearl drops adds a touch of contemporary elegance.",
  "colors": [
    "The color palette features the warm glow of rose gold",
    "the vibrant green of the emeralds",
    "the subtle red of the ruby",
    "the sparkling white of the diamonds",
    "and the creamy white of the pearls. The color combination is designed to be vibrant and eye-catching."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Muhurtham)",
    "receptions",
    "engagement ceremonies",
    "Sangeeth",
    "and festive celebrations. Its modern design also makes it suitable for upscale social gatherings and contemporary events."
  ],
  "description": "This haaram beautifully blends traditional South Indian aesthetics with modern design sensibilities. The use of high-quality emeralds, ruby, diamonds, and pearls ensures lasting beauty and value. The Hyderabadi polish provides durability and a luxurious shine. The unique temple-inspired design is a conversation starter and reflects a rich cultural heritage. A timeless heirloom that can be treasured for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Pearl",
    "Moti",
    "South Sea Pearl",
    "Rose Gold",
    "Diamond",
    "Indian Jewelry",
    "Temple Jewelry",
    "Muhurtham",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional",
    "Contemporary",
    "Bridal",
    "Andhra Jewelry",
    "Telangana Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-48_0914",
  "collection": "diamond"
}