{
  "id": "bangles-274",
  "title": "Aarya Antique Gold and Emerald Bangle Set - Kanganalu",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold (916 Hallmark)",
    "High-Quality Emeralds",
    "Polki Diamonds. Features the distinctive Hyderabadi Polish for a rich",
    "antique luster."
  ],
  "features": "These stunning bangles feature intricate floral latticework, studded with sparkling Polki diamonds and vibrant green emeralds. The design is inspired by traditional Mughal artistry, showcasing meticulous craftsmanship and a timeless antique finish. The secure clasp ensures comfortable wear and lasting durability. Detailed filigree work adds to the richness of the design, a true reflection of artisanal excellence.",
  "colors": [
    "Antique Gold",
    "Emerald Green",
    "and shimmering White (Polki diamonds). The earthy gold tone complements the vibrant emeralds",
    "creating a regal and eye-catching contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festivals (like Sankranti and Ugadi)",
    "bridal showers",
    "and special occasions. These bangles can also elevate any contemporary outfit",
    "adding a touch of traditional elegance to modern celebrations."
  ],
  "description": "These bangles blend heritage with luxury. The antique finish and Mughal-inspired design make them a timeless heirloom piece. The genuine emeralds and Polki diamonds ensure brilliance and value, reflecting the wearer's refined taste. They are comfortable to wear, durable, and a symbol of prosperity and good fortune. A true testament to Hyderabad's rich jewelry-making tradition.",
  "tags": [
    "Bangles",
    "Kanganalu",
    "22K Gold",
    "Emerald",
    "Polki",
    "Antique Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Vivaha",
    "Muhurtham",
    "Fine Jewelry"
  ],
  "original_id": "jewellery_IMG-20241219-WA0015_1594",
  "collection": "jewellery"
}