{
  "id": "earrings-454",
  "title": "Swarna Kamal: Traditional Diamond & Ruby Stud Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Swarna)",
    "Natural Rubies (Ratnaalu)",
    "Polki Diamonds (Uncut Diamonds)",
    "Accented with a central Emerald (Panna). Crafted with a traditional Hyderabadi Polish (Minakari) for a rich",
    "lasting luster."
  ],
  "features": "These captivating stud earrings feature a stylized floral design, reminiscent of a lotus (kamal), a symbol of purity and prosperity in South Indian culture. Delicately placed Polki diamonds surround a central emerald and are accented with ruby droplets, creating a visually stunning effect. The intricate gold filigree work showcases exceptional craftsmanship.",
  "colors": [
    "Predominantly gold",
    "complemented by the vibrant red of the rubies",
    "the brilliant sparkle of the diamonds",
    "and a touch of emerald green. This classic South Indian color combination symbolizes auspicious beginnings and blessings."
  ],
  "occasions": [
    "Perfect for both everyday elegance and special occasions like weddings (Pelli)",
    "festivals (Pandugalu)",
    "engagement ceremonies (Nischitartham)",
    "and traditional South Indian celebrations like Seemantham or half-saree functions (Langa Voni Function)."
  ],
  "description": "These earrings are a testament to the enduring beauty of South Indian jewelry traditions. The use of Polki diamonds, combined with the vibrant ruby accents and Hyderabadi polish, creates a piece that is both timeless and exquisite. They are designed to be cherished for generations, symbolizing heritage and elegance. Comfortable and secure, these studs are perfect for all-day wear.",
  "tags": [
    "Earrings",
    "Studs",
    "Chepala Kammalu",
    "Gundla Kammalu",
    "22K Gold",
    "Polki Diamonds",
    "Rubies",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Ethnic Jewelry",
    "Temple Jewelry",
    "Pelli",
    "Seemantham",
    "Ratnaalu",
    "Swarna",
    "Panna",
    "Lotus",
    "Kamal"
  ],
  "original_id": "earrings_diamond-open-close_IMG-20241113-WA0150_1531",
  "collection": "earrings"
}