{
  "id": "necklaces-1209",
  "title": "Enchanting Emerald and Diamond Floral Necklace - The Jadau Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximate)",
    "Brilliant-cut Diamonds (GH color",
    "VS clarity)",
    "Faceted Emeralds (Zambian origin",
    "vibrant green)",
    "South Sea Pearls (creamy white",
    "lustrous). Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite necklace showcases a delicate floral motif, blending traditional South Indian craftsmanship with modern sensibilities. The central pendant features meticulously set emeralds framed by shimmering diamonds, creating a captivating focal point. The intricate diamond-studded chain showcases a floral vine design. Pearl dangles add a touch of timeless elegance.",
  "colors": [
    "Predominantly gold and white with vibrant green emerald accents and creamy white pearls. The rich green emeralds create a stunning contrast against the brilliance of the diamonds and the warmth of the gold."
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "receptions",
    "engagement ceremonies",
    "and other grand celebrations. Also a perfect statement piece for upscale social events and festive gatherings. Adds a touch of regal charm to any outfit."
  ],
  "description": "This necklace is a true investment piece, blending traditional artistry with modern aesthetics. The use of high-quality materials ensures lasting beauty and value. A versatile design that can be paired with both traditional and contemporary attire. The vibrant emeralds are believed to bring good luck and prosperity.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Jadau",
    "Mogappu",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Engagement Jewelry",
    "Muhurtham",
    "Vilandi",
    "Vaiduryam",
    "Mutyalu",
    "Jawaharat"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-49 2_1783",
  "collection": "sjpl"
}