{
  "id": "necklaces-812",
  "title": "Emerald Empress Diamond Haaram: A Regal Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finest Quality Diamonds",
    "Pear-Cut Emerald (6.15 carats)",
    "setting in Platinum Alloy. Crafted with exceptional precision and finishing."
  ],
  "features": "This breathtaking Haaram features a cascading design of interconnected diamond-encrusted leaf motifs. A stunning, large Pear-cut Emerald serves as the focal point, enhancing the necklace's regal appearance. The intricate setting maximizes the brilliance of each diamond, creating a captivating display of light.",
  "colors": [
    "Brilliant white diamonds contrast beautifully with the rich green of the emerald",
    "creating a visually striking and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings",
    "receptions",
    "and high-profile events. Its modern design allows it to be worn at contemporary parties as well as traditional Seemantham or Half-Saree functions. A true statement piece that adds a touch of royalty to any ensemble."
  ],
  "description": "This is more than just a necklace; it's an investment in timeless elegance. The exceptional quality of the diamonds and the rare beauty of the emerald, combined with the meticulous craftsmanship, ensures this Haaram will be treasured for generations. A symbol of prosperity and grace, it's the ultimate expression of sophistication.",
  "tags": [
    "Diamond Necklace",
    "Emerald Haaram",
    "Party wear",
    "Statement Jewelry",
    "Indian Wedding Jewelry",
    "Contemporary Indian Jewelry",
    "Bridal Jewelry",
    "Platinum Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Green Emerald",
    "Diamond Haaram",
    "Luxury Jewelry",
    "Regal",
    "Statement",
    "Diamond leaf"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-45 2_1406",
  "collection": "diamond"
}