{
  "id": "necklaces-915",
  "title": "Vasantika Kundan Nakshi Haaram - A Touch of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated Alloy. Features high-quality Kundan settings with synthetic coral cabochons and shimmering Cubic Zirconia (CZ) stones. Hyderabadi Polish applied for a lasting",
    "radiant finish."
  ],
  "features": "This stunning Haaram showcases a fusion of modern and traditional design. The intricate Kundan settings, meticulously handcrafted, surround vibrant synthetic coral cabochons and sparkling CZ stones. The central pendant features a floral motif and a heart-shaped drop, embellished with CZ's, adding a contemporary touch to the classic Haaram silhouette. Nakshi-inspired detailing enhances the overall aesthetic, adding depth and texture.",
  "colors": [
    "Dominant Gold tone",
    "accentuated by the warm hues of the synthetic Coral and the brilliance of the White CZ stones. A harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement ceremonies (Muhurtham)",
    "festive occasions like Diwali or Sankranthi",
    "and even upscale social gatherings where you want to make a statement. Also suitable for a modern twist on traditional attire during Seemantham or Half-Saree functions."
  ],
  "description": "A beautiful blend of tradition and contemporary style, this Haaram is a true masterpiece. The handcrafted Kundan work reflects the rich heritage of South Indian jewelry, while the modern design elements make it versatile for various occasions. The high-quality materials ensure durability and a lasting shine. It's an investment piece that you will treasure for years to come.",
  "tags": [
    "Haaram",
    "Kundan",
    "Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "CZ",
    "Coral",
    "Gold Plated",
    "Vaddanam",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Festive",
    "Uttaraandhra",
    "Nakshi",
    "Kasulaperu",
    "Gundu"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0309_2376",
  "collection": "necklace"
}