{
  "id": "earrings-052",
  "title": "Mayuri Kundanalu: Ruby Peacock Jhumka Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "meticulously set with round cut diamonds and a central ruby. The jhumka tassels feature ruby beads with white pearl accents."
  ],
  "features": "These exquisite earrings feature a graceful peacock (Mayuri) design, symbolizing beauty and royalty. The peacock is adorned with pavé-set diamonds, highlighting its intricate details. Below the peacock, a round diamond adds a touch of brilliance. The jhumka base is intricately designed with diamonds set in a dome shape, leading to cascading ruby bead tassels finished with delicate pearls. The fine craftsmanship reflects the rich jewelry tradition of Hyderabad.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Diamond White",
    "Pearl White"
  ],
  "occasions": [
    "Perfect for weddings",
    "festive occasions like Sankranthi",
    "Diwali",
    "or Ugadi",
    "traditional ceremonies (like Seemantham or half-saree function)",
    "and elegant social gatherings. These earrings add a touch of regal charm to any ensemble."
  ],
  "description": "These Mayuri Kundanalu are a testament to timeless elegance and superior craftsmanship. The combination of diamonds, rubies, and pearls, set in high-quality gold with Hyderabadi polish, ensures lasting beauty and value. The peacock motif adds a touch of cultural significance and auspiciousness, making it a treasured addition to any jewelry collection. They are not just earrings; they are a statement piece that embodies tradition and sophistication.",
  "tags": [
    "Jhumka",
    "Kundanalu",
    "Peacock Earrings",
    "Ruby Earrings",
    "Diamond Earrings",
    "Gold Earrings",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Mayuri",
    "Temple Jewelry",
    "Seemantham",
    "Pavé Setting",
    "Pearls"
  ],
  "original_id": "diamond_jewellery_7261b3b6-d0af-46a3-b5d8-b11ab6b61754_0134",
  "collection": "diamond"
}