{
  "id": "necklaces-086",
  "title": "Polki Diamond and Tourmaline Pendant with South Sea Pearl Drop - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds",
    "Carved Green Tourmaline",
    "South Sea Pearl",
    "Ruby accents. Hyderabadi Polish for lasting shine."
  ],
  "features": "Features a beautifully carved leaf-shaped green Tourmaline as the centerpiece, surrounded by brilliant, uncut Polki diamonds. A delicate arrangement of smaller diamonds accentuates the leaf form, giving it an organic, natural feel. A lustrous South Sea pearl dangles below, adorned with tiny ruby beads for a pop of color. The gold setting showcases a traditional Hyderabadi polish, known for its smooth finish and durability.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with a vibrant green (tourmaline) and a subtle pink (ruby) and white (pearl) accent."
  ],
  "occasions": [
    "Perfect for special occasions",
    "weddings",
    "receptions",
    "or adding a touch of elegance to your everyday attire. Ideal as a statement piece for sarees or contemporary outfits. Suitable as a special gift (Varalakshmi Vratham present)"
  ],
  "description": "A unique blend of traditional Polki diamond setting with a modern design sensibility. The high-quality tourmaline is expertly carved, offering a one-of-a-kind touch. The South Sea pearl adds a touch of sophistication and grace. The Hyderabadi polish ensures lasting beauty and shine. This piece exudes both timeless elegance and contemporary charm.",
  "tags": [
    "Polki",
    "Diamond",
    "Pendant",
    "Necklace",
    "Tourmaline",
    "South Sea Pearl",
    "Hyderabadi Jewelry",
    "Uncut Diamonds",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Office Jewelry"
  ],
  "original_id": "diamond_jewellery_DPER8-1648_0293",
  "collection": "diamond"
}