{
  "id": "necklaces-419",
  "title": "Divya Harika Diamond & Gemstone Haaram - A Royal Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold",
    "studded with brilliant-cut Diamonds (4288)",
    "complemented by vibrant Rubies (17.01ct x 2) and Emeralds (14.26ct x 7) and lustrous South Sea Pearls (40.25ct x 16). The piece showcases a meticulous Hyderabadi Polish",
    "enhancing the gold's radiance and the gemstone's brilliance."
  ],
  "features": "This exquisite Haaram features a layered design, meticulously handcrafted to create a statement piece. The centerpiece is an elaborate filigree pattern, studded with diamonds, emeralds and rubies. The locket (3.63 dwt, 786) features a similar filigree design with a large emerald (6.57 x 1) and ruby (11.50 x 1) at the heart, accented by South Sea Pearls (12.75ct x 5). The necklace drapes gracefully, adorned with delicate pearl drops along the bottom, adding a touch of ethereal beauty. The ornate design reflects traditional South Indian jewelry styles, blending seamlessly with the modern diamond settings.",
  "colors": [
    "Yellow Gold",
    "Brilliant White (Diamonds)",
    "Deep Red (Rubies)",
    "Rich Green (Emeralds)",
    "and Creamy White (Pearls). This harmonious color palette is a signature of South Indian bridal jewelry."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (muhurtham)",
    "receptions",
    "Seemantham ceremonies",
    "and other significant celebrations. Its elegance and traditional design make it a cherished heirloom."
  ],
  "description": "This Haaram is a timeless treasure, blending traditional craftsmanship with contemporary design. The exquisite gemstone quality, Hyderabadi polish, and intricate detailing make it a unique and valuable piece. It represents a harmonious blend of tradition and modernity, making it a perfect investment for generations to come. The generous size and magnificent design make it a show-stopping piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Muhurtham",
    "Seemantham",
    "Filigree",
    "Nakshi Work",
    "Vaddanam"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-01 2_0860",
  "collection": "diamond"
}