{
  "id": "necklaces-231",
  "title": "Lakshmi Kasu Mala - Divine Grace Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Premium Quality Coral Beads",
    "CZ Stones. Features an exquisite Hyderabadi Polish for lasting luster and brilliance."
  ],
  "features": "This elegant Kasu Mala showcases a double-layered chain design. It features meticulously crafted Lakshmi motifs (Kasu) with intricate Nakshi work, depicting the Goddess of Prosperity. Each Lakshmi motif is framed with sparkling CZ stones, adding a touch of modern sophistication. Vibrant coral beads are delicately suspended beneath each kasu, enhancing the necklace's traditional charm. The centerpiece features a larger Lakshmi pendant with hanging gold bead accents (gundlu).",
  "colors": [
    "Predominantly gold with a warm",
    "antique finish",
    "complemented by the vibrant red of the coral beads and the dazzling white of the CZ stones."
  ],
  "occasions": [
    "Ideal for weddings (Vivah)",
    "engagements",
    "Seemantham ceremonies",
    "or any auspicious occasion. Its timeless design also makes it perfect for festive celebrations like Ugadi",
    "Sankranti",
    "or Diwali. Can also be worn for formal events where a touch of cultural elegance is desired."
  ],
  "description": "This Kasu Mala is more than just jewelry; it's a symbol of prosperity and blessings. Handcrafted by skilled artisans with generations of expertise, this piece showcases exceptional Nakshi work and reflects the rich cultural heritage of South India. The Hyderabadi polish ensures long-lasting shine and durability. The combination of traditional Lakshmi motifs with modern CZ stone accents makes it a versatile piece that complements both traditional and contemporary attire.",
  "tags": [
    "Kasu Mala",
    "Lakshmi Haar",
    "Temple Jewellery",
    "South Indian Jewelry",
    "Nakshi Work",
    "Coral Beads",
    "Hyderabadi Jewellery",
    "Indian Necklace",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Gold Necklace",
    "సాంప్రదాయ నగలు",
    "కాసుల పేరు",
    "లక్ష్మి కంఠహారం",
    "పెళ్లి నెక్లెస్"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0311_0508",
  "collection": "diamond"
}