{
  "id": "necklaces-191",
  "title": "Polki & Ruby Manoranjani Haaram - A Symphony of Tradition and Grace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (ranging in quality)",
    "and Faceted Rubies. Pavé-set Diamonds accentuating the design. Metal composition verified by hallmarking."
  ],
  "features": "This stunning Polki Haaram showcases a geometric design with alternating Polki and Ruby floral motifs. The Polki diamonds are set in an open setting to maximize their brilliance. Each ruby floral motif is meticulously crafted. The Haaram features delicate drop pendants, each with a ruby centerpiece. The intricate setting and Hyderabadi polish highlight the artistry and expertise of our craftsmen.",
  "colors": [
    "Rich Gold",
    "Sparkling White (Polki Diamonds)",
    "and Deep Red (Rubies). The color contrast enhances the overall visual appeal."
  ],
  "occasions": [
    "Ideal for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "anniversaries",
    "and other grand celebrations. Suitable for traditional South Indian ceremonies like Muhurtham and Seemantham."
  ],
  "description": "A captivating blend of traditional Polki craftsmanship and modern design aesthetics. The use of genuine Polki diamonds and vivid rubies ensures lasting value and timeless elegance. Each piece is meticulously handcrafted and hallmarked for quality assurance. The Hyderabadi polish provides a rich, enduring luster. This piece is a statement of sophistication and cultural heritage.",
  "tags": [
    "Polki",
    "Diamond Necklace",
    "Haaram",
    "Ruby",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Traditional Jewelry",
    "Kanthabharanam",
    "పెళ్లి నగలు",
    "నిశ్చితార్థం నగలు"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0035_0443",
  "collection": "diamond"
}