{
  "id": "earrings-130",
  "title": "Exquisite Polki & Gemstone Jhumka Earrings - A Timeless Masterpiece",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds (approx. 2.5 carats total weight)",
    "Burmese Rubies",
    "Natural Pearls",
    "Zambian Emerald Beads. Hyderabadi Polish for lasting luster."
  ],
  "features": "Intricately handcrafted Jhumka earrings featuring a classic South Indian floral motif. The Polki diamonds are meticulously set in a Kundan style, creating a radiant sparkle. Adorned with vibrant Burmese rubies, lustrous natural pearls, and rich green Zambian emerald beads. Design incorporates cascading elements for graceful movement. The intricate detailing reflects exceptional artistry and cultural heritage.",
  "colors": [
    "Gold",
    "White (Polki Diamonds)",
    "Ruby Red",
    "Pearl White",
    "Emerald Green."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "Seemantham ceremonies",
    "half-saree functions",
    "Diwali",
    "and other special celebrations. Also suitable for adding a touch of traditional elegance to modern formal wear."
  ],
  "description": "Authentic South Indian craftsmanship featuring the timeless beauty of Polki diamonds. The vibrant color combination and intricate design make these Jhumkas a true statement piece. Handcrafted with meticulous attention to detail and made with high-quality gemstones for lasting brilliance and durability. A valuable heirloom piece that will be treasured for generations.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Polki",
    "Kundan",
    "Diamonds",
    "Rubies",
    "Emeralds",
    "Pearls",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Gold Jewelry",
    "Temple Jewelry",
    "Seemantham Jewelry",
    "Muhurtham Jewelry",
    "Butta",
    "Kempu",
    "Pachalu",
    "Mutyalu"
  ],
  "original_id": "diamond_jewellery_DPER8-1256_0253",
  "collection": "diamond"
}