{
  "id": "necklaces-1147",
  "title": "Aadhya Kundan Polki Haaram with Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Hallmarked)",
    "Untreated Polki Diamonds",
    "Natural Rubies. Features exquisite Hyderabadi Kundan craftsmanship. Diamonds display high clarity and are expertly set in traditional Kundan style."
  ],
  "features": "This exquisite Haaram showcases the timeless beauty of Kundan craftsmanship, blending traditional Telugu design with a modern aesthetic. Features alternating square Polki diamond settings and intricately designed Ruby flower motifs. The central pendant is a larger square Polki, surrounded by smaller Polkis, creating a captivating focal point.",
  "colors": [
    "Gold",
    "White (Polki Diamonds)",
    "Ruby Red. The combination of the warm gold tone with the vibrant ruby creates a rich and royal color palette",
    "perfect for South Indian celebrations."
  ],
  "occasions": [
    "Ideal for weddings (Vadhuvu)",
    "engagements",
    "receptions",
    "and significant celebrations like Seemantham or Half-Saree function. Can also be styled for upscale modern events."
  ],
  "description": "This Kundan Polki Haaram embodies a heritage of craftsmanship and elegance. The use of untreated Polki diamonds gives it a unique character and brilliance, enhanced by the vibrant Rubies. Its durability ensures it can be treasured for generations as a cherished family heirloom (Sambhandham). The modern design makes it versatile enough to be worn with both traditional and contemporary attire.",
  "tags": [
    "Kundan",
    "Polki",
    "Haaram",
    "Necklace",
    "Ruby",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Heritage Jewelry",
    "Vadhuvu",
    "Seemantham",
    "Gold Necklace",
    "Diamond Necklace",
    "Temple Jewelry (Inspired)"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0056_2566",
  "collection": "radhe"
}