{
  "id": "necklaces-133",
  "title": "Emerald & Ruby Majestic Haaram: A Regal South Indian Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Faceted Emeralds",
    "Faceted Ruby",
    "Polki Diamonds. Gold features traditional Hyderabadi Polish for a rich",
    "lustrous finish. The gemstones are hand-selected for their vibrant color and clarity."
  ],
  "features": "This exquisite haaram features a graduated arrangement of pear-shaped emeralds, interspersed with polki diamond drops for added sparkle. The central pendant showcases an elaborate floral design adorned with ruby at the center, leading to a magnificent pear-shaped ruby drop. The design reflects a blend of traditional temple jewelry inspiration with a modern, sophisticated touch. Expert gold craftsmanship highlights the intricate details.",
  "colors": [
    "Rich green from the emeralds",
    "deep red from the ruby",
    "and the warm yellow of the gold create a visually stunning and traditionally auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "bridal wear (pellikuturu)",
    "festivals (like Sankranti or Diwali)",
    "or any special occasion where you want to make a grand statement. It's also a beautiful heirloom piece to pass down through generations."
  ],
  "description": "This Haaram is a true testament to South Indian jewelry artistry. The vibrant emeralds and rich ruby complement the warm gold, creating a piece of timeless elegance. The Hyderabadi polish enhances the gold's luster, while the intricate design showcases exceptional craftsmanship. It's not just a piece of jewelry, it's a symbol of heritage, prosperity, and enduring beauty.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Polki Diamond",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Pellikuturu",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "22K Gold",
    "Gemstone Necklace",
    "Antique Finish",
    "Gutta Pusalu inspired",
    "Grand Necklace"
  ],
  "original_id": "diamond_jewellery_DPNK8-1801_0366",
  "collection": "diamond"
}