{
  "id": "necklaces-894",
  "title": "Divine Peacock Kundan Haaram - A Touch of Traditional Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-quality Kundan setting with uncut Diamonds (Polki Diamonds)",
    "Emerald (Panna) cabochon center",
    "Ruby accents. Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Haaram features a captivating peacock (Mayura) motif pendant, symbolizing beauty and grace. The intricate Kundan setting showcases the brilliance of Polki diamonds. Delicate floral drops with ruby centers adorn the necklace. The pendant showcases traditional filigree work. The emerald cabochon adds a touch of regal charm.",
  "colors": [
    "Predominantly Gold",
    "with vibrant Emerald green",
    "Ruby red",
    "and sparkling White (Diamonds)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements",
    "festivals (Ugadi",
    "Sankranti)",
    "and other special occasions. It's also a statement piece for formal events where you want to embrace your cultural heritage."
  ],
  "description": "This Kundan Haaram is a true heirloom piece. Its timeless design and exquisite craftsmanship ensure it will be treasured for generations. The use of high-quality materials and traditional techniques adds to its value and appeal. The peacock motif holds significant cultural meaning, making it a meaningful and beautiful addition to your jewelry collection.",
  "tags": [
    "Kundan Haaram",
    "Polki Diamonds",
    "Peacock Necklace",
    "Mayura",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Necklace",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Hyderabadi Jewelry",
    "Emerald",
    "Ruby",
    "కంఠహారం",
    "పెళ్లి నెక్లెస్",
    "భారతీయ ఆభరణాలు",
    "సాంప్రదాయ నగలు"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0284_2355",
  "collection": "necklace"
}