{
  "id": "necklaces-924",
  "title": "Divine Lakshmi Temple Haaram with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Round Cut Diamonds (VS Clarity)",
    "Emeralds (Round Cut",
    "Vivid Green)",
    "Rubies (Round Cut",
    "Pigeon Blood Red). Meticulously crafted and hallmarked for authenticity."
  ],
  "features": "Features a central pendant depicting Goddess Lakshmi, meticulously hand-carved with intricate detailing. The necklace boasts a cascading design with three circular pendants, each adorned with a floral motif crafted from Emeralds and a central Ruby. The body of the haaram is designed in a wave pattern embellished with diamonds, completed with round-cut diamond droplets dangling along the necklace. The design incorporates traditional temple jewellery elements, giving it a regal and divine look.",
  "colors": [
    "Gold (warm yellow)",
    "White (diamonds)",
    "Green (emeralds)",
    "Red (rubies)"
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "auspicious ceremonies",
    "festivals like Diwali and Sankranti",
    "and traditional gatherings. A perfect heirloom piece for generations."
  ],
  "description": "This exquisite Haaram is a testament to South Indian craftsmanship, embodying both religious significance and artistic brilliance. The combination of Goddess Lakshmi, considered the epitome of prosperity, with the vibrant hues of Emeralds and Rubies makes it an auspicious choice. The Hyderabadi polish enhances the gold's luster, while the intricate diamond work adds a touch of modern elegance, resulting in a timeless treasure.",
  "tags": [
    "Haaram",
    "Temple Jewellery",
    "Lakshmi Pendant",
    "South Indian Jewellery",
    "Wedding Necklace",
    "Bridal Jewellery",
    "22K Gold",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "Muhurtham",
    "Seemantham",
    "Traditional Jewellery",
    "Hyderabadi Jewellery",
    "ದಕ್ಷಿಣ ಭಾರತದ ಆಭರಣಗಳು",
    "தென்னிந்திய ஆபரணங்கள்",
    "దక్షిణ భారత ఆభరణాలు",
    "సౌత్ ఇండియన్ జ్యువెలరీ"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0318_2385",
  "collection": "necklace"
}