{
  "id": "necklaces-920",
  "title": "Divyamani Kasu Haaram: A Floral Symphony of Heritage",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold",
    "studded with brilliant-cut CZ diamonds",
    "genuine Ruby accents",
    "and Emerald highlights. Features a lustrous Hyderabadi Polish for enhanced brilliance and lasting shine."
  ],
  "features": "This exquisite Kasu Haaram reimagines tradition with delicate floral connectors. The coin pendants are intricately detailed with CZ stones encircling a central Emerald, framed by Ruby highlights. The floral connectors alternate with the Kasu motifs, creating a balanced and refined aesthetic. The Haaram’s design reflects the essence of South Indian artistry, perfect for the modern woman.",
  "colors": [
    "Primarily gold with sparkling white CZ diamonds. The inclusion of lush green emeralds and vibrant red rubies creates a harmonious and visually appealing color palette."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festive occasions like Diwali and Sankranthi",
    "or a grand half-saree function (Langa Voni). Perfect for making a statement at modern galas as well."
  ],
  "description": "A blend of heritage and contemporary design. Meticulously handcrafted by skilled artisans with generations of expertise. High-quality materials ensure lasting beauty and value. A timeless piece that can be passed down through generations, making it a valuable heirloom. Adds an instant touch of regal elegance to any outfit.",
  "tags": [
    "Kasu Haaram",
    "Necklace",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Gold Jewelry",
    "Ruby",
    "Emerald",
    "CZ Diamonds",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Hyderabadi Jewelry",
    "Vivahaalu",
    "Langa Voni",
    "Nischitartham",
    "Bridal Jewelry",
    "Gift for Her"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0314_2381",
  "collection": "necklace"
}