{
  "id": "necklaces-1494",
  "title": "Emerald Bloom Grand Haaram - Indravati Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated Alloy; Features high-quality cubic zirconia",
    "meticulously set around vibrant",
    "natural Emeralds. Accented with lustrous Freshwater Pearls. Hyderabadi Polish ensures a long-lasting",
    "radiant finish."
  ],
  "features": "A stunning Grand Haaram featuring a cascading design. The necklace incorporates floral and geometric patterns, intricately crafted with pavé-set CZ stones. The central pendant showcases a larger Emerald, framed by a delicate filigree design studded with CZs. Pearl drops enhance the elegance and movement of the piece. Features a contemporary adaptation of traditional South Indian design.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and Pearl White. The contrast of the rich gold with the vibrant emeralds and soft pearl accents creates a regal and captivating color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions (రిసెప్షన్)",
    "engagements (నిశ్చితార్థం)",
    "and other grand celebrations. Ideal for brides and those attending important ceremonies. Suitable for Seemantham",
    "Half-Saree Function (లంగ ఓని వేడుక) and other traditional events."
  ],
  "description": "This Emerald Bloom Grand Haaram is a statement piece that seamlessly blends traditional South Indian aesthetics with modern elegance. The high-quality craftsmanship and the use of premium materials ensure a durable and exquisite piece of jewelry that can be treasured for generations. The radiant combination of Emeralds, CZs, and Pearls will add a touch of royalty to any occasion. An investment in timeless beauty and cultural heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Emerald Necklace",
    "CZ Jewelry",
    "Pearl Necklace",
    "Temple Jewelry",
    "Traditional Jewelry",
    "22K Gold",
    "Wedding Jewelry",
    "Indian Wedding",
    "Grand Haaram",
    "Kantaabharanam",
    "కంఠాభరణం",
    "Pelli",
    "పెళ్లి",
    "Nisithaartham",
    "నిశ్చితార్థం",
    "Hyderabadi Jewelry",
    "Emerald",
    "CZ",
    "Pearl",
    "Seemantham",
    "సీమంతం"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-32 3_2112",
  "collection": "sjpl"
}