{
  "id": "earrings-455",
  "title": "Navaratna Chandbali Stud Earrings - A Timeless Classic",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Natural Pearls",
    "Emerald Beads",
    "Ruby Zirconia",
    "Diamond Simulants. Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "Circular stud design showcasing the Navaratna (nine gemstones) concept. A lustrous pearl sits at the center, surrounded by a halo of sparkling diamond simulants. Emerald beads, natural pearls, and ruby zirconia are meticulously arranged around the center to create a vibrant and auspicious design. The earrings are crafted with fine goldwork, reflecting the rich heritage of Hyderabadi jewelry.",
  "colors": [
    "Predominantly gold with vibrant green from the emeralds",
    "soft pink from the rubies",
    "white from the pearls",
    "and the dazzling clear sparkle of the diamond simulants. A harmonious blend of colors considered auspicious in South Indian tradition."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festivals",
    "and other special occasions. Also suitable for gifting during Muhurtham",
    "Seemantham",
    "or Voni Function (Half-Saree Function). Can be paired with both traditional and modern outfits for an elegant touch."
  ],
  "description": "Represents the auspicious Navaratna concept, believed to bring prosperity and good fortune. Handcrafted with intricate detail by skilled artisans, using high-quality materials. The blend of traditional design with modern sensibility makes these earrings a versatile addition to any jewelry collection. The Hyderabadi Polish ensures a lasting radiance. A cherished heirloom piece to be passed down through generations.",
  "tags": [
    "Earrings",
    "Kammalu",
    "Stud Earrings",
    "Navaratna",
    "Pearls",
    "Emerald",
    "Ruby",
    "Diamond Simulant",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Gift for Women",
    "Muhurtham",
    "Seemantham",
    "Voni Function",
    "Indian Jewelry",
    "Indian Earrings",
    "Ethnic Jewelry"
  ],
  "original_id": "ear_rings_DMER8-1162_2569",
  "collection": "ear"
}