{
  "id": "necklaces-255",
  "title": "The Swarna Rekha Manga Maalai: A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant-Cut Diamonds (SI clarity",
    "G-H color)",
    "Ruby accents. Features a traditional Hyderabadi polish for a rich",
    "lasting luster."
  ],
  "features": "Exquisitely crafted with classic Manga Maalai (Mango Necklace) motifs. Each mango pendant is meticulously detailed with diamond pavé setting and intricate filigree work. The central pendant features a delicate ruby accent, adding a touch of vibrant color. Features alternating circles and diamonds in an alternating pattern all along the neck",
  "colors": [
    "Predominantly gold with the sparkling brilliance of white diamonds and a subtle touch of deep red from the rubies. The Hyderabadi polish enhances the gold's warm",
    "luxurious hue."
  ],
  "occasions": [
    "Perfect for weddings",
    "bridal wear (pellikuturu)",
    "engagement ceremonies",
    "traditional festivals like Ugadi and Sankranthi",
    "and special family celebrations. Also suitable for high-end cultural events and formal gatherings."
  ],
  "description": "A symbol of prosperity and fertility, the Manga Maalai is a cherished heirloom piece. This Swarna Rekha Haaram combines traditional Telugu artistry with modern diamond setting techniques for a dazzling effect. The piece represents enduring style and cultural heritage, making it a valuable addition to any jewelry collection. Offers a timeless charm that transcends generations.",
  "tags": [
    "Haaram",
    "Manga Maalai",
    "Necklace",
    "22K Gold",
    "Diamond Jewelry",
    "Ruby Accent",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "Fine Jewelry",
    "Pellikuturu",
    "Ugadi",
    "Sankranthi"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0335_0532",
  "collection": "diamond"
}