{
  "id": "bangles-125",
  "title": "Emerald Bloom: Exquisite Diamond and Emerald Vanki Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish. Features a central square-cut Emerald of approximately 2 carats",
    "complemented by high-quality Polki Diamonds (Uncut Diamonds). Estimated Diamond Carat Weight: 3.5 ct. The gold used is tested to ensure purity."
  ],
  "features": "This Vanki Bangle showcases intricate filigree work (Jali Design) in gold, accentuated with numerous Polki Diamonds. The central Emerald is bezel-set within a floral motif of smaller diamonds, creating a captivating focal point. The openwork design provides a light and airy feel, while maintaining a solid construction for durability. It embodies the artistry of the 'Nakshi' technique, known for its delicate detailing and lifelike forms, though in a more modern interpretation.",
  "colors": [
    "Primary Color: Yellow Gold. Secondary Colors: Vivid Green (Emerald)",
    "White (Diamonds). The warm gold tones contrast beautifully with the vibrant green of the emerald and the dazzling sparkle of the diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "festivals (like Ugadi and Sankranthi)",
    "and significant family celebrations. Its modern design also makes it suitable for formal events and parties."
  ],
  "description": "This Vanki Bangle is a masterpiece of craftsmanship, blending traditional South Indian design with a contemporary aesthetic. The use of genuine Emeralds and Polki diamonds ensures enduring value and prestige. The intricate design and impeccable finish reflect the skill of our master artisans. A statement piece that radiates elegance and sophistication, ideal for the discerning collector.",
  "tags": [
    "Vanki",
    "Kada",
    "Bangle",
    "Emerald",
    "Polki Diamonds",
    "Uncut Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Fine Jewelry",
    "Nakshi",
    "Filigree",
    "Jali Design",
    "Jewelry",
    "వంకీ",
    "కడా",
    "ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0278_0476",
  "collection": "diamond"
}