{
  "id": "earrings-057",
  "title": "Swarna Kamalini Stud Earrings: A Touch of Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "brilliant-cut Diamonds (VS clarity",
    "G color)",
    "natural Emeralds (round cut). Meticulously crafted with traditional Hyderabadi polish for a radiant",
    "lasting shine."
  ],
  "features": "These exquisite earrings feature a captivating floral design, drawing inspiration from the lotus (Kamalam). A central arrangement of four emeralds is surrounded by a halo of glittering diamonds, set in an intricate openwork gold setting. The filigree detailing adds a touch of vintage charm.",
  "colors": [
    "Predominantly gold",
    "with the vibrant green of emeralds providing a striking contrast and the dazzling white of the diamonds adding brilliance."
  ],
  "occasions": [
    "Perfect for festive occasions like Diwali",
    "weddings",
    "or any special event where you want to make a statement. Equally suitable for adding a touch of South Indian elegance to your everyday attire. Can be styled with modern outfits."
  ],
  "description": "These Swarna Kamalini studs offer a unique blend of traditional design and modern appeal. The use of high-quality 22K gold and natural gemstones ensures lasting beauty and value. The intricate filigree work showcases exceptional craftsmanship, making these earrings a true heirloom piece. Symbolizing purity and beauty, the lotus design adds a layer of cultural significance.",
  "tags": [
    "Earrings",
    "Studs",
    "Gold",
    "Diamonds",
    "Emeralds",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Filigree",
    "Lotus Design",
    "Kamalam",
    "Swarna",
    "Temple Jewelry",
    "Fine Jewelry",
    "handcrafted",
    "designer jewelry"
  ],
  "original_id": "diamond_jewellery_786ff0da-3ccf-4ac8-b3b1-5686141f6e3a_0141",
  "collection": "diamond"
}