{
  "id": "necklaces-1443",
  "title": "Delicate Diamond Leaf Haaram: A Touch of Nature's Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold (750 purity)",
    "Certified VVS Clarity Diamonds (Color: E-F",
    "Cut: Marquise and Round Brilliant). Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This modern Haaram features a delicate leaf motif design, each leaf meticulously crafted and studded with marquise and round brilliant cut diamonds. The graduated leaf arrangement provides a stunning neckline contour. The setting style is a combination of prong and pave, maximizing the brilliance of each diamond. A unique fusion of contemporary aesthetics and subtle traditional symbolism.",
  "colors": [
    "Rose Gold (pinkish-gold)",
    "White (Diamonds)"
  ],
  "occasions": [
    "Perfect for cocktail parties",
    "upscale events",
    "engagement ceremonies",
    "receptions",
    "or adding a touch of understated elegance to your daily wear. Suitable for both contemporary and traditional attire."
  ],
  "description": "Crafted with meticulous attention to detail by our skilled artisans in Hyderabad, this Diamond Leaf Haaram embodies both modern sophistication and timeless beauty. The VVS clarity diamonds guarantee exceptional sparkle, while the 18K rose gold provides a warm and elegant hue. This piece is not just jewelry; it's a statement of refined taste and enduring style, making it a valuable addition to your jewelry collection.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Rose Gold Jewelry",
    "Leaf Design",
    "VVS Diamonds",
    "Fine Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Design",
    "South Indian Jewelry",
    "Engagement Gift",
    "Wedding Jewelry",
    "Cocktail Jewelry",
    "Vaddanam (metaphorical",
    "due to its necklace style)"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-47 3_2061",
  "collection": "sjpl"
}