{
  "id": "bangles-226",
  "title": "Diamond-Studded Gold Kangan Set: A Timeless Treasure",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features brilliant-cut",
    "high-clarity diamonds (VS1",
    "G color) set in a prong setting. Gold composition analysis reveals an ideal strength-to-purity ratio",
    "ensuring durability without compromising on precious metal content."
  ],
  "features": "This Kangan set features an alternating floral diamond design, delicately prong-set for maximum brilliance. The bangles possess a smooth, comfortable inner surface, a hallmark of our master artisans' attention to detail. The design subtly blends modern aesthetics with traditional South Indian bangle styles, making it versatile for any occasion.",
  "colors": [
    "The set exhibits a radiant golden hue from the 22K gold",
    "beautifully contrasted by the dazzling white of the diamonds. This classic color combination symbolizes purity",
    "prosperity",
    "and timeless elegance."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "festivals (Ugadi",
    "Sankranti)",
    "family gatherings",
    "and formal events. An excellent choice for brides or as a treasured gift for a loved one. Suitable for wearing at any special event",
    "from Seemantham ceremonies to modern cocktail parties."
  ],
  "description": "Exquisite craftsmanship featuring genuine diamonds and high-purity gold. The timeless design blends seamlessly with both traditional and contemporary attire. A valuable heirloom to be cherished for generations, this Kangan set represents a significant investment in beauty, tradition, and lasting value. The Hyderabadi polish lends a unique lustre and sheen, enhancing the jewelry's overall appeal. Each diamond is hand-selected, ensuring exceptional quality and brilliance.",
  "tags": [
    "Bangles",
    "Kangan",
    "కంకణం",
    "Diamond Jewelry",
    "Gold Jewelry",
    "22K Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Brilliant Cut Diamonds",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0146_0762",
  "collection": "diamond"
}