{
  "id": "necklaces-165",
  "title": "Gulabi Bagh Kundan Kanthi Haaram - Emerald and Ruby Floral Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (Panna)",
    "Natural Rubies (Manikyam)",
    "Kundan Polki Diamonds. Hyderabadi Polish. Gold purity is hallmarked."
  ],
  "features": "Exquisite floral design featuring a central ruby and kundan polki flower, alternating with emerald square cut flowers. The delicate kundan setting showcases traditional craftsmanship. Features closed setting Kundan craftsmanship with meticulous attention to detail. A nod to the Nizam era, the intricate design embodies old-world charm.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "White (Kundan). Classic South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "festive occasions like Diwali and Sankranthi",
    "and traditional ceremonies such as Seemantham or half-saree function (Pavada Dhaavani). Also suitable for upscale cultural events and heirloom jewelry collections."
  ],
  "description": "This Kanthi Haaram is a true testament to Hyderabadi craftsmanship. The use of high-quality emeralds, rubies, and kundan polki diamonds ensures enduring beauty and value. Its timeless design makes it a versatile piece that can be passed down through generations, becoming a cherished heirloom. The rich colors and intricate detailing make it a statement piece for any special occasion.",
  "tags": [
    "Kundan",
    "Polki",
    "Emerald",
    "Ruby",
    "Kanthi",
    "Necklace",
    "Haaram",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Temple Jewelry",
    "Panna",
    "Manikyam",
    "కంఠి",
    "హారం",
    "పెళ్లి నగలు"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0004_0413",
  "collection": "diamond"
}