{
  "id": "earrings-617",
  "title": "Vibrant Neelambari Jhumkas: A Symphony of Tradition and Modernity",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (FG)",
    "Natural Rubies (2.50ct)",
    "Emeralds (4.16ct)",
    "Sapphires (3.80ct)",
    "Blue Beads (10.82ct)",
    "Polki Diamonds (1.36ct). Hyderabadi Gold Polish."
  ],
  "features": "A contemporary take on the classic Jhumka, these earrings feature a vibrant combination of gemstones. The upper section showcases carved emerald leaves, reminiscent of traditional nature-inspired designs. A striking sapphire cabochon sits atop a floral motif encrusted with polki diamonds, complemented by vibrant ruby accents. The intricate filigree work and the Hyderabadi gold polish add a touch of timeless elegance.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "Sapphire Blue",
    "and White (Polki Diamonds). The bold color palette is a modern interpretation of traditional South Indian hues."
  ],
  "occasions": [
    "Perfect for modern receptions",
    "sangeets",
    "and special occasions where you want to make a statement. Can also be worn at traditional events like half-saree functions or family celebrations for a touch of contemporary flair."
  ],
  "description": "These earrings blend traditional South Indian craftsmanship with a modern aesthetic, making them a unique and versatile addition to your jewelry collection. The use of high-quality gemstones, combined with intricate detailing and Hyderabadi gold polish, ensures both lasting beauty and enduring value. The vibrant color combination and contemporary design make these Jhumkas a true conversation starter, embodying both tradition and individuality.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Gold Earrings",
    "Ruby",
    "Emerald",
    "Sapphire",
    "Neelam",
    "Polki Diamonds",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Festive Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-13-02-27 3_1847",
  "collection": "sjpl"
}