{
  "id": "necklaces-203",
  "title": "Chandrika Ruby Pendant - A Timeless Telugu Legacy",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold setting with Hyderabadi Polish for a rich",
    "antique luster. Features a central cabochon-cut Ruby (approx. 5ct",
    "AAA quality) surrounded by meticulously set Polki Diamonds (uncut diamonds). Dangler accents include smaller Polki diamonds and natural freshwater pearls adorning the ruby beads."
  ],
  "features": "The Chandrika pendant showcases traditional South Indian craftsmanship. The central ruby is the focal point, embraced by concentric circles of shimmering Polki diamonds. The dangled accents give a lightweight feel of balance and sophistication, with ruby beads and pearl highlights enhancing the design. This piece shows traditional Telugu design with modern accents.",
  "colors": [
    "Dominant colors are rich red (ruby)",
    "warm gold",
    "sparkling white (diamonds)",
    "and subtle pearl shimmer",
    "creating a classic and luxurious aesthetic."
  ],
  "occasions": [
    "Perfect for weddings (especially the Muhurtham)",
    "anniversaries",
    "festive celebrations like Diwali and Sankranti",
    "and special family functions. Its elegant design also makes it suitable for formal evening events and cultural gatherings."
  ],
  "description": "This Chandrika Ruby Pendant embodies the timeless elegance of South Indian jewelry. The use of 22K gold and high-quality gemstones ensures lasting value. The Hyderabadi polish adds a touch of antique charm, while the Polki diamonds deliver unmatched brilliance. It's a unique piece that blends tradition with contemporary style, making it a treasured heirloom.",
  "tags": [
    "Pendant",
    "Locket",
    "Ruby",
    "Manikyam",
    "Polki Diamond",
    "Uncut Diamond",
    "Diamond",
    "Pearl",
    "Mutyalu",
    "Gold",
    "Swarnam",
    "22K Gold",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Chandrika",
    "Antique Finish"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0054_0462",
  "collection": "diamond"
}