{
  "id": "necklaces-1564",
  "title": "Exquisite Floral Navratna Haaram - A Symphony of Tradition and Modernity",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity Gold with Hyderabadi Polish. Adorned with a vibrant array of Navratna gemstones",
    "including Ruby (Manikyam)",
    "Pearl (Mutyam)",
    "Coral (Pagadam)",
    "Emerald (Pachcha)",
    "Yellow Sapphire (Pushyaragam)",
    "Diamond (Vajram)",
    "Blue Sapphire (Neelam)",
    "Hessonite (Gomedhikam)",
    "and Cat's Eye (Vaiduryam). Showcases brilliant-cut Fancy Diamonds for unparalleled sparkle and beauty."
  ],
  "features": "This stunning Haaram showcases a contemporary floral design, meticulously handcrafted with intricate detailing. The arrangement of Navratna gemstones is carefully balanced to maximize their individual brilliance and harmonious synergy. The necklace features a series of interconnected floral motifs, each meticulously set with diamonds and colorful gemstones, culminating in a grand floral centerpiece. The Hyderabadi polish gives the gold a rich, enduring luster.",
  "colors": [
    "The necklace features a rich tapestry of colors",
    "including the fiery red of Ruby",
    "the serene white of Pearl",
    "the vibrant coral of Pagadam",
    "the lush green of Emerald",
    "the sunny yellow of Yellow Sapphire",
    "the dazzling brilliance of Diamond",
    "the deep blue of Blue Sapphire",
    "the smoky brown of Hessonite",
    "and the iridescent shimmer of Cat's Eye. The gold setting adds a warm",
    "luxurious touch."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "receptions",
    "anniversaries",
    "and significant celebrations. Also suitable for modern events where a touch of traditional elegance is desired."
  ],
  "description": "This Navratna Haaram seamlessly blends traditional South Indian aesthetics with contemporary design. The use of high-quality Navratna gemstones, each representing a planetary deity, bestows blessings of good fortune, health, and prosperity upon the wearer. The intricate floral design and Hyderabadi craftsmanship add a touch of timeless elegance, making it a treasured heirloom for generations to come. The sparkle of the diamonds enhances the richness of the colored gems making it a truly special piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Navratna",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Gemstone Necklace",
    "Diamond Necklace",
    "Floral Design",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Vivaha",
    "Mutyam",
    "Manikyam",
    "Pagadam",
    "Pachcha",
    "Pushyaragam",
    "Neelam",
    "Vaiduryam",
    "Gomethikam"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-48 3_2268",
  "collection": "sjpl"
}