{
  "id": "necklaces-1110",
  "title": "Polki Kundan Statement Haaram with Gemstone Drops - \"Ratna Manjari\"",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Hallmarked)",
    "Uncut Polki Diamonds (Hyderabadi Polish)",
    "Faceted Emerald (Oval Cabochon)",
    "Faceted Amethyst (Pear Cut)",
    "Freshwater Pearls. Setting Style: Closed Setting (Kundan)"
  ],
  "features": "This 'Ratna Manjari' Haaram showcases intricate Kundan craftsmanship, a hallmark of Hyderabadi jewelry. The necklace features a series of Polki diamond-encrusted motifs in floral and geometric shapes. Delicate clusters of Emerald drops and Freshwater Pearls gracefully dangle from each motif, adding movement and light. The centerpiece is a large, oval-shaped faceted Emerald cabochon, encircled by Polki diamonds, radiating an aura of timeless elegance. Below the emerald is beautiful faceted amethyst drops.",
  "colors": [
    "Antique Gold",
    "Emerald Green",
    "Amethyst Purple",
    "Pearl White",
    "Diamond (Colorless)"
  ],
  "occasions": [
    "Ideal for weddings (Vivaha Mahotsavam)",
    "engagements (Nischitartham)",
    "bridal showers (Pellikuthuru function)",
    "and grand receptions. It's also a striking piece for festive occasions like Diwali or Sankranthi",
    "or modern formal events where you want to make a statement."
  ],
  "description": "A blend of traditional Telugu artistry and modern design sensibilities, the 'Ratna Manjari' Haaram is an heirloom piece. The use of uncut Polki diamonds gives it a distinct vintage charm, while the contrasting colours of Emerald and Amethyst offer a unique and eye-catching aesthetic. The Hyderabadi Polish ensures lasting shine and durability. This piece is more than just jewelry; it's a statement of cultural heritage and refined taste.",
  "tags": [
    "Haaram",
    "Polki",
    "Kundan",
    "Emerald",
    "Amethyst",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Necklace",
    "Wedding Jewelry",
    "Statement Necklace",
    "Pearl",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Ratna",
    "Manjari",
    "Antique Gold"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0005_2523",
  "collection": "radhe"
}