{
  "id": "necklaces-992",
  "title": "Diamond Pearl Haaram Set - The 'Chandrika' Collection",
  "category": "necklaces",
  "original_type": "Necklace & Earring Set",
  "materials": [
    "22K Gold",
    "Hyderabadi Polish. Features brilliant-cut Diamonds (VS clarity",
    "G color) and Freshwater Pearls. Center stone is a Ruby (estimated 3 carats) with excellent clarity."
  ],
  "features": "This exquisite Haaram necklace showcases a floral design intricately embellished with dazzling diamonds. Delicate diamond-studded leaf motifs grace the neckline, leading to a central pendant with a vibrant ruby surrounded by further diamond detailing. Dainty pearl drops adorn both the necklace and the matching jhumka earrings. The earrings feature a traditional dome shape. The piece showcases exquisite handcraftsmanship, typical of Hyderabadi jewelry.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Red (Ruby)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "receptions",
    "festive occasions like Sankranthi or Ugadi",
    "and grand celebrations. This is a statement piece perfect for the bride or any special occasion where you want to make a lasting impression."
  ],
  "description": "This Diamond Pearl Haaram set is a testament to timeless elegance, blending traditional design with modern brilliance. The Hyderabadi polish enhances the gold's luster, while the high-quality diamonds provide unparalleled sparkle. The inclusion of lustrous freshwater pearls adds a touch of femininity and grace. This set is a heirloom piece to be cherished for generations.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Diamond Necklace",
    "Pearl Necklace",
    "Ruby",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "VS Diamond",
    "22K Gold",
    "Muhurtham",
    "Seemantham",
    "Vaddanam",
    "Kanjeevaram Saree",
    "Gold Jewelry",
    "Indian Wedding"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0448_2313",
  "collection": "necklace"
}