{
  "id": "earrings-557",
  "title": "Aarya Diamond Floral Stud Earrings - Manoharam Kammlu",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K Yellow Gold (approx. 9.720 g gross weight)",
    "Brilliant Cut Diamonds (approx. 9.51 ct total diamond weight)",
    "Secure Post and Butterfly Closure. Boasts a Hyderabadi Polish for a lasting luster."
  ],
  "features": "These captivating stud earrings feature a floral motif crafted with intricate gold filigree and embellished with sparkling brilliant-cut diamonds. The openwork design allows light to pass through, enhancing the diamonds' brilliance. A modern interpretation of traditional Telugu floral motifs, lending a touch of heritage to contemporary styles.",
  "colors": [
    "Predominantly yellow gold with shimmering white diamonds",
    "creating a classic and elegant color palette."
  ],
  "occasions": [
    "Perfect for daily wear",
    "special occasions",
    "engagement parties",
    "cocktail events",
    "or to add a touch of sparkle to any outfit. A beautiful gift for anniversaries",
    "birthdays",
    "or any celebration of a loved one."
  ],
  "description": "These earrings are a testament to the perfect blend of modern design and traditional artistry. The floral motif adds a touch of timeless elegance, while the brilliant-cut diamonds provide unparalleled sparkle. Crafted from high-quality 18K gold and meticulously set diamonds, these earrings are a durable and cherished investment. The classic design ensures versatility, making them suitable for any occasion.",
  "tags": [
    "Diamond Earrings",
    "Stud Earrings",
    "Gold Earrings",
    "Floral Jewelry",
    "Kammlu",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Engagement Earrings",
    "Gift for Her",
    "Manoharam",
    "Vaibhav Jewellers",
    "Contemporary Jewelry"
  ],
  "original_id": "jewellery_IMG-20241219-WA0027_1606",
  "collection": "jewellery"
}