{
  "id": "bangles-097",
  "title": "Emerald Radiance Vanki - Traditional Armlet with a Contemporary Twist",
  "category": "bangles",
  "original_type": "Armlet/Bracelet",
  "materials": [
    "22K Yellow Gold",
    "ethically sourced Square Cut Emerald",
    "brilliant-cut CZ Diamonds. Features a fine Hyderabadi polish for a lasting luster and antique appeal."
  ],
  "features": "This exquisite vanki showcases intricate filigree work reminiscent of traditional South Indian designs. A square-cut emerald takes center stage, surrounded by a halo of sparkling CZ diamonds meticulously set in a floral motif. The openwork design provides a delicate and airy feel, blending classic aesthetics with modern sensibilities. The cuff is comfortable and sturdy.",
  "colors": [
    "Lustrous yellow gold contrasted by the vibrant green of the emerald and the dazzling white of the CZ diamonds. A classic and elegant color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "Seemantham (baby shower)",
    "or other special occasions where you want to make a statement. Its versatile design also makes it suitable for upscale parties and formal events."
  ],
  "description": "This Vanki blends traditional South Indian artistry with a contemporary design, making it a timeless piece. The high-quality emerald, the intricate filigree, and the sparkling CZ diamonds ensure both beauty and lasting value. Its Hyderabadi polish provides a unique sheen, and the comfortable design ensures ease of wear. It's a testament to skilled craftsmanship and a precious heirloom to be cherished for generations.",
  "tags": [
    "Vanki",
    "Armlet",
    "Bracelet",
    "Emerald",
    "CZ Diamonds",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Telugu Jewelry",
    "Antique Finish",
    "Fine Jewelry",
    "Seemantham",
    "Filigree",
    "Andhra Jewelry"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0377_0025",
  "collection": "bracelets"
}