{
  "id": "necklaces-759",
  "title": "Exquisite Emerald and Diamond Chowker - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "brilliant-cut Diamonds",
    "Emeralds (Panna). Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "Intricate floral and vine motifs meticulously handcrafted in gold, enhanced by dazzling diamonds. The chowker features a stunning emerald centerpiece, with smaller emerald accents throughout. The design includes dangling golden beads, adding a touch of traditional flair. The pendant boasts a detachable emerald drop, adding versatility to this piece.",
  "colors": [
    "Primarily gold and shimmering white (diamonds)",
    "beautifully contrasted by the deep green hues of the emeralds. A classic South Indian color palette signifying prosperity and auspiciousness."
  ],
  "occasions": [
    "Perfect for bridal wear (పెళ్ళి నగల)",
    "traditional Telugu weddings",
    "engagement ceremonies",
    "and grand celebrations. Ideal for a Seemantham or any occasion where you want to exude timeless elegance."
  ],
  "description": "This chowker is a testament to the skilled craftsmanship of our Hyderabad artisans. The high-quality diamonds and vivid emeralds create a captivating sparkle. The timeless design blends traditional aesthetics with modern wearability, making it a treasured heirloom piece (వారసత్వ సంపద). Its adjustable length ensures a comfortable and secure fit. The detachable emerald drop allows for multiple wearing styles.",
  "tags": [
    "Chowker",
    "Necklace",
    "Bridal Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Kantaabharanam",
    "పెళ్ళి నగల",
    "Traditional Jewelry",
    "Gold Necklace",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-03 2_1265",
  "collection": "diamond"
}