{
  "id": "necklaces-1557",
  "title": "Exquisite Blossom Haaram with South Sea Pearls and Fancy Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "South Sea Pearls (Moti)",
    "Fancy Diamonds (NV Fancy)",
    "Pink Sapphires (D PAN(+7)). Features a meticulous Hyderabadi polish for a rich",
    "lasting shine."
  ],
  "features": "This stunning Haaram showcases an intricate floral design, meticulously crafted with shimmering diamonds and delicate pink sapphires. Each flower is individually set for maximum brilliance. Large, luminous South Sea Pearls are strategically placed to enhance the overall elegance. The central floral motif is the focal point, culminating in a single, dangling pearl pendant. The design incorporates a modern take on traditional Telugu jewelry craftsmanship.",
  "colors": [
    "Rose Gold",
    "White Diamonds",
    "Pink Sapphires",
    "and Lustrous White Pearls create a harmonious and captivating color palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "receptions",
    "Seemantham",
    "and special celebrations. Also makes a statement piece for modern evening wear and high-end social events."
  ],
  "description": "This Haaram is a testament to exceptional craftsmanship and timeless elegance. The floral design symbolizes prosperity and new beginnings. The use of high-quality South Sea Pearls and Fancy Diamonds ensures lasting value and unparalleled brilliance. A unique fusion of traditional South Indian aesthetics and contemporary design makes this piece a treasured heirloom.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Sea Pearls",
    "Moti",
    "Fancy Diamonds",
    "Pink Sapphires",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "పూల హారము",
    "Vivaha",
    "Seemantham",
    "Reception"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-32_2236",
  "collection": "sjpl"
}