{
  "id": "necklaces-980",
  "title": "Divya Emerald and Diamond Hasli Haaram - A Touch of Hyderabad's Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Suvarna)",
    "Premium Quality Brilliant Cut Diamonds (Vajraalu)",
    "Natural Emeralds (Marakathamani) with vivid green hue and excellent clarity",
    "South Sea Pearls. Features a lustrous Hyderabadi Polish for enduring shine."
  ],
  "features": "This exquisite Haaram features a delicate floral motif crafted with brilliant cut diamonds. The necklace is anchored by a larger central pendant with a focal emerald, and a larger floral motif with diamonds, and a lower pendant featuring an oval emerald surrounded by diamonds with cascading South Sea pearls. The gold chain is a modern mesh style. The intricate setting showcases the sparkle of each individual diamond, while the emeralds bring a touch of regal grace. This blending of modern and traditional motifs offers a unique interpretation of the classic Hasli.",
  "colors": [
    "Gold (Yellow)",
    "Diamond (White)",
    "Emerald (Green)",
    "Pearl (Creamy White)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "engagement ceremonies (Nischitartham)",
    "and upscale social events. Makes a stunning statement for modern brides and for those seeking to add a touch of traditional opulence to their contemporary wardrobe."
  ],
  "description": "This stunning haaram represents the epitome of Hyderabadi craftsmanship and design. The use of high-quality diamonds and vibrant emeralds enhances its value and beauty. Its exquisite craftsmanship ensures a timeless piece that can be cherished for generations. The modern design makes it versatile for any occasion.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Temple Jewelry",
    "Suvarna",
    "Vajraalu",
    "Marakathamani",
    "Vivaham",
    "Nischitartham",
    "Hasli",
    "Floral Motif",
    "Emerald Pendant"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0432_2301",
  "collection": "necklace"
}