{
  "id": "necklaces-315",
  "title": "The Apsara Diamond Haaram Set with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Crafted in 22K Gold. Features brilliant-cut diamonds (VVS clarity",
    "F color) in a pave setting. Accented with a central cabochon Emerald (Zambian origin) and a Ruby. Adorned with South Sea Pearls. Finished with a special Hyderabadi Polish for a lasting luster."
  ],
  "features": "The Haaram showcases a floral motif design, meticulously handcrafted with numerous sparkling diamonds. The central pendant features a prominent emerald surrounded by diamond petals. The necklace transitions into a streamlined, modern design. The Jhumka earrings are embellished with a ruby and pearl drop, echoing the necklace's aesthetic. Features delicate pearl drops, adding a touch of traditional South Indian grace.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with pops of vibrant green (emerald) and red (ruby). The pearls add a soft",
    "iridescent white."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivah",
    "Kalyanam)",
    "receptions",
    "and significant family functions. Suitable for traditional ceremonies like Seemantham or Voni Function. Also",
    "it's ideal for adding a regal touch to modern formal events."
  ],
  "description": "This exquisite Diamond Haaram set is a true masterpiece of craftsmanship. The combination of traditional design elements with a contemporary silhouette makes it a timeless investment. The high-quality diamonds and precious gemstones ensure lasting beauty and value. The Hyderabadi polish guarantees a superior and long-lasting shine. A statement piece that embodies South Indian heritage and modern elegance.",
  "tags": [
    "Diamond Haaram",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Kalyanam Jewellery",
    "Voni Function",
    "Seemantham",
    "Emerald",
    "Ruby",
    "Pearls",
    "22K Gold",
    "Hyderabadi Polish",
    "Indian Bridal Jewelry",
    "Nakshi Work",
    "Flower Design",
    "Contemporary Indian Jewelry",
    "diamond necklace set",
    "guttapusalu haaram inspired"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0404_0601",
  "collection": "diamond"
}