{
  "id": "necklaces-1180",
  "title": "Grandeur Emerald and Diamond Haaram - The 'Lakshmi Kasula Mala' Reimagined",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark) with Hyderabadi Polish; Natural Emeralds (28.84 carats total) of Fine Color and Clarity; Brilliant-Cut Diamonds (20.80 carats total); South Sea Pearls (Moti)"
  ],
  "features": "This three-layered Haaram showcases exquisite craftsmanship with intricate floral patterns meticulously set with dazzling diamonds. The design is accented with vibrant oval-cut Emeralds, adding a touch of regal elegance. The center pendant is detachable and features a stunning Emerald centerpiece surrounded by delicate diamond filigree and lustrous South Sea Pearls. 'Nakshi' style detailing adds a traditional South Indian touch, while the overall design offers a contemporary aesthetic.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Diamonds)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "bridal showers (Sreemantham)",
    "and grand receptions. Also suitable for formal events where you want to make a statement of timeless beauty and cultural richness."
  ],
  "description": "This Emerald and Diamond Haaram is a stunning blend of tradition and modern elegance. The vibrant Emeralds symbolize prosperity and new beginnings, making it a cherished heirloom. The high-quality diamonds sparkle with unmatched brilliance, showcasing the impeccable craftsmanship of our Hyderabad artisans. The detachable pendant offers versatility, allowing you to wear the Haaram in multiple ways. Invest in a piece of art that reflects your refined taste and appreciation for South Indian heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emeralds",
    "Diamonds",
    "South Sea Pearls",
    "22K Gold",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "கண்டிக",
    "Mutyala Haram",
    "Pasupu Tadu",
    "Kanthabharanam",
    "Lakshmi Kasula Mala",
    "Seemantham",
    "Vivahaalu"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-02_1732",
  "collection": "sjpl"
}