{
  "id": "necklaces-699",
  "title": "Lavanya Pink Sapphire and Tanzanite Floral Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Pink Sapphires (Round Cut)",
    "Tanzanite (Cabochon Cut)",
    "Cubic Zirconia (CZ) Stones. Features Hyderabadi Polish for lasting luster."
  ],
  "features": "A modern take on the classic Haaram, featuring alternating hexagonal floral motifs. The delicate gold filigree work resembles traditional Nakshi artistry, while the floral centers showcase meticulously set pink sapphires. Each motif is connected by intricate CZ-studded designs. Finished with dangling tanzanite cabochons for added elegance.",
  "colors": [
    "Dominant colors include Rose Pink (Sapphires)",
    "Deep Blue-Purple (Tanzanite)",
    "and Brilliant White (CZ)",
    "accented by the rich Yellow Gold. A sophisticated and contemporary color palette."
  ],
  "occasions": [
    "Perfect for modern brides",
    "receptions",
    "cocktail parties",
    "anniversaries",
    "or special gatherings. Adds a touch of South Indian elegance to any outfit. Suitable for Muhurtham or Seemantham with the right attire."
  ],
  "description": "A unique blend of traditional South Indian design and contemporary styling. The high-quality gemstones and expert craftsmanship ensure lasting beauty and value. The combination of pink sapphires and tanzanite makes this haaram a statement piece that will draw admiration. Handcrafted in Hyderabad, showcasing regional artistry.",
  "tags": [
    "Haaram",
    "Necklace",
    "Pink Sapphire",
    "Tanzanite",
    "Floral Design",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Modern Jewelry",
    "22K Gold",
    "Gold Necklace",
    "CZ",
    "Wedding Jewelry",
    "Party Wear",
    "Ethnic Jewelry",
    "Ethnic"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-54_1205",
  "collection": "diamond"
}