{
  "id": "bangles-075",
  "title": "Emerald and Diamond Bangle - Vaiduryam Vajra Kankanam",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish. Features a central square-cut Emerald (approx. 3 carats) of vibrant green hue",
    "surrounded by meticulously set Brilliant-cut Diamonds (VS clarity",
    "G color",
    "approx. 1 carat total weight)."
  ],
  "features": "This exquisite bangle showcases a fusion of modern aesthetics and traditional South Indian craftsmanship. The centerpiece features a striking square-cut Emerald, framed by a delicate halo of sparkling diamonds, creating a mesmerizing contrast. The intricately designed band showcases a unique chevron pattern adorned with pave-set diamonds, adding a touch of contemporary elegance. The lattice-like gold filigree surrounding the emerald adds a traditional flair. The bangle has a secure clasp to guarantee an easy and safe fit.",
  "colors": [
    "Primarily gold with brilliant white diamonds and a vibrant green emerald centerpiece."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (Vivaha)",
    "engagements (Nischitartham)",
    "festivals (like Diwali or Sankranthi)",
    "or milestone celebrations. Also suitable for upscale parties and social gatherings where you want to make a statement."
  ],
  "description": "A stunning statement piece that blends traditional design elements with modern sophistication. The vibrant emerald and sparkling diamonds are a symbol of prosperity and good fortune. The Hyderabadi polish ensures a lasting luster and showcases the exceptional craftsmanship. A perfect heirloom piece to be treasured for generations. The unique chevron pattern on the band is eye-catching and modern, making it suitable for both traditional and contemporary ensembles.",
  "tags": [
    "Bangle",
    "Kankanam",
    "Emerald",
    "Vajram",
    "Diamond",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Festive Jewelry",
    "Fine Jewelry",
    "Vaiduryam",
    "Emerald Jewellery",
    "Diamond Bangle"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0269_0003",
  "collection": "bracelets"
}