{
  "id": "necklaces-160",
  "title": "Diamond Nakshi Addigai Pendant - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "High-Quality Brilliant Cut Diamonds (VS Clarity",
    "G-H Color). Features a traditional Hyderabadi polish for a rich",
    "lustrous finish."
  ],
  "features": "A delicate addigai pendant showcases traditional Nakshi work inspired by nature, resembling intricately crafted vines and leaves. Features a central kempu-inspired design element embellished with shimmering diamonds. The pendant is designed to sit perfectly on a choker or addigai, creating a timeless and elegant statement.",
  "colors": [
    "Warm yellow gold provides a rich backdrop for the sparkling white diamonds",
    "creating a classic and luxurious color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "muhurtham",
    "and other auspicious occasions. Also suitable for formal events and celebrations where you want to make a statement of refined elegance."
  ],
  "description": "This addigai pendant is a testament to the enduring beauty of traditional South Indian jewelry. The combination of Nakshi artistry, brilliant diamonds, and high-karat gold creates a piece that is both exquisite and heirloom-worthy. Its timeless design ensures it will be cherished for generations to come. Handcrafted in Hyderabad with meticulous attention to detail, this pendant embodies the rich cultural heritage of the region.",
  "tags": [
    "Addigai",
    "Kantabharanam",
    "Necklace Pendant",
    "Diamond Pendant",
    "Nakshi Work",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Temple Jewelry",
    "Heirloom Jewelry"
  ],
  "original_id": "diamond_jewellery_e68546c0-6126-4b76-ab75-8a8c49dcf0ba_0395",
  "collection": "diamond"
}