{
  "id": "necklaces-1099",
  "title": "Manikyam Haaram - Ruby and Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Rubies (Cabochon and faceted)",
    "Polki Diamonds",
    "Freshwater Pearls. Exquisite Hyderabadi Polish for a lasting shine."
  ],
  "features": "This stunning Haaram features five strands of finely beaded rubies interspersed with lustrous freshwater pearls. The pendant is an elaborate composition of Polki diamonds surrounding a large, oval cabochon ruby. Delicate ruby drops, each framed by diamonds, add movement and sparkle. The goldwork showcases intricate filigree detailing, a hallmark of traditional South Indian jewelry. Traditional temple jewelry influence is reflected in the pendant's overall design.",
  "colors": [
    "Rich Ruby Red",
    "Sparkling White (Diamonds and Pearls)",
    "Warm Gold."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "receptions",
    "Seemantham",
    "half-saree function (Voni Function)",
    "and other grand celebrations. Also suitable as a statement piece for exclusive events."
  ],
  "description": "This Manikyam Haaram is a timeless heirloom, handcrafted with meticulous attention to detail. The combination of vibrant rubies, sparkling Polki diamonds, and lustrous pearls exudes opulence and grace. The piece's traditional design elements, combined with modern wearability, make it a prized possession. Its robust construction ensures durability and longevity, making it a valuable investment.",
  "tags": [
    "Haaram",
    "Necklace",
    "Manikyam",
    "Ruby",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Seemantham",
    "Vonifunction",
    "Vivahaalu",
    "Hyderabadi Jewelry",
    "Heirloom Jewelry",
    "Traditional Jewelry",
    "Jadau Jewelry"
  ],
  "original_id": "radhe_diam_DPPD8-1656_2512",
  "collection": "radhe"
}