{
  "id": "bangles-243",
  "title": "Navarathna Vala - Nine Gemstone Bangles in Gold",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features nine traditional gemstones (Navarathna stones) including Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "and Cat's Eye. Accentuated with CZ Diamonds."
  ],
  "features": "These handcrafted bangles showcase the classic Navarathna design, believed to bring prosperity and good fortune. Each of the nine gemstones is meticulously set in a square bezel setting, interspersed with delicate floral motifs adorned with sparkling CZ diamonds. The polished gold provides a rich, warm glow that complements the gemstones' vibrant colors.",
  "colors": [
    "Gold (warm yellow)",
    "Ruby (red)",
    "Pearl (white)",
    "Coral (orange)",
    "Emerald (green)",
    "Yellow Sapphire (yellow)",
    "Blue Sapphire (blue)",
    "Hessonite (brownish-orange)",
    "Cat's Eye (greyish-green)",
    "Diamond (white). A harmonious blend of auspicious colors."
  ],
  "occasions": [
    "Ideal for weddings",
    "festivals like Sankranthi and Ugadi",
    "traditional ceremonies (like Seemantham)",
    "and special occasions where a touch of cultural elegance is desired. Also suitable as an everyday statement piece."
  ],
  "description": "Experience the blessings of the Navarathnas with this exquisite pair of bangles. Meticulously handcrafted with attention to detail, these bangles are a testament to skilled craftsmanship and timeless design. The combination of auspicious gemstones and sparkling CZ diamonds makes it a truly special and valuable addition to your jewelry collection. The Hyderabadi polish ensures a lasting luster.",
  "tags": [
    "Bangles",
    "Valalu",
    "Navarathna",
    "Nine Gemstones",
    "Gold",
    "22K",
    "CZ Diamonds",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabad",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Seemantham",
    "Ugadi",
    "Sankranthi",
    "Ethnic Jewelry",
    "Handcrafted",
    "Auspicious",
    "Vala",
    "Gold Bangles",
    "Gemstone Bangles"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-05-04-11-18-22_0830",
  "collection": "diamond"
}