{
  "id": "necklaces-1198",
  "title": "Diamond Chandrani Haaram with Emerald and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (480 milligrams of Gold weight)",
    "Ethically sourced Diamonds (1.86 carats)",
    "Natural Ruby (1.05 carat)",
    "Emerald (0.63 carat)",
    "Cultured Pearls (12.50 carat total weight for 4 pearls). Features a signature Hyderabadi Polish for enhanced luster."
  ],
  "features": "This exquisite Chandrani Haaram features a delicate diamond-studded chain leading to an ornate pendant. The pendant showcases intricate filigree work reminiscent of traditional South Indian designs, with a vibrant ruby at its core and a cluster of lustrous pearls hanging below, evoking the elegance of classic Hyderabadi craftsmanship. The arrangement of diamonds and pearls follows a traditional layered design.",
  "colors": [
    "Primarily white (diamonds)",
    "with warm yellow gold accents",
    "a pop of green (emerald)",
    "deep red (ruby) and a soft creamy white of the pearls. These colors reflect traditional South Indian jewelry palettes."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (vivaham)",
    "engagements",
    "festivals",
    "or as a precious heirloom piece. Ideal for wearing with traditional South Indian attire like sarees or lehengas. Also appropriate for sophisticated modern events."
  ],
  "description": "This Chandrani Haaram is a timeless blend of tradition and luxury. The exquisite craftsmanship, the brilliance of the diamonds, the quality of the gemstones and pearls makes it a valuable addition to any jewelry collection. It represents a significant cultural investment and a stunning statement piece, ensuring you stand out with unmatched elegance.",
  "tags": [
    "Diamond Haaram",
    "Chandrani",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "Vajraala Haaram",
    "Temple Jewelry",
    "Filigree",
    "Traditional Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-45 3_1772",
  "collection": "sjpl"
}