{
  "id": "necklaces-1048",
  "title": "Rajakumari Polki Haaram with Radiant Rubies",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (కంప్లీట్ బంగారు)",
    "Uncut Polki Diamonds",
    "Faceted Rubies. Hyderabadi Polish. String of Natural Pearls."
  ],
  "features": "A captivating Polki Haaram featuring a graduated design with bezel-set polki diamonds interspersed with rows of vibrant, faceted rubies. The centerpiece is a magnificent polki diamond pendant encircled by smaller diamonds, creating a mesmerizing focal point. The necklace transitions to a string of lustrous natural pearls near the clasp for added elegance. Exemplifies the classic South Indian jewelry aesthetic with a modern twist.",
  "colors": [
    "Gold (బంగారు రంగు)",
    "Ruby Red (రూబీ ఎరుపు)",
    "Diamond White (వజ్రం తెలుపు)",
    "Pearl White (ముత్యం తెలుపు)."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "receptions (రిసెప్షన్)",
    "Seemantham (సీమంతం)",
    "bridal occasions",
    "and high-end social gatherings. A timeless piece to be treasured for generations."
  ],
  "description": "This Rajakumari Haaram is a testament to the enduring legacy of South Indian craftsmanship. The use of uncut polki diamonds lends a regal and antique feel, while the vibrant rubies add a touch of modern glamour. Crafted with meticulous attention to detail and using only the finest materials, this necklace is a true heirloom piece. The Hyderabadi polish enhances the gold's luster, ensuring a radiant shine that will captivate all who see it. Its perfect blend of tradition and contemporary style makes it a versatile piece for any discerning jewelry collector.",
  "tags": [
    "Polki",
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Rubies",
    "Diamonds",
    "Uncut Diamonds",
    "కంఠాభరణం",
    "వజ్రాలు",
    "రూబీ",
    "బంగారు",
    "వివాహం",
    "సీమంతం",
    "Hyderabadi Jewelry",
    "Heirloom Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry"
  ],
  "original_id": "radhe_diam_DPNK8-1144_2461",
  "collection": "radhe"
}