{
  "id": "necklaces-1580",
  "title": "Enchanting Emerald and Diamond Cascade Necklace - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity Gold (estimated 22K or 916 gold)",
    "adorned with meticulously selected Emeralds and dazzling GH color Diamonds. Features a Hyderabadi Polish for a lasting sheen and vibrant color."
  ],
  "features": "This exquisite necklace features a modern Haaram design with a graceful cascade of emeralds and diamonds. The rectangular Emeralds are individually prong-set, creating a stunning contrast against the brilliance of the pave-set diamonds. The intricate diamond work around each emerald adds depth and dimension, showcasing exceptional craftsmanship.",
  "colors": [
    "Predominantly gold",
    "with vibrant emerald green and sparkling white diamonds. The emeralds provide a rich",
    "luxurious contrast against the neutral tones of the gold and diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement ceremonies",
    "and grand celebrations. Also suitable for modern cocktail parties and special events where you want to make a statement."
  ],
  "description": "This necklace offers a unique blend of traditional South Indian aesthetics and contemporary design. The use of high-quality emeralds and diamonds ensures lasting brilliance. The Hyderabadi Polish enhances the gold's luster, adding to the piece's overall value and appeal. This is a statement piece that will be cherished for generations.",
  "tags": [
    "Necklace",
    "Haaram",
    "Emerald",
    "Diamond",
    "Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Statement Necklace",
    "Pachi work",
    "Jadau",
    "Modern Haaram",
    "கல்யாண நகைகள்",
    "நகைகள்"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-45 3_2285",
  "collection": "sjpl"
}