{
  "id": "necklaces-625",
  "title": "Emerald and Diamond Grand Haaram Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Natural Emeralds (Pear and Round Cut)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color)",
    "Cultured Pearls. Finished with authentic Hyderabadi Polish for a lasting lustre."
  ],
  "features": "This exquisite haaram features a contemporary design with intricate filigree work, meticulously handcrafted by skilled artisans. The necklace showcases a graduating arrangement of diamond-studded paisley motifs, punctuated with vibrant emeralds. Delicate pearls dangle gracefully, adding a touch of traditional elegance. The centerpiece features a larger pear-shaped emerald, elegantly framed in diamonds and pearls, creating a stunning focal point.",
  "colors": [
    "Emerald Green",
    "Brilliant White (Diamonds)",
    "Soft White (Pearls)",
    "Warm Yellow (Gold). The colour combination evokes regality and sophistication."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "receptions",
    "grand celebrations",
    "and significant family functions like Seemantham or Half-Saree Function. This haaram adds a touch of timeless elegance to any special occasion."
  ],
  "description": "This haaram seamlessly blends traditional South Indian aesthetics with modern design sensibilities. The use of high-quality emeralds and diamonds, combined with expert craftsmanship, makes it a valuable heirloom piece. The Hyderabadi polish ensures lasting shine and durability. This necklace is a statement piece that reflects refined taste and cultural appreciation.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Contemporary Design",
    "Fine Jewelry",
    "Vaddanam",
    "Kasulaperu",
    "Seemantham",
    "Vivahaalu",
    "Pasupu Thadu",
    "Gundu Mala"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-03_1131",
  "collection": "diamond"
}