{
  "id": "necklaces-1541",
  "title": "Emerald Radiance Grand Haaram Necklace Set",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VS Clarity",
    "GH Color)",
    "Natural Emeralds (Pear & Round Cut)",
    "Freshwater Pearls. Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This stunning Grand Haaram features a multi-layered design meticulously handcrafted with intricate diamond settings. Pear-shaped emeralds are elegantly interspersed throughout the necklace, culminating in a statement emerald pendant. Adorned with dangling freshwater pearls, this piece exudes regal charm. Traditional 'Gutti Poosalu' inspired pearl drops add a touch of Telugu heritage. The diamond setting showcases exceptional craftsmanship, providing maximum sparkle and brilliance.",
  "colors": [
    "Gold (Warm Yellow)",
    "Emerald Green",
    "Diamond White",
    "Pearl White."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha)",
    "receptions",
    "bridal wear",
    "milestone birthdays",
    "and significant family celebrations. Ideal for Seemantham",
    "half-saree function",
    "or any occasion demanding an exquisite statement piece."
  ],
  "description": "This Grand Haaram is a true heirloom piece. It combines the timeless elegance of traditional South Indian design with the modern brilliance of diamonds. The exquisite emeralds, sourced from trusted mines, add a touch of sophistication. The Hyderabadi polish ensures lasting shine and durability. This necklace is a testament to the skill and artistry of our master craftsmen.",
  "tags": [
    "Grand Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "Gutti Poosalu",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Telugu Jewelry",
    "Vivaha",
    "Seemantham",
    "Pearl Drops",
    "Jadau",
    "polki"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-09_2159",
  "collection": "sjpl"
}