{
  "id": "necklaces-430",
  "title": "The Emerald Empress Haaram: A Diamond & Gemstone Symphony",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously crafted with brilliant-cut Diamonds (17.52 carats)",
    "vibrant Emeralds (5.55 carats in necklace",
    "1.02 carats in pendant)",
    "a single Ruby (1.18 carat) and lustrous South Sea Pearls (28.75 carats in necklace",
    "23.93 in pendant). Featuring a rich",
    "lustrous Hyderabadi Polish."
  ],
  "features": "A breathtaking, full-length Haaram designed with intricate floral and paisley motifs, pavonine design elements. The necklace features a stunning arrangement of round Emeralds interspersed with diamond-studded floral patterns. The pendant is a magnificent triangular design, studded with diamonds and a central emerald, with pearl drops (moti). Excellent craftsmanship and traditional setting techniques are evident throughout the piece.",
  "colors": [
    "Predominantly Gold and Diamond White",
    "accented by the rich green of the Emeralds and the creamy luster of the South Sea Pearls."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaaham)",
    "receptions",
    "Seemantham (baby shower)",
    "or other important ceremonies. Also suitable for high-profile parties and celebrations where you want to make a statement."
  ],
  "description": "This exquisite Haaram is a true heirloom piece, embodying the rich cultural heritage of South Indian jewelry design. The exceptional craftsmanship, combined with the use of high-quality diamonds, emeralds, ruby and pearls, ensures both its beauty and lasting value. A statement piece, it is an investment and a legacy to be cherished for generations.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Jewelry",
    "South Sea Pearls",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Vivaaham",
    "Hyderabadi Jewelry",
    "కంఠాభరణము",
    "Moti",
    "Emeralds",
    "Ruby",
    "Full Length Necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-09_0871",
  "collection": "diamond"
}