{
  "id": "necklaces-1227",
  "title": "Emerald Grandeur Collar Necklace: A Timeless Nagas Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Fine Quality Emeralds (4.88 carats - 2 stones",
    "2.36 carats - 1 stone)",
    "Sparkling Rubies (8.06 carats - 2 stones",
    "3.60 carats - 1 stone)",
    "High-Quality Polki Diamonds. Features a brilliant Hyderabadi Polish."
  ],
  "features": "This exquisite collar necklace features a unique tiered design, meticulously handcrafted with intricate filigree and floral details. The central emerald is expertly set within a halo of Polki diamonds, complemented by a stunning pendant. The pendant itself mirrors the floral design, showcasing a tear drop Emerald drop at its center. Delicate gold beads cascade from the necklace’s edge, adding movement and grace. The necklace embodies the classic Nagas design, reflecting the architectural splendor of South Indian temples.",
  "colors": [
    "Golden yellow (22K gold)",
    "vibrant green (emeralds)",
    "rich red (rubies)",
    "and dazzling white (diamonds)."
  ],
  "occasions": [
    "Ideal for grand occasions such as weddings (Vivaaham)",
    "receptions",
    "Seemantham (baby shower)",
    "half-saree function (Langa Voni Function)",
    "and other significant celebrations. This statement piece will also elevate any modern formal event."
  ],
  "description": "This collar necklace is a harmonious blend of traditional South Indian artistry and modern design sensibilities. The use of precious gemstones, including emeralds and rubies, imbues the piece with rarity and value. Its impeccable craftsmanship ensures heirloom quality, making it a truly special investment. Its grandeur makes a striking statement, celebrating both your heritage and personal style.",
  "tags": [
    "Haaram",
    "Collar Necklace",
    "Emerald Necklace",
    "Ruby Necklace",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Nagas Design",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Seemantham",
    "Gold Jewelry",
    "Traditional Jewelry",
    "Statement Necklace",
    "Temple Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-55 3_1801",
  "collection": "sjpl"
}