{
  "id": "necklaces-179",
  "title": "Timeless Polki Grandeur: The Rajadhani Diamond Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Uncut Polki Diamonds (పోల్కీ వజ్రాలు) with rose cuts",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Haaram showcases a traditional cascading design, meticulously crafted with uncut Polki diamonds in a closed setting. Features intricate floral and geometric motifs. The central pendant is a pear-shaped Polki with surrounding droplet accents. 'Gutta-pusalu' style teardrop diamond dangles along the edges, adding movement and brilliance. The back chain is adjustable for a comfortable and custom fit.",
  "colors": [
    "Warm yellow gold with sparkling white Polki diamonds",
    "creating a regal and timeless aesthetic."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (వివాహాలు)",
    "receptions",
    "Seemantham (సీమంతం)",
    "and other important celebrations. Also suitable for adding a touch of royal elegance to formal events."
  ],
  "description": "This Rajadhani Diamond Haaram is a true heirloom piece, blending traditional South Indian design with the timeless allure of Polki diamonds. The intricate craftsmanship, combined with the high purity of the gold and the quality of the diamonds, makes it a valuable investment and a statement of refined taste. The Hyderabadi polish enhances the luster and longevity of the gold, ensuring this piece remains a cherished possession for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki",
    "Diamond",
    "Uncut Diamonds",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Telugu Jewelry",
    "Kanthaharam",
    "పోల్కీ",
    "కంఠహారం",
    "వజ్రాలు",
    "వివాహాలు",
    "సీమంతం"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0020_0428",
  "collection": "diamond"
}