{
  "id": "necklaces-949",
  "title": "Divyam Diamond Jadau Haaram with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Adorned with brilliant-cut diamonds of VS clarity and G color. Features ethically sourced Emeralds and Rubies."
  ],
  "features": "This stunning Haaram showcases intricate Jadau craftsmanship, a hallmark of Hyderabadi jewelry. The undulating design of the necklace is set with dazzling diamonds. The central pendants feature a floral motif, meticulously crafted with Polki diamonds, emeralds, and rubies. Delicate gold bead drops (Gutti Pusalu inspired) enhance the overall opulence.",
  "colors": [
    "Predominantly gold with sparkling white diamonds",
    "complemented by the rich green of the emeralds and the vibrant red of the rubies – a traditionally auspicious color palette."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaham)",
    "receptions",
    "Seemantham ceremonies",
    "and other significant cultural events. Can also be styled for modern",
    "high-end parties seeking a touch of traditional elegance."
  ],
  "description": "Exquisite Hyderabadi Jadau craftsmanship ensures exceptional quality and lasting beauty. The use of high-quality diamonds, emeralds, and rubies elevates its value. This Haaram is a timeless heirloom, embodying the rich cultural heritage of South India while appealing to contemporary sensibilities. It’s a statement piece that radiates sophistication and traditional grace.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jadau",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "Gutti Pusalu",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Vivaham",
    "Seemantham",
    "Ethnic Jewelry",
    "Polki Diamonds"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0343_2410",
  "collection": "necklace"
}