{
  "id": "waistbands-002",
  "title": "Mayura Vaddanam: Exquisite Peacock Design Gold Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Yellow Gold",
    "meticulously handcrafted using traditional Telugu goldsmithing techniques. The piece features an exquisite Hyderabadi polish",
    "enhancing the gold's natural luster and depth."
  ],
  "features": "This Vaddanam features intricate filigree work and a prominent peacock (Mayura) motif, symbolizing grace, beauty, and royalty. The piece showcases traditional nakshi work, depicting floral and paisley patterns with exceptional detail. The adjustable design ensures a comfortable and secure fit. The bottom edge is adorned with small golden droplet-shaped danglers which contribute to the Vaddanam's regal appearance.",
  "colors": [
    "Lustrous Yellow Gold",
    "reflecting the rich heritage of South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "bridal wear",
    "traditional ceremonies (Pelli)",
    "Seemantham",
    "and special occasions where a touch of timeless elegance is desired. This piece also complements modern ethnic wear for upscale events."
  ],
  "description": "This Vaddanam is a masterpiece of South Indian craftsmanship, embodying cultural heritage and timeless beauty. The intricate details and superior gold quality make it a valuable heirloom piece, passed down through generations. Its design resonates with traditional symbolism, making it auspicious for significant life events.",
  "tags": [
    "Vaddanam",
    "Oddanam",
    "Waist Belt",
    "Gold Jewelry",
    "22K Gold",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Mayura",
    "Peacock Design",
    "Filigree",
    "Nakshi Work",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Pelli",
    "Seemantham",
    "Vivaham"
  ],
  "original_id": "choker_diamonds_open-close_WhatsApp Image 2024-09-04 at 22.05.59_80b731fb_0066",
  "collection": "choker"
}