{
  "id": "necklaces-1068",
  "title": "Enchanting Ruby and Diamond Nakshi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold Standard) with Hyderabadi Polish",
    "Faceted Ruby",
    "brilliant cut Diamonds (VS Clarity",
    "G Color). Metal contains rose gold elements."
  ],
  "features": "This exquisite haaram showcases a modern geometric interpretation of traditional South Indian jewelry. The necklace features a series of interlocked geometric shapes, each encrusted with brilliant cut diamonds surrounding a triangle cut center. The pendant boasts a large, carved ruby gemstone, adorned with a halo of pave diamonds. The ruby is carved with a floral pattern, a testament to the rich artistic heritage of the region.",
  "colors": [
    "Rose gold",
    "Ruby Red",
    "and sparkling white Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagements",
    "receptions",
    "festive occasions like Diwali and Sankranthi",
    "and high-end social gatherings. Also suitable for Seemantham and half-saree functions",
    "particularly for the modern bride."
  ],
  "description": "This piece seamlessly blends traditional craftsmanship with modern design sensibilities. The exceptional brilliance of the diamonds, combined with the rich hue of the ruby, creates a captivating contrast. The intricate craftsmanship, including the pave diamond setting and detailed ruby carving, ensures this necklace is a timeless heirloom piece, passed down through generations. A true statement piece that is both elegant and eye-catching.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Ruby",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Engagement Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Pave Setting",
    "Heirlooms",
    "Statement Necklace",
    "Guttapusalu",
    "Addigai"
  ],
  "original_id": "radhe_diam_DPNK8-1577_2481",
  "collection": "radhe"
}