{
  "id": "necklaces-076",
  "title": "Emerald Polki Jadau Choker - 'Pachala Vaddanam'",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Pachala Bangaram) with Hyderabadi Polish",
    "Natural Polki Diamonds (Uncut Diamonds)",
    "Oval Cabochon Emerald Center Stone",
    "Freshwater Pearls",
    "Emerald Beads."
  ],
  "features": "Exquisite Jadau setting showcasing the brilliance of uncut Polki diamonds, meticulously handcrafted with traditional 'nakshi' work detailing. The central emerald is surrounded by a halo of polki diamonds, forming an intricate floral motif. Features a multi-strand necklace of emerald beads interspersed with lustrous freshwater pearls. Finished with delicate pearl drops (Gundlu) along the bottom edge.",
  "colors": [
    "Predominantly green (emerald)",
    "white (pearls and diamonds)",
    "and golden yellow (gold). The contrast between the rich emeralds and the sparkling diamonds creates a visually stunning effect."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli)",
    "traditional ceremonies (Pujas)",
    "festive occasions like Diwali and Sankranti",
    "Seemantham",
    "and other special celebrations where a touch of regal elegance is desired."
  ],
  "description": "This handcrafted Jadau Choker represents the pinnacle of South Indian jewelry craftsmanship. The use of natural polki diamonds and a stunning emerald centerpiece ensures that this piece is a unique heirloom that will be cherished for generations. The combination of traditional techniques and modern design makes it a versatile piece that can be worn with both traditional and contemporary outfits. The Hyderabadi polish enhances the gold's luster, adding to its overall allure.",
  "tags": [
    "Jadau",
    "Polki",
    "Choker",
    "Necklace",
    "Haaram",
    "Vaddanam",
    "Emerald",
    "Pachala",
    "Pearls",
    "Gundlu",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Uncut Diamonds"
  ],
  "original_id": "diamond_jewellery_DPCK8-213_0235",
  "collection": "diamond"
}