{
  "id": "necklaces-631",
  "title": "Exquisite Ruby & Diamond Nakshi Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Fine Quality Diamonds (VVS Clarity",
    "G Color)",
    "Natural Ruby (Pear Cut)",
    "Natural Emeralds (Round Cut)",
    "Pink Tourmaline Beads. Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This haaram showcases intricate Nakshi work, a traditional South Indian technique known for its detailed carving and embossing. The central pendant features a striking pear-shaped ruby, surrounded by vibrant emeralds. The necklace is adorned with delicate diamond-studded floral motifs, culminating in elegant pink tourmaline bead drops. The piece is meticulously crafted with a focus on symmetry and balance, ensuring a comfortable and graceful fit.",
  "colors": [
    "Primary: Gold",
    "White (Diamonds)",
    "Ruby Red",
    "Emerald Green",
    "Pink (Tourmaline). Secondary: Hints of antique gold finish in the Nakshi work."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "receptions",
    "engagements",
    "bridal showers",
    "and other grand celebrations. Also suitable for festive occasions such as Diwali",
    "Ugadi",
    "and Sankranti. Makes a statement at upscale parties and social gatherings."
  ],
  "description": "This haaram is a testament to the rich heritage of South Indian jewelry making. The intricate Nakshi work and the use of high-quality gemstones make it a truly exceptional piece. It's a valuable investment that will be cherished for generations. The blend of traditional and modern design elements ensures that it complements both traditional and contemporary attire. The ruby symbolizes love and passion, making it an ideal gift for a loved one.",
  "tags": [
    "Haaram",
    "Necklace",
    "Nakshi",
    "Diamond Jewelry",
    "Ruby Jewelry",
    "Emerald Jewelry",
    "Tourmaline",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Festive Jewelry",
    "Indian Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Vaddanam",
    "Kasulaperu",
    "Guttapusalu",
    "Muhurtham",
    "Vivaha Mahotsavam"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-07_1137",
  "collection": "diamond"
}