{
  "id": "necklaces-794",
  "title": "Exquisite Peacock Motif Diamond Choker - A Modern Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity Gold (GH Quality)",
    "featuring meticulously set brilliant-cut Diamonds and a vibrant Rubellite center stone. Accented with mixed gemstones. Finished with a lustrous Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This unique choker showcases an asymmetrical design with a delicate floral motif on one side and a majestic peacock motif on the other. The peacock is embellished with intricately placed Rubellite, diamonds and mixed gemstones to enhance its vibrant colours. The floral motif shows a combination of different gold tone metals. The design blends traditional South Indian artistry with a modern choker silhouette.",
  "colors": [
    "Predominantly gold with dazzling white diamonds. Accented with shades of Rubellite",
    "white",
    "brown and yellow gemstones to accentuate the peacock's feathers. The gold has a warm",
    "inviting tone enhanced by the Hyderabadi Polish."
  ],
  "occasions": [
    "Perfect for modern brides",
    "receptions",
    "anniversary celebrations",
    "and high-end parties. Adds a touch of sophisticated elegance to any contemporary or semi-traditional outfit. Can also be worn for special family functions to signify tradition with a modern twist."
  ],
  "description": "A stunning blend of contemporary design and traditional South Indian motifs. The unique asymmetrical design and vibrant gemstone accents make this choker a true statement piece. Crafted with the highest quality materials and impeccable craftsmanship, it’s a valuable addition to any fine jewelry collection and a true heirloom piece.",
  "tags": [
    "Necklace",
    "Choker",
    "Haaram",
    "Diamond Jewelry",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Peacock Motif",
    "Rubellite",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Temple Jewelry",
    "Designer Jewelry",
    "Asymmetrical Jewellery",
    "Floral Motif"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-33 2_1362",
  "collection": "diamond"
}