{
  "id": "necklaces-1013",
  "title": "Divine Ruby & Diamond Bridal Haaram - Devatha Deepthi Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold",
    "adorned with meticulously set Brilliant-cut Diamonds (VVS Clarity",
    "E-F Color). Features a central Ruby (approx. 2 carats) with excellent color saturation and luster",
    "further enhanced with lustrous South Sea Pearls. Features a premium Hyderabadi Polish."
  ],
  "features": "Exquisite floral and paisley-inspired design, a timeless motif cherished in South Indian heritage. The necklace showcases intricate openwork with brilliant diamonds in a pave setting. The centerpiece includes a radiant ruby surrounded by floral arrangements. Dangles of South Sea Pearls add to its ethereal beauty. The overall design embodies the 'Addigai' style with modern sensibilities.",
  "colors": [
    "Primarily Yellow Gold with dazzling White Diamonds",
    "complemented by the intense Red of the Ruby and the iridescent White of the South Sea Pearls."
  ],
  "occasions": [
    "Perfect for bridal wear (Muhurtham)",
    "engagements",
    "reception",
    "and grand celebrations. An ideal heirloom piece for Seemantham or any traditional Telugu ceremony."
  ],
  "description": "This Haaram is more than just jewelry; it is an investment in artistry and heritage. The exceptional craftsmanship, combined with the brilliance of diamonds and the captivating ruby, makes it a true statement piece. The use of South Sea Pearls adds an element of sophistication and grace, elevating the design. Experience the luxury of owning a piece that blends tradition with timeless elegance, making it a treasured family heirloom for generations to come. A perfect embodiment of 'Lakshmi Kasula Haaram' essence, radiating prosperity and grace.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Ruby Necklace",
    "Pearl Necklace",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Engagement Jewelry",
    "Muhurtham Jewelry",
    "Kanthaabharanam",
    "Addigai",
    "South Sea Pearls",
    "Diamond Haaram"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0472_2334",
  "collection": "necklace"
}