{
  "id": "necklaces-743",
  "title": "Vaishnavi Emerald & Diamond Long Haaram - A Regal Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము) with Hyderabadi Polish",
    "featuring brilliant-cut Diamonds and Emeralds (పచ్చ). Diamonds are VS clarity and G color. Gold weight is approximately 80 grams."
  ],
  "features": "Intricate design with peacock motifs, a symbol of beauty and prosperity. The central pendant showcases a traditional Indian design with a central Emerald surrounded by pave-set diamonds. The long chain features a recurring diamond and emerald pattern. Features elements of Nakshi work throughout, showcasing a rich heritage.",
  "colors": [
    "Primarily gold and diamond white",
    "accentuated by the rich green hue of the Emeralds. The warm gold tones complement the cool vibrancy of the Emeralds",
    "creating a classic and elegant South Indian color palette."
  ],
  "occasions": [
    "Perfect for traditional South Indian weddings (పెళ్ళి)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham (శీమంతం)",
    "and other auspicious occasions. Also suitable for high-end galas and formal events where you want to make a statement."
  ],
  "description": "A timeless piece of South Indian heritage, crafted with exceptional skill and the highest quality materials. The long Haaram design is a symbol of tradition and elegance. The Emeralds are carefully selected for their vibrant color and brilliance. The Hyderabadi polish ensures a long-lasting, radiant shine. This piece is an investment in beauty and cultural value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Emerald",
    "Diamond",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Peacock Motif",
    "Nakshi Work",
    "Kanthabaranam",
    "పచ్చ",
    "సువర్ణము",
    "కంఠాభరణం",
    "పెళ్ళి",
    "నిశ్చితార్థం",
    "శీమంతం"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-36_1249",
  "collection": "diamond"
}