{
  "id": "necklaces-439",
  "title": "Emerald & Diamond Floral Motif Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (5.28 carats)",
    "Natural Rubies (3.33 carats)",
    "Emeralds (2.19 carats)",
    "South Sea Pearls (40.10 carats). Features a Hyderabadi polish for a lasting luster."
  ],
  "features": "Exquisite floral motif design with a delicate network of diamonds surrounding vibrant emeralds. The Haaram features a detachable pendant for versatile styling. Accented with lustrous South Sea pearl drops, showcasing a harmonious blend of traditional and contemporary aesthetics. Intricate filigree work enhances the richness and depth of the design.",
  "colors": [
    "Yellow Gold",
    "Green (Emerald)",
    "Red (Ruby)",
    "White (Diamonds)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (పెళ్లి)",
    "receptions",
    "engagements (నిశ్చితార్థం)",
    "festivals (పండుగలు)",
    "and grand celebrations. Also suitable for modern formal events where a touch of traditional elegance is desired."
  ],
  "description": "A statement piece embodying timeless beauty and sophistication. The combination of emeralds, diamonds, and pearls exudes luxury and elegance, making it a cherished heirloom for generations. The detachable pendant offers versatility in styling, allowing it to be worn as a standalone piece. Meticulously crafted with traditional South Indian techniques and high-quality materials.",
  "tags": [
    "Haaram",
    "Haram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Festive Jewelry",
    "కంఠాభరణం",
    "Mutyala Haram",
    "Paccha Haram",
    "Vaddanam"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-44_0902",
  "collection": "diamond"
}