{
  "id": "necklaces-896",
  "title": "Lakshmi Kasula Mala - Auspicious Gold and Kundan Long Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Kundan Stones",
    "Emeralds",
    "Ruby. Traditional Hyderabadi Polish for an enduring",
    "radiant finish."
  ],
  "features": "Exquisite Kasula Haaram design featuring intricately crafted gold coins (Kasulu) linked together with a delicate latticework. The centerpiece is a grand Lakshmi pendant, meticulously embellished with Kundan stones and flanked by peacocks. The necklace also features temple design elements, adding a touch of divinity and heritage.",
  "colors": [
    "Predominantly gold with vibrant accents of emerald green",
    "ruby red",
    "and sparkling white Kundan. This color palette embodies traditional South Indian jewelry aesthetics."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagement ceremonies",
    "traditional festivals (like Sankranthi and Ugadi)",
    "baby showers (Seemantham)",
    "half-saree functions",
    "and grand celebrations. Also suitable for formal events where a touch of cultural elegance is desired."
  ],
  "description": "This Lakshmi Kasula Mala is a timeless heirloom piece, embodying prosperity and blessings. The use of 22K gold ensures lasting value and brilliance. The Hyderabadi polish enhances the gold's natural luster, making it a captivating statement piece. The combination of traditional craftsmanship and high-quality materials makes it a durable and treasured possession.",
  "tags": [
    "Kasula Haaram",
    "Lakshmi Pendant",
    "Kundan Jewelry",
    "Gold Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Muhurtham Jewelry",
    "Haaram",
    "Kasulu",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Ethnic Jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0288_2357",
  "collection": "necklace"
}