{
  "id": "necklaces-362",
  "title": "Enchanting Emerald and Pearl Haram Set: A Touch of Traditional Elegance",
  "category": "necklaces",
  "original_type": "Necklace and Earrings",
  "materials": [
    "22K Gold",
    "High-Quality Emeralds (Round Cut)",
    "Cultured Pearls",
    "Cubic Zirconia. Gold is crafted with a lustrous Hyderabadi Polish for enduring shine."
  ],
  "features": "This exquisite necklace features a delicate, modern Haaram design with alternating Emerald and CZ-studded floral motifs. Lustrous pearls are suspended from each motif, adding a touch of classic charm. The matching Jhumka studs echo the necklace's design, completing the set with understated elegance. The intricate setting showcases meticulous craftsmanship.",
  "colors": [
    "Rich gold",
    "vibrant emerald green",
    "and pristine white pearls create a captivating and harmonious color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "engagement ceremonies",
    "festivals (Ugadi",
    "Sankranthi)",
    "and contemporary celebrations. Its versatility makes it a stunning addition to any special occasion attire."
  ],
  "description": "This Haaram set seamlessly blends traditional South Indian aesthetics with modern design sensibilities. The high-quality emeralds and pearls exude sophistication, while the durable gold setting ensures lasting beauty. It's a timeless investment piece that can be treasured for generations. Symbolizes prosperity, purity, and enduring love.",
  "tags": [
    "Haaram",
    "Necklace",
    "Earrings",
    "Jhumka",
    "Emerald",
    "Pearls",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Traditional Jewelry",
    "Contemporary Design",
    "CZ",
    "Vivaham",
    "Ugadi",
    "Sankranthi"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0476_0658",
  "collection": "diamond"
}