{
  "id": "necklaces-448",
  "title": "Enticing Diamond & Emerald Haar with South Sea Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Gold",
    "adorned with 2.45ct Ruby (2 pieces)",
    "1.53ct Emerald (2 pieces)",
    "and 22.85ct South Sea Pearls (12 pieces). Locket weight:1.45ct with 9.85ct of 5 pearl beads. Exquisite Hyderabadi polish for a lasting lustre. Diamond weight is 6.91ct."
  ],
  "features": "This captivating Haaram features an intricate Nakshi design with floral motifs, meticulously set with sparkling diamonds. The pendant showcases a vibrant emerald at its core, gracefully complemented by dangling South Sea pearls, creating a mesmerizing cascade. The design incorporates traditional South Indian craftsmanship with a modern aesthetic.",
  "colors": [
    "The warm yellow gold beautifully contrasts with the verdant green of the emeralds",
    "the fiery red of the rubies",
    "and the lustrous white of the pearls",
    "creating a rich and harmonious color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand festive celebrations. This Haaram is a treasured addition to any bridal trousseau (pellikuturu)",
    "suitable for muhurtham",
    "seemantham",
    "or a sophisticated evening gala."
  ],
  "description": "This exquisite necklace embodies the essence of South Indian heritage with a contemporary twist. The combination of diamonds, emeralds, and pearls symbolizes prosperity and good fortune. The meticulous craftsmanship and timeless design make it a valuable heirloom piece to be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Pearl Necklace",
    "South Sea Pearls",
    "Nakshi Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Pellikuturu",
    "Traditional Jewelry",
    "Emerald",
    "Pearls",
    "Gold",
    "18K Gold",
    "Jewellery",
    "South Indian Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-47_0911",
  "collection": "diamond"
}