{
  "id": "earrings-112",
  "title": "Emerald Kundan Jhumka - పచ్చ కుందన్ జుంకాలు",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features a central Emerald gemstone (approx. 0.5 carats) of vivid green hue and brilliant-cut Cubic Zirconia (CZ) stones. High-quality gold ensures lasting shine and value."
  ],
  "features": "Traditional bell-shaped Jhumka design adorned with intricate filigree work and studded with shimmering CZ stones. The top features a floral motif with an emerald center. Delicate gold beads gracefully dangle from the bottom, adding a touch of playful elegance. Embodying the essence of South Indian craftsmanship with a touch of modern sparkle.",
  "colors": [
    "Dominant gold tone with vibrant green from the emerald and sparkling white from the CZ stones."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "festivals (like Sankranthi",
    "Ugadi",
    "Dussehra",
    "Diwali)",
    "and other special occasions. Also suitable for half-saree functions (Langa Voni function) and temple visits. Can add a touch of elegance to modern cocktail parties as well."
  ],
  "description": "This Emerald Kundan Jhumka perfectly marries traditional South Indian design with modern elegance. The use of high-quality 22K gold and vibrant emeralds ensures lasting value and a luxurious look. The intricate filigree work and delicate dangling beads showcase exceptional craftsmanship, making it a cherished heirloom piece. The Hyderabadi polish gives it a unique luster and traditional appeal.",
  "tags": [
    "Jhumka",
    "Jhumkas",
    "Earrings",
    "Gold Earrings",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Emerald",
    "Kundan",
    "CZ",
    "Chevi Duddulu",
    "చెవి దుద్దులు",
    "Jhumkalu",
    "జుంకాలు",
    "Hyderabadi Jewelry",
    "Indian Earrings",
    "Ethnic Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Pacha",
    "పచ్చ"
  ],
  "original_id": "diamond_jewellery_db87beaf-3a7c-4d43-8e50-e0e282aded37_0214",
  "collection": "diamond"
}