{
  "id": "necklaces-1444",
  "title": "Emerald & Diamond Floral Cascade Necklace - A Timeless Vaddanam Inspiration",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold (750 hallmark)",
    "Natural Diamonds (VS Clarity",
    "G Color)",
    "Zambian Emerald (Emerald Cut)",
    "Tanzanite Cabochons. Exquisite Hyderabadi Polish for a lasting luster."
  ],
  "features": "This necklace reimagines the traditional Vaddanam (waist belt) aesthetic into a stunning cascade necklace. Features a central, meticulously bezel-set Zambian Emerald, flanked by a floral motif crafted from round brilliant cut diamonds. Accents of vibrant Tanzanite cabochons add depth and character. The openwork design allows light to beautifully refract through each stone. Delicate diamond-studded paisley motifs dangle gracefully, creating a captivating cascade effect.",
  "colors": [
    "Vibrant Green (Emerald)",
    "Rich Blue-Violet (Tanzanite)",
    "Sparkling White (Diamonds)",
    "Warm Yellow Gold."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "high-profile events",
    "or as a cherished heirloom piece. Ideal for Sangeeth",
    "Cocktail Party",
    "or Anniversary celebrations."
  ],
  "description": "This exquisite necklace masterfully blends traditional South Indian design cues with contemporary sensibilities. The use of natural, high-quality gemstones ensures lasting brilliance and value. The delicate, handcrafted detailing showcases exceptional artistry. Its unique design makes it a versatile piece, suitable for both grand occasions and elegant evenings. A true statement of sophisticated style and timeless beauty.",
  "tags": [
    "Necklace",
    "Haaram",
    "Emerald",
    "Diamond",
    "Tanzanite",
    "Vaddanam",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "Indian Wedding",
    "Contemporary Haaram",
    "Aabharanam"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-47_2062",
  "collection": "sjpl"
}