{
  "id": "necklaces-697",
  "title": "Enchanting Kundan Peacock Haaram with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold plated base",
    "meticulously set with high-quality Kundan stones",
    "facet cut Emeralds",
    "purple colored precious stone",
    "and sparkling Cubic Zirconia (CZ). Crafted with a special Hyderabadi Polish for a lasting radiant finish."
  ],
  "features": "This exquisite Haaram features a captivating peacock motif on either side of the central floral design, symbolizing beauty and grace. The Kundan stones are intricately placed in a classic Pachi setting, highlighted by the vibrant green of the Emeralds. The central cluster boasts a prominent green emerald surrounded by purple stones, adding a touch of regal elegance. Delicate gold dangles enhance the overall design, creating a beautiful interplay of light and movement.",
  "colors": [
    "Primary colors include gold",
    "white (from the Kundan and CZ stones)",
    "vibrant green (Emeralds)",
    "and purple for the small accent stones",
    "creating a rich and captivating palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "receptions",
    "and festive celebrations. Its contemporary design also makes it suitable for upscale parties and formal events."
  ],
  "description": "This Kundan Peacock Haaram is a unique blend of traditional craftsmanship and contemporary design. The use of high-quality Kundan stones and the addition of Emerald accents elevate this piece, making it a valuable addition to any jewelry collection. The durable Hyderabadi Polish ensures lasting brilliance and enhances the overall value of this investment. A true statement piece that embodies elegance and sophistication.",
  "tags": [
    "Kundan Jewelry",
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Peacock Motif",
    "Emeralds",
    "Hyderabadi Jewelry",
    "Pachi Setting",
    "Ethnic Jewelry",
    "Bridal Jewelry",
    "Indian Jewelry",
    "Muhurtham",
    "Reception",
    "Gold Plated"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-53_1203",
  "collection": "diamond"
}