{
  "id": "earrings-037",
  "title": "Chandbali Earrings - Radiant Gold with Pearls and Precious Gemstones",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "embellished with brilliant-cut Diamonds (SI clarity)",
    "vibrant Emeralds (faceted cut)",
    "radiant Rubies",
    "and a lustrous South Sea Pearl. The gold features our signature Hyderabadi Polish for an enduring shine."
  ],
  "features": "These Chandbali earrings feature a traditional crescent moon shape, intricately crafted with filigree detailing and studded with sparkling diamonds. The earrings are suspended with delicate gold ghungroo-style beads. A pear shaped emerald sits at the top, followed by a South Sea Pearl dangling within the chandbali’s inner space. Two cabochon rubies and another emerald are placed at the base above the ghungroo. The intricate design is a testament to generations of South Indian craftsmanship.",
  "colors": [
    "Predominantly Gold with contrasting pops of Green (Emerald)",
    "Red (Ruby)",
    "White (Diamond)",
    "and a Creamy Golden hue (Pearl). This vibrant color palette represents prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for weddings (pendli)",
    "festivals (pandugalu)",
    "traditional celebrations",
    "or a special occasion where you want to make a statement. These earrings are also suitable for elegant evening events."
  ],
  "description": "These Chandbali earrings are a timeless piece of South Indian jewelry, combining traditional design with modern elegance. The use of high-quality gemstones and skilled craftsmanship ensures lasting beauty and value. The Hyderabadi polish gives it unique luster and feel. They are lightweight and comfortable to wear, making them a perfect heirloom piece for generations to come.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "22K Gold",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "South Sea Pearl",
    "Indian Jewelry",
    "Hyderabad Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Pendli",
    "Pandugalu",
    "Bridal Earrings"
  ],
  "original_id": "diamond_jewellery_47919a48-ab6f-4204-b3a1-ffc658eee89f_0113",
  "collection": "diamond"
}