{
  "id": "necklaces-973",
  "title": "Raaga Kundan Haaram: A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Kundan Setting",
    "Natural Ruby Cabochon",
    "Natural Emerald",
    "Brilliant-Cut Diamonds (VVS Clarity",
    "E-F Color). Hyderabadi Polish for a lasting luster."
  ],
  "features": "Exquisite Kundan setting meticulously handcrafted in a traditional oval motif pendant. The pendant features intricate floral patterns accentuated with sparkling diamonds. A central Ruby Cabochon adds a touch of regal elegance, while a single Emerald adorns the top. The necklace chain is beautifully crafted with diamond-studded links and finished with subtle gold bead drops, creating a graceful modern fusion.",
  "colors": [
    "Warm Gold",
    "Ruby Red",
    "Emerald Green",
    "and Dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Pendli)",
    "receptions",
    "engagements (Nischitartham)",
    "festive occasions (Sankranti",
    "Ugadi)",
    "or to add a touch of heritage to a contemporary outfit."
  ],
  "description": "This Raaga Kundan Haaram is a timeless investment, blending traditional South Indian craftsmanship with modern design sensibilities. The high-quality Kundan setting ensures lasting beauty, while the vibrant gemstones add a touch of regal sophistication. The exceptional clarity and cut of the diamonds guarantee unparalleled sparkle, making it a statement piece for any occasion. A true heirloom piece to be cherished for generations.",
  "tags": [
    "Kundan Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Diamond Necklace",
    "Ruby",
    "Emerald",
    "Pendli",
    "Nischitartham",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Gold Necklace",
    "Haaram"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0375_2434",
  "collection": "necklace"
}