{
  "id": "necklaces-705",
  "title": "Exquisite Emerald and Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Diamonds (VS Clarity",
    "Excellent Cut)",
    "Natural Emeralds (Deep Green Hue)",
    "Natural Amethyst. Features a fine Hyderabadi polish for a lasting shine."
  ],
  "features": "This Haaram showcases a regal design featuring a central Emerald centerpiece framed by intricate diamond settings. Accented with delicate Amethyst in a floral design along the necklace, and further embellished with emerald drops. The necklace blends traditional South Indian aesthetics with a modern, sophisticated style.",
  "colors": [
    "Predominantly gold with a vibrant contrast of deep green emeralds",
    "amethyst and sparkling white diamonds."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements",
    "receptions",
    "Seemantham (శ్రీమంతం)",
    "and other grand celebrations. Also suitable for high-profile social events and family gatherings where you want to make a statement."
  ],
  "description": "A stunning fusion of traditional South Indian artistry and contemporary design. The high-quality emeralds and diamonds guarantee lasting value and brilliance. This Haaram is a testament to the craftsmanship of Hyderabad's finest artisans, making it a cherished heirloom piece. A unique blend of gemstones creates a striking and unforgettable look. Its versatile design complements both traditional and modern attire.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "Engagement Jewelry",
    "పెళ్లి నగలు",
    "కంఠాభరణం",
    "పచ్చలు",
    "వజ్రాలు",
    "Seemantham",
    "SriMatam"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-56_1211",
  "collection": "diamond"
}