{
  "id": "earrings-286",
  "title": "Enchanting Gulabi Pushpa Jhumka: Diamond and Rose Quartz Floral Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K Rose Gold with White Diamond Pavé Setting and Rose Quartz center stones. Features Hyderabadi craftsmanship. Gold weight: 20.020(FG) grams."
  ],
  "features": "These exquisite earrings feature a delicate cascading floral design. Each bloom is intricately crafted with a pavé setting of sparkling white diamonds, lending a subtle shimmer to every petal. The design incorporates a central rose quartz gemstone, set as the heart of the flower. The jhumka's design evokes images of rose-filled gardens. The design uses rose gold with diamonds as an accent for the overall rose effect.",
  "colors": [
    "Rose Gold",
    "White Diamonds",
    "and delicate Pink Rose Quartz. A classic and modern color palette."
  ],
  "occasions": [
    "Perfect for modern celebrations",
    "cocktail parties",
    "receptions",
    "weddings",
    "or any special occasion where you desire a touch of floral elegance. These also make excellent gifts for anniversaries and birthdays."
  ],
  "description": "These earrings represent a fusion of classic jhumka sensibilities with a modern floral design. The rose quartz provides a soft, feminine touch, while the brilliant diamonds provide a timeless sparkle. Expertly crafted, these earrings are a statement of elegance and enduring style, making them a treasured addition to any jewelry collection. The use of rose gold will ensure that the jewelry will go well with any skin tone.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Bugada",
    "Rose Gold",
    "Diamonds",
    "Rose Quartz",
    "Floral Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Cocktail Jewelry",
    "Party Jewelry",
    "Hyderabadi Jewelry",
    "Gift for Her",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-30-49 2_0959",
  "collection": "diamond"
}