{
  "id": "earrings-499",
  "title": "Enchanting Emerald Polki Jhumki: Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (సువర్ణం)",
    "Uncut Polki Diamonds (పొల్కి వజ్రాలు)",
    "Natural Emerald (పచ్చ). Hyderabadi Polish finish for lasting luster. The gold has been hallmarked for authenticity."
  ],
  "features": "Classic Jhumka design with a central oval-cut emerald embraced by a floral halo of Polki diamonds. Geometric Polki diamond shapes form the upper part of the earring, leading to the embellished Emerald centre. The Polki diamonds are set in a traditional Kundan style, highlighting the natural beauty of each uncut stone. The meticulous craftsmanship reflects the rich heritage of Hyderabadi jewelry making.",
  "colors": [
    "Rich gold setting",
    "vibrant green Emerald center",
    "and sparkling white Polki diamonds create a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "festivals (పండుగలు)",
    "and special occasions like engagements (నిశ్చితార్థం) and anniversaries. Adds a touch of traditional glamour to any outfit",
    "from sarees ( చీర) to lehengas (లహెంగా)."
  ],
  "description": "This Jhumki is a masterpiece of traditional craftsmanship, showcasing the timeless beauty of Polki diamonds and emeralds. Each Polki diamond is unique, adding to the piece's charm and value. The Hyderabadi Polish ensures a long-lasting shine, making it a treasured heirloom for generations to come. A symbol of prosperity and good fortune, these earrings are an investment in both beauty and heritage.",
  "tags": [
    "Polki Jhumka",
    "Emerald Earrings",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Earrings",
    "చెవి దుద్దులు",
    "పొల్కి వజ్రాలు",
    "పచ్చ",
    "వివాహం",
    "పండుగలు",
    "నిశ్చితార్థం",
    "చీర",
    "లహెంగా",
    "Jhumki",
    "Emerald",
    "Gold",
    "Diamonds",
    "Indian Jewellery",
    "Earrings",
    "Temple Jewellery"
  ],
  "original_id": "ear_rings_DPER8-1611_2626",
  "collection": "ear"
}