{
  "id": "necklaces-440",
  "title": "Emerald and Diamond Peacock Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in gleaming 22K Gold",
    "this exquisite Haaram features dazzling brilliant-cut Diamonds (5.53 carats)",
    "two vibrant oval-cut Rubies (7.23 carats)",
    "two captivating oval-cut Emeralds (5.38 carats) and fourteen lustrous South Sea Pearls (16.40 carats). The gold boasts a rich Hyderabadi Polish for enhanced luster and longevity."
  ],
  "features": "This Haaram showcases a classic peacock design, a symbol of beauty and prosperity in South Indian culture. The central pendant features a larger emerald, surrounded by intricate diamond detailing. Delicate pearl drops add a touch of grace and sophistication. The necklace employs a 'kundan' like stone setting to enhance gem brilliance. The total Gross Weight of this necklace is 63.850 grams.",
  "colors": [
    "The color palette is a harmonious blend of rich gold",
    "fiery red from the rubies",
    "deep green from the emeralds",
    "and the soft",
    "creamy white of the South Sea Pearls. This traditional combination is revered for its auspiciousness."
  ],
  "occasions": [
    "Perfect for grand celebrations such as weddings (Vivaham)",
    "engagements (Nischitartham)",
    "Seemantham (baby shower)",
    "or any special occasion where you want to make a statement. It’s also ideal for cultural events and festivals."
  ],
  "description": "This Haaram is more than just jewelry; it's a piece of heritage. It's handcrafted by skilled artisans in Hyderabad, known for their expertise in creating exquisite South Indian jewelry. The peacock design represents grace and royalty, making it a truly unique and valuable investment. Its timeless design ensures that it will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emerald",
    "Diamond",
    "Pearl",
    "Gold",
    "22K Gold",
    "Hyderabad Jewelry",
    "Vivaham",
    "Nischitartham",
    "Seemantham",
    "Traditional Jewelry",
    "Indian Wedding",
    "Peacock Design",
    "Nakshi Work",
    "kasulaperu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-45 2_0903",
  "collection": "diamond"
}