{
  "id": "necklaces-171",
  "title": "The 'Chandini' Polki and Emerald Collar Necklace - An Timeless Heritage Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Antique Polish",
    "Uncut Polki Diamonds",
    "Faceted Zambian Emeralds (Vivid Green)",
    "Freshwater Pearls."
  ],
  "features": "Exquisite Chand-bali inspired design, featuring a wide collar embellished with intricate floral polki settings. Vivid green Zambian Emeralds are carefully placed throughout for a regal contrast. The centerpiece pendant showcases a floral design in polki, mirroring the necklace's pattern. Delicate pearl and emerald bead drops adorn the necklace's hem, adding graceful movement. Expert 'Ghatai' work is visible in the setting of the polkis, which creates a seamless and antique look.",
  "colors": [
    "Antique Gold",
    "Sparkling White (Polki Diamonds)",
    "Deep Emerald Green",
    "Lustrous White (Freshwater Pearls)"
  ],
  "occasions": [
    "Ideal for Bridal Wear (Muhurtham",
    "Reception)",
    "Seemantham",
    "Wedding Anniversaries",
    "High-Profile Social Gatherings",
    "and other grand occasions. A statement piece perfect for Half-Saree function",
    "too."
  ],
  "description": "This necklace blends the timeless elegance of polki diamonds with the captivating allure of Zambian emeralds and freshwater pearls. The antique Hyderabadi polish gives it a rich, heirloom quality. Meticulously handcrafted, each stone is carefully placed, promising exceptional durability and lasting beauty. The 'Chandini' necklace is not just jewelry; it's an investment in a cherished family heirloom, a testament to South Indian artistry and a symbol of eternal grace.",
  "tags": [
    "Polki Necklace",
    "Haaram",
    "Emerald Necklace",
    "Zambian Emerald",
    "Bridal Jewelry",
    "Antique Jewelry",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Chandbali Necklace",
    "Uncut Diamond",
    "Pearls",
    "Moghal Inspired Jewellery",
    "Wedding Jewellery",
    "muhurtham",
    "seemantham",
    "vaddanam",
    "kempu stones"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0010_0419",
  "collection": "diamond"
}