{
  "id": "necklaces-087",
  "title": "Heera & Manikyam Pendant: The Lakshmi's Grace Amulet",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold",
    "Natural Ruby (Manikyam) of approximately 5 carats",
    "Polki Diamonds (Heera) with a carat weight around 1.5",
    "Seed Pearls. Crafted with traditional Hyderabadi Polish for a rich",
    "antique luster."
  ],
  "features": "This exquisitely designed pendant features a central, cabochon-cut ruby surrounded by concentric rows of shimmering Polki diamonds. Three smaller Polki-encrusted pendants, each suspending a cluster of ruby beads and seed pearls, add a touch of ethereal charm. The intricate goldwork showcases traditional South Indian filigree detailing, reminiscent of temple art (devasthana abharanam).",
  "colors": [
    "Predominantly ruby red and gold",
    "complemented by the bright sparkle of the Polki diamonds and the delicate white of the seed pearls. The Hyderabadi polish gives the gold a warm",
    "aged tone."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "or any special occasion where you want to make a statement. Suitable for traditional ceremonies like muhurtham",
    "seemantham",
    "or half-saree function (Langa Voni function). Also appropriate for upscale social gatherings and cultural events."
  ],
  "description": "This pendant is a blend of tradition and elegance. The natural ruby is believed to bring prosperity and good fortune, making it an auspicious choice. The unique Hyderabadi polish gives it a timeless appeal. Polki diamonds (uncut diamonds) showcase their natural brilliance with their unique sparkle. This is a piece that will be treasured for generations.",
  "tags": [
    "Pendant",
    "Locket",
    "Ruby",
    "Manikyam",
    "Polki Diamond",
    "Heera",
    "Seed Pearl",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Heirloom",
    "Devotional",
    "antique finish",
    "filigree work",
    "uncut diamonds"
  ],
  "original_id": "diamond_jewellery_DPER8-1657_0297",
  "collection": "diamond"
}