{
  "id": "necklaces-756",
  "title": "Apsara Kundan Haaram with Emerald Accents - COHar00035",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base Metal: Gold Plated. Stones: High-quality Kundan stones with Emerald accents. The gold plating features a lustrous Hyderabadi polish for enhanced radiance and longevity."
  ],
  "features": "This exquisite Haaram showcases the timeless beauty of Kundan craftsmanship, meticulously hand-set by skilled artisans. Features traditional South Indian peacock (Mayura) motifs symbolizing grace and prosperity. The necklace boasts intricate detailing with floral patterns and is adorned with delicate golden ghungroo dangles (గుళ్ళు) for added charm.",
  "colors": [
    "Primarily gold with sparkling white Kundan stones. Emeralds provide a contrasting pop of green",
    "a traditionally auspicious color combination."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements (నిశ్చితార్థం)",
    "festive occasions (పండుగలు)",
    "and traditional South Indian celebrations like Seemantham (శీమంతం) and Half-Saree Function (లంగా ఓణి ఫంక్షన్). Also a stunning statement piece for formal events."
  ],
  "description": "This Kundan Haaram is a true masterpiece, blending traditional craftsmanship with modern sensibilities. The exquisite design, combined with the use of high-quality materials, ensures both timeless beauty and enduring value. It's a statement piece that reflects your refined taste and appreciation for South Indian heritage. Each Kundan is expertly set to maximize its brilliance, and the Emerald accents add a touch of sophistication and elegance. A timeless investment to be cherished for generations.",
  "tags": [
    "Haaram",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Emerald Necklace",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Peacock Motif",
    "Mayura Design",
    "కంఠాభరణం",
    "పెళ్ళి నగలు",
    "పండుగ నగలు",
    "Emerald"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-41 2_1262",
  "collection": "diamond"
}