{
  "id": "necklaces-1477",
  "title": "Emerald Radiance Nakshi Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "AAA Grade Emeralds (Oval Cut",
    "Vivid Green",
    "High Clarity)",
    "Cubic Zirconia (CZ) Diamonds"
  ],
  "features": "This exquisite Haaram features a contemporary design inspired by traditional South Indian artistry. The centerpiece showcases oval-cut emeralds, meticulously framed by dazzling CZ diamonds in a pave setting. Delicate golden bead dangles add a touch of traditional elegance. The Haaram incorporates intricate filigree work, reminiscent of traditional nakshi craftsmanship, creating a visually stunning piece.",
  "colors": [
    "Gold",
    "Vivid Green (Emeralds)",
    "Brilliant White (CZ Diamonds)"
  ],
  "occasions": [
    "Ideal for weddings (vivaham)",
    "receptions",
    "festivals (Ugadi",
    "Diwali)",
    "and grand celebrations. A perfect statement piece for muhurtham",
    "seemantham",
    "or any special occasion where you want to exude elegance and grace."
  ],
  "description": "This Haaram is a harmonious blend of traditional South Indian design and modern aesthetics. The high-quality emeralds and CZ diamonds radiate brilliance, while the Hyderabadi polish on the gold ensures a lasting luster. The intricate craftsmanship and symbolic value make it a treasured heirloom to be passed down through generations. The combination of emeralds and gold is considered auspicious in South Indian culture, representing prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "CZ Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Filigree",
    "Nakshi",
    "Gold Jewelry",
    "22K Gold",
    "Haram",
    "Kasulaperu",
    "Addigai",
    "Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-41-00 2_2095",
  "collection": "sjpl"
}