{
  "id": "bangles-222",
  "title": "Sparkling Diamond Vanki Bangles - Wavy Lines of Brilliance",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "18K Yellow Gold",
    "Round Cut Diamonds (SI Clarity",
    "G Color). Crafted with a smooth Hyderabadi polish for a lasting shine. Guaranteed gold purity with hallmark certification."
  ],
  "features": "Featuring a unique wavy design, these bangles are set with meticulously placed round-cut diamonds along the undulating gold lines. The design offers a modern twist to traditional bangle styles, providing a comfortable and elegant fit. The setting is a secure prong setting, ensuring the diamonds remain safe and sparkle brilliantly.",
  "colors": [
    "Yellow Gold and White Diamonds. This classic combination offers a timeless and versatile appeal",
    "easily complementing various outfits."
  ],
  "occasions": [
    "Perfect for daily wear",
    "special occasions",
    "parties",
    "festive celebrations like Diwali and Sankranti",
    "and weddings. A sophisticated addition to both traditional attire like sarees and lehengas",
    "as well as contemporary outfits."
  ],
  "description": "These diamond vanki bangles combine modern design with exceptional craftsmanship. The wavy diamond setting creates a unique visual appeal, making them a statement piece. High-quality materials ensure lasting beauty and durability. The secure setting and comfortable fit make these bangles a practical and beautiful investment.",
  "tags": [
    "Bangles",
    "Kadiyalu",
    "Vanki",
    "Diamond Bangles",
    "Yellow Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Modern Bangle Design",
    "Party Wear",
    "Festive Jewelry",
    "Diwali Jewelry",
    "Wedding Jewelry",
    "Gift for Her",
    "వంకీ కడియాలు",
    "డైమండ్ కడియాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0141_0757",
  "collection": "diamond"
}