{
  "id": "necklaces-1553",
  "title": "Kundan Polki and Pearl Satlada Haaram - A Rainbow of Regal Splendor",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality alloy with meticulous Kundan Polki setting. Features a mesmerizing array of natural",
    "multicolored gemstones",
    "including sapphires",
    "emeralds",
    "rubies and others. Dazzling brilliant-cut diamonds accentuate the floral motifs. Adorned with 18 lustrous South Sea Pearls (Moti)",
    "each hand-selected for its unique iridescence. Finished with a durable gold plating."
  ],
  "features": "A breathtaking Satlada Haaram, traditionally known for its layered design, featuring intricately handcrafted floral and foliage motifs using Kundan Polki technique. Each Polki is carefully placed to maximize light reflection, creating a dazzling spectacle. The various gemstones are arranged in a harmonious color palette, creating a vibrant contrast against the antique pearl color. The design showcases a contemporary take on traditional Hyderabadi jewelry, blending classic elegance with modern sophistication. Note the unique design around each pearl adding to the overall beauty.",
  "colors": [
    "A vibrant spectrum of colors: rich reds",
    "vibrant greens",
    "deep blues",
    "and sunny yellows",
    "all complemented by the soft cream of the South Sea Pearls and the sparkle of the diamonds. The gold plating adds a warm",
    "luxurious glow."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaha Mahotsavam)",
    "receptions",
    "and milestone anniversaries. An exquisite piece for a bride (Vadhuvu) or to make a statement at any festive occasion (Pandaga). Also suitable for high-profile events and galas."
  ],
  "description": "This Satlada Haaram is a true work of art, combining traditional South Indian craftsmanship with contemporary design sensibilities. The use of high-quality natural gemstones and South Sea Pearls ensures lasting beauty and value. The intricate Kundan Polki setting showcases the skill and artistry of our master artisans. This piece is a timeless investment that will be treasured for generations, embodying the rich heritage of Hyderabad's jewelry tradition.",
  "tags": [
    "Haaram",
    "Satlada",
    "Kundan Polki",
    "South Sea Pearls",
    "Moti",
    "Necklace",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Traditional",
    "Hyderabadi Jewelry",
    "Gemstone Necklace",
    "Statement Necklace",
    "Vivaha Mahotsavam",
    "Vadhuvu",
    "Pandaga"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-31 2_2232",
  "collection": "sjpl"
}