{
  "id": "necklaces-1123",
  "title": "Emerald Kundan Grand Haaram with Ruby Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణం) with Hyderabadi Polish. Features high-quality Polki Diamonds",
    "Emeralds (పచ్చలు)",
    "and a Central Ruby (మాణిక్యం) of exceptional clarity. Diamond quality: VVS clarity",
    "G color."
  ],
  "features": "A breathtaking three-layered Haaram, meticulously handcrafted with intricate Kundan setting. The emeralds are square cut and set within the second layer, while the other two layers are adorned with brilliant Polki diamonds. A large, pear-shaped Ruby pendant adds a touch of regal charm. The pendant setting features intricate filigree work.",
  "colors": [
    "Primary colors are gold",
    "the vibrant green of the emeralds",
    "the fiery red of the ruby pendant and the bright white of the polki diamonds creating a rich",
    "opulent palette."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "bridal wear",
    "special celebrations like seemantham (శ్రీమంతం)",
    "half-saree function (లంగా ఓణి ఫంక్షన్)",
    "or any grand occasion where you want to make a statement."
  ],
  "description": "This Haaram is a testament to timeless South Indian craftsmanship. The combination of Polki diamonds, emeralds, and a vibrant Ruby pendant creates a piece that is both elegant and culturally significant. The Hyderabadi polish ensures a lasting shine and antique appeal. A true heirloom piece to be treasured for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan Jewelry",
    "Polki Diamonds",
    "Emeralds",
    "Ruby",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "కంఠాభరణం",
    "పొరల హారం",
    "సువర్ణం",
    "పచ్చలు",
    "మాణిక్యం",
    "Hyderabadi Jewelry",
    "Traditional Jewelry"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0019_2537",
  "collection": "radhe"
}