{
  "id": "necklaces-1133",
  "title": "The 'Chandrika' Polki Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Uncut Polki Diamonds (Rose Cut)",
    "Enamel Detailing. Features the renowned Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This exquisite Haaram features a classic alternating design of circular and triangular motifs, each encrusted with meticulously set Polki diamonds. The centerpiece is a statement-sized, rose-cut Polki diamond pendant, surrounded by a halo of smaller Polkis. The design subtly incorporates traditional Telugu 'Addigai' elements with a contemporary twist. The back of the pendant is closed and has floral enamel work.",
  "colors": [
    "Predominantly Gold and White (Diamond). Subtle hints of color in the enamel work."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "weddings (Muhurtham)",
    "receptions",
    "and other grand celebrations. Suitable for Seemantham",
    "Voni Function",
    "or any special occasion where you want to make a statement. Its timeless elegance also makes it suitable for modern formal events."
  ],
  "description": "Crafted with ethically sourced Polki diamonds and high-purity gold, this Haaram is an investment in both beauty and heritage. The Hyderabadi Polish ensures a long-lasting shine, while the unique design blends traditional South Indian aesthetics with contemporary sensibilities. The substantial size of the Polki diamonds adds to its grandeur, making it a true heirloom piece. Offers unmatched brilliance and a regal look, embodying the rich cultural heritage of Hyderabad.",
  "tags": [
    "Polki Diamond Necklace",
    "Haaram",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Diamond Haaram",
    "Rose Cut Diamonds",
    "Gold Necklace",
    "22K Gold",
    "Traditional Jewelry",
    "Hyderabad Polish",
    "Muhurtham Jewelry",
    "Addigai",
    "Indian Jewelry",
    "Fine Jewelry",
    "Heirloom Jewelry",
    "డైమండ్ హారము",
    "పెళ్లి నగలు",
    "బంగారు నగలు"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0032_2548",
  "collection": "radhe"
}