{
  "id": "necklaces-1277",
  "title": "Floral Diamond Vaddanam Pendant - A Contemporary Take on Tradition",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18K Yellow Gold",
    "Set with brilliant-cut diamonds. Diamonds of VS clarity and G-H color. Hyderabadi Polish ensuring long-lasting shine and brilliance."
  ],
  "features": "This pendant boasts a unique floral design with intricate diamond settings. The openwork design gives it a light and airy feel, perfect for the modern bride. The triple floral arrangement is reminiscent of traditional South Indian motifs while maintaining a contemporary aesthetic. The diamonds are meticulously set to maximize brilliance, creating a dazzling effect. Designed to be used as a detachable Vaddanam pendant or as a stylish necklace pendant.",
  "colors": [
    "Gold (Yellow)",
    "White (Diamonds)"
  ],
  "occasions": [
    "Suitable for weddings",
    "receptions",
    "sangeet ceremonies",
    "or any grand occasion. Its modern design also makes it perfect for upscale parties and events. A stunning piece for a Half-Saree function or a Seemantham ceremony",
    "adding a touch of contemporary flair to traditional attire."
  ],
  "description": "This pendant effortlessly blends traditional South Indian design with modern aesthetics, making it a versatile piece for any jewelry collection. The high-quality diamonds and expert craftsmanship ensure lasting brilliance and value. Its detachable design offers flexibility, allowing it to be worn as a vaddanam/Odyanam pendant or a striking necklace pendant. A statement piece that exudes sophistication and grace.",
  "tags": [
    "Vaddanam",
    "Odyanam",
    "Pendant",
    "Diamond Jewelry",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Floral Design",
    "Modern Jewelry",
    "Telugu Jewellery",
    "Traditional Jewellery",
    "Contemporary Jewellery",
    "VS Clarity Diamonds",
    "18K Gold"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-02 3_1874",
  "collection": "sjpl"
}