{
  "id": "necklaces-145",
  "title": "Elegant Ruby & Polki Pendant with Pearl Latkans - A Royal \"Addigai\" Inspired Piece",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (916 Gold)",
    "Rose Cut Polki Diamonds (Uncut Diamonds)",
    "Faceted Ruby",
    "Natural Freshwater Pearls. Hyderabadi Polish for lasting lustre."
  ],
  "features": "This pendant draws inspiration from the classic Addigai necklace design, featuring a central teardrop Ruby surrounded by intricate Polki diamond settings. The Polki diamonds are carefully placed in a traditional Kundan setting, allowing their natural brilliance to shine through. Delicate pearl latkans (pearl drops) add a touch of femininity and movement. The design has a floral-inspired motif for a regal look.",
  "colors": [
    "Gold (Yellow)",
    "Ruby (Deep Red)",
    "Polki Diamonds (Off-White/Champagne)",
    "Pearls (Creamy White)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaahaalu)",
    "receptions",
    "engagement ceremonies (Nischitartham)",
    "and festive occasions like Diwali or Sankranthi. Also suitable for upscale parties and formal events."
  ],
  "description": "This pendant is a unique blend of traditional South Indian aesthetics and modern jewelry design. The use of high-quality materials such as 22K gold, natural Polki diamonds, a striking Ruby and lustrous pearls ensures both lasting value and exquisite beauty. The Hyderabadi polish further enhances the gold's shine and provides superior durability. The pearl latkans lend an graceful charm.",
  "tags": [
    "Pendant",
    "Locket",
    "Polki",
    "Diamonds",
    "Ruby",
    "Pearls",
    "Gold",
    "Addigai",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Kundan",
    "Latkan",
    "Hyderabadi",
    "Bridal Jewellery",
    "Vivaahaalu",
    "Nischitartham",
    "Jewellery",
    "Fine Jewelry",
    "Handmade"
  ],
  "original_id": "diamond_jewellery_DPPD8-1540_0378",
  "collection": "diamond"
}