{
  "id": "necklaces-169",
  "title": "Maharani Kundan Choker - A Regal Adornment",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plated Base. Set with high-quality Kundan Polki diamonds and genuine Burmese Ruby droplets. Accented with freshwater pearls. Features a Hyderabadi Antique Polish for a vintage appeal."
  ],
  "features": "This exquisite choker showcases traditional Kundan setting techniques, with each Polki meticulously placed by skilled artisans. The graduated Ruby droplets add a touch of rich color and movement. The design features a central pear-shaped pendant, surrounded by intricate Polki work, inspired by Mughal artistry. The freshwater pearls lining the top edge provide a delicate contrast and enhance the regal look. The antique finish gives it a timeless charm, reminiscent of royal heirlooms.",
  "colors": [
    "Antique Gold",
    "Sparkling White (Polki Diamonds)",
    "Deep Red (Burmese Rubies)",
    "and Creamy White (Freshwater Pearls)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "and grand celebrations. Ideal for a bride's Muhurtham look or a special Seemantham ceremony. Also suitable for upscale events and formal gatherings."
  ],
  "description": "A testament to Hyderabad's rich jewelry heritage, this choker combines traditional techniques with exquisite materials. The Kundan setting ensures exceptional brilliance, while the Burmese Rubies add a touch of luxury and prosperity. Its durable construction guarantees longevity, making it a cherished piece for generations. It exudes elegance and cultural significance, making it a true statement piece.",
  "tags": [
    "Kundan",
    "Choker",
    "Necklace",
    "Polki",
    "Ruby",
    "Burmese Ruby",
    "Pearl",
    "Hyderabadi Jewelry",
    "Antique Finish",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Vivaaham",
    "Seemantham",
    "कंठाभरण",
    "Kanthabharanam"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0008_0417",
  "collection": "diamond"
}