{
  "id": "necklaces-489",
  "title": "Exquisite Emerald and Diamond Floral Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finely crafted with shimmering White Gold",
    "embellished with brilliant-cut Diamonds and vibrant",
    "pear-shaped Emeralds. The diamonds boast exceptional fire and clarity. Featuring natural Emeralds with deep color saturation. Hyderabadi polish for a lasting luster."
  ],
  "features": "This breathtaking necklace showcases an elaborate floral motif, meticulously crafted with dazzling diamonds. The design features stylized flowers and leaves set in a flowing arrangement. Exquisite detailing with pave-set diamonds enhancing the beauty of the emeralds. The central drop-shaped emeralds add a touch of regality and sophistication.",
  "colors": [
    "Emerald Green and Sparkling White (Diamonds). A classic and elegant combination."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "grand celebrations (like Sangeeth",
    "Muhurtham)",
    "or any special occasion where you want to make a statement. Equally stunning for upscale modern events."
  ],
  "description": "A true statement piece, this Emerald and Diamond Haaram is a timeless treasure. The meticulously crafted design, the brilliance of the diamonds, and the vibrant hue of the emeralds create a captivating allure. This necklace embodies elegance, sophistication, and enduring value, making it a prized addition to any jewelry collection. Its the perfect piece for any Bride and Bridesmaid.",
  "tags": [
    "Necklace",
    "Haaram",
    "Emerald",
    "Diamond",
    "White Gold",
    "Floral",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Statement Necklace",
    "Kanthi",
    "Hyderabadi Jewelry",
    "Luxury Jewelry",
    "Pachi work inspired",
    "Party wear."
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-45-09 2_0967",
  "collection": "diamond"
}