{
  "id": "earrings-648",
  "title": "Emerald Radiance Jhumka: The Perfect Blend of Tradition and Sparkle",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Faceted Emerald",
    "Cubic Zirconia (CZ)",
    "and Shell Pearls. Accented with real stones in the center",
    "these jhumkas shine with brilliance."
  ],
  "features": "Classic Jhumka design with an ornate top featuring a central Emerald and floral CZ surround. The bell-shaped Jhumka boasts intricate latticework and delicate pearl droplets (guttapusalu style variation) along the bottom edge. The design draws inspiration from traditional temple jewelry motifs with a modern, lighter aesthetic. This earring set has screw posts for extra security.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Brilliant White (CZ)",
    "and Creamy White (Pearls). This classic color palette is quintessentially South Indian."
  ],
  "occasions": [
    "Ideal for weddings ( పెళ్లి )",
    "receptions",
    "engagements",
    "festive occasions like Diwali or Sankranthi",
    "or any event where you want to make a statement of timeless elegance. Perfect for pairing with Kanjeevaram sarees",
    "lehengas",
    "or modern fusion outfits."
  ],
  "description": "These Jhumkas offer a modern take on a traditional South Indian design. The vibrant emerald and sparkling CZ provide a luxurious touch, while the Hyderabadi Polish ensures lasting shine. Lightweight and comfortable to wear, they are perfect for long events. The classic design ensures versatility, making them a valuable addition to any jewelry collection.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Gold Earrings",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Telugu Jewelry",
    "Chevi Duddulu",
    "పెళ్లి నగలు",
    "Fashion Earrings",
    "Statement Earrings",
    "Indian Wedding",
    "Gutapusalu"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 9_2225",
  "collection": "sjpl"
}