{
  "id": "necklaces-1514",
  "title": "Divine Peacock Emerald Haaram: A Timeless Telugu Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము) setting with Hyderabadi Polish. Features meticulously selected round-cut Emeralds (పచ్చ) of vibrant green color and high clarity",
    "interspersed with dazzling CZ stones. Ruby (కెంపు) accents add a touch of regal charm."
  ],
  "features": "This exquisite three-layered Haaram showcases a traditional South Indian design featuring intricate peacock motifs (నెమలి డిజైన్) embellished with CZ stones. The central pendant boasts a filigree-like structure, adorned with emerald drops that add graceful movement. The graduated layers create a visually stunning effect, making it a true statement piece. The Hyderabadi polish gives it a lustrous shine.",
  "colors": [
    "Primary colors are Gold (సువర్ణము)",
    "Emerald Green (పచ్చ ఆకుపచ్చ)",
    "Ruby Red (కెంపు ఎరుపు)",
    "and sparkling white (CZ stones). This classic combination is highly auspicious in South Indian tradition."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "engagements (నిశ్చితార్థం)",
    "festive occasions like Diwali (దీపావళి)",
    "and traditional Telugu ceremonies such as Seemantham (సీమంతం) or Half-Saree Function (బాలిక సారీ కార్యక్రమం). Also suitable for adding a touch of elegance to formal events."
  ],
  "description": "This Haaram embodies the rich cultural heritage of South Indian jewelry making. Its intricate design, combined with high-quality materials and expert craftsmanship, makes it a valuable investment. The peacock motif symbolizes beauty, royalty, and prosperity, making it a meaningful heirloom to pass down through generations. The brilliant CZ stones offer exceptional sparkle, while the emeralds provide a touch of natural elegance.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Emerald",
    "Ruby",
    "CZ stones",
    "22K Gold",
    "Hyderabadi Polish",
    "Peacock Design",
    "Kantabharanam",
    "Pachcha",
    "Kempu",
    "Vivaham",
    "Engagement",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Heirloom Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-39 3_2132",
  "collection": "sjpl"
}