{
  "id": "earrings-157",
  "title": "The 'Indrani' Ruby Drop Jhumka - A Touch of Telugu Heritage",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features a central pear-shaped Ruby with excellent clarity and deep red hue. Accented with Polki Diamonds showcasing a raw",
    "uncut brilliance."
  ],
  "features": "This exquisite earring embodies the essence of South Indian jewelry craftsmanship. The pear-shaped Ruby, reminiscent of a 'bindi' (forehead decoration), is surrounded by a halo of delicate Polki diamonds, enhancing its regal appeal. The intricate gold setting displays a level of detail only found in the finest Hyderabadi jewelry.",
  "colors": [
    "Deep Ruby Red and the warm",
    "lustrous yellow of 22K Gold. The Polki diamonds provide a subtle contrast with their natural",
    "icy white sparkle."
  ],
  "occasions": [
    "Ideal for weddings (Pendli)",
    "engagements",
    "milestone celebrations",
    "and formal events. This Jhumka adds a touch of tradition and sophistication to any outfit",
    "perfect for Seemantham",
    "half-saree functions",
    "or even a special date night."
  ],
  "description": "This earring is a beautiful blend of classic Telugu jewelry design and modern elegance. The rare Ruby gemstone, combined with the unmatched radiance of Polki Diamonds, makes it an heirloom piece to treasure for generations. The Hyderabadi polish ensures a long-lasting shine, reflecting the exceptional craftsmanship of our artisans. Own a piece of heritage and make a statement with this stunning creation.",
  "tags": [
    "Jhumka",
    "Ruby",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Traditional Earrings",
    "Indian Earrings",
    "Wedding Jewelry",
    "Pendli",
    "Seemantham",
    "Heirloom",
    "Gold Earrings",
    "Ratnalu",
    "Bangaru",
    "Bottu"
  ],
  "original_id": "diamond_jewellery_DPER8-1607_0285",
  "collection": "diamond"
}