{
  "id": "necklaces-987",
  "title": "Divya Ratna Haar: Exquisite Diamond and Ruby Bridal Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously set with brilliant-cut diamonds (VVS Clarity",
    "G Color). Features a central",
    "cabochon-cut Ruby of vibrant red hue",
    "complemented by natural South Sea Pearls. Hyderabadi Polish for a lasting luster."
  ],
  "features": "This magnificent Haar showcases intricate filigree work, reminiscent of traditional South Indian motifs. The pendant features a floral design centered around a striking Ruby. Delicate South Sea Pearls are suspended along the necklace's edge, adding a touch of elegance. The overall design draws inspiration from traditional 'Addigai' styles with a modern twist in the diamond setting. The ornate detailing is meticulously handcrafted by skilled artisans from Hyderabad, ensuring unparalleled quality and precision.",
  "colors": [
    "Primary colors are Gold and White (diamonds)",
    "accented by the intense Red of the Ruby and the creamy White of the South Sea Pearls. The gold provides a warm backdrop",
    "while the diamonds create a dazzling sparkle."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand celebrations. An ideal piece for the bride's Muhurtham or a significant family gathering. Also suitable for high-end social events and parties."
  ],
  "description": "This Divya Ratna Haar is a true masterpiece of craftsmanship and artistry. It’s a fusion of traditional South Indian design with modern diamond setting techniques. The exquisite combination of diamonds, rubies, and pearls represents prosperity and good fortune, making it a cherished heirloom piece that will be passed down through generations. Owning this necklace is not just about possessing a beautiful piece of jewelry; it's about owning a piece of South Indian cultural heritage.",
  "tags": [
    "Haar",
    "Necklace",
    "Diamond Necklace",
    "Ruby Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "South Sea Pearls",
    "Filigree",
    "Addigai",
    "Muhurtham Jewelry",
    "VVS Diamonds",
    "Telugu Jewelry",
    "Ratna Haar",
    "Bridal Haar"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0442_2308",
  "collection": "necklace"
}