{
  "id": "necklaces-210",
  "title": "Devi Kundan Haaram: Divine Elegance for Your Auspicious Moments",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Kundan Stones (High Quality)",
    "Ruby Cabochon",
    "Emeralds",
    "Hyderabadi Polish. The gold used is of exceptional purity",
    "offering a rich",
    "lasting luster. The Kundan stones are meticulously set",
    "reflecting light beautifully."
  ],
  "features": "This exquisite Haaram showcases intricate Kundan work, a hallmark of traditional South Indian jewelry. The centerpiece is a Temple Jewelry inspired pendant, featuring a meticulously crafted Devi idol. The chain itself is made of woven gold beads. The pendant is flanked by peacocks, symbols of beauty and prosperity, in a Nakshi design. The Ruby cabochon adds a touch of royalty.",
  "colors": [
    "Dominant gold with pops of Ruby red and Emerald green. The Kundan stones provide a shimmering white contrast",
    "enhancing the overall vibrancy."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "Seemantham ceremonies",
    "half-saree functions",
    "and other significant celebrations. Its timeless design also makes it suitable for grand receptions and cultural events."
  ],
  "description": "This Haaram is more than just jewelry; it is an heirloom. The traditional Kundan setting and temple design evoke a sense of cultural heritage and divine blessing. Each gemstone is carefully selected for its quality and brilliance. The Hyderabadi polish ensures a lasting shine and durability, making it a treasured piece for generations. The peacock Nakshi work showcases exceptional craftsmanship.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan Jewelry",
    "Temple Jewelry",
    "South Indian Jewelry",
    "22K Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham Jewelry",
    "Seemantham",
    "Devotional Jewelry",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Antique Finish",
    "Nakshi Work",
    "Ruby",
    "Emerald",
    "Lakshmi Devi",
    "Peacock",
    "Mayura"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0288_0485",
  "collection": "diamond"
}