{
  "id": "necklaces-1532",
  "title": "Emerald Dream Bridal Haaram - Exquisite Diamond and Gemstone Statement Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-purity 22K Gold setting",
    "meticulously encrusted with brilliant-cut Diamonds (SI clarity",
    "G-H color). Features natural",
    "pear-shaped Emeralds of vibrant green hue",
    "complemented by lustrous",
    "round Freshwater Pearls. Hyderabadi Polish for a radiant finish."
  ],
  "features": "This breathtaking Haaram showcases intricate filigree work reminiscent of traditional South Indian jewelry designs. The cascading floral motifs are embellished with pave-set diamonds, creating a mesmerizing sparkle. The central Emerald pendant, surrounded by a diamond halo, adds a touch of regal elegance. Delicate pearl drops enhance the necklace's graceful movement.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and Sparkling White (Diamonds)",
    "with soft white Pearls."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "especially for Muhurtham and reception events. Also suitable for grand celebrations",
    "festive occasions like Diwali",
    "and milestone events like anniversaries."
  ],
  "description": "A truly captivating statement piece that seamlessly blends traditional South Indian aesthetics with modern diamond-setting techniques. The use of high-quality materials and expert craftsmanship ensures lasting beauty and enduring value. The exquisite Emeralds symbolize prosperity and new beginnings, making this Haaram a cherished heirloom for generations to come. The Hyderabadi polish adds a touch of regal elegance.",
  "tags": [
    "Haaram",
    "Bridal Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Indian Wedding",
    "Muhurtham",
    "Hyderabadi Jewelry",
    "Gold Jewelry",
    "Traditional Jewelry",
    "Kantaabharanam",
    "కంఠాభరణం",
    "Emerald",
    "Pearls",
    "Indian Bride",
    "Wedding Jewellery",
    "Bridal Haaram"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-07 3_2150",
  "collection": "sjpl"
}