{
  "id": "necklaces-300",
  "title": "Divine Diamond & Gemstone Long Haaram Set with Matching Earrings - \"Ratna Deepthi\"",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "22K Gold (916 Hallmarked)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Ruby (Cabochon Cut)",
    "Natural Emerald (Pear Cut)",
    "South Sea Pearls. Features exquisite Hyderabadi Polish for lasting luster."
  ],
  "features": "This stunning Haaram showcases a delicate floral design meticulously set with sparkling diamonds. The central pendant features a vibrant pear-shaped emerald, while a complementing ruby is nestled in the necklace's upper section. The necklace is adorned with lustrous South Sea pearls, enhancing its regal appeal. The matching Jhumka earrings echo the floral motif, with a ruby centerpiece and pearl drops. The intricate filigree work adds a touch of traditional Telugu artistry (kundan kari) to this modern design.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Red (Ruby)",
    "Green (Emerald)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagements",
    "festivals like Diwali and Dussehra",
    "and milestone celebrations such as Seemantham or Half-Saree functions. Its modern aesthetic also makes it suitable for upscale events and galas."
  ],
  "description": "This 'Ratna Deepthi' set embodies the perfect blend of tradition and contemporary elegance. The high-quality diamonds and gemstones ensure lasting brilliance, while the classic design guarantees timeless appeal. The set is a statement piece that exudes sophistication and celebrates South Indian heritage. It’s an investment in exquisite craftsmanship and enduring style. The Hyderabadi polish ensures the gold retains its radiant shine for years to come.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Temple Jewelry",
    "Vaddanam Style",
    "Long Necklace",
    "Kundan Kari",
    "Ratnalu",
    "Muhurtham",
    "Seemantham"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0389_0586",
  "collection": "diamond"
}