{
  "id": "necklaces-1214",
  "title": "Manikyam & Pachala Mutyala Haram - Exquisite Gemstone & Pearl Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approx. 35.410 grams gross weight",
    "2.14 diamond weight)",
    "featuring meticulously selected Rubies (approx. 1.43 carats total weight)",
    "Emeralds (approx. 1.42 carats total weight)",
    "and lustrous South Sea Pearls (approx. 6.60 carats total weight). The diamonds are set in a prong and pave setting",
    "enhancing their brilliance. Features a 'Hyderabadi Polish' for enduring shine."
  ],
  "features": "This stunning necklace showcases a modern take on the traditional Haaram. The delicate gold chain is adorned with diamond-studded floral motifs, leading to a captivating pendant. The pendant features a central emerald surrounded by intricate diamond detailing and a ruby accent, followed by another emerald centered, and pearl drops at the base for added elegance. The floral arrangement showcases meticulous craftsmanship. Its very light in weight, it offers high comfort.",
  "colors": [
    "Classic combination of gold",
    "vibrant red of rubies",
    "rich green of emeralds",
    "the white of diamonds",
    "and the soft ivory of South Sea pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "festive occasions (like Sankranti or Dussehra)",
    "and elegant modern parties. Adds a touch of regal charm to any traditional attire",
    "such as sarees or lehengas",
    "and can also complement contemporary outfits."
  ],
  "description": "This necklace is a statement piece that blends traditional South Indian aesthetics with modern design sensibilities. The combination of high-quality gemstones, lustrous pearls, and impeccable craftsmanship ensures both beauty and lasting value. The traditional 'Hyderabadi Polish' enhances the gold's luster, making it a heirloom-worthy piece. The use of rubies, emeralds, and pearls together is considered auspicious in South Indian culture, adding to its significance.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "Mutyala Haram",
    "Manikyam",
    "Pachala",
    "22K Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-50_1788",
  "collection": "sjpl"
}