{
  "id": "necklaces-1247",
  "title": "Emerald Blossom Diamond Haaram - Enchanting Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finest quality Platinum setting",
    "meticulously crafted. Showcasing brilliant-cut diamonds with exceptional clarity and fire. Adorned with vibrant",
    "pear-shaped Zambian Emeralds (17.82 carats) of deep green hue. Each stone is carefully selected and set to maximize brilliance."
  ],
  "features": "A modern take on the traditional Haaram, this necklace features a floral motif. Each flower is intricately designed with a cluster of diamonds, surrounding a center stone of emerald. The pear-shaped emeralds dangle gracefully, adding movement and allure. The platinum setting ensures durability and a timeless aesthetic. Features delicate milgrain detailing around each setting.",
  "colors": [
    "The piece showcases a captivating contrast of sparkling white diamonds and lush green emeralds against the subtle sheen of the platinum setting."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (Vivaha)",
    "receptions",
    "and grand celebrations. It's a statement piece that complements both traditional Indian attire like sarees and lehengas",
    "as well as modern evening gowns."
  ],
  "description": "This Emerald Blossom Diamond Haaram is a stunning blend of classic elegance and contemporary design. The Zambian Emeralds add a touch of regal sophistication, while the diamonds ensure brilliance and sparkle. Its durable platinum setting ensures that this treasured piece will be cherished for generations. A true heirloom piece reflecting timeless beauty.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond",
    "Emerald",
    "Platinum",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Reception Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "Zambian Emerald",
    "Contemporary Design",
    "floral"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-45-09 2_1841",
  "collection": "sjpl"
}