{
  "id": "earrings-086",
  "title": "Lakshmi Temple Kasu Earrings - Divine Radiance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "set with brilliant Cubic Zirconia (CZ) stones and accented with synthetic Rubies. Features a signature Hyderabadi polish for lasting luster and deep color."
  ],
  "features": "These stunning jhumkas showcase the traditional temple jewelry design, featuring a meticulously crafted Lakshmi figure at the center. The deity is surrounded by a halo of sparkling CZ stones, enhancing her divine presence. The intricate gold filigree work and traditional 'nakshi' carving on the Lakshmi idol are hallmarks of South Indian craftsmanship.",
  "colors": [
    "Dominantly golden with a rich antique finish",
    "accented by the vibrant red of the synthetic rubies and the sparkling white of the CZ stones. A timeless and auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings (Pelli)",
    "festivals (Pandugalu)",
    "religious ceremonies",
    "and other auspicious occasions. A beautiful and meaningful gift for a bride or a loved one",
    "especially during Seemantham or half-saree functions."
  ],
  "description": "These earrings blend divine symbolism with exquisite craftsmanship. The Lakshmi motif signifies prosperity and good fortune, making these more than just jewelry - they are a blessing. The detailed nakshi work and the brilliant CZ stones highlight the artistry of our skilled artisans. A treasured heirloom to be passed down through generations.",
  "tags": [
    "Temple Jewelry",
    "Jhumka",
    "Kammalu",
    "Lakshmi",
    "Nakshi",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Earrings",
    "Indian Earrings",
    "Gold Earrings",
    "Divine Jewelry",
    "CZ Earrings",
    "Antique Finish",
    "Pelli",
    "Pandugalu"
  ],
  "original_id": "diamond_jewellery_b31bdde7-df7b-414d-adb8-b43117bc9875_0183",
  "collection": "diamond"
}