{
  "id": "necklaces-863",
  "title": "Magnificent Peacock Kundan Haaram with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) base",
    "meticulously hand-set Kundan stones",
    "brilliant-cut Diamonds",
    "Emeralds (Pachalu)",
    "Rubies (Rathalu)",
    "and South Sea Pearls."
  ],
  "features": "This regal haaram showcases exquisite Kundan craftsmanship, a hallmark of Hyderabadi jewelry. The design features gracefully intertwined peacocks (Mayura) symbolizing beauty and prosperity, adorned with vibrant emeralds and a central ruby. Delicate pearl drops (muthyalu) enhance its traditional charm. The pendant (gundla haram) features an intricate floral mandala design mirroring the neckline's opulence.",
  "colors": [
    "Primarily gold and white (diamond)",
    "with striking accents of green (emerald) and red (ruby)",
    "complemented by the soft luster of the pearls."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaaham)",
    "bridal ceremonies (Pellikuthuru)",
    "receptions",
    "and important family functions (Shubha karyamulu). An ideal heirloom piece for generations to cherish."
  ],
  "description": "This haaram is a masterpiece of traditional South Indian jewelry, combining the grandeur of Kundan setting with the auspicious symbolism of peacocks and the timeless elegance of pearls. Its meticulous craftsmanship and premium materials ensure lasting beauty and value. A true statement piece that reflects impeccable taste and cultural heritage.",
  "tags": [
    "Haaram",
    "Kundan",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Vivaaham",
    "Pelli",
    "Gundla Haram",
    "Peacock Design",
    "Emerald",
    "Ruby",
    "Pearls",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "భారతీయ ఆభరణాలు",
    "కంఠాభరణము",
    "ముత్యాలు"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0396_1550",
  "collection": "haaram"
}