{
  "id": "necklaces-1038",
  "title": "Raani Haar Set with Polki & Emerald Pendants",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximate)",
    "Polki Diamonds (Uncut Diamonds)",
    "Emerald (Pachala) Center Stone and Pendants",
    "Ruby (Rattha) beads",
    "and Freshwater Pearls. Features a Hyderabadi polish for a lasting shine."
  ],
  "features": "This exquisite Raani Haar features a central floral pendant intricately crafted with Polki diamonds, showcasing the traditional Polki setting technique. The multi-strand necklace comprises alternating Ruby and Emerald beads, giving it a rich, vibrant look. The pendant is further enhanced with a cascade of emerald and ruby bead drops, interspersed with delicate freshwater pearls, creating a delightful balance of colors and textures. The pendant design incorporates traditional Telugu motifs, offering a blend of cultural heritage and sophistication.",
  "colors": [
    "Emerald Green",
    "Ruby Red",
    "Gold",
    "White (Pearls)",
    "with the warmth of 22K gold adding a regal touch."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "engagements",
    "Seemantham",
    "weddings",
    "and other grand celebrations. This heirloom-quality piece is ideal for making a statement at any special occasion and is a timeless addition to any jewelry collection."
  ],
  "description": "This Raani Haar is a true masterpiece, reflecting the rich cultural heritage of Hyderabad. The use of Polki diamonds, renowned for their natural beauty and unique character, enhances the regal appeal of the piece. Each element, from the Hyderabadi polish to the intricately designed pendant, speaks volumes of superior craftsmanship and attention to detail. Its timeless design makes it a valuable addition to any jewelry collection, promising enduring beauty and elegance.",
  "tags": [
    "Raani Haar",
    "కంఠాభరణం",
    "Polki Necklace",
    "Emerald Necklace",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Pachala",
    "Rattha",
    "Pearls",
    "Uncut Diamonds",
    "Jadau Jewelry"
  ],
  "original_id": "radhe_diam_DPCK8-624_2451",
  "collection": "radhe"
}