{
  "id": "necklaces-066",
  "title": "Swan Motif Ruby & Pearl Gutapusalu Haram - Royal Heritage",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Fine Rubies (Cabochon Cut)",
    "Natural Freshwater Pearls. Features Hyderabadi Polish for lasting shine."
  ],
  "features": "This exquisite haram showcases a central swan motif pendant, symbolizing love and harmony, adorned with brilliant cabochon cut rubies. The pendant incorporates traditional Gutapusalu tassels, crafted with delicate ruby and pearl beading, creating a graceful cascading effect. The double-layered chain consists of alternating pearls and ruby accents, enhancing the piece's regal appearance. Meticulously handcrafted with attention to detail, reflecting the rich cultural heritage of South Indian jewelry.",
  "colors": [
    "Primary Colors: Gold (Yellow Gold)",
    "Ruby (Deep Red)",
    "Pearl (Lustrous White). A traditional and timeless color palette."
  ],
  "occasions": [
    "Ideal for traditional Telugu weddings (Pendli)",
    "auspicious ceremonies like seemantham",
    "bridal showers",
    "grand celebrations (Shubhakaryam)",
    "and elegant social gatherings."
  ],
  "description": "This haram is not just jewelry; it's an heirloom. The swan motif holds significant cultural meaning, making it a perfect gift for a bride or a cherished addition to any jewelry collection. The superior craftsmanship ensures durability, while the timeless design ensures lasting appeal. The use of high-quality rubies and pearls adds to its value and beauty. A true statement piece showcasing Hyderabadi artistry.",
  "tags": [
    "Haram",
    "Gutapusalu",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Ruby Necklace",
    "Pearl Necklace",
    "Swan Motif",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Pendli",
    "Seemantham",
    "Shubhakaryam"
  ],
  "original_id": "diamond_jewellery_b7506e3f-13f1-4ca1-a9df-bdc9a03cdcca_0184",
  "collection": "diamond"
}