{
  "id": "necklaces-336",
  "title": "Exquisite Diamond and Gemstone Vaddanam-Inspired Necklace Set",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Emerald",
    "Ruby",
    "South Sea Pearls. Expertly crafted with Hyderabadi Polish for a lasting shine."
  ],
  "features": "This stunning necklace draws inspiration from the traditional Vaddanam (waist belt) design. It features intricate floral and paisley motifs set with sparkling diamonds. The central pendant is adorned with a vibrant emerald and a striking ruby. The earrings mirror the pendant design, featuring a matching ruby accent and delicate South Sea Pearl drops. The diamond settings are meticulously done, maximizing the brilliance of each stone.",
  "colors": [
    "Yellow Gold",
    "White (Diamonds)",
    "Green (Emerald)",
    "Red (Ruby)",
    "Cream (Pearls). A classic and auspicious color palette."
  ],
  "occasions": [
    "Perfect for bridal wear (pellikuturu)",
    "grand receptions",
    "engagements",
    "Seemantham (baby shower)",
    "and special celebrations. A timeless piece for showcasing your exquisite taste."
  ],
  "description": "This Vaddanam-inspired necklace is a testament to traditional South Indian jewelry craftsmanship, reimagined for the modern woman. The high-quality diamonds and vibrant gemstones create a dazzling display of luxury. Its durable construction ensures it will be cherished for generations. A true heirloom piece, representing prosperity and elegance.",
  "tags": [
    "Diamond Necklace",
    "Vaddanam",
    "Bridal Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Pellikuturu",
    "Seemantham",
    "Engagement",
    "Reception",
    "Diamonds",
    "Haaram",
    "Kasulaperu",
    "Addigai"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0450_0632",
  "collection": "diamond"
}