{
  "id": "waistbands-028",
  "title": "Divine Diamond and Gemstone Vaddanam - Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VS Clarity)",
    "Faceted Emeralds",
    "and Amethyst. Finished with a traditional Hyderabadi polish to enhance the gold's luster."
  ],
  "features": "This Vaddanam features a series of ornate motifs, each meticulously crafted with intricate diamond detailing. Each panel includes a unique peacock design. The central Amethyst gems are surrounded by smaller emeralds, creating a regal touch. Dangling pearl-like gold beads add movement and allure. Features the traditional design elements with a modern flair, perfect for the contemporary bride.",
  "colors": [
    "Primarily gold and diamond white",
    "with accents of vibrant green (Emeralds) and regal purple (Amethyst)."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "receptions",
    "Bharatanatyam performances",
    "and other festive occasions like Seemantham or Half-Saree function. A statement piece for any grand celebration."
  ],
  "description": "This Vaddanam is more than just a piece of jewelry; it's a symbol of cultural heritage and refined craftsmanship. The brilliant cut diamonds sparkle with unmatched fire, while the emeralds and amethyst add a touch of royalty. Its enduring design ensures it will be treasured for generations. It is a true investment, a timeless heirloom, and a statement of impeccable taste. The piece features high-quality gemstones, ensuring lasting brilliance and value.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald",
    "Amethyst",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Muhurtham Jewelry",
    "Seemantham",
    "Half-Saree",
    "Peacock Design",
    "Kamarband"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-57-20 3_2162",
  "collection": "sjpl"
}