{
  "id": "rings-049",
  "title": "Navratan Chakra Ring - Timeless Elegance and Auspicious Energy",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold (916 Gold) setting",
    "meticulously crafted with a Hyderabadi Polish for a lasting luster. Features nine carefully selected gemstones representing the Navaratnas: Ruby (Manikyam)",
    "Pearl (Mutyam)",
    "Red Coral (Erra Pagadam)",
    "Emerald (Pachcha)",
    "Yellow Sapphire (Kanaka Pushyaragam)",
    "Diamond (Vajram)",
    "Blue Sapphire (Neelam)",
    "Hessonite (Gomedhikam)",
    "and Cat's Eye (Vaiduryam). Each gemstone is carefully selected for its color",
    "clarity",
    "and auspicious properties."
  ],
  "features": "This exquisite ring showcases the traditional Navratna design, a circular arrangement symbolizing cosmic balance and protection. The gemstones are set in a cluster style, surrounded by pave-set cubic zirconia (CZ) for enhanced brilliance. The intricate detailing and smooth finish exemplify the superior craftsmanship synonymous with Hyderabad's jewelry heritage. The ring's design ensures comfort and durability, making it suitable for daily wear or special occasions.",
  "colors": [
    "A vibrant symphony of colors including rich reds (Ruby and Coral)",
    "luminous whites (Pearl and CZ)",
    "deep blues (Sapphire)",
    "lush greens (Emerald)",
    "sunny yellows (Sapphire)",
    "and earth-toned browns (Hessonite). The gold setting adds warmth and richness",
    "enhancing the gemstone's individual beauty."
  ],
  "occasions": [
    "Ideal for auspicious occasions such as weddings (Vivah)",
    "engagement ceremonies (Nischitartham)",
    "housewarmings (Gruhapravesham)",
    "festivals (Sankranti",
    "Diwali)",
    "and traditional celebrations. Its versatile design also makes it a perfect statement piece for parties",
    "anniversaries",
    "or any event where you want to radiate elegance and sophistication."
  ],
  "description": "Embrace the power and beauty of the Navratnas with this exquisitely crafted ring. Each gemstone is believed to bring positive energies and balance to the wearer's life, according to Vedic astrology. The Hyderabadi Polish ensures lasting shine and durability. A timeless heirloom that can be treasured for generations. Experience the perfect blend of tradition and modern style.",
  "tags": [
    "Navratan",
    "Ring",
    "Anguleeyakam",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Gemstone Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Auspicious Jewelry",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Cluster Ring",
    "CZ",
    "Cubic Zirconia",
    "Manikyam",
    "Mutyam",
    "Erra Pagadam",
    "Pachcha",
    "Kanaka Pushyaragam",
    "Vajram",
    "Neelam",
    "Gomedhikam",
    "Vaiduryam"
  ],
  "original_id": "sjpl_PHOTO-2023-05-16-12-22-52_1701",
  "collection": "sjpl"
}