{
  "id": "waistbands-018",
  "title": "The Indrani Diamond Vaddanam: A Timeless Waist Belt of Unparalleled Elegance",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "Crafted in lustrous 22K Gold",
    "embellished with meticulously set brilliant-cut diamonds. Showcasing two Emeralds totaling 6.01 carats and two Rubies totalling 4.52 carats",
    "each hand-selected for their exceptional color and clarity. Features Hyderabadi Polish for enduring brilliance."
  ],
  "features": "This Vaddanam showcases intricate floral motifs meticulously studded with diamonds, evoking a sense of timeless beauty. The design features a central Emerald motif with a cascade of smaller diamond and Emerald clusters, creating a captivating visual symphony. Each gemstone is carefully set to maximize its brilliance and fire.",
  "colors": [
    "Predominantly gold and white (diamond) with vibrant emerald green and ruby red accents",
    "creating a classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaah)",
    "Seemantham (baby shower)",
    "half-saree functions (Voni Function)",
    "and festive celebrations like Sankranthi and Diwali. Also ideal for making a statement at high-end parties and cultural events."
  ],
  "description": "A masterpiece of traditional craftsmanship, the Indrani Diamond Vaddanam is an heirloom piece meant to be cherished for generations. The exquisite combination of diamonds and precious gemstones symbolizes prosperity, health, and marital bliss. The timeless design ensures it remains a stylish and valuable investment.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Kamarband",
    "OTTIYANAM",
    "Mekala Bandham"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-03_1299",
  "collection": "diamond"
}