{
  "id": "necklaces-1220",
  "title": "Emerald and Diamond Pearl Cascade Haaram - 'Manoharam'",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (58.31 grams)",
    "Brilliant-cut Diamonds (4.46 carats)",
    "Natural Emeralds (13.03 carats)",
    "South Sea Pearls (29.43 carats). Hyderabadi Polish finish for enhanced luster."
  ],
  "features": "A contemporary take on the traditional Haaram. Features a central row of oval-cut emeralds surrounded by a halo of dazzling diamonds. Delicate diamond-studded motifs cascade downwards, each adorned with a lustrous South Sea pearl. The setting showcases exceptional craftsmanship, with each stone meticulously placed for maximum brilliance and security. The gold is crafted with a subtle filigree design, adding a touch of traditional elegance.",
  "colors": [
    "Predominantly gold with vibrant green emeralds",
    "shimmering white diamonds",
    "and creamy ivory pearls. A classic and timeless South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "sangeets",
    "or any special occasion where you want to make a statement. Suitable for both traditional Telugu ceremonies like muhurtham and modern cocktail parties."
  ],
  "description": "This 'Manoharam' Haaram is a fusion of traditional South Indian aesthetics and contemporary design. The rare combination of emeralds, diamonds, and South Sea pearls creates a piece that is both luxurious and versatile. The Hyderabadi polish enhances the gold's radiance, making it a truly eye-catching heirloom piece. The emeralds are believed to bring prosperity and good fortune, adding symbolic value to this exquisite necklace.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Pearl",
    "South Sea Pearl",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Mogappu",
    "Antique Finish",
    "Nakshi",
    "Vaddanam"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-53 2_1794",
  "collection": "sjpl"
}