{
  "id": "necklaces-1481",
  "title": "Emerald Grandeur: Antique Finish Kasulaperu Haaram with Diamond Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Emeralds (Natural",
    "Round Cut",
    "Eye-Clean Clarity)",
    "Cubic Zirconia (CZ) / American Diamonds. The base metal is alloy-based for durability."
  ],
  "features": "This exquisite haaram features a timeless design with a contemporary twist. The intricately crafted gold chain showcases delicate filigree work (jali). The pendant is designed with emerald and diamond accents. The heart-shaped motifs dangling from the chain are embedded with emeralds, and the main pendant is adorned with a single large emerald surrounded by cubic zirconia for maximum brilliance. The use of CZ/American diamonds adds a modern touch to this traditional design.",
  "colors": [
    "Predominantly Gold with vibrant Green (Emeralds) and sparkling White (CZ). The traditional gold color enhances the richness of the emeralds."
  ],
  "occasions": [
    "Perfect for weddings (Vagdhanam",
    "Pellikuturu)",
    "receptions",
    "and grand celebrations. Also suitable for modern parties and formal events where you want to make a statement."
  ],
  "description": "This haaram is a stunning blend of traditional South Indian craftsmanship and contemporary design. The high-quality emeralds and Hyderabadi polish provide a luxurious and lasting shine. Its unique design is sure to turn heads and make you feel like royalty. The use of CZ allows for a grand, high-jewelry look at an accessible price point, while the 22K gold maintains the investment value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "22K Gold",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Kasulaperu",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Bridal Jewelry",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Pellikuturu",
    "Vagdhanam",
    "CZ Jewelry",
    "American Diamond"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-41-01 3_2099",
  "collection": "sjpl"
}