{
  "id": "necklaces-352",
  "title": "The \"Raaga Deepthi\" Diamond & Ruby Haaram - A Symphony of Light",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "meticulously handcrafted with brilliant-cut Diamonds (VVS clarity",
    "G color grade). Features two captivating Ruby gemstones with excellent clarity and a vibrant red hue. Finished with a lustrous Hyderabadi Polish for enduring shine."
  ],
  "features": "This exquisite Haaram showcases a delicate floral motif, handcrafted in a traditional South Indian style, leading to a breathtaking pendant. The pendant features intricate diamond-studded petals framing a central Ruby. The floral designs are interconnected creating a harmonious flow. The chain itself features alternating diamond-studded floral designs which are linked. The pendant's design elements are inspired by traditional temple jewelry, but with a contemporary, lightweight feel.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented by the striking red of the Rubies. The classic color combination embodies auspiciousness and prosperity."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "and special occasions like Seemantham or housewarmings. Its modern yet traditional design also makes it suitable for upscale parties and cultural events."
  ],
  "description": "This Raaga Deepthi Haaram seamlessly blends traditional South Indian artistry with modern elegance. The brilliance of the diamonds, coupled with the vibrancy of the rubies, creates a mesmerizing effect. It is a testament to exceptional craftsmanship, promising enduring beauty and heirloom value. The lightweight design ensures comfortable wear, allowing you to shine on any occasion. A true investment piece, reflecting your exquisite taste and appreciation for cultural heritage.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Temple Jewellery",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "VVS Diamonds",
    "Ruby",
    "Vivahaalu",
    "Nischitartham",
    "Seemantham",
    "Indian Jewellery",
    "Traditional Jewellery",
    "long chain"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0466_0648",
  "collection": "diamond"
}