{
  "id": "necklaces-1561",
  "title": "Diamond Cascade Grandeur: Contemporary Bridal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality metal alloy",
    "this necklace showcases a dazzling array of meticulously cut diamonds. The setting enhances the brilliance of each stone. The metal is coated with a high shine",
    "Hyderabadi inspired polish",
    "ensuring long-lasting luster and durability."
  ],
  "features": "This breathtaking haaram features a contemporary cascade design. Multiple rows of graduated diamond drops create a mesmerizing, flowing effect. The intricate setting maximizes the light reflection and sparkle of each diamond. The necklace is designed to sit comfortably and gracefully on the neckline.",
  "colors": [
    "Primarily shimmering white",
    "reflecting the brilliance of the diamonds."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "grand celebrations",
    "and special occasions where you want to make a statement. This haaram is a perfect blend of modern elegance and traditional grandeur",
    "suitable for both contemporary and traditional Indian attire."
  ],
  "description": "A masterpiece of modern jewelry design, this diamond haaram is designed for maximum brilliance and impact. The cascade design creates a flattering silhouette, while the high-quality craftsmanship ensures lasting beauty. It's a stunning investment piece that can be cherished for generations, adding a touch of contemporary elegance to any special occasion.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Cascade Necklace",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Indian Jewelry",
    "Contemporary Jewelry",
    "Diamond Jewellery",
    "Telugu Jewellery",
    "Reception Jewelry",
    "Statement Necklace",
    "Grand Occasion"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-46 3_2265",
  "collection": "sjpl"
}