{
  "id": "necklaces-929",
  "title": "Elegant Navratna-Inspired Necklace with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features genuine Rubies",
    "Emeralds",
    "and high-quality Cubic Zirconia (CZ)."
  ],
  "features": "This modern take on the classic Navratna (nine gems) concept features a delicate gold setting embellished with rubies along the chain, leading to a striking pendant section. The pendant showcases five vibrant green emeralds, expertly set in bezel settings. The spaces in between the emeralds are filled with intricate cubic zirconia pave, creating a mesmerizing sparkle. Small, spherical gold dangles add a touch of movement and playfulness. The design has an open, airy feel, making it comfortable to wear.",
  "colors": [
    "Primary colors are gold",
    "ruby red",
    "emerald green",
    "and brilliant white (from the CZs). This classic color palette is considered auspicious and adds to the piece's timeless appeal."
  ],
  "occasions": [
    "Ideal for weddings",
    "engagements",
    "parties",
    "festive celebrations like Diwali or Sankranthi",
    "or even to elevate everyday style. This versatile piece can be paired with both traditional sarees and contemporary outfits."
  ],
  "description": "This necklace is a perfect blend of tradition and modern aesthetics. The genuine gemstones and high-quality CZs create a luxurious look without the heavy price tag of traditional Navratna. The intricate gold work and Hyderabadi polish enhance its beauty and ensure lasting shine. It’s a statement piece that will turn heads and become a cherished heirloom.",
  "tags": [
    "Necklace",
    "Haaram",
    "Gold Jewelry",
    "Ruby",
    "Emerald",
    "Cubic Zirconia",
    "CZ",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Navratna Inspired",
    "Party Wear",
    "Festive Jewelry",
    "Sankranthi",
    "Diwali",
    "Mangalsutra alternative"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0323_2390",
  "collection": "necklace"
}