{
  "id": "necklaces-263",
  "title": "Divine Nakshi Work Kante Haaram with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "High-Quality Zircon",
    "Emeralds (Pachalu)",
    "Rubies (Garalu)."
  ],
  "features": "Intricate Nakshi work showcasing traditional South Indian motifs. Layered design adorned with shimmering Zircon. Center pendants featuring Emerald and Ruby floral accents for a touch of regal elegance. Delicate gold ball drops add movement and charm. The entire piece exudes a vintage, antique finish, meticulously handcrafted by skilled artisans in Hyderabad.",
  "colors": [
    "Primarily gold with vibrant pops of green from the Emeralds and deep red from the Rubies. The Zircon adds a brilliant white sparkle",
    "creating a mesmerizing contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "traditional ceremonies (like Seemantham or Half-Saree function)",
    "or any festive occasion where a touch of traditional grandeur is desired. Can also be styled with modern Indian wear for a fusion look."
  ],
  "description": "This Kante Haaram represents the pinnacle of Hyderabadi craftsmanship. The combination of Nakshi work, Emeralds, and Rubies makes it a timeless heirloom piece. The Hyderabadi Polish gives the gold a rich, lustrous finish, while the Zircon adds a modern touch of sparkle. It's a statement piece that exudes tradition, luxury, and enduring beauty. An excellent investment for future generations.",
  "tags": [
    "Kante",
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Nakshi Work",
    "Emerald",
    "Ruby",
    "Pachalu",
    "Garalu",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Antique Finish",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0343_0540",
  "collection": "diamond"
}