{
  "id": "earrings-014",
  "title": "Lakshmi Studs - A Timeless Touch of Tradition",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "meticulously crafted with a radiant Hyderabadi Polish. Adorned with brilliant-cut White Cubic Zirconia. The center features a cluster of vibrant Red and Green synthetic stones."
  ],
  "features": "These exquisite studs feature a geometric square design, a subtle twist on the classic round stud. The outer border is embellished with dazzling Cubic Zirconia, creating a halo effect. The inner design features a traditional floral pattern rendered with Red and Green gemstones, providing a vibrant contrast to the gold. Open work setting allows light to pass through the gemstones.",
  "colors": [
    "Primarily gold with highlights of white (Cubic Zirconia)",
    "red",
    "and green."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "festive occasions like Diwali",
    "Ugadi",
    "and Sankranthi",
    "or as a charming addition to a half-saree function (Langa Voni Function). Adds a touch of elegance to both traditional and modern attire."
  ],
  "description": "These studs blend tradition with contemporary design, making them versatile and suitable for all ages. The high-quality 22K gold ensures durability and lasting value. The traditional South Indian color palette of red, green, and gold brings good fortune and prosperity. The intricate craftsmanship is a testament to the rich heritage of Hyderabad jewelry.",
  "tags": [
    "Earrings",
    "Studs",
    "Chevi Diddulu",
    "22K Gold",
    "Cubic Zirconia",
    "CZ",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "Festive Jewelry",
    "Indian Jewelry",
    "Red Stones",
    "Green Stones",
    "Geometric Jewelry"
  ],
  "original_id": "diamond_jewellery_086d913a-25e0-4ccf-824d-034cbf7b730a_0074",
  "collection": "diamond"
}