{
  "id": "bangles-081",
  "title": "Vaishnavi Diamond Bangle - A Touch of Tradition",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "High-Quality Cubic Zirconia (CZ) Diamonds",
    "Emerald and Ruby accents. The gold exhibits a rich",
    "lustrous finish achieved through meticulous hand-polishing techniques unique to Hyderabad."
  ],
  "features": "This exquisite bangle showcases a captivating geometric design, featuring a central, diamond-encrusted square. The design incorporates delicate filigree work, reminiscent of traditional South Indian jewelry artistry. An emerald and ruby accents provide a subtle color contrast, echoing traditional Telugu aesthetics. The pave setting of the CZ diamonds enhances brilliance and ensures a secure hold. Its openable design ensures easy wearability.",
  "colors": [
    "Predominantly gold with dazzling white from the CZ Diamonds. Emerald (green) and Ruby (red) provide eye-catching accents."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements (Nischayathartham)",
    "festivals (Sankranthi",
    "Diwali)",
    "and special occasions. Its elegant design also makes it suitable for modern evening wear."
  ],
  "description": "This Vaishnavi Diamond Bangle beautifully blends traditional South Indian design with modern craftsmanship. The brilliant CZ diamonds provide a luxurious sparkle at an accessible price point. The 22K gold ensures lasting value and durability, making it a cherished heirloom. Its Hyderabadi polish guarantees a radiant finish, reflecting the region's renowned craftsmanship.",
  "tags": [
    "Bangle",
    "Kangan",
    "Diamond",
    "CZ Diamonds",
    "Gold",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Vivaha Jewelry",
    "Festival Jewelry",
    "Kundan",
    "Emerald",
    "Ruby",
    "Geometric Jewelry"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0275_0009",
  "collection": "bracelets"
}