{
  "id": "necklaces-391",
  "title": "Emerald Blossom Raani Haaram Set - A Timeless Telugu Treasure",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "22K Gold (Suvarna) with Hyderabadi Polish",
    "featuring Emeralds (Panna) and high-quality Cubic Zirconia (CZ) stones. Meticulously crafted setting ensures gemstone security and brilliance."
  ],
  "features": "This exquisite Raani Haaram features a delicate floral design, adorned with vibrant Emeralds and shimmering CZ stones. The intricate detailing showcases exceptional craftsmanship, reminiscent of traditional South Indian jewelry making techniques. The Jhumka earrings echo the necklace's floral motif, creating a harmonious and elegant ensemble.",
  "colors": [
    "Lustrous Gold",
    "Vibrant Green (Emerald)",
    "Sparkling White (Cubic Zirconia)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "engagement ceremonies",
    "festivals (Sankranti",
    "Diwali)",
    "and other special occasions. A stunning choice for Muhurtham",
    "Seemantham",
    "or a Half-Saree Function",
    "adding a touch of regal elegance to your attire."
  ],
  "description": "This Raani Haaram set is a testament to timeless South Indian craftsmanship, blending tradition with modern elegance. The high-quality materials and meticulous detailing ensure lasting beauty and durability. Emeralds symbolize prosperity and new beginnings, making this set a meaningful and cherished heirloom piece. Experience the allure of Hyderabad's rich jewelry heritage with this breathtaking set.",
  "tags": [
    "Raani Haaram",
    "Jhumka Earrings",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Indian Jewelry",
    "22K Gold",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Panna",
    "Vivaaham",
    "Suvarna",
    "Necklace Set",
    "Haaralu"
  ],
  "original_id": "diamond_jewellery_IMG-20241219-WA0023_0803",
  "collection": "diamond"
}