{
  "id": "necklaces-358",
  "title": "Indrani Diamond Haaram with Ruby and Pearl Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Pear-Shaped Ruby Cabochons",
    "Natural South Sea Pearls."
  ],
  "features": "This exquisite Haaram showcases a delicate floral diamond setting, reflecting a blend of traditional South Indian design and modern aesthetics. The necklace features intricate openwork detailing with floral motifs entirely set with diamonds. The pendant is adorned with a rich ruby cabochon surrounded by diamonds and punctuated by lustrous South Sea pearl drops. The Hyderabadi polish accentuates the gold's brilliance and gives the diamonds an extraordinary sparkle. The arrangement of diamonds and gemstones creates a mesmerizing play of light.",
  "colors": [
    "Primarily Gold and White (Diamonds)",
    "with vibrant Ruby Red and creamy Pearl accents."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "engagements",
    "formal gatherings",
    "and significant celebrations like Seemantham or a milestone birthday. Also suitable for high-end fashion events and special occasions where you want to make a statement."
  ],
  "description": "This Haaram is a testament to Hyderabadi craftsmanship, blending the timeless appeal of South Indian jewelry with modern design sensibilities. The high-quality diamonds and rich rubies symbolize prosperity and good fortune. The pearls add a touch of classic elegance. This piece is not just jewelry; it is an heirloom to be treasured for generations. Excellent value for an impeccable design.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Ruby",
    "Pearls",
    "Bridal Jewelry",
    "Muhurtham Jewelry",
    "Wedding Necklace",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Indian Wedding",
    "Vaddanam",
    "Kasulaperu",
    "Temple Jewellery",
    "Navaratna",
    "Gemstone Jewelry",
    "Luxury Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0472_0654",
  "collection": "diamond"
}