{
  "id": "bangles-284",
  "title": "Leafy Diamond Kada Bracelet - \"Pallavi Bandi\" (పల్లవి బండి)",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "18K Rose Gold",
    "conflict-free Baguette and Round Brilliant Cut Diamonds. Expertly crafted with a delicate Hyderabadi polish to enhance the warm luster of the gold."
  ],
  "features": "This enchanting bracelet features a central square motif adorned with Baguette cut diamonds, surrounded by pave set round brilliant diamonds. The band is composed of stylized leaf-shaped diamond clusters, meticulously designed for maximum brilliance and light reflection. The clasp is discreetly integrated into the design, ensuring a seamless and elegant look. Incorporates a modern take on traditional South Indian foliage motifs.",
  "colors": [
    "Rose Gold (Gulabi Bangaram) and dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for evening wear",
    "cocktail parties",
    "weddings (Sangeet",
    "Reception)",
    "or any special occasion where you want to add a touch of sophisticated sparkle. Also suitable as a stunning gift for birthdays and anniversaries."
  ],
  "description": "This exquisite Kada bracelet seamlessly blends contemporary design with timeless elegance. The unique leaf motif represents growth and prosperity, making it a meaningful and stylish addition to your jewelry collection. The Baguette and Round Brilliant diamonds offer unparalleled sparkle and brilliance, showcasing superior craftsmanship and attention to detail. This is a piece that will be treasured for generations.",
  "tags": [
    "Diamond Bracelet",
    "Kada",
    "Rose Gold Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Cocktail Jewelry",
    "Pallavi Bandi",
    "Diamond Bangle",
    "Contemporary Design",
    "Indian Jewelry",
    "Fine Jewelry",
    "Baguette Diamonds",
    "Round Brilliant Diamonds"
  ],
  "original_id": "sjpl_PHOTO-2024-05-09-11-07-47 2_1985",
  "collection": "sjpl"
}