{
  "id": "necklaces-1567",
  "title": "Manohari Pushpa Haaram: Rose Gold Diamond and Pearl Blossom Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold (Grwt: 127.850 GH)",
    "Premium Quality Diamonds (Dwt: 17.12; 2379 stones",
    "including D PAN(+7):-0.66(12) & D MQ(+7):-0.83(14))",
    "Fancy Colored Diamonds (NV Fancy:-11.77; 29 stones)",
    "South Sea Pearls (Moti: 22.65; 7 pearls). Exhibits a brilliant Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "A breathtaking floral design Haaram. Each blossom is intricately crafted with pave-set diamonds and delicate pink gemstones. The design features floral motifs with a prominent central flower pendant drop. The pearls are strategically placed to enhance the overall elegance and grandeur. The rose gold setting gives a modern touch to this traditional design. The craftsmanship reflects the renowned Hyderabadi tradition of meticulous detail.",
  "colors": [
    "Rose Gold",
    "Brilliant White (Diamonds)",
    "Soft Pink (Gemstones)",
    "Creamy White (Pearls). This pastel palette offers a refreshing and contemporary take on traditional South Indian jewelry."
  ],
  "occasions": [
    "Perfect for a modern bride on her Muhurtham",
    "a grand reception",
    "or an upscale gala. Also ideal for special occasions such as Seemantham (baby shower) or a half-saree function where a touch of elegance and tradition is desired."
  ],
  "description": "This exquisite Haaram is a statement piece blending modern aesthetics with traditional Indian design. The use of rose gold, diamonds, colored diamonds, and pearls creates a unique and luxurious look. The meticulous craftsmanship ensures durability and lasting beauty, making it a cherished heirloom for generations. Its eye-catching floral design embodies femininity and grace.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Rose Gold Jewelry",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Fancy Diamonds",
    "Pushpa Haaram",
    "Bridal Necklace",
    "Statement Jewelry",
    "Contemporary Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-49 3_2271",
  "collection": "sjpl"
}