{
  "id": "necklaces-1229",
  "title": "Emerald Radiance Diamond Haaram Set: A Regal Telugu Bridal Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Crafted in high-purity 22K Gold (916 Gold) with a Hyderabadi Polish for lasting brilliance. Adorned with brilliant-cut Diamonds of exceptional clarity and carefully selected Emeralds and Ruby accent stones. Total diamond weight is 14.31 (989)",
    "ruby weight 4.60 (4) and emeralds weight 2.85 (2). The pendant weight 2.50 (208) with ruby weight 1.15 (4) and emerald 0.98 (1)."
  ],
  "features": "This exquisite haaram showcases a classic South Indian design with a modern sensibility. The necklace features a broad collar-style setting, meticulously paved with diamonds in a tessellated pattern. The central pendant boasts a floral motif, with an oval-cut Emerald as the centerpiece, surrounded by a halo of sparkling diamonds and delicate ruby accents. The lower pendant mimics the floral pendant with matching gemstones.The cascading diamond accents at the lower end add movement and allure.",
  "colors": [
    "Predominantly gold with a dazzling white diamond sparkle",
    "complemented by the lush green of the Emeralds and touches of ruby",
    "creating a vibrant and auspicious color palette."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (muhurtham)",
    "receptions",
    "engagements",
    "and other celebratory events. Perfect for brides seeking a statement piece with a touch of modern elegance while honoring traditional Telugu heritage. Can also be worn for Seemantham or Half-Saree functions."
  ],
  "description": "This haaram is a true investment piece, representing the pinnacle of South Indian jewelry craftsmanship. The superior diamond quality and the vibrant Emeralds create a mesmerizing sparkle that will captivate onlookers. The timeless design ensures that this piece can be cherished for generations, making it a valuable heirloom. This piece blends traditional design with modern elegance and craftsmanship.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Indian Wedding",
    "Contemporary Indian Jewelry",
    "Diamond Jewelry",
    "kanthabharanam"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-56 2_1803",
  "collection": "sjpl"
}