{
  "id": "necklaces-1568",
  "title": "Regal Neelam Haaram: 18K Gold Necklace with Sapphires and Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18 Karat Gold. Features a dazzling array of vibrant Neelam (Sapphire) gemstones",
    "totaling 3.84 carats",
    "with round and pear-shaped cuts. Showcases 0.88 carats of brilliant-cut diamonds. Setting is platinum with a polished finish."
  ],
  "features": "This contemporary Haaram design incorporates a series of graduated sapphires, each embraced by intricate floral motifs set with sparkling diamonds. The alternating pattern creates a graceful silhouette around the neckline. The necklace culminates in three dramatic sapphire and diamond-encrusted pendants, offering a modern take on traditional South Indian jewelry. The platinum setting enhances the gemstone's brilliance.",
  "colors": [
    "Features a striking color palette with rich",
    "deep blue sapphires and bright white diamonds against the warm tone of 18K gold. Platinum provides contrast."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "and grand celebrations. A perfect statement piece for the modern Telugu bride or for any special occasion where you want to exude elegance and grace. Can be used for both traditional Seemantham or Half-saree ceremonies."
  ],
  "description": "This Neelam Haaram is a testament to modern design, featuring brilliant blue sapphires and sparkling diamonds set in 18K gold. The detailed craftsmanship and bold color combination make it a statement piece that will be cherished for generations. The high-quality gemstones and precious metal ensure lasting value and beauty. A modern interpretation of the traditional Haaram, this necklace offers a unique blend of cultural heritage and contemporary style.",
  "tags": [
    "Haaram",
    "Necklace",
    "Neelam",
    "Sapphire",
    "Diamonds",
    "18K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Platinum Setting",
    "Fine Jewelry",
    "Bridal Jewelry",
    "Contemporary Design",
    "Festival Jewelry",
    "Special Occasion"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-51_2272",
  "collection": "sjpl"
}