{
  "id": "earrings-071",
  "title": "Emerald Peacock Jhumkaalu: A Regal Symphony of Tradition and Sparkle",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish; Featuring pear-shaped Emeralds",
    "Round Rubies",
    "Brilliant-Cut Cubic Zirconia (CZ) stones",
    "and natural freshwater Pearls."
  ],
  "features": "Classic bell-shaped Jhumka design with intricate filigree work and a peacock motif (Mayura Akruti) at the top. The peacock features ruby accent stones. The jhumka is adorned with pavé-set Cubic Zirconia stones throughout. Delicate pearl drops enhance the overall elegance.",
  "colors": [
    "Predominantly Gold with vibrant Emerald green",
    "Ruby red accents",
    "the brilliance of the CZ stones and soft pearl shimmer."
  ],
  "occasions": [
    "Ideal for weddings",
    "festivals like Sankranthi and Diwali",
    "temple visits",
    "and significant life events like seemantham or half-saree functions. Equally suited to add a touch of elegance to modern ethnic wear."
  ],
  "description": "These Jhumkas embody the timeless elegance of South Indian jewelry. The rich 22K gold and vibrant gemstones represent prosperity and good fortune. The peacock motif symbolizes beauty and grace, making these earrings a cherished heirloom piece. The Hyderabadi polish ensures a lasting luster, reflecting the superior craftsmanship. The blend of traditional design with sparkling CZs provides a touch of contemporary glamour.",
  "tags": [
    "Jhumka",
    "Kammalu",
    "Earrings",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Emerald",
    "Ruby",
    "Pearls",
    "Peacock Motif",
    "Mayura Akruti",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "22K Gold",
    "CZ Stones",
    "Seemantham",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_93e4ff96-49f0-4d61-97d0-d94c11297ae8_0162",
  "collection": "diamond"
}