{
  "id": "necklaces-1431",
  "title": "Exquisite Gulabi Pushpa Haaram: A Floral Diamond Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base",
    "meticulously set with brilliant-cut diamonds (VS Clarity",
    "G Color). Features clusters of pink gemstones (likely Rubellite or Pink Tourmaline) and Blue Sapphire accents. Finished with a Hyderabadi Polish for enduring shine."
  ],
  "features": "This breathtaking haaram showcases a series of stylized floral motifs. Each 'pushpa' (flower) is intricately crafted with diamond-studded petals and a cluster of smooth, rounded pink gemstones at its heart. Sapphire cabochons are tastefully spaced to add a touch of contrasting color. The setting style maximizes the brilliance of each diamond, creating a dazzling play of light. The floral design is very modern, while the gold setting is crafted in a style reminescent of a temple jewellery design.",
  "colors": [
    "Dominant gold hue with vibrant pink and cool blue accents",
    "creating a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vadhuvu Alankarana)",
    "receptions",
    "and other grand celebrations. Its modern design also makes it suitable for high-end parties and upscale social events. Ideal for a Seemantham or Half-Saree function."
  ],
  "description": "This Gulabi Pushpa Haaram is a unique blend of traditional craftsmanship and modern design. The floral motif symbolizes beauty and prosperity, making it a meaningful and cherished heirloom. The high-quality diamonds and gemstones ensure lasting value and radiance. The Hyderabadi Polish provides enhanced durability and a rich, lustrous finish. A perfect statement piece that will turn heads at any event.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Floral Necklace",
    "Pushpa Haaram",
    "Pink Tourmaline",
    "Blue Sapphire",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewellery",
    "Vadhuvu Alankarana",
    "Seemantham",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Contemporary Design",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-34_2049",
  "collection": "sjpl"
}