{
  "id": "earrings-508",
  "title": "Exquisite Kundan Jhumka with Pearl Center and Tassel Drop",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated Base. Features a central freshwater pearl",
    "surrounded by high-quality Kundan settings with multicoloured gemstones including ruby",
    "sapphire",
    "topaz",
    "amethyst and cubic zirconia. Accented with delicate pink crystal tassel drop and a Hyderabadi polish for lasting brilliance."
  ],
  "features": "Traditional Jhumka design with a modern twist. The floral motif surrounding the pearl is meticulously crafted using the age-old Kundan setting technique, where uncut gemstones are set in gold foil. The tassel drop adds a contemporary flair. This piece combines the timeless elegance of South Indian craftsmanship with a modern aesthetic.",
  "colors": [
    "Predominantly gold",
    "white",
    "and pink",
    "complemented by the varied hues of the multicoloured gemstones",
    "creating a vibrant and eye-catching palette. The pink crystal tassel adds a playful touch."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals (like Sankranthi or Diwali)",
    "family functions",
    "and special occasions. Suitable for a traditional half-saree function or a modern cocktail party."
  ],
  "description": "This Jhumka is a unique blend of traditional South Indian artistry and contemporary design. The Kundan setting and the pearl center reflect cultural heritage, while the tassel drop makes it a modern statement piece. It is handcrafted by skilled artisans, ensuring exceptional quality and durability. The variety of gemstones adds a vibrant sparkle and makes it a versatile accessory.",
  "tags": [
    "Jhumka",
    "చెవి దిద్దులు",
    "Kundan",
    "Pearl",
    "Freshwater Pearl",
    "Earrings",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Hyderabadi Jewelry",
    "Tassel Earrings",
    "Multicoloured Gemstones",
    "Bridal Jewelry",
    "Indian Earrings",
    "Gift for Her",
    "Women's Fashion"
  ],
  "original_id": "ear_rings_DPER8-1808_2643",
  "collection": "ear"
}