{
  "id": "necklaces-1003",
  "title": "Diamond and Gemstone Floral Haaram Set with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "22K Gold Plating. Adorned with CZ diamonds",
    "Ruby Red and Emerald Green synthetic stones. Features hanging freshwater pearls. Showcases the intricate Hyderabadi polish",
    "enhancing its luster and longevity."
  ],
  "features": "This enchanting Haaram set boasts an intricate floral design, meticulously crafted with sparkling CZ diamonds. The necklace features a central pendant with a ruby red synthetic stone surrounded by elaborate detailing, complemented by delicate emerald green accents. The accompanying Jhumka earrings echo the necklace's floral motif and feature freshwater pearl drops, adding a touch of classic elegance. The necklace showcases a modern chain that connects the intricate floral design seamlessly.",
  "colors": [
    "Predominantly gold",
    "with vibrant ruby red and emerald green gemstones. The freshwater pearls offer a soft",
    "creamy white contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "anniversaries",
    "and festive occasions like Diwali",
    "Dussehra",
    "Sankranthi",
    "Seemantham",
    "half-saree function",
    "or any special celebration. A timeless addition to bridal jewelry collections."
  ],
  "description": "This Haaram set is a stunning blend of traditional South Indian design and modern aesthetics. The intricate floral patterns and vibrant gemstones add a regal touch, while the Hyderabadi polish ensures lasting shine. The inclusion of both a necklace and matching earrings offers exceptional value and versatility. Makes a stunning statement piece that's sure to become a treasured heirloom.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace",
    "Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "CZ Diamonds",
    "Ruby",
    "Emerald",
    "Pearls",
    "Hyderabadi Polish",
    "22K Gold Plated",
    "Indian Jewelry",
    "Fashion Jewelry",
    "Contemporary",
    "కంఠాభరణం",
    "జుంకాలు",
    "నగలు"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0461_2324",
  "collection": "necklace"
}