{
  "id": "earrings-343",
  "title": "Enchanting Pink Petal Chandbali Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base metal with Gold finish. Features meticulously set Pink Stones and White American Diamonds."
  ],
  "features": "Classic Chandbali design, reminiscent of Mughal-inspired Indian Jewelry. The earring showcases a cascade of pink stone petals and glittering AD stones, set in a graceful, tiered structure. Delicate filigree work connecting each petal and the floral tops add an intricate touch, echoing traditional craftsmanship.",
  "colors": [
    "Predominantly Gold",
    "Pink",
    "and White. The combination of the gold finish with the pink and white creates a feminine and opulent look",
    "perfectly complementing traditional South Indian attire."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham",
    "sangeet)",
    "festive celebrations like Sankranthi or Diwali",
    "and special occasions such as engagement parties or any event where a touch of traditional elegance is desired. Also suitable for modern evening wear when you want to make a statement."
  ],
  "description": "These Chandbali earrings offer a blend of traditional Mughal and South Indian aesthetics, adding a touch of regal charm to your look. The design is carefully crafted for optimal shine and brilliance, making them a dazzling addition to any jewelry collection. Lightweight and comfortable to wear, they are designed for lasting beauty and enjoyment.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Mughal Jewelry",
    "Pink Jewelry",
    "Wedding Jewelry",
    "Party Wear",
    "Ethnic Earrings",
    "Traditional Earrings",
    "Gold Finish",
    "American Diamond",
    "Bridal Jewelry",
    "Festive Jewelry",
    "Latest Design",
    "New Design"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-43 2_1383",
  "collection": "diamond"
}