{
  "id": "necklaces-002",
  "title": "Geometric Radiance: Rose Gold Finish Layered Necklace with Jhumka Set",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "High-Quality Alloy with Rose Gold Finish",
    "Cubic Zirconia (CZ) Stones. Meticulously crafted with a durable Hyderabadi polish ensuring longevity and enhanced brilliance."
  ],
  "features": "This unique set features a three-layered necklace with geometric patterns connected by circular designs. The layers are interspersed with varying circle patterns. The earrings, a modern take on the classic Jhumka, echo the geometric theme with circular and rectangular elements. The geometric patterns are embellished with small CZ Stones to give a high-end look. There is no Nakshi Work",
  "colors": [
    "Predominantly Rose Gold with clear Cubic Zirconia highlights. The soft rose gold provides a warm",
    "contemporary aesthetic",
    "perfectly complementing the sparkling CZ stones."
  ],
  "occasions": [
    "Suitable for modern weddings",
    "receptions",
    "engagement ceremonies",
    "and festive occasions. Also perfect for a chic Indo-Western look at parties and events. For those occasions where traditional ethnic looks are required but with a modern twist."
  ],
  "description": "A unique fusion of modern geometric design with the essence of traditional Indian jewelry. Crafted with durable, high-quality materials ensuring lasting beauty. The rose gold finish and sparkling CZ stones offer a luxurious look at an accessible price point. The design is eye-catching and perfect for a modern and contemporary women",
  "tags": [
    "Rose Gold Necklace",
    "Jhumka Earrings",
    "Geometric Jewelry",
    "Modern Indian Jewelry",
    "Hyderabadi Jewelry",
    "Party Wear",
    "Cubic Zirconia",
    "CZ Jewelry",
    "Gift for Her",
    "Reception Jewelry",
    "Engagement Jewelry",
    "Contemporary Indian Design"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0008_0037",
  "collection": "choker"
}