{
  "id": "necklaces-1066",
  "title": "The \"Chandrika\" Polki Diamond Haaram: A Radiant Legacy",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold setting with Uncut Polki Diamonds (approx. 25 carats). Hyderabadi Polish for a timeless luster. Each Polki diamond is meticulously selected for its unique character and brilliance."
  ],
  "features": "This stunning Chandrika Haaram features a layered, cascading design. Each segment is crafted with floral motifs, evocative of traditional South Indian artistry. The Polki diamonds are set in a closed setting, showcasing their natural beauty. The central pendant boasts a larger, pear-shaped Polki, surrounded by smaller diamonds, creating a captivating focal point. Features an elaborate design inspired by vintage Hyderabad jewelry.",
  "colors": [
    "Golden yellow (22K Gold) with the natural white brilliance of Polki Diamonds. Hints of light pink can be seen in some Polki Diamonds."
  ],
  "occasions": [
    "Perfect for Muhurtham",
    "weddings",
    "Seemantham",
    "and grand celebrations. Also a statement piece for upscale cultural events and black-tie affairs where you want to embody regal elegance."
  ],
  "description": "This Chandrika Haaram is more than just a necklace; it's a piece of history. Crafted with authentic Polki diamonds and traditional Hyderabadi craftsmanship, it embodies the rich heritage of South Indian jewelry. The uncut Polki diamonds add a unique, natural charm, making it a truly one-of-a-kind piece. Its timeless design ensures it will be treasured for generations. Represents the 'Lakshmi Kataksham' for prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamonds",
    "Uncut Diamonds",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Chandrika",
    "Lakshmi Kataksham",
    "बंदनालु (Bandaanalu - Necklaces)"
  ],
  "original_id": "radhe_diam_DPNK8-1564_2479",
  "collection": "radhe"
}