{
  "id": "necklaces-1182",
  "title": "Emerald Dream Haaram: A Symphony of Tradition and Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity gold (estimate 22K)",
    "intricately set with 1.24 carat ruby",
    "7.98 carat emeralds and dazzling",
    "brilliant-cut cubic zirconia and has Hyderabadi Polish for a lasting shine. Gross weight: 154.400 g and Diamond weight: 14.06(3148) ct."
  ],
  "features": "This exquisite Haaram features a multi-layered design, culminating in a stunning central pendant. The pendant showcases meticulous filigree work and is embellished with perfectly placed round and octagon shaped emerald stones. The overall design incorporates traditional South Indian floral motifs, adding a touch of timeless charm. The locket alone has a total Diamond weight: 5.17(1273)ct, 1.24 carat ruby and 2.34 carat emeralds.",
  "colors": [
    "The necklace features a rich gold base complemented by the vibrant green hues of the emeralds and the sparkling white of the cubic zirconia."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "engagements (Nischayathartham)",
    "Seemantham ceremonies",
    "or any festive celebration. This Haaram is sure to become a treasured heirloom."
  ],
  "description": "This is more than just a necklace; it's a statement of heritage and refined taste. The intricate craftsmanship, combined with the auspiciousness of gold and the vibrancy of emeralds, makes this a truly exceptional piece. Its timeless design ensures it will remain a cherished part of your jewelry collection for generations to come.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Muhurtham",
    "Seemantham",
    "Vivaha Mahotsavam",
    "Nischayathartham",
    "kasulaperu",
    "addigai"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-08 2_1734",
  "collection": "sjpl"
}