{
  "id": "necklaces-1122",
  "title": "Regal Panakala Haaram: Emerald and Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Emeralds (Square Cut",
    "approximately 8ctw)",
    "Polki Diamonds (Uncut",
    "varying sizes). Featuring signature Hyderabadi Polish for a lasting luster."
  ],
  "features": "A striking Panakala Haaram featuring five prominent square-cut emeralds, each meticulously framed by a halo of sparkling Polki diamonds. The design is further enhanced with interspersed Polki diamond accents, adding a touch of ethereal charm. The links are intricately crafted in gold, offering both flexibility and durability. The overall design marries traditional South Indian aesthetics with a modern sensibility.",
  "colors": [
    "Lustrous Gold",
    "Deep Green Emeralds",
    "and Brilliant White (Polki) Diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "grand celebrations (like grahapravesam)",
    "or milestone anniversaries. A magnificent statement piece for brides during muhurtham or for any special occasion where you want to exude timeless elegance."
  ],
  "description": "A timeless heirloom piece showcasing the rich heritage of South Indian jewelry design. The combination of high-quality emeralds and uncut Polki diamonds exudes opulence and sophistication. This Panakala Haaram is a symbol of prosperity and marital bliss, making it an exceptional addition to any jewelry collection. The Hyderabadi polish ensures a lasting shine and enhances the overall beauty of the piece.",
  "tags": [
    "Necklace",
    "Haaram",
    "Panakala Haaram",
    "Emerald",
    "Panna",
    "Polki",
    "Uncut Diamonds",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Grand Jewelry",
    "Graha Pravesam",
    "Muhurtham",
    "Choker",
    "Guttapusalu",
    "Kasulaperu",
    "Addigai"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0018_2536",
  "collection": "radhe"
}