{
  "id": "earrings-053",
  "title": "Navarathna Studs: Modern Heritage Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Faceted Red Ruby (approx. 2 carats total weight)",
    "Cubic Zirconia (CZ) stones. The gold has a rich",
    "warm tone indicative of traditional South Indian craftsmanship."
  ],
  "features": "These earrings feature a geometric, contemporary design inspired by traditional South Indian motifs. The central ruby is square-cut and bezel-set, surrounded by a halo of sparkling CZ stones. The openwork design gives a light and airy feel, blending modern aesthetics with a touch of heritage. The setting showcases intricate metalwork with a high polish finish.",
  "colors": [
    "The color palette is dominated by the vibrant red of the ruby",
    "complemented by the warm yellow of the gold",
    "and the brilliant white of the CZ stones",
    "creating a striking and eye-catching contrast."
  ],
  "occasions": [
    "Perfect for both traditional occasions and modern celebrations. Ideal for a Diwali gathering",
    "a wedding reception",
    "or adding a touch of elegance to your everyday wear. Suitable for festivals like Sankranti and Ugadi."
  ],
  "description": "These earrings offer a unique blend of modern design and traditional South Indian craftsmanship. The high-quality materials ensure durability and lasting beauty. The vibrant color combination and sparkling stones make these earrings a statement piece. The Hyderabadi polish gives the gold a rich, luxurious luster.",
  "tags": [
    "Earrings",
    "Studs",
    "Gold",
    "Ruby",
    "CZ",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Navarathna",
    "Modern Jewelry",
    "Ethnic Jewelry",
    "Party Wear",
    "Festival Jewelry",
    "Temple Jewellery",
    "Kempu",
    "Butalu"
  ],
  "original_id": "diamond_jewellery_731405b1-638b-47e8-a519-a879a89a646c_0135",
  "collection": "diamond"
}