{
  "id": "necklaces-852",
  "title": "The Empress Diamond Haaram Set: A Timeless Statement of Elegance",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "18K Yellow Gold",
    "featuring brilliant-cut Diamonds (VS Clarity",
    "G Color). Accented with a vibrant Ruby (Cabochon Cut) and Emerald. Adorned with lustrous South Sea Pearls. Exhibits a fine Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "The Haaram features a meticulously crafted floral motif diamond setting. A central Ruby cabochon adds a touch of royal color, complemented by a single Emerald accent above. The necklace culminates in a pearl-studded pendant. The matching Jhumka earrings showcase a delicate floral design with a pearl drop, echoing the necklace's elegance. Features a classic 'U' shaped design.",
  "colors": [
    "Predominantly Gold and Diamond white",
    "with striking Ruby red and Emerald green accents. The pearls add a soft",
    "creamy luminescence."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "Seemantham ceremonies",
    "and grand celebrations. This set also makes a sophisticated statement piece for high-end events and special occasions."
  ],
  "description": "This Haaram set is a true investment piece, blending timeless design with exceptional craftsmanship. The brilliant diamonds, coupled with the vibrant Ruby and Emerald, create a mesmerizing sparkle. The South Sea Pearls add a touch of classic charm. This set is a symbol of prosperity and heritage, perfect for passing down through generations. The Hyderabadi Polish ensures lasting brilliance.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "18K Gold",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Festive Jewelry",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Indian Jewellery"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0384_1539",
  "collection": "haaram"
}