{
  "id": "earrings-090",
  "title": "Emerald Radiance Chandbali Jhumka - Manoharam Kundan Vibha",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish. Features faceted Emerald cabochons of fine quality",
    "shimmering CZ (Cubic Zirconia) stones",
    "and lustrous golden-hued pearls. The intricate framework is crafted with meticulous detail."
  ],
  "features": "Classic Chandbali design with a modern twist. The emerald teardrop is surrounded by a halo of sparkling CZ stones, atop a filigree framework adorned with more CZs. Delicate golden pearl drops (gundu pusalu) add movement and elegance. The detailed setting style and the Hyderabadi polish enhances the gold's luster.",
  "colors": [
    "Primarily gold with a vibrant emerald green accent",
    "complemented by the clear sparkle of the CZ stones and the soft golden hue of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals like Diwali (Deepavali)",
    "or any special occasion where you want to make a statement. Also suitable for contemporary events and celebrations",
    "blending traditional charm with modern style."
  ],
  "description": "These Chandbali Jhumkas offer a unique blend of traditional South Indian artistry and contemporary design. The high-quality emeralds, sparkling CZs, and the rich gold finish create a luxurious and eye-catching piece. Handcrafted with precision by skilled artisans, these earrings are a valuable addition to any jewelry collection, representing timeless elegance and cultural heritage.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Karnamulu",
    "Earrings",
    "Gold Jewelry",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "Kundan",
    "Manoharam",
    "Vibha",
    "Gundu Pusalu",
    "Ethnic Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "diamond_jewellery_bbbccc7a-78d0-41c9-995f-094d3501ac8d_0188",
  "collection": "diamond"
}