{
  "id": "necklaces-870",
  "title": "Magnificent Floral Diamond Haaram with Matching Jhumka Set - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Crafted in high-purity 22K Gold with Hyderabadi Polish. Adorned with dazzling",
    "meticulously selected brilliant-cut CZ Diamonds",
    "interspersed with Emeralds and Rubies. Features lustrous South Sea Pearls. Gold Mesh chain."
  ],
  "features": "This exquisite Haaram showcases intricate floral motifs, a quintessential design element in South Indian jewelry. Delicate Diamond-studded peacock motifs, a symbol of beauty and prosperity (Subham), enhance the neckline. The matching Jhumka earrings mirror the necklace's floral pattern, creating a cohesive and elegant set. The setting showcases expert craftsmanship with a fine, secure hold. Floral pendant with Pearl drops.",
  "colors": [
    "Predominantly brilliant White (Diamonds) with rich Gold accents. Subtle touches of Emerald Green and Ruby Red for a vibrant",
    "traditional color palette. The Pearls add a soft",
    "luminous touch."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "receptions",
    "Seemantham (baby shower)",
    "bridal showers",
    "and other celebratory events. Its timeless design also makes it suitable for cultural performances and formal gatherings."
  ],
  "description": "This Diamond Haaram set is a true investment, blending traditional South Indian artistry with contemporary design sensibilities. Its impeccable craftsmanship, high-quality materials, and cultural significance make it a cherished heirloom piece, perfect for passing down through generations. The brilliance of the diamonds, combined with the richness of the gold and the elegance of the pearls, creates a stunning visual impact. Own a piece of Hyderabad's rich jewelry heritage.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace Set",
    "South Indian Jewelry",
    "Diamond Jewelry",
    "Gold Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Pearls",
    "Emeralds",
    "Rubies",
    "Vivaha",
    "Seemantham",
    "Subham",
    "Rani Haar",
    "Haram"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0403_1557",
  "collection": "haaram"
}