{
  "id": "waistbands-036",
  "title": "Emerald & Diamond Vaddanam - A Timeless Expression of Bridal Elegance",
  "category": "waistbands",
  "original_type": "Belt",
  "materials": [
    "Crafted in high-purity gold with a Hyderabadi Polish. Adorned with sparkling Diamonds (17.90 carats",
    "3797 pieces)",
    "two brilliant-cut Rubies (4.70 carats)",
    "and eighteen vibrant Emeralds (15.82 carats). Features fifteen lustrous South Sea Pearls (55.75 carats)."
  ],
  "features": "This exquisitely crafted Vaddanam features a traditional belt design, meticulously embellished with floral and paisley motifs using pavé-set diamonds. Square-cut emeralds are interspersed throughout, adding a touch of regal charm. The delicate pearl drops lend a graceful, swaying movement. The craftsmanship reflects the legacy of Hyderabadi jewelry making, blending antique aesthetics with modern sparkle.",
  "colors": [
    "Radiant gold provides a warm backdrop for the dazzling diamonds",
    "vibrant emerald green",
    "deep ruby red",
    "and the soft",
    "creamy white of the South Sea pearls."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "including Muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "and other grand celebrations. Its versatility also makes it suitable for upscale contemporary events and formal gatherings."
  ],
  "description": "A heirloom-quality piece, this Vaddanam represents a significant investment in timeless beauty and cultural heritage. The combination of diamonds, emeralds, and pearls symbolizes prosperity, fertility, and good fortune. The exquisite craftsmanship ensures durability, making it a cherished possession for generations to come. The Hyderabadi Polish enhances the gold's luster, creating a captivating radiance.",
  "tags": [
    "Vaddanam",
    "Oddaanam",
    "Kamarband",
    "Diamond Belt",
    "Emerald",
    "Ruby",
    "South Sea Pearls",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Antique Finish",
    "Muhurtham",
    "Seemantham",
    "ఒడ్డాణం",
    "వడ్డాణం",
    "నడుము పట్టీ"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-11-18-03 2_2172",
  "collection": "sjpl"
}