{
  "id": "necklaces-1581",
  "title": "Blossom Diamond Haaram: A Symphony of Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold (85.750 GH Gross Weight)",
    "Brilliant Cut Diamonds (0.77 Carat Diamond Weight). Features a stunning array of marquise and pear-shaped diamonds in varying sizes",
    "meticulously set for maximum brilliance. Diamond Clarity: SI. Diamond Color: GH."
  ],
  "features": "This exquisite two-strand Haaram features a repeating floral motif, each blossom delicately crafted with marquise and pear-shaped diamonds radiating from a central cluster. The design incorporates both symmetrical and asymmetrical arrangements, creating a dynamic yet harmonious aesthetic. A subtle 'Hyderabadi Polish' enhances the brilliance of the white gold setting. Each flower has pear-shaped diamond leaves dangling. The use of various diamond shapes is a modern interpretation of traditional Telugu jewelry design.",
  "colors": [
    "Predominantly white and clear",
    "with the bright white gold providing a lustrous backdrop for the dazzling diamonds."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivah)",
    "receptions",
    "and upscale social gatherings. Its contemporary design also makes it suitable for modern cocktail parties and formal events",
    "adding a touch of timeless elegance to any ensemble. Ideal for the modern Telugu bride."
  ],
  "description": "This Diamond Haaram is a testament to exquisite craftsmanship and timeless design. The brilliant-cut diamonds, meticulously set in white gold, create a breathtaking display of sparkle. A versatile piece that blends tradition with modern sensibilities, this haaram will be a cherished heirloom for generations to come. Its lightweight design ensures comfortable wear, making it ideal for extended celebrations.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "White Gold Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Contemporary Jewelry",
    "Floral Design",
    "Fine Jewelry",
    "Diamonds",
    "Bridal Jewelry",
    "Vivah",
    "Reception",
    "Modern Haaram"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-45_2286",
  "collection": "sjpl"
}