{
  "id": "earrings-067",
  "title": "Emerald and Diamond Openwork Gold Jhumka Earrings - \"Paccha Kalla Jhumkalu\"",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold (Pachalu Bangaram)",
    "Emeralds (Paccha Rallu)",
    "Polki Diamonds (Undiluted Diamonds)",
    "Rubies (Manikyam)",
    "Cultured Pearls (Mutyalu). Features a signature Hyderabadi Polish for lasting luster."
  ],
  "features": "These exquisite Jhumka earrings showcase intricate openwork detailing, typical of South Indian temple jewelry. The earrings feature a floral motif topper, centered with a striking emerald and surrounded by brilliant Polki diamonds. The bell-shaped Jhumka is adorned with a delicate filigree pattern embellished with Polki diamonds, and accented with rubies. Dangling from the base are luminous cultured pearls, adding a touch of elegance and movement. The openwork design enhances the overall brilliance and allows light to pass through the gemstones, maximizing their sparkle.",
  "colors": [
    "Primarily gold with vibrant green emeralds",
    "fiery red rubies",
    "and luminous white diamonds and pearls. The gold provides a warm",
    "luxurious base",
    "while the gemstones add pops of contrasting color."
  ],
  "occasions": [
    "Perfect for weddings (Pendli)",
    "festivals (Pandugalu)",
    "special occasions (Visesha Sandarbhalu)",
    "and cultural celebrations. Ideal for a Seemantham ceremony",
    "half-saree function (Voni Function)",
    "or any event where you want to showcase your rich heritage."
  ],
  "description": "These Jhumkas blend traditional South Indian design with modern sensibilities. The exceptional craftsmanship and the use of high-quality gemstones make this a valuable and timeless piece. The openwork design and pearl drops offer a lightweight and comfortable wear. This is a statement piece embodying cultural richness and refined aesthetics.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Gold Earrings",
    "Emerald",
    "Polki Diamond",
    "Ruby",
    "Pearls",
    "Kalla Jhumkalu",
    "Pendli",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "traditional",
    "designer earrings",
    "South Indian Earrings",
    "Pachalu Bangaram",
    "Pachalu Rallu",
    "Manikyam",
    "Mutyalu"
  ],
  "original_id": "diamond_jewellery_8c4fcf53-bc0a-4ecd-b4e4-5b8323d4fdb6_0156",
  "collection": "diamond"
}