{
  "id": "necklaces-369",
  "title": "The 'Ratna Haar': Exquisite Diamond and Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Finest Quality Round Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color)",
    "Emerald Cabochons (Natural",
    "Untreated)",
    "Natural Ruby Accents",
    "South Sea Pearls. Features signature Hyderabadi Polish for lasting luster."
  ],
  "features": "This statement necklace features intricate floral filigree design with a striking diamond pave setting. The central motif showcases a green emerald cabochon surrounded by a halo of sparkling diamonds and natural ruby accents. A larger, matching emerald-centered pendant hangs gracefully below, embellished with delicate pearl drops. The necklace's gold chain is designed for comfort and showcases the brilliant diamond work.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant green (emerald) and red (ruby) accents. Pearl drops add a touch of creamy white."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (vivahaalu)",
    "receptions",
    "engagement ceremonies",
    "and important festivals like Sankranthi or Diwali. Its modern design also makes it suitable for upscale parties and special events."
  ],
  "description": "This 'Ratna Haar' is a testament to timeless elegance and exceptional craftsmanship. The exquisite combination of diamonds, emeralds, rubies, and pearls reflects South Indian heritage while embracing modern design sensibilities. The use of high-quality materials ensures lasting beauty and value. Its intricate details and striking color combination will make you the center of attention. A true heirloom piece to be cherished for generations. 'Swarna alaankaarana' (golden adornment) at its finest.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Ruby Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Fine Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Festive Jewelry",
    "Alaankaarana",
    "Vaddanam"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0483_0665",
  "collection": "diamond"
}