{
  "id": "earrings-069",
  "title": "Floral Heritage Stud Earrings - Bottu Jimmiki (బొట్టు జిమ్మికి)",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "High-quality CZ Diamonds",
    "Ruby",
    "and Emerald. Featuring a fine Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "Intricately crafted floral design inspired by traditional South Indian motifs. The central cluster features a carefully arranged ruby and emerald gemstone accents, surrounded by sparkling CZ Diamonds. The delicate filigree work adds a touch of vintage charm, blending seamlessly with the modern design. The classic bottu style is elevated with a contemporary flair.",
  "colors": [
    "Rich Gold with accents of deep red (ruby)",
    "vibrant green (emerald)",
    "and dazzling white (CZ diamonds). This vibrant color combination is auspicious in South Indian tradition."
  ],
  "occasions": [
    "Perfect for everyday wear or special occasions like Diwali",
    "Ugadi",
    "weddings",
    "and festive celebrations. An ideal addition to your traditional attire for Seemantham or half-saree functions",
    "adding a touch of timeless elegance."
  ],
  "description": "Handcrafted by skilled artisans from Hyderabad, these earrings showcase exquisite craftsmanship and attention to detail. The combination of precious metals and gemstones ensures lasting beauty and value. Symbolizes prosperity and good fortune, making it a cherished heirloom piece. Lightweight and comfortable to wear, providing both style and ease.",
  "tags": [
    "Earrings",
    "Studs",
    "Bottu Jimmiki",
    "Jimmiki",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Gold Earrings",
    "CZ Diamonds",
    "Ruby",
    "Emerald",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "Festive Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Polish",
    "Floral Design",
    "filigree"
  ],
  "original_id": "diamond_jewellery_910a1d5d-c69a-4150-8da5-d09f00d47af9_0159",
  "collection": "diamond"
}