{
  "id": "necklaces-434",
  "title": "Royal Diamond Haaram with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold setting. Features 4572 dazzling diamonds totaling 16.15 carats. Adorned with 4 rubies totaling 8.25 carats",
    "4 emeralds totaling 6.35 carats and 85 Natural pearls totaling 36.26. Hyderabadi Polish."
  ],
  "features": "A magnificent three-strand haaram showcasing a complex pattern. The ornate pendant features a central emerald surrounded by intricate diamond detailing with hanging pearl drops. Two flanking diamond flowers with sapphire accents at the top of the pendant. Superior cut and clarity diamonds are meticulously set to maximize brilliance and fire. Locket Details: 702 diamonds totaling 2.53 carats, 1 ruby totaling 2.75 carats, 1 emerald totaling 1.75 carats and 12 natural pearls totaling 29.93.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "with vibrant green (emeralds)",
    "red (rubies)",
    "purple (sapphires) and subtle pink (pearls) accents. Traditional combination symbolizing prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for bridal wear (pellikuturu)",
    "weddings (vivaham)",
    "engagement (nischitartham)",
    "and grand festive celebrations (pandugalu). This haaram will instantly elevate any traditional attire",
    "especially suitable for muhurtham",
    "seemantham",
    "or half-saree functions."
  ],
  "description": "A timeless piece blending traditional South Indian design with modern elegance. The superior craftsmanship and high-quality materials ensure lasting beauty and durability. The use of authentic emeralds, rubies, and diamonds symbolizes wealth, prosperity, and happiness, making it a valuable heirloom piece. The haaram's intricate design reflects the rich cultural heritage of Hyderabad and South India.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emeralds",
    "Rubies",
    "Gold Necklace",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Vivaham",
    "Pellikuturu",
    "Pandugalu",
    "Kanthabharanam",
    "Diamonds",
    "Natural Pearls"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-11 2_0875",
  "collection": "diamond"
}