{
  "id": "necklaces-1559",
  "title": "Elegant Statement Collar Necklace with Floral and Peacock Motif",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (GH) with Rhodium Plating. Features natural fancy multi-colored sapphires",
    "white diamonds",
    "and a central ruby. Total gross weight 46.870 grams."
  ],
  "features": "This exquisite collar necklace features two distinct sections: one a detailed floral design with diamond-studded petals, and the other showcases a graceful peacock motif adorned with a captivating mix of colored sapphires and diamonds. The design uses a pavé setting style to maximize the sparkle of the diamonds and showcases the vibrant colors of the sapphires. The peacock's eye is marked by a single ruby.",
  "colors": [
    "The necklace features a color scheme dominated by white diamonds and gold",
    "beautifully contrasted by the vibrant mix of colored sapphires",
    "including pink",
    "yellow",
    "green",
    "and lavender. The ruby provides a striking focal point."
  ],
  "occasions": [
    "Ideal for special occasions such as weddings",
    "receptions",
    "and high-end parties. A modern twist on traditional Telugu jewelry",
    "suitable for contemporary celebrations."
  ],
  "description": "This is a true statement piece with a unique blend of floral and peacock elements. The high-quality craftsmanship and carefully selected gemstones ensures both luxury and durability. The design is guaranteed to turn heads and add a touch of sophistication to any outfit. It offers a fresh approach to classic South Indian jewelry, making it a perfect heirloom piece.",
  "tags": [
    "Necklace",
    "Collar Necklace",
    "Diamond Jewelry",
    "Sapphire Jewelry",
    "Peacock Motif",
    "Floral Design",
    "Statement Jewelry",
    "Wedding Jewelry",
    "Occasion Wear",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Modern Jewelry",
    "Fancy Sapphires",
    "Ruby Accent"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-33 3_2238",
  "collection": "sjpl"
}