{
  "id": "necklaces-1067",
  "title": "Heirloom Polki Diamond Long Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (approx. 30 carats total weight)",
    "Rose-cut Diamonds in Pave Setting"
  ],
  "features": "This majestic Haaram showcases the artistry of traditional Hyderabad craftsmanship. The design features alternating floral and oval motifs, meticulously set with uncut Polki diamonds. The center pendant boasts a pear-shaped Polki diamond embraced by a intricate gold filigree and pave diamond detailing. The antique finish adds a regal touch, reminiscent of Mughal era jewelry.",
  "colors": [
    "Golden Yellow (Gold)",
    "White (Polki Diamonds)",
    "Hint of Champagne (Antique Finish)"
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaham/పెళ్లి)",
    "engagement ceremonies",
    "Seemantham (శీమంతం)",
    "and milestone anniversaries. This Haaram is a statement piece that will elevate any traditional South Indian attire",
    "especially silk sarees like Kanjeevaram or Paithani."
  ],
  "description": "A true heirloom piece, this Polki diamond Haaram is an investment in tradition and beauty. Each Polki diamond is hand-selected for its unique character and brilliance. The Hyderabadi polish ensures a lasting luster, while the intricate design reflects the rich cultural heritage of South India. The substantial gold weight adds to its value and ensures its durability for generations to come. Own a piece of history and create new memories with this exquisite necklace.",
  "tags": [
    "Polki Diamond Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Antique Finish",
    "Traditional Jewelry",
    "Uncut Diamonds",
    "22K Gold",
    "Heirloom Jewelry",
    "Vivaham",
    "Kantaharam",
    "పెళ్లి",
    "కంఠహారం"
  ],
  "original_id": "radhe_diam_DPNK8-1573_2480",
  "collection": "radhe"
}