{
  "id": "necklaces-1537",
  "title": "Emerald Kundan Pearl Statement Haaram - Pachala Haram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "Brilliant Cut Diamonds (SI Clarity",
    "GH Color)",
    "Natural South Sea Pearls",
    "Emerald Cabochons. Showcases exquisite Hyderabadi Polish."
  ],
  "features": "This stunning Haaram features a floral design, meticulously handcrafted with Kundan setting that enhances the brilliance of each diamond. Intricate filigree work and pearl droplet accents add a touch of elegance. The centerpiece features a central Emerald cabochon, complemented by a larger teardrop pendant also set with emerald. Classic layered design evoking royal Telugu heritage.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emerald)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Ideal for grand occasions such as Telugu weddings",
    "Muhurtham",
    "Seemantham ceremonies",
    "formal parties",
    "or any event where you desire to make a statement. Perfect for brides seeking a traditional yet modern look."
  ],
  "description": "This Emerald Kundan Haaram is a testament to timeless elegance and exceptional craftsmanship. The combination of sparkling diamonds, lustrous pearls, and vibrant emeralds creates a captivating piece that embodies grace and sophistication. A valuable heirloom piece, handcrafted in Hyderabad, the city of pearls, ensuring the highest quality and lasting beauty. A symbol of prosperity and good fortune, making it an auspicious choice for brides.",
  "tags": [
    "Haaram",
    "Pachala Haram",
    "Kundan Jewelry",
    "Emerald Necklace",
    "Bridal Necklace",
    "South Indian Jewelry",
    "Telugu Jewellery",
    "22K Gold",
    "Diamond Necklace",
    "Pearl Necklace",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Heirloom Jewelry",
    "Contemporary Traditional Jewelry",
    "కంఠాభరణం",
    "ముత్యాల హారం",
    "పచ్చల హారం"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-08 4_2155",
  "collection": "sjpl"
}