{
  "id": "earrings-540",
  "title": "Exquisite Teardrop Ruby and Diamond Danglers - Karna Kundalalu",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Faceted Ruby (estimated 5 carats",
    "good clarity)",
    "Rose Cut Diamonds (estimated total 0.5 carats",
    "SI clarity)",
    "Hyderabadi Polish"
  ],
  "features": "A modern take on the classic Jhumka design. Features a rich, teardrop-shaped ruby as the focal point, surrounded by a halo of shimmering rose-cut diamonds in a prong setting. The ear-stud component features three graduating rose cut diamonds bezel set, providing a delicate yet secure hold. Finished with our signature Hyderabadi polish for exceptional luster and shine. The ruby has a smooth, cabochon-like polished surface with a faceted effect on the edges catching the light beautifully.",
  "colors": [
    "Deep Ruby Red",
    "Warm Yellow Gold",
    "Sparkling White Diamonds"
  ],
  "occasions": [
    "Perfect for evening events",
    "cocktail parties",
    "or adding a touch of sophistication to a modern Indian outfit. Also suitable for special occasions like weddings",
    "anniversaries",
    "and festive celebrations like Diwali and Sankranthi."
  ],
  "description": "A unique blend of traditional Indian aesthetics and contemporary design. The rich ruby symbolizes love and passion, while the diamonds add a touch of timeless elegance. Expertly crafted by our skilled artisans in Hyderabad, showcasing the region's renowned jewelry-making heritage. The Hyderabadi polish ensures a lasting shine and enhances the beauty of the materials. Rose cut diamonds give this piece a vintage feel with modern allure.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Ruby",
    "Diamond",
    "Rose Cut Diamonds",
    "22K Gold",
    "Karna Kundalalu",
    "Indian Jewelry",
    "Hyderabad Jewelry",
    "South Indian Jewelry",
    "Modern Indian Jewelry",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Contemporary Jhumka"
  ],
  "original_id": "jewellery_IMG-20241218-WA0007_1568",
  "collection": "jewellery"
}