{
  "id": "earrings-624",
  "title": "Emerald Blossom Jhumka: Classic Elegance, Modern Sparkle",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold)",
    "Pear-Shaped Emerald (Approx. 1.5ct)",
    "Cubic Zirconia (CZ) Pave Setting",
    "Cultured Pearl Drop. Features a high-quality Hyderabadi polish for a lasting luster."
  ],
  "features": "Features a teardrop-shaped emerald as the primary stone, surrounded by a delicate halo of sparkling CZ stones. Intricate filigree detailing on the 'jhumka' (bell) part creates a captivating pattern. The floral motif connector adds a touch of contemporary design to the classic jhumka shape. The pearl drop adds a traditional touch and graceful movement.",
  "colors": [
    "Predominantly gold with vibrant green from the emerald",
    "and a soft white from the pearls and CZ stones."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals (like Sankranti",
    "Ugadi)",
    "and special occasions. Ideal for pairing with traditional South Indian attire like Kanjeevaram sarees",
    "or to add an ethnic touch to contemporary outfits."
  ],
  "description": "This 'Jhumka' design blends traditional South Indian artistry with modern design aesthetics. The high-quality CZ stones provide brilliance and sparkle, making it a stunning piece. The emerald is selected for its color and clarity, and the Hyderabadi polish ensures a long-lasting shine. Represents good luck and prosperity, making it an auspicious gift.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Emerald",
    "Pearls",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "'Bugada'",
    "'Chevi Poovulu'",
    "Bridal Jewellery",
    "Cubic Zirconia",
    "CZ",
    "Filigree",
    "Indian Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-34 4_2201",
  "collection": "sjpl"
}