{
  "id": "necklaces-438",
  "title": "Emerald & Diamond Grand Haaram with South Sea Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Dwt: 5.11)",
    "brilliant-cut Diamonds (1010 pcs)",
    "Natural Emeralds (Eme: 4.14",
    "2 pcs)",
    "South Sea Pearls (Moti: 19.80",
    "9 pcs). Hyderabadi Polish for lasting luster."
  ],
  "features": "Classic Haaram design featuring intricate filigree work set with dazzling diamonds. A central floral motif is accentuated by two pear-shaped ruby, flanked by green Emeralds to catch the light. Delicate South Sea pearl drops add a touch of timeless elegance. The necklace features a zig-zag design with interspersed diamonds",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with vibrant green emeralds and lustrous white pearls creating a rich and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaaham)",
    "receptions",
    "and milestone celebrations like Seemantham. Also suitable for upscale events and parties."
  ],
  "description": "This majestic Haaram is a true heirloom piece, crafted with the finest materials and impeccable artistry. The combination of diamonds, emeralds, and South Sea pearls creates a captivating statement that will be treasured for generations. Its unique blend of traditional South Indian design and modern sophistication makes it a truly special investment. The Hyderabadi polish ensures lasting brilliance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Seemantham",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Indian Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-44 3_0901",
  "collection": "diamond"
}