{
  "id": "necklaces-1035",
  "title": "Manohari Emerald Bead Gulbandh with Rose Quartz Centerpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emerald Beads (Panna)",
    "Rose Quartz Cabochon",
    "Polki Diamonds. The gold has a traditional Hyderabadi Polish for a rich luster."
  ],
  "features": "This exquisite gulbandh features five strands of meticulously hand-strung emerald beads. The centerpiece is a captivating rose quartz cabochon, surrounded by a halo of uncut Polki diamonds set in a traditional Kundan style. The setting showcases intricate detailing, indicative of skilled craftsmanship passed down through generations.",
  "colors": [
    "Green (Emerald)",
    "Rose (Quartz)",
    "Gold",
    "White (Polki Diamonds). This classic combination exudes elegance and prosperity."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "festive celebrations like Sankranthi",
    "Diwali",
    "and other special occasions. Perfect for adding a touch of timeless elegance to both traditional and contemporary outfits. Suitable for brides seeking a unique and regal look."
  ],
  "description": "This gulbandh is a testament to the enduring beauty of South Indian craftsmanship. The combination of vibrant emeralds, the soft blush of the rose quartz, and the brilliance of the Polki diamonds creates a piece that is both eye-catching and culturally significant. The Hyderabadi polish ensures long-lasting shine and enhances the gold's richness. A unique heirloom piece, perfect for passing down through generations.",
  "tags": [
    "Gulbandh",
    "Choker",
    "Emerald",
    "Panna",
    "Rose Quartz",
    "Polki Diamonds",
    "Kundan Jewelry",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Indian Wedding",
    "Telugu Jewelry",
    "Jadau Jewelry",
    "Heirloom Jewelry",
    "Festival Jewelry"
  ],
  "original_id": "radhe_diam_DPCK8-1257_2448",
  "collection": "radhe"
}