{
  "id": "necklaces-1450",
  "title": "Elegant Ruby and Diamond Pendant Necklace - A Timeless Haaram Design",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Fine Diamonds (VS Clarity)",
    "Faceted Ruby Center Stone",
    "Ruby Drops. Hyderabadi Polish for lasting luster."
  ],
  "features": "Intricate filigree work surrounding the central Ruby, adorned with sparkling diamonds in a pave setting. The pendant features a classic teardrop design, complemented by three delicate Ruby drops. The chain consists of alternating diamond and gold sections, showcasing a modern take on traditional Haaram design. The Ruby center is an emerald cut, while the smaller rubies are pear cut.",
  "colors": [
    "Yellow Gold",
    "Brilliant White Diamonds",
    "Deep Red Rubies. A vibrant and auspicious color palette deeply rooted in South Indian tradition."
  ],
  "occasions": [
    "Perfect for engagements",
    "weddings (Vivahalu)",
    "receptions",
    "and other special occasions. Also suitable for half-saree functions (Chinnavayasu Utsavam) and contemporary evening wear."
  ],
  "description": "This pendant necklace blends traditional South Indian design with modern sensibilities. The high-quality gemstones and meticulous craftsmanship ensure lasting beauty and value. The ruby, considered auspicious, symbolizes love and passion, making it an ideal gift for a loved one. The Hyderabadi polish ensures the gold maintains its brilliant shine for years to come. Versatile design makes it suitable for both traditional and contemporary outfits.",
  "tags": [
    "Haaram",
    "Necklace",
    "Ruby",
    "Diamond",
    "Pendant",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "Chinnavayasu Utsavam",
    "Engagement",
    "Vivahalu",
    "Kantaabharanam",
    "filigree",
    "Hyderabadi Polish"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-49_2068",
  "collection": "sjpl"
}