{
  "id": "necklaces-247",
  "title": "Lakshmi Kasu Haaram - Divine Grace Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "meticulously studded with CZ (Cubic Zirconia) stones. Features Ruby and Emerald accents.  Crafted with meticulous attention to detail."
  ],
  "features": "This exquisite Haaram showcases a classic two-row design, embellished with intricately patterned CZ stones. The centerpiece features a Lakshmi pendant, embodying prosperity and auspiciousness. Traditional temple jewelry influences are visible in the pendant's design and the use of small, delicate bead dangles. The necklace is also adorned with Goddess Lakshmi motifs in the nakshi style.",
  "colors": [
    "Predominantly Gold with dazzling White CZ stones. Accents of Emerald Green and Ruby Red for a pop of traditional color."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "and other auspicious occasions such as Seemantham (శ్రీమంతం)",
    "Half-Saree Function",
    "or any grand celebration. This Haaram adds a touch of regal elegance to any outfit."
  ],
  "description": "This Lakshmi Kasu Haaram is a timeless piece that blends traditional South Indian aesthetics with modern design elements. The meticulous craftsmanship and high-quality materials ensure lasting beauty and durability. It's not just jewelry; it's a symbol of cultural heritage and divine blessings, making it a cherished heirloom for generations to come. The Hyderabadi polish gives it a rich, luxurious finish.",
  "tags": [
    "Kasu Haaram",
    "Lakshmi Pendant",
    "Temple Jewelry",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "CZ Stones",
    "సంప్రదాయ నెక్లెస్",
    "పెళ్ళి నెక్లెస్",
    "కాసుల హారం",
    "లక్ష్మి పెండెంట్",
    "టెంపుల్ జ్యువెలరీ"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0327_0524",
  "collection": "diamond"
}