{
  "id": "necklaces-673",
  "title": "Emerald and Diamond Cascade Haaram - \"Panchaloha Prabha\"",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold",
    "Natural Emeralds (Marquise Cut",
    "Fine Green Color",
    "VS Clarity)",
    "Natural Diamonds (Round Brilliant Cut",
    "GH Color",
    "SI Clarity). Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "This exquisite Haaram features three graduated strands of meticulously set diamonds that gracefully cascade down to meet stunning emerald pendants. The emeralds are framed with delicate diamond clusters resembling floral motifs. The setting is a modern prong setting, allowing maximum light to enhance the brilliance of both the emeralds and diamonds. Combines traditional Haaram structure with contemporary design elements.",
  "colors": [
    "Rose Gold",
    "Vibrant Green (Emeralds)",
    "Sparkling White (Diamonds)"
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "high-end parties",
    "and special celebrations. A statement piece ideal for modern brides or to elevate any formal attire. Excellent choice for a seemantham (baby shower) or other family gatherings where a touch of elegance is desired."
  ],
  "description": "This haaram beautifully blends contemporary aesthetics with traditional South Indian design sensibilities. The combination of lush green emeralds and dazzling diamonds creates a striking visual impact. The high-quality materials ensure lasting beauty and value. This piece is a testament to skilled craftsmanship and represents a modern take on a timeless classic.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Rose Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Gemstone Necklace",
    "Bridal Jewelry",
    "Indian Wedding",
    "Contemporary Jewelry",
    "Panchaloha",
    "Seemantham",
    "Reception Jewelry",
    "Party Wear"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-44_1179",
  "collection": "diamond"
}