{
  "id": "earrings-306",
  "title": "Emerald-Kissed Swarna Jhumkas: A Symphony of Tradition and Sparkle",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "High-quality gold-plated alloy intricately set with dazzling cubic zirconia (CZ) stones. Features a central emerald-cut green gemstone (likely simulated emerald) and delicately dangling freshwater pearls. Hyderabadi-inspired polish for a radiant shine."
  ],
  "features": "Classic Jhumka design, featuring a floral stud encrusted with CZ stones and a central simulated emerald. The dome-shaped Jhumka bell is adorned with an intricate openwork design, accented by cascading strings of pearl embellishments. The open work design provides a delicate yet sturdy feel, allowing light to reflect beautifully, enhancing its brilliance.",
  "colors": [
    "Predominantly golden",
    "complemented by the lush green of the simulated emerald and the creamy white of the pearls. The combination creates a rich",
    "sophisticated palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "festivals like Sankranthi and Diwali",
    "traditional Telugu ceremonies like Seemantham (baby shower) and Half-Saree functions. Equally stunning for upscale parties and modern celebrations."
  ],
  "description": "These Jhumkas are a celebration of South Indian heritage, reimagined for the modern woman. The intricate detailing and the use of emerald and pearls evoke a sense of timeless elegance, while the high-quality CZ stones add contemporary sparkle. Lightweight and comfortable to wear, these Jhumkas are a versatile addition to any jewelry collection, ensuring you make a statement at every event. A perfect blend of traditional craftsmanship and modern design.",
  "tags": [
    "Jhumka",
    "Karnapatram",
    "Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emerald",
    "Pearls",
    "CZ Stones",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Traditional Earrings",
    "Festive Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Gold Plated"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-35 17_1335",
  "collection": "diamond"
}