{
  "id": "necklaces-235",
  "title": "Enchanting Mogra Haaram with Emerald and Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality gold with a lustrous finish. Adorned with a central pear-shaped emerald of exceptional clarity. Embellished with sparkling cubic zirconia with ruby accent stones. Features delicate pearl dangles."
  ],
  "features": "This contemporary Haaram reimagines traditional floral motifs in a modern design. The mogra (jasmine flower) design is intricately set with high quality CZ stones and small rubies in between adding a pop of color. The central emerald is the focal point. Pearl drops add a touch of traditional elegance. The setting emphasizes the brilliance of the stones, creating a mesmerizing sparkle.",
  "colors": [
    "Predominantly gold with vibrant green from the emerald",
    "subtle red highlights from the rubies",
    "and a soft pearl white."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "or any special occasion where you want to make a statement. Its versatile design makes it suitable for both traditional attire and contemporary ensembles. Ideal for Muhurtham",
    "Seemantham",
    "or any grand celebration."
  ],
  "description": "This haaram is a perfect fusion of tradition and modernity. The meticulously crafted mogra design and vibrant gemstone colors make it a timeless piece. The high-quality materials and craftsmanship ensure durability and lasting beauty. Its design reflects South Indian heritage while maintaining a contemporary flair.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Mogra",
    "Emerald",
    "Ruby",
    "Pearl",
    "CZ",
    "Cubic Zirconia",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Seemantham",
    "Muhurtham",
    "Contemporary Design",
    "Jadau",
    "Gundla Mala",
    "Kasu Mala",
    "Addigai",
    "Kante"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0315_0512",
  "collection": "diamond"
}