{
  "id": "necklaces-918",
  "title": "Chandrika Haar: Exquisite Polki Diamond and Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Polki Diamonds (Uncut Diamonds)",
    "Ruby (Manikyam)",
    "Emeralds (Pachalu)",
    "and South Sea Pearls (Mutyalu). Gold has a rich",
    "warm tone indicative of high purity."
  ],
  "features": "This Chandrika Haar blends traditional South Indian motifs with a modern aesthetic. The necklace features a Chevron-patterned design set with sparkling Polki diamonds. The center pendant showcases a vibrant Ruby, flanked by Emeralds in delicate floral settings, creating a captivating focal point. South Sea Pearls add a touch of elegance and movement. The intricate filigree work enhances the overall richness of the design.",
  "colors": [
    "Predominantly gold with a stunning contrast between the deep red of the Ruby",
    "the vibrant green of the Emeralds",
    "the sparkle of the Polki diamonds",
    "and the creamy hue of the South Sea Pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "and other grand celebrations. Its contemporary design also makes it suitable for upscale events and formal gatherings. It can also be worn for special religious events (Pujas) and festive occasions like Diwali or Sankranti."
  ],
  "description": "This Haar is a fusion of traditional craftsmanship and modern design. The use of Polki diamonds and South Sea Pearls gives it a unique appeal, while the Ruby and Emeralds add a touch of royal grandeur. The Hyderabadi polish ensures a lasting luster and durability, making it a treasured heirloom for generations. This piece represents an investment in both beauty and cultural heritage.",
  "tags": [
    "Haar",
    "Polki",
    "Diamond Necklace",
    "Ruby",
    "Emerald",
    "South Sea Pearl",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Vivaaham",
    "Manikyam",
    "Pachalu",
    "Mutyalu",
    "22K Gold",
    "Contemporary Jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0312_2379",
  "collection": "necklace"
}