{
  "id": "necklaces-1374",
  "title": "Delicate Diamond Mangalsutra - A Timeless Blend of Tradition and Modernity",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold",
    "Natural Black Beads (పూసలు/Poosalu)",
    "Brilliant-Cut Diamonds (వజ్రాలు/Vajraalu) with VS Clarity. Features a high-shine Hyderabadi Polish for lasting brilliance."
  ],
  "features": "A contemporary take on the traditional Mangalsutra. This necklace features a delicate rose gold chain interspersed with black beads, symbolizing marital harmony and protection from evil eye. The focal point is the diamond floral motifs, adding a touch of elegance and modernity. The setting is a secure prong setting showcasing the brilliance of the diamonds.",
  "colors": [
    "Rose Gold",
    "Black",
    "and Sparkling White (Diamonds). The color palette is deliberately chosen to represent tradition with a modern twist."
  ],
  "occasions": [
    "Perfect for daily wear",
    "anniversary gifts",
    "engagement ceremonies",
    "or as a subtle yet meaningful piece for wedding celebrations (వివాహ వేడుకలు/Vivaaha Vedukalu). Also suitable for modern Indian wear and fusion outfits."
  ],
  "description": "This Mangalsutra provides the perfect blend of traditional significance and contemporary aesthetics. The delicate design ensures it is comfortable and stylish for daily wear. The rose gold complements all skin tones and the high-quality diamonds add enduring value. The black beads and diamond floral motifs represents marital fidelity and prosperity, making it a cherished symbol of love and commitment.",
  "tags": [
    "Mangalsutra",
    "Rose Gold",
    "Diamonds",
    "Black Beads",
    "Pustelu",
    "పుస్తెలు",
    "Poosalu",
    "పూసలు",
    "Vajraalu",
    "వజ్రాలు",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Hyderabadi Jewelry",
    "Anniversary Gift",
    "Wedding Jewelry",
    "Engagement Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-13-41-26 3_1972",
  "collection": "sjpl"
}