{
  "id": "necklaces-301",
  "title": "Diamond Lakshmi Kasu Mala - A Timeless Bridal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold with Rhodium Polish",
    "High-Quality Cubic Zirconia (CZ) Stones",
    "Emerald and Ruby Gemstone Accents",
    "and Natural Freshwater Pearls. Exquisite Hyderabadi craftsmanship."
  ],
  "features": "Classic Lakshmi Kasu design intricately woven into a long, opulent haaram. Features central floral motifs adorned with Ruby and Emerald stones. Embellished with delicate, handcrafted Lakshmi coins and shimmering CZ stones. The design culminates with cascading pearl drops for added elegance.",
  "colors": [
    "Predominantly gold and white due to the gold setting and CZ stones. Accented by the vibrant green of the emerald and rich red of the ruby. Soft white pearls provide a gentle contrast."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings",
    "muhurtham ceremonies",
    "and festive celebrations. An heirloom piece suitable for Seemantham",
    "half-saree functions",
    "and other significant Telugu/South Indian traditions. Can also be styled with modern attire for a statement look."
  ],
  "description": "A statement piece embodying South Indian heritage, showcasing exceptional craftsmanship and design. The intricate Lakshmi Kasu work signifies prosperity and blessings, making it an auspicious choice for brides. The high-quality CZ stones provide a dazzling shine comparable to diamonds, ensuring lasting beauty and value. Crafted with meticulous attention to detail by our skilled artisans in Hyderabad.",
  "tags": [
    "Haaram",
    "Lakshmi Kasu Mala",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "CZ Jewelry",
    "Gold Necklace",
    "Pearl Jewelry",
    "Wedding Necklace",
    "Muhurtham",
    "Seemantham",
    "Indian Jewellery",
    "Hyderabad Jewellery",
    "Kasulaperu"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0390_0587",
  "collection": "diamond"
}