{
  "id": "necklaces-470",
  "title": "Emerald and Ruby Bridal Choker - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "set with high-quality Rubies (Manikyam) and Emeralds (Panna). The diamonds are of VS clarity. Features a smooth Hyderabadi polish for a lasting shine."
  ],
  "features": "This exquisite choker boasts a regal design with a graduated, geometric collar. The central medallion features a square-cut emerald surrounded by intricate filigree work and dazzling diamonds. The detachable pendant showcases a pear-shaped emerald embraced by a floral diamond setting. Delicate gold droplets adorn the edges, adding a touch of traditional South Indian grace. The setting is designed to maximize the brilliance of the stones. The design incorporates temple jewelry elements with a modern twist.",
  "colors": [
    "Primary colors are rich yellow gold",
    "vibrant green from the emeralds",
    "and deep red from the rubies",
    "complemented by the sparkling white of the diamonds. These colors are considered auspicious and highly valued in Telugu weddings."
  ],
  "occasions": [
    "Perfect for weddings (Veedukolu",
    "Muhurtham)",
    "receptions",
    "festive celebrations (Ugadi",
    "Sankranthi)",
    "and other grand occasions. Its elegant design also makes it suitable for high-profile social events and milestone anniversaries. A treasured heirloom piece."
  ],
  "description": "This choker represents the pinnacle of South Indian jewelry craftsmanship. The combination of precious gemstones and expert goldwork makes it a valuable investment. The detachable pendant offers versatility, allowing it to be worn with other necklaces or as a separate pendant. Its timeless design ensures it will be cherished for generations. The symbolism of emeralds (growth, prosperity) and rubies (passion, protection) makes it a meaningful gift.",
  "tags": [
    "Choker",
    "Necklace",
    "Haaram",
    "Emerald",
    "Ruby",
    "Manikyam",
    "Panna",
    "Diamond",
    "Gold",
    "22K",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "કંઠિ હારમ",
    "Kanthi Haaram",
    "Muhurtham",
    "Veedukolu",
    "Ugadi",
    "Sankranthi"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-55 3_0933",
  "collection": "diamond"
}