{
  "id": "necklaces-182",
  "title": "Exquisite Polki & Pink Tourmaline Raani Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22k Gold",
    "meticulously crafted with uncut Polki diamonds and captivating Pink Tourmalines. Features a central Emerald. Crafted with Hyderabadi polish for a lustrous finish."
  ],
  "features": "This Raani Haar features a classic symmetrical design with a contemporary twist. The intricate Polki setting enhances the natural brilliance of the diamonds. The floral motifs are characteristic of South Indian jewelry design. Large, cushion-cut Tourmalines add a vibrant pop of color. Emerald is in the center. Features pear-shaped dangling accents, completing the regal look.",
  "colors": [
    "Primary: Gold (Warm Yellow)",
    "Secondary: Pink (Tourmaline)",
    "Green (Emerald)",
    "White (Polki Diamonds). A harmonious blend of traditional hues."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "and grand celebrations. A statement piece for brides during their Muhurtham or Seemantham ceremonies. Also suitable for elegant galas and special occasions."
  ],
  "description": "A timeless blend of tradition and luxury, this Raani Haar showcases exquisite craftsmanship and high-quality gemstones. The uncut Polki diamonds have natural imperfections that make each piece uniquely special. The classic Raani Haar style is a valuable heirloom to pass down through generations. A stunning piece that commands attention and exudes sophistication.",
  "tags": [
    "Raani Haar",
    "Polki Necklace",
    "Diamond Necklace",
    "Pink Tourmaline",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Vivaha",
    "Muhurtham",
    "Seemantham",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Emerald"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0023_0431",
  "collection": "diamond"
}