{
  "id": "earrings-659",
  "title": "Emerald Dewdrop Chandbali Earrings - Marakathamani Jhumka",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K White Gold setting",
    "adorned with meticulously selected Oval Cut Emeralds of exceptional clarity and vibrant green hue. Encrusted with brilliant-cut Diamonds (VS clarity",
    "G color). The diamonds are pavé-set to maximize sparkle. Features Hyderabadi polish for a lasting shine."
  ],
  "features": "These contemporary Chandbali Jhumkas feature a cascading design with two oval-shaped emeralds gracefully suspended within a delicate diamond halo. The leaf-like diamond setting surrounding each emerald adds a touch of nature-inspired elegance. The intricate detailing showcases the exceptional craftsmanship of our artisans. Modern design with traditional jhumka sensibilities.",
  "colors": [
    "Lustrous white gold",
    "vibrant green emeralds",
    "and dazzling white diamonds create a harmonious and captivating color palette."
  ],
  "occasions": [
    "Perfect for adding a touch of sophisticated glamour to any occasion. Ideal for weddings",
    "engagement parties",
    "receptions",
    "and celebratory events. Also suitable for contemporary Indian wear and evening attire."
  ],
  "description": "These Emerald Dewdrop Chandbali Jhumkas effortlessly blend modern design with timeless elegance. The exceptional quality of the emeralds and diamonds, combined with the superior craftsmanship of our artisans, ensures a lasting heirloom piece. A statement piece that exudes luxury and sophistication.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Chandbali",
    "Emerald",
    "Diamond",
    "White Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Marakathamani",
    "Bridal Jewelry",
    "Engagement Jewelry",
    "Party Wear",
    "Fine Jewelry",
    "Luxury Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-39 3_2247",
  "collection": "sjpl"
}