{
  "id": "necklaces-496",
  "title": "Exquisite Neelambari Peacock Haaram with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-purity Gold (GH) with Kundan setting; embellished with Ruby (0.04ct)",
    "Emerald beads (2.83ct)",
    "Rice Pearls (6.19ct)",
    "round Pearl (3.69ct)",
    "Blue beads (19.74ct) and Emerald carve (69.80ct); Features a radiant Hyderabadi polish for enduring lustre."
  ],
  "features": "A striking peacock motif pendant, meticulously crafted with Kundan setting and intricate detailing. Features a central gemstone. Emerald beads are artistically strung to complement the gemstone's tones. The piece reflects traditional South Indian jewelry craftsmanship blended with modern aesthetic sensibilities. The beads add to the traditional charm.",
  "colors": [
    "Dominant Gold with vibrant green from the beads",
    "enhanced by the blue gemstone of the peacock and white pearl. The combination creates a rich",
    "regal color palette."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (Vivaha)",
    "engagements",
    "milestone birthdays",
    "Seemantham ceremonies",
    "and festive celebrations such as Sankranthi and Ugadi. Also suitable for high-end cultural events and formal gatherings."
  ],
  "description": "This haaram beautifully blends traditional South Indian aesthetics with contemporary elegance. The intricate Kundan setting, coupled with vibrant gemstone accents and Hyderabadi polish, ensures a lasting heirloom-quality piece. A statement piece that radiates timeless beauty and cultural significance, making it a worthy investment.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan",
    "Jadau",
    "Peacock",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional",
    "Festive",
    "Ethnic",
    "Statement Necklace",
    "Neelambari",
    "Pearls",
    "Gemstones",
    "Bridal Jewelry",
    "Vivaha",
    "Seemantham",
    "Ugadi"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-28_0976",
  "collection": "diamond"
}