{
  "id": "earrings-493",
  "title": "Manoharam Ruby and Diamond Jhumka Earrings - A Timeless Masterpiece",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish for enduring shine. Features a central pear-shaped Ruby (approx. 3 carats) with excellent clarity and rich color. Accented with round-cut Rubies and Emeralds. Polki diamonds (uncut diamonds) are meticulously set in a pave setting",
    "adding a touch of brilliance."
  ],
  "features": "These Jhumkas showcase a delicate floral design, blending traditional South Indian motifs with a modern aesthetic. The intricate gold filigree work adds depth and texture. The cascading Polki diamonds create a graceful, dangling effect. The design takes inspiration from nature with leaves and floral elements, meticulously handcrafted by skilled artisans.",
  "colors": [
    "The color palette is a classic South Indian combination of deep red Ruby",
    "vibrant green Emeralds",
    "and the warm glow of 22K gold. The white sparkle of Polki diamonds provides a beautiful contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals",
    "and special occasions. A striking choice for a Bride's jewelry collection or for adding a touch of elegance to any ensemble. Suitable for events like Muhurtham",
    "Reception",
    "and other traditional Telugu ceremonies."
  ],
  "description": "A unique blend of traditional craftsmanship and modern design sensibilities. The use of high-quality gemstones and meticulous detailing ensures both beauty and lasting value. The rich cultural significance and timeless appeal make it a cherished heirloom piece. Made with Hyderabadi craftsmanship with intricate detail, a cultural symbol. The uncut diamond adds a vintage royal vibe.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Ruby",
    "Emerald",
    "Polki Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Muhurtham",
    "Wedding Jewelry",
    "చెవి దుద్దులు",
    "Ruby earrings",
    "Emerald earrings",
    "Uncut Diamonds",
    "Polki",
    "Indian Jewelry",
    "Bridal jewelry"
  ],
  "original_id": "ear_rings_DPER8-1587_2620",
  "collection": "ear"
}