{
  "id": "necklaces-861",
  "title": "Ethereal Emerald & Diamond Raasi Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold",
    "adorned with Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color)",
    "Zambian Emeralds (Excellent Cut",
    "Rich Green Hue)",
    "and South Sea Pearls. Features a signature Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Raasi Haaram showcases intricate filigree work interspersed with vibrant Zambian Emeralds. The design draws inspiration from traditional South Indian motifs, reimagined for modern sensibilities. Delicate South Sea pearls cascade from the bottom section, adding a touch of ethereal beauty. The pendant displays exceptional craftsmanship with an elaborate floral motif, centered around a dazzling emerald.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "with striking accents of deep green (emeralds) and soft pearl white. This classic color combination is highly auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham (శ్రీమంతం)",
    "half-saree functions (పట్టు లంగా ఓణి)",
    "or any grand celebration where you want to make a statement. Can also be styled with contemporary outfits for a touch of regal elegance."
  ],
  "description": "This Raasi Haaram is a symbol of timeless elegance and traditional South Indian artistry. The combination of high-quality diamonds, vibrant emeralds, and lustrous pearls makes it a truly unique piece. Its durable construction ensures it will be a cherished heirloom for generations to come. The Hyderabadi polish guarantees lasting brilliance. Owning this piece is not just acquiring jewelry; it's investing in a legacy.",
  "tags": [
    "Haaram",
    "Raasi",
    "Necklace",
    "South Indian Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "పెళ్ళి నగలు",
    "హారము",
    "కంఠాభరణం",
    "Zambian Emerald",
    "Diamonds",
    "South Sea Pearls",
    "Fine Jewelry"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0394_1548",
  "collection": "haaram"
}