{
  "id": "necklaces-937",
  "title": "Diamond & Gemstone Chandramukhi Haaram - An Elegant South Indian Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish; Brilliant Cut Diamonds (VS Clarity",
    "G Color); Faceted Emerald (Square Cut); Faceted Ruby (Oval Cut); Cultured Pearls"
  ],
  "features": "This Chandramukhi Haaram features a stunning crescent-shaped necklace with concentric rows of dazzling brilliant-cut diamonds. The central pendant is a circular design adorned with ruby, emerald, and diamond accents. Delicate pearl drops gracefully enhance the necklace's lower edge. The Hyderabadi polish gives the gold a rich, lasting shine. The back of the haaram is intricately designed, ensuring both beauty and comfort.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with pops of vibrant green (emerald) and red (ruby). The pearls offer a soft",
    "creamy contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "and other grand celebrations. It's also ideal for Seemantham ceremonies",
    "half-saree functions (Voni Function)",
    "and other traditional South Indian events."
  ],
  "description": "This Chandramukhi Haaram blends traditional design elements with modern sparkle, making it a truly unique piece. The high-quality diamonds and carefully selected gemstones ensure lasting brilliance. The Hyderabadi polish protects the gold, ensuring its radiant luster for years to come. It's a statement piece that celebrates South Indian heritage while embracing contemporary elegance.",
  "tags": [
    "Haaram",
    "Chandramukhi",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Vivaaham",
    "Seemantham",
    "Temple Jewelry",
    "Voni Function",
    "22K Gold",
    "Emerald",
    "Ruby",
    "Pearls",
    "Statement Necklace",
    "Bridal Jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0331_2398",
  "collection": "necklace"
}