{
  "id": "necklaces-1196",
  "title": "Emerald and Diamond Nakshi Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish",
    "Natural Diamonds (5.28 carats)",
    "Natural Rubies (3.33 carats)",
    "Natural Emeralds (2.19 carats)",
    "South Sea Pearls (40.10 carats for necklace and 14.75 for locket)"
  ],
  "features": "Intricate Nakshi work featuring traditional floral motifs is combined with modern diamond setting techniques. The pendant showcases a prominent emerald center stone surrounded by a halo of diamonds, with delicate pearl drops. The necklace’s design includes emeralds strategically placed to enhance the overall aesthetic. The locket also incorporates emerald with pearls. The setting style ensures maximum brilliance and durability.",
  "colors": [
    "Yellow Gold",
    "Sparkling White Diamonds",
    "Rich Green Emeralds",
    "Deep Red Rubies",
    "and Lustrous Cream Pearls create a classic and harmonious color palette."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "engagements ( நிச்சயதార్థం)",
    "Seemantham ceremonies",
    "or any grand celebration where a touch of timeless elegance is desired. Suitable for formal events and can also be styled for modern gatherings."
  ],
  "description": "This Haaram is a beautiful blend of traditional Telugu craftsmanship and modern jewelry design. The use of high-quality diamonds, rubies, emeralds, and South Sea pearls, combined with intricate Nakshi work, makes this piece a true heirloom. It embodies cultural richness while retaining a contemporary appeal. The Hyderabadi polish ensures lasting shine and durability.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "Nakshi Work",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Emeralds",
    "Rubies",
    "Diamonds",
    "Pearls",
    "Hyderabadi Jewelry",
    "Gold Jewelry",
    "22K Gold"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-44_1770",
  "collection": "sjpl"
}