{
  "id": "necklaces-162",
  "title": "Lakshmi Kasu Mala Pendant - A Divine Statement Piece",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "Brilliant Cut Diamonds (SI Clarity",
    "GH Color). Features a traditional Hyderabadi Polish for a rich",
    "lustrous finish."
  ],
  "features": "Exquisite pendant featuring a finely detailed Lakshmi Devi seated on a lotus. The design incorporates intricate filigree work along the sides, embellished with sparkling diamonds. Traditional temple jewellery craftsmanship is evident in every detail, from the goddess's serene expression to the delicate floral motifs. A single gold dhumki (sphere pendant) hangs below, adding a touch of movement and elegance.",
  "colors": [
    "Dominant: Yellow Gold. Accent: Sparkling White (Diamonds). The combination creates a classic and timeless aesthetic."
  ],
  "occasions": [
    "Ideal for weddings (pellillu)",
    "religious ceremonies (poojas)",
    "festivals like Diwali and Dussehra",
    "and traditional events such as Seemantham or Half-Saree functions. Can also be worn for special modern occasions where a touch of cultural heritage is desired."
  ],
  "description": "This pendant is a perfect blend of tradition and elegance. The Lakshmi motif represents prosperity and good fortune, making it a meaningful heirloom piece. The high-quality gold and diamonds ensure lasting value and brilliance. Its unique design is perfect for any modern event but has a cultural value that will always be relevant. The Hyderabadi Polish gives the gold a radiant shine that is instantly captivating.",
  "tags": [
    "Lakshmi Pendant",
    "Kasu Mala",
    "Temple Jewellery",
    "22K Gold",
    "Diamond Pendant",
    "South Indian Jewellery",
    "Traditional Jewellery",
    "Wedding Jewellery",
    "Hyderabadi Jewellery",
    "Pellillu",
    "Pooja",
    "Diwali",
    "Dussehra",
    "Seemantham",
    "Half-Saree",
    "Devotional Jewellery",
    "Goddess Lakshmi",
    "Gold Pendant",
    "Divine Jewellery"
  ],
  "original_id": "diamond_jewellery_ec7dbe71-fe3e-4fac-916e-45128da62d30_0397",
  "collection": "diamond"
}