{
  "id": "necklaces-1593",
  "title": "Dazzling Diamond Cascade Haaram - PMQN2",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finest quality (Fg) Diamonds",
    "estimated total weight 79.600 Fg",
    "set in a durable and lustrous [Assuming Platinum/White Gold based on appearance] alloy. Features both pear-shaped (D.PAN) and marquise-cut (D.MQ) diamonds of varying sizes for optimal brilliance. Precisely set prongs for maximum light reflection."
  ],
  "features": "This stunning haaram boasts a graduated cascade design, featuring rows of meticulously placed diamonds. The arrangement showcases pear-shaped (D.PAN) and marquise-cut (D.MQ) diamonds, creating a visually captivating and modern aesthetic. The central floral motif adds a touch of elegance and femininity. The design utilizes a prong setting to enhance the sparkle of each stone.",
  "colors": [
    "Predominantly white and clear",
    "reflecting the brilliance of the diamonds against the bright white metal setting."
  ],
  "occasions": [
    "Perfect for grand receptions",
    "engagement parties",
    "cocktail evenings",
    "and upscale gatherings. Makes a statement piece for any special occasion",
    "adding a touch of sophistication and glamour."
  ],
  "description": "A true statement piece, this diamond haaram is designed to capture attention and elevate any outfit. The combination of pear and marquise cut diamonds creates a unique and eye-catching design. The meticulously crafted prong setting ensures the longevity and brilliance of each diamond. The quality of the stones and the modern design make this haaram a valuable investment.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "White Gold Jewelry",
    "Platinum Jewelry",
    "Engagement Jewelry",
    "Party Wear",
    "Bridal Necklace",
    "Statement Jewelry",
    "Designer Jewelry",
    "Marquise Cut Diamonds",
    "Pear Shaped Diamonds",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Modern Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-50_2298",
  "collection": "sjpl"
}