{
  "id": "necklaces-1398",
  "title": "Exquisite Diamond and Emerald Raasi Haaram with South Sea Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold with White Gold Polish",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Emeralds (High Quality",
    "Zambian Origin)",
    "South Sea Pearls"
  ],
  "features": "A two-tiered Raasi Haaram featuring intricate floral motifs pave-set with brilliant cut diamonds. The center is adorned with vibrant green emeralds, adding a touch of regality. Delicate South Sea pearl drops are suspended from each tier, providing a graceful movement and classic appeal. Features a delicate, hand-crafted filigree work throughout the design. The gold has a fine Hyderabadi polish for a lasting shine.",
  "colors": [
    "Yellow Gold",
    "White",
    "Green",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Weddings (Vivahaalu)",
    "Engagements (Nischithartham)",
    "Anniversary Celebrations",
    "Grand Receptions",
    "Seemantham",
    "Half-Saree Function"
  ],
  "description": "This Raasi Haaram is a timeless heirloom piece blending traditional design with modern elegance. The superior quality diamonds and emeralds ensure enduring brilliance. The South Sea pearls are known for their luster and represent purity and wisdom. The fine craftsmanship and Hyderabadi polish signify exceptional quality and durability, making it a treasured addition to any jewelry collection. The traditional Haaram design is deeply rooted in South Indian culture and is considered an auspicious adornment.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Raasi Haaram",
    "Emerald Jewelry",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Vajrala Haram",
    "Pachala Haram",
    "Engagement Necklace",
    "Anniversary Gift"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-09 2_2016",
  "collection": "sjpl"
}