{
  "id": "necklaces-802",
  "title": "Floral Fantasy Pearl and Gemstone Haaram - A Symphony of Tradition and Modernity",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Premium Gold (GH) setting adorned with lustrous Pearls (Moti - 40.35 carats)",
    "dazzling Natural Fancy gemstones (NV Fancy - 25.47 carats)",
    "and delicate Pink Carved stones (Pink Carve - 48.08 carats). Meticulously handcrafted with a Hyderabadi polish for a lasting shine."
  ],
  "features": "This exquisite haaram features a captivating floral design, blending traditional Indian artistry with modern aesthetics. The intricate detailing showcases a delicate balance between floral elements and geometric patterns, set with precision. The design features a symphony of colors and textures, creating a visually stunning piece.",
  "colors": [
    "The haaram boasts a sophisticated color palette featuring a radiant gold setting complemented by the milky white of the pearls",
    "the varying hues of the natural fancy stones (pinks",
    "oranges",
    "greens)",
    "and the soft pink of the carved stones. This blend of colors creates a striking yet harmonious effect."
  ],
  "occasions": [
    "Perfect for both traditional South Indian occasions like weddings (muhurtham)",
    "pre-wedding ceremonies (seemantham",
    "haldi)",
    "and half-saree functions",
    "as well as modern celebrations and sophisticated events. A statement piece for any discerning jewelry lover."
  ],
  "description": "This haaram is a true testament to exceptional craftsmanship and timeless elegance. The unique floral design, combined with the radiance of the pearls and gemstones, makes it a standout piece. The Hyderabadi polish ensures lasting brilliance, while the balanced design makes it versatile enough for both traditional and contemporary settings. A valuable addition to any fine jewelry collection, embodying both cultural heritage and modern style.",
  "tags": [
    "Haaram",
    "Necklace",
    "Pearl",
    "Moti",
    "Gemstone",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Fancy Gemstones",
    "Carved Stones",
    "Gold Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-49 2_1395",
  "collection": "diamond"
}