{
  "id": "necklaces-356",
  "title": "Vaibhav Diamond Haaram Set with Navratna Accents - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "22K Gold (కంప్లీట్ బంగారం) with Hyderabadi Polish for a rich",
    "lasting luster. Set with brilliant-cut diamonds (VVS clarity",
    "EF color)",
    "genuine Ruby",
    "Emerald and Fresh Water Pearls (ముత్యాలు)."
  ],
  "features": "Intricate floral motif design meticulously handcrafted by skilled artisans. The necklace features a central Emerald (పచ్చ) surrounded by a diamond halo, leading to a stunning Ruby (కెంపు) pendant adorned with cascading South Sea Pearls. Matching Jhumka style earrings are included with Ruby and pearl details. The necklace is designed with a flexible mesh style link, adding comfort and durability. The setting showcases a delicate pavé setting for maximum diamond sparkle.",
  "colors": [
    "Predominantly gold and diamond white",
    "accented by the rich red of the Ruby",
    "the vibrant green of the Emerald and the soft white of the pearls. A classic South Indian color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements",
    "anniversaries",
    "and traditional South Indian ceremonies like Seemantham (సీమంతం)",
    "Half-Saree Function",
    "and other special occasions. Also suitable for grand receptions and festive gatherings."
  ],
  "description": "This exquisite Haaram set is a true statement piece, blending traditional South Indian design with modern elegance. The high-quality diamonds and genuine gemstones ensure lasting beauty and value. The Hyderabadi polish adds a touch of regal charm. It's a heirloom-worthy piece that will be treasured for generations. The traditional motifs are considered highly auspicious, bringing prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Necklace Set",
    "Diamond Necklace",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "22K Gold",
    "Ruby",
    "Emerald",
    "Pearls",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Kanthabharanam",
    "Kempu",
    "Pachcha",
    "Mutyalu",
    "పెళ్లి",
    "సీమంతం",
    "కెంపు",
    "పచ్చ",
    "ముత్యాలు",
    "కంఠాభరణం",
    "చెవి దిద్దులు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0470_0652",
  "collection": "diamond"
}