{
  "id": "necklaces-494",
  "title": "Navaratna Coral & Emerald Motif Haar with South Sea Pearl Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (GH)",
    "South Sea Pearls (S Moti - 28.75 ct)",
    "Natural Corals (Corals - 36.46 ct)",
    "Carved Emerald (Eme Carve - 13.31 ct)",
    "Emerald Beads (Eme bds - 17.94 ct)",
    "Diamonds (Dwt - 3.47 ct)"
  ],
  "features": "This contemporary haar features a unique hexagonal pendant design incorporating vibrant corals and diamonds. The necklace strands are composed of South Sea pearls interspersed with emerald beads and coral sections, creating a striking color contrast. The pendant's center boasts a diamond-studded floral motif, surrounded by perfectly cut coral segments. A carved emerald drop adds a touch of traditional South Indian elegance. Handcrafted with meticulous attention to detail, reflecting the legacy of Hyderabadi craftsmanship.",
  "colors": [
    "Predominantly gold",
    "coral red",
    "emerald green",
    "and pearl white. The vibrant red of the corals contrasts beautifully with the lush green emeralds and the classic white of the pearls",
    "creating a rich and auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "festive occasions (like Sankranthi or Ugadi)",
    "formal gatherings",
    "and celebratory events. Its modern design also makes it suitable for upscale parties and cocktail events."
  ],
  "description": "This exquisite haar is a fusion of traditional South Indian aesthetics and modern design sensibilities. The use of authentic South Sea pearls, high-quality corals, and brilliant-cut diamonds makes it a valuable heirloom piece. Its unique design and vibrant color combination will ensure you stand out in any crowd. The handcrafted detailing reflects the rich heritage of Hyderabadi jewelry making.",
  "tags": [
    "Haar",
    "Necklace",
    "Coral Jewelry",
    "Emerald Jewelry",
    "South Sea Pearl",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Muhurtham Jewelry",
    "Contemporary Jewelry",
    "Designer Necklace",
    "Nakshi Work Inspired",
    "Indian Jewelry",
    "Gold Jewelry",
    "Moti Haar",
    "పగడపు",
    "కెంపు",
    "ముత్యాల హారం"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-28 2_0974",
  "collection": "diamond"
}