{
  "id": "earrings-113",
  "title": "Devi Temple Jhumka - Divine Grace and Timeless Beauty",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Brilliant-cut Cubic Zirconia",
    "and Emerald accents. Crafted with a traditional Hyderabadi Polish for a rich",
    "enduring lustre."
  ],
  "features": "These exquisite Jhumkas showcase a miniature temple design, featuring a intricately carved Goddess figure at the center. The openwork filigree is adorned with sparkling Cubic Zirconia to resemble precious Polki diamonds, enhancing the divine aesthetic. Graceful gold ball drops (Gundla) sway gently, adding movement and charm. The top is punctuated with emerald accents.",
  "colors": [
    "Radiant gold enhanced by the brilliance of white Cubic Zirconia and the vibrancy of green emeralds. The classic color combination evokes a sense of tradition and auspiciousness."
  ],
  "occasions": [
    "Perfect for traditional occasions like weddings (Vivaha)",
    "religious ceremonies (Puja)",
    "festive celebrations (Sankranthi",
    "Diwali)",
    "and cultural events. Also suitable for adding a touch of traditional elegance to modern gatherings."
  ],
  "description": "These Temple Jhumkas are a testament to the enduring beauty of South Indian jewelry craftsmanship. The intricate detailing, the symbolic Goddess motif, and the high-quality materials make this piece a cherished heirloom. Owning this piece represents a connection to rich cultural heritage and adds a touch of divine elegance to any ensemble.",
  "tags": [
    "Jhumka",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Kammalu",
    "22K Gold",
    "Wedding Jewelry",
    "Traditional Earrings",
    "Goddess Lakshmi",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "Cubic Zirconia",
    "Emeralds",
    "Gundla",
    "Festive Jewelry",
    "Indian Earrings",
    "Vivaha",
    "Puja",
    "Sankranthi",
    "Diwali"
  ],
  "original_id": "diamond_jewellery_de2b49fd-b829-4a31-990a-a40efab9859b_0215",
  "collection": "diamond"
}