{
  "id": "necklaces-1400",
  "title": "Vaibhav Collection: Diamond and Emerald Tanmani Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Gold",
    "this Tanmani Haaram features meticulously selected dazzling CZ Diamonds and vibrant",
    "pear-shaped Emeralds. The piece is finished with lustrous South Sea Pearls. Hyderabadi Polish ensures a lasting shine."
  ],
  "features": "This contemporary Tanmani Haaram showcases a delicate leaf-inspired design, meticulously studded with CZ diamonds. Pear-shaped Emeralds are gracefully set within diamond halos, enhancing their brilliance. The design concludes with a cascade of perfectly round South Sea pearls, lending an air of sophistication. The intricate setting ensures maximum light refraction for exceptional sparkle.",
  "colors": [
    "The necklace boasts a vibrant color palette: the warmth of yellow gold",
    "the icy sparkle of white diamonds",
    "the rich green of the emeralds",
    "and the soft",
    "iridescent luster of the South Sea Pearls."
  ],
  "occasions": [
    "Perfect for any occasion",
    "from grand celebrations like weddings (వివాహం) and receptions to special events such as seemantham (శీమంతం) and half-saree functions (లంగా ఓణి వేడుక). Its versatile design also makes it ideal for modern parties and sophisticated gatherings."
  ],
  "description": "This exquisite Haaram combines the timeless elegance of South Indian jewelry with a contemporary design sensibility. The high-quality CZ Diamonds provide the brilliance of real diamonds at an accessible price point. The vibrant Emeralds represent prosperity and good fortune. Durable construction ensures it can be cherished for generations. A perfect blend of tradition and modern style.",
  "tags": [
    "Haaram",
    "Necklace",
    "Tanmani",
    "South Indian Jewelry",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Contemporary Jewelry",
    "Telugu Jewelry",
    "Kanthabharanam",
    "CZ Diamonds",
    "South Sea Pearls",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Vivaaham",
    "Seemantham",
    "Langa Voni",
    "కంఠాభరణం",
    "వివాహం",
    "శీమంతం",
    "లంగా ఓణి వేడుక"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-09_2018",
  "collection": "sjpl"
}