{
  "id": "necklaces-1399",
  "title": "Emerald & Diamond Peacock Haar: A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Finest Quality Emeralds (Vivid Green",
    "Excellent Cut)",
    "Premium Quality Diamonds (Brilliant Cut",
    "VS Clarity)",
    "Freshwater Pearls. Hyderabadi Polish for enhanced shine."
  ],
  "features": "This exquisite Haaram features a contemporary design rooted in South Indian traditions. Delicate peacock motifs, symbolic of beauty and prosperity, are meticulously crafted and studded with shimmering diamonds and vibrant green emeralds. The cascading design is adorned with lustrous freshwater pearls, adding a touch of classic charm. The intricate setting enhances the brilliance of the diamonds and emeralds, showcasing the skill of our master craftsmen.",
  "colors": [
    "Yellow Gold",
    "Vivid Green Emeralds",
    "Sparkling White Diamonds",
    "Creamy White Pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "engagements",
    "and grand festive occasions. Also a statement piece for upscale parties and cultural events. Ideal for Muhurtham ceremonies and other significant celebrations."
  ],
  "description": "A stunning fusion of traditional South Indian motifs and modern design sensibilities. The peacock, a revered symbol, brings grace and good fortune. The high-quality emeralds and diamonds are hand-selected for their exceptional brilliance and clarity. Expertly crafted in Hyderabad by skilled artisans. A heirloom-worthy piece that will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Peacock",
    "South Indian Jewelry",
    "Temple Jewellery",
    "Hyderabad Jewellery",
    "Wedding Jewelry",
    "Vivaha",
    "Reception",
    "Engagement",
    "Muhurtham",
    "Indian Jewelry",
    "Traditional",
    "Contemporary",
    "Pearls",
    "18K Gold",
    "Jewellery",
    "Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-09 3_2017",
  "collection": "sjpl"
}