{
  "id": "necklaces-1435",
  "title": "Enchanting Neelamani and Diamond Raani Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold. Features round brilliant cut diamonds (VS clarity",
    "G-H color) and Square cut Sapphire (Neelamani). The gold is meticulously crafted and boasts a fine Hyderabadi polish for a lasting shine."
  ],
  "features": "This stunning necklace reimagines the classic Haar with a contemporary twist. Showcasing a graduated design with alternating sapphire and diamond stations. Graceful diamond-studded pendants dangle below, adding movement and sparkle. The setting is a modern prong and bezel combination that beautifully secures each gemstone. The craftsmanship emphasizes symmetry and balance for a pleasing aesthetic.",
  "colors": [
    "Primarily rose gold",
    "contrasted by the brilliant white of the diamonds and the deep blue of the sapphires. This color combination adds a touch of regal elegance."
  ],
  "occasions": [
    "Perfect for special occasions like weddings",
    "receptions",
    "engagement ceremonies",
    "or a sophisticated evening out. This Raani Haar is sure to make a statement at any grand event or gala. Wear this for modern events and classic celebrations"
  ],
  "description": "This necklace offers a harmonious blend of traditional elegance and contemporary design. It features premium materials and impeccable craftsmanship. The unique combination of sapphires and diamonds makes it a timeless investment. The Hyderabadi polish ensures a lasting brilliance. Its contemporary design elements make it versatile enough for modern events. The diamonds and sapphires, a symbol of royalty.",
  "tags": [
    "Necklace",
    "Haar",
    "Diamond",
    "Sapphire",
    "Neelamani",
    "Raani Haar",
    "Rose Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "VS Clarity",
    "18K Gold",
    "Special Occasion"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-44 3_2053",
  "collection": "sjpl"
}