{
  "id": "necklaces-1210",
  "title": "Elegant Emerald and Pearl Kundan Haaram - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality gold with a lustrous finish",
    "this Haaram features vibrant emeralds",
    "shimmering rubies",
    "and genuine freshwater pearls (Moti). Meticulously set Kundan stones add to its regal appeal."
  ],
  "features": "This exquisite Haaram showcases a delicate vine design adorned with Kundan settings, accented by carefully placed emeralds and rubies. The pendant is intricately designed with a floral motif. The pendant is further enhanced by cascading pearls (moti) which add to the look. Contemporary blend with traditional essence.",
  "colors": [
    "The piece features a captivating color palette of gold",
    "vibrant green from the emeralds",
    "flashes of red from the rubies and the soft luster of white pearls",
    "creating a visually stunning contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "receptions",
    "and special occasions like seemantham or half-saree functions. It's also a sophisticated choice for modern gatherings",
    "adding a touch of tradition to your contemporary style."
  ],
  "description": "This Haaram is a testament to exquisite craftsmanship and timeless elegance. The combination of traditional Kundan work with contemporary design makes it a unique heirloom piece. The high-quality materials ensure durability and lasting beauty. A true statement piece that reflects your refined taste and appreciation for South Indian heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan",
    "Emerald",
    "Ruby",
    "Pearl",
    "Moti",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Vivaaha",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Traditional",
    "Contemporary",
    "Gold Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-49 3_1784",
  "collection": "sjpl"
}