{
  "id": "necklaces-471",
  "title": "Exquisite Emerald & Ruby Diamond Bridal Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold (916 Hallmark)",
    "meticulously set with brilliant-cut Diamonds",
    "vibrant Burmese Rubies",
    "and striking Zambian Emeralds. Features a unique Hyderabadi Polish for lasting radiance."
  ],
  "features": "This stunning Haaram features a graduated design with rows of shimmering diamonds culminating in a central floral motif. The pendant showcases intricate filigree work (కంఠమాల నగిషీ పని) around a captivating pear-shaped emerald. Dangles of gold beads add a touch of movement and traditional charm. The necklace incorporates a combination of bezel and prong settings for maximum gemstone security and brilliance.",
  "colors": [
    "Classic combination of warm yellow gold",
    "fiery red rubies",
    "lush green emeralds",
    "and the dazzling white of diamonds",
    "creating a rich and vibrant color palette."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (పెళ్లి)",
    "receptions",
    "Seemantham (శ్రీమంతం)",
    "and other significant celebrations. Its timeless design makes it suitable for both traditional and modern bridal ensembles."
  ],
  "description": "A masterpiece of Hyderabadi craftsmanship, this Haaram embodies the rich heritage of South Indian jewelry. The combination of high-quality gemstones and exquisite design makes it a valuable and cherished heirloom piece. The emerald accents symbolize prosperity and good fortune, making it a meaningful addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Diamond Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Kanthabharanam",
    "పెళ్లి నగలు",
    "శ్రీమంతం నగలు",
    "కంఠాభరణం",
    "నగిషీ పని"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-55_0934",
  "collection": "diamond"
}