{
  "id": "necklaces-1201",
  "title": "Emerald Blossom Diamond Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in lustrous 18K gold. Features brilliant-cut diamonds (5.17ct) with exceptional fire and clarity. Accented with two vivid green emeralds (2.05ct)",
    "two brilliant rubies (2.75ct) and freshwater pearls (23.25ct)",
    "including the locket (1.22ct) adorned with white diamonds and freshwater pearls (6.75ct)."
  ],
  "features": "This exquisite haaram showcases a delicate floral design, meticulously handcrafted with intricate diamond settings. The necklace features a detachable emerald and diamond-studded pendant (locket). The elegant pearl drops add a touch of classic charm. The floral design has been created to look similar to a blossom. The diamond flowers are complemented by the pearls. ",
  "colors": [
    "Predominantly white (diamonds) and yellow (gold)",
    "complemented by the vibrant green of the emeralds and the subtle red of the rubies. The creamy white pearls add a soft",
    "luxurious touch."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings",
    "engagements",
    "Seemantham ceremonies",
    "or grand celebrations. A stunning statement piece for any formal event."
  ],
  "description": "A timeless piece of South Indian artistry, this diamond haaram is a testament to superior craftsmanship. The combination of sparkling diamonds, vibrant emeralds, and lustrous pearls creates a captivating and sophisticated look. Its versatility allows it to be cherished for generations. Offers a modern take on the classic Haaram design.",
  "tags": [
    "Diamond Haaram",
    "Emerald Necklace",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Grand Necklace",
    "Formal Jewelry",
    "Mutyala Haaram",
    "Ratnala Haaram"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-46 3_1775",
  "collection": "sjpl"
}