{
  "id": "rings-036",
  "title": "Gulabi Kundan Rang – The Rosy Radiance Ring",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Rose Quartz",
    "Polki Diamonds (Uncut Diamonds). Gold purity verified; Polki diamonds are ethically sourced with VS clarity"
  ],
  "features": "This exquisite ring features a traditional Kundan setting with a captivating rosette arrangement of Polki diamonds surrounding a larger central diamond. The outer border is delicately inlaid with cabochon-cut rose quartz, creating a stunning contrast and adding a touch of contemporary flair. The back of the ring showcases intricate gold detailing, reflective of traditional Hyderabadi craftsmanship.",
  "colors": [
    "Primarily a combination of warm yellow gold",
    "translucent rose pink from the rose quartz",
    "and sparkling white from the Polki diamonds. The Hyderabadi polish enhances the gold's luster."
  ],
  "occasions": [
    "Perfect for traditional occasions like weddings (Vivaham)",
    "engagements (Nischitartham)",
    "festivals (Panduga)",
    "or simply to add a touch of regal elegance to your everyday attire. It also blends beautifully with modern outfits for cocktail parties and special events."
  ],
  "description": "This ring is a stunning fusion of traditional artistry and contemporary design. The use of genuine Polki diamonds and natural rose quartz lends it an unparalleled elegance. The Hyderabadi polish ensures lasting brilliance and showcases the superior craftsmanship of our artisans. It's a statement piece that speaks volumes about your refined taste and appreciation for heritage.",
  "tags": [
    "Kundan",
    "Ring",
    "Anguleeyakam",
    "Polki",
    "Diamonds",
    "Rose Quartz",
    "Hyderabadi",
    "Gold",
    "Indian Jewelry",
    "Traditional",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Gulabi",
    "Engagement Ring",
    "Ethnic"
  ],
  "original_id": "ear_rings_DPCR8-1394_2582",
  "collection": "ear"
}