{
  "id": "necklaces-243",
  "title": "Emerald & Ruby Chandrika Haar: A Touch of Telugu Heritage",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "Natural Emeralds (Oval Cut",
    "good clarity)",
    "Natural Rubies (Round Cut)",
    "Polki Diamonds. Features traditional Hyderabadi Polish for lasting luster."
  ],
  "features": "Geometric Haaram design featuring emeralds and polki diamonds. Ruby embellishments add a vibrant touch. The pendant is adorned with spherical gold danglers, creating a graceful, rhythmic movement. Each motif is meticulously handcrafted, reflecting the rich heritage of Telugu jewelry. The design incorporates a contemporary touch, making it versatile for various occasions.",
  "colors": [
    "Predominantly Yellow Gold",
    "with vibrant Emerald Green and Ruby Red accents. The Polki Diamonds offer a subtle sparkle and complement the warm gold hue."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "and traditional events like Seemantham (శీమంతం) and half-saree functions. Also suitable for modern cocktail parties and festive celebrations."
  ],
  "description": "This Chandrika Haar seamlessly blends traditional Telugu design with contemporary aesthetics. Crafted with the finest materials and meticulous attention to detail, it is a testament to enduring craftsmanship and style. The use of natural emeralds, rubies, and polki diamonds ensures lasting value and brilliance. A piece that embodies both cultural heritage and modern elegance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Polki Diamonds",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Chandrika Haar",
    "Kanthabharanam",
    "శీమంతం",
    "కంఠాభరణం"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0323_0520",
  "collection": "diamond"
}