{
  "id": "earrings-533",
  "title": "Rose Quartz and Polki Diamond Studs - Navaratan Kadiyam Design",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Oval Rose Quartz cabochons (approximately 10mm)",
    "Uncut Polki Diamonds (approximately 2mm each)",
    "Gold backing."
  ],
  "features": "Classic rosette design inspired by traditional Kadiyam (bangle) motifs. Features a smooth, oval Rose Quartz cabochon at the center, surrounded by a halo of sparkling Polki diamonds in a prong setting. The Hyderabadi polish gives the gold a rich, lustrous sheen enhancing the brilliance of the gemstones. The Polki diamonds are set in a classic closed setting to showcase their natural beauty.",
  "colors": [
    "Rose Quartz (soft pink)",
    "Gold (yellow)",
    "Polki Diamonds (white/clear with subtle inclusions). A harmonious and feminine color combination."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "casual outings",
    "or as delicate embellishments for festive occasions. Can be paired with traditional sarees and lehengas for functions like Seemantham (సీమంతం)",
    "Half-Saree Function (Langa Voni Function). Also suitable for modern cocktail parties and formal events."
  ],
  "description": "These earrings offer a delightful fusion of traditional and contemporary design. The use of Polki diamonds, a hallmark of South Indian jewelry, adds a touch of heritage. The Rose Quartz promotes love and harmony, making it a meaningful gift. The high-quality craftsmanship ensures durability and lasting beauty. The classic design makes these earrings a versatile addition to any jewelry collection.",
  "tags": [
    "Earrings",
    "Studs",
    "Rose Quartz",
    "Polki Diamond",
    "Uncut Diamonds",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Kadiyam Design",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Seemantham",
    "Half Saree Function",
    "Navaratan",
    "కడియం",
    "సీమంతం"
  ],
  "original_id": "ear_rings_PKER8-1242_2679",
  "collection": "ear"
}