{
  "id": "necklaces-1016",
  "title": "Enchanting Diamond & Gemstone Haarams (కంఠాభరణం): A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold",
    "meticulously set with brilliant-cut Diamonds (VVS clarity",
    "GH color). Adorned with vibrant Ruby and Emerald gemstones",
    "and lustrous freshwater pearls. Features a flexible mesh chain for comfortable wear."
  ],
  "features": "This exquisite Haaram features a scalloped design of intricate filigree work, embellished with ruby and emerald gemstones, and brilliant cut diamonds. The cascading arrangement is reminiscent of traditional Andhra designs with subtle temple motifs. The piece concludes with delicate freshwater pearls, adding a touch of ethereal beauty. This modern design features a flexible band for comfort.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with pops of rich red (ruby) and green (emerald). The pearls provide a soft",
    "creamy contrast",
    "adding a touch of elegance and charm."
  ],
  "occasions": [
    "Perfect for grand celebrations such as weddings (Muhurtham)",
    "receptions",
    "Seemantham ceremonies",
    "and other formal events. Also suitable for adding a touch of sophistication to upscale gatherings and cultural events."
  ],
  "description": "This Haarams represent both modern luxury and a timeless emblem of South Indian heritage. The harmonious blend of diamonds, gemstones, and pearls showcases exceptional craftsmanship and offers a unique statement piece for any jewelry collection. It is durable and is sure to turn heads.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "Telugu Jewelry",
    "Andhra Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Necklace",
    "Kanthabharanam",
    "కంఠాభరణం",
    "Vaddanam"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0475_2337",
  "collection": "necklace"
}