{
  "id": "earrings-159",
  "title": "Polki & Emerald Chandbali Jhumka - An Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (సువర్ణం)",
    "Uncut Polki Diamonds",
    "Natural Emerald (పచ్చ)",
    "Hyderabadi Polish for a lasting luster. Polki diamonds used are of high clarity with minimal inclusions for optimal brilliance."
  ],
  "features": "Classic Chandbali design with a central oval-cut Emerald surrounded by a halo of Polki diamonds. The earrings feature an intricate openwork design meticulously handcrafted by skilled artisans, creating a sense of depth and dimension. The Jhumka is adorned with additional polki diamonds, adding to its traditional charm. ",
  "colors": [
    "Predominantly gold with the vibrant green of the Emerald and the shimmering white of the Polki diamonds. The Hyderabadi polish gives the gold a rich",
    "warm tone",
    "enhancing the overall brilliance."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements (నిశ్చితార్థం)",
    "festivals like Diwali (దీపావళి)",
    "and other special occasions. A statement piece for any traditional South Indian attire like silk sarees and lehengas. Also suitable for modern fusion outfits seeking a touch of tradition."
  ],
  "description": "This Chandbali Jhumka is a true heirloom piece, crafted with the finest materials and timeless design. The Polki diamonds, with their unique uncut charm, lend an antique yet sophisticated feel. The natural emerald adds a touch of luxury and is believed to bring prosperity. Its lightweight design ensures comfortable wear, even for extended periods. The Hyderabadi polish guarantees a lasting shine.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "Polki Diamonds",
    "Emerald",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "పెళ్ళి",
    "చెవి దుద్దులు",
    "Hyderabadi Jewelry",
    "Heirloom Jewelry",
    "Uncut Diamonds",
    "పచ్చ"
  ],
  "original_id": "diamond_jewellery_DPER8-1611_0287",
  "collection": "diamond"
}