{
  "id": "necklaces-139",
  "title": "Contemporary Polki Diamond Drop Necklace - Modern Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Laxmi Cut)",
    "Brilliant-cut Diamonds",
    "Hyderabadi Polish"
  ],
  "features": "This delicate necklace features two stylized leaf-shaped pendants, each adorned with a central, heart-shaped Polki diamond. The diamonds are surrounded by a halo of sparkling, brilliant-cut diamonds set in a pavé setting. The minimalistic design is offset by the richness of the Polki and the warmth of the Hyderabadi-polished gold, creating a harmonious blend of tradition and modernity. A fine gold chain completes the look.",
  "colors": [
    "Golden Yellow (Gold)",
    "White (Diamonds)",
    "Off-White/Milky White (Polki Diamonds)"
  ],
  "occasions": [
    "Perfect for daily wear",
    "casual outings",
    "festive occasions like Diwali",
    "Sankranthi",
    "or a simple Telugu wedding reception. Also suitable for modern events and parties where a touch of elegance is desired."
  ],
  "description": "This Polki diamond necklace is a testament to fine craftsmanship and subtle elegance. The use of uncut Polki diamonds adds a touch of tradition and uniqueness, while the modern design ensures it complements any outfit. The Hyderabadi polish gives the gold a radiant sheen, making it a piece that will be cherished for years to come. It is lightweight, comfortable, and a perfect representation of blending traditional South Indian jewelry techniques with contemporary aesthetics.",
  "tags": [
    "Necklace",
    "Haaram",
    "Polki Diamonds",
    "Uncut Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "Pendant Necklace",
    "Indian Jewelry",
    "Contemporary Jewelry",
    "Laxmi Cut Polki",
    "22K Gold",
    "Diamond Necklace",
    "Diwali",
    "Sankranthi"
  ],
  "original_id": "diamond_jewellery_DPPD8-1314_0372",
  "collection": "diamond"
}