{
  "id": "rings-031",
  "title": "Pushpa Vanam Ring - A Floral Symphony of Gemstones",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features vibrant orange Sapphires with heart cut at the center and sparkling Cubic Zirconia (CZ) accents throughout. The gold boasts a warm",
    "rich luster indicative of fine South Indian craftsmanship."
  ],
  "features": "This striking ring showcases a floral motif, expertly handcrafted with intricate detailing. The heart cut sapphires form the central flower, complemented by a halo of sparkling CZs. The openwork design creates depth and allows light to dance through the stones, enhancing their brilliance. The overall design blends traditional floral elements with a modern, bold aesthetic.",
  "colors": [
    "Radiant gold is accented by the fiery orange of the Sapphires and the dazzling white of the CZs",
    "creating a warm and captivating color palette."
  ],
  "occasions": [
    "Perfect for special occasions",
    "weddings (Vivaha)",
    "festivals (like Diwali or Sankranti)",
    "or any event where you want to make a statement. Equally suitable for adding a touch of glamour to your evening wear."
  ],
  "description": "This Pushpa Vanam Ring is a testament to exquisite craftsmanship and timeless design. The vibrant Sapphires and sparkling CZs are carefully selected for their quality and brilliance. The Hyderabadi Polish enhances the gold's natural luster, ensuring a lasting shine. Its unique floral design makes it a truly special piece that will be treasured for years to come.",
  "tags": [
    "Ring",
    "Floral Ring",
    "Statement Ring",
    "Orange Sapphire",
    "CZ",
    "Cubic Zirconia",
    "22K Gold",
    "Hyderabadi Polish",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Engagement Ring",
    "Fine Jewelry",
    "Pushpa Vanam",
    "Vivaha",
    "Diwali",
    "Sankranti"
  ],
  "original_id": "ear_rings_DMCR8-1663_2568",
  "collection": "ear"
}