{
  "id": "necklaces-245",
  "title": "Divyam Diamond Lakshmi Kasu Haaram with Emerald & Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VVS Clarity)",
    "Natural Emerald (Panna) Center Stone",
    "Natural Rubies (Manikyam)",
    "Cultured Pearls. Exquisite Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This stunning Haaram features a classic Kasu design with a contemporary twist. The entire necklace is embellished with meticulously set brilliant-cut diamonds, creating a dazzling effect. The Lakshmi motif at the center of the pendant is intricately crafted, evoking blessings and prosperity. The pendant's open setting adds a modern flair to the traditional design. Nakshi work accents enhance the intricate design. The emerald and ruby accents provide a vibrant contrast.",
  "colors": [
    "Gold (light yellow)",
    "White (Diamonds)",
    "Green (Emerald)",
    "Red (Ruby)",
    "Off-White/Cream (Pearls). A traditional South Indian color palette symbolizing prosperity and auspiciousness."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements",
    "bridal showers",
    "Seemantham",
    "Half-Saree function (Langa Voni Function)",
    "and other grand celebrations. Also suitable for upscale formal events where you want to make a statement."
  ],
  "description": "A harmonious blend of tradition and modern aesthetics. The Lakshmi motif is a symbol of wealth and prosperity, making this piece a cherished heirloom. The brilliant-cut diamonds provide exceptional sparkle and brilliance. Crafted with meticulous attention to detail by skilled artisans in Hyderabad. This Haaram is a testament to timeless elegance and exquisite craftsmanship.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Lakshmi Pendant",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Kantabharanam",
    "పతకం",
    "కంఠాభరణం",
    "పెళ్ళి నగలు",
    "సీమంతం నగలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0325_0522",
  "collection": "diamond"
}