{
  "id": "necklaces-873",
  "title": "Manohari Diamond and Emerald Haaram Set with Jhumka",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold base",
    "adorned with meticulously set brilliant-cut Diamonds",
    "vibrant Emeralds of VS clarity",
    "and lustrous South Sea Pearls. Hyderabadi Polish for a rich",
    "enduring shine."
  ],
  "features": "This exquisite Haaram showcases a classic U-shaped design, meticulously crafted with alternating diamond and emerald motifs. Delicate pearl drops enhance the necklace's graceful flow. The centerpiece features a floral pendant with a central Ruby, surrounded by diamonds and emeralds, echoing the overall design. Matching Jhumka earrings complete the set, mirroring the Haaram's intricate details and pearl accents.",
  "colors": [
    "Predominantly gold with sparkling diamond accents",
    "complemented by the rich green of the emeralds",
    "the deep red of the ruby",
    "and the soft cream of the pearls",
    "creating a harmonious and opulent palette."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha Mahotsavam)",
    "engagement ceremonies",
    "bridal showers",
    "and celebratory events (Shubhakaryalu). An exquisite choice for a bride (Vadhuvu) or as a special gift for milestone celebrations."
  ],
  "description": "This Haaram set is a testament to exceptional craftsmanship and timeless design. The combination of diamonds, emeralds, and pearls exudes elegance and luxury. It's a heirloom piece that can be cherished for generations, symbolizing prosperity and good fortune. The Hyderabadi polish ensures lasting brilliance. The set is designed to complement traditional South Indian attire, adding a touch of regal splendor.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Shubhakaryalu",
    "Vadhuvu",
    "Vivaha Mahotsavam",
    "शुभकार्यलू",
    "वधुवु",
    "विवाह महोत्सवम्"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0406_1560",
  "collection": "haaram"
}