{
  "id": "necklaces-754",
  "title": "Lakshmi Kasula Haaram with Coral and Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "high-quality CZ stones",
    "Natural Coral beads",
    "and Emerald accents. Handcrafted with intricate detail and finished with a lustrous Hyderabadi Polish."
  ],
  "features": "A magnificent three-strand Kasula Haaram featuring intricately designed Lakshmi motifs along the chain, leading to two ornate pendants. The pendants showcase traditional South Indian floral designs, enhanced by vibrant coral beads and emerald drops, creating a captivating contrast. The setting is meticulously crafted, ensuring the gemstones sparkle brilliantly. Antique finish adds depth and character to the piece.",
  "colors": [
    "Gold",
    "sparkling white (CZ stones)",
    "coral red",
    "and emerald green. A classic and auspicious color combination for South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "bridal wear",
    "festivals (Sankranthi",
    "Diwali)",
    "and traditional South Indian celebrations like Seemantham and half-saree functions (Pattu Langa Voni kaaryakramam). Also a stunning statement piece for upscale cultural events."
  ],
  "description": "This Kasula Haaram embodies the rich heritage of South Indian jewelry. The Lakshmi motifs symbolize prosperity and good fortune, making it an auspicious choice. The exquisite craftsmanship, the use of high-quality gemstones, and the Hyderabadi Polish ensure lasting beauty and value. A heirloom piece to be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kasula Haaram",
    "Lakshmi",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Coral",
    "Emerald",
    "Indian Jewellery",
    "temple jewellery",
    "pachi work",
    "mangalsutra",
    "muhurtham",
    "seemantham",
    "Hyderabadi Polish",
    "Vivahaalu",
    "Pattu Langa Voni kaaryakramam",
    "Sankranthi",
    "Diwali"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-40 2_1260",
  "collection": "diamond"
}