{
  "id": "necklaces-1274",
  "title": "Diamond Dazzle: Contemporary Bridal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold setting. Showcases a collection of brilliant-cut diamonds. Each diamond is VS clarity with a G-H color grade. Hallmarked for gold purity and authenticity. Hyderabadi Polish for a lasting sheen."
  ],
  "features": "Features a modern interpretation of the classic Haaram design. The graduating teardrop motif is intricately set with diamonds, creating a captivating cascade effect. The delicate diamond-studded bail adds an extra touch of elegance. The openwork design ensures comfortable wear while maximizing sparkle. Minimalist design, blending seamlessly into modern aesthetics and traditional celebrations.",
  "colors": [
    "Predominantly white (diamonds) against the warm hue of rose gold. The rose gold beautifully complements Indian skin tones."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "engagements",
    "anniversaries",
    "and high-end social gatherings. Also suitable for cocktail parties and black-tie events",
    "where a touch of modern elegance is desired."
  ],
  "description": "This Diamond Haaram offers a modern take on a timeless classic. Its meticulous craftsmanship, high-quality diamonds, and versatile design make it a cherished heirloom. The use of rose gold gives it a contemporary edge while retaining the traditional charm of a Haaram. Its lightweight design ensures all-day comfort. An investment in timeless beauty and enduring value.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Rose Gold",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Engagement Necklace",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Jewelry",
    "కంఠాభరణము",
    "VS Diamonds",
    "G-H Diamonds",
    "Modern Haaram",
    "Reception Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-01 2_1871",
  "collection": "sjpl"
}