{
  "id": "necklaces-452",
  "title": "Enchanting Emerald and Diamond Haaralu - A Regal Necklace for Every Celebration",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base",
    "meticulously crafted with brilliant-cut diamonds (SI clarity",
    "G-H color). Features four natural Emeralds (4.32 carats total) of vivid green hue and one Ruby (1.96 carats). Accented with three lustrous South Sea Pearls (8.55mm). Boasts a signature Hyderabadi polish for lasting shine."
  ],
  "features": "This Haaralu seamlessly blends traditional South Indian design with contemporary flair. The intricate diamond work showcases a floral motif, creating a delicate yet opulent aesthetic.  Four emeralds are set in a prong setting to highlight the vibrancy of green colour and One ruby is used. The pearl drops add a touch of timeless elegance. This is a great piece to showcase the great skills of our karigars. The overall design reflects the rich heritage of Telugu jewelry.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "punctuated by the vibrant green of the emeralds and the soft luster of the pearls and ruby. This color palette represents prosperity and auspiciousness."
  ],
  "occasions": [
    "Perfect for weddings",
    "Seemantham ceremonies",
    "Bharatanatyam performances",
    "or any grand celebration. Also ideal for adding a touch of regal elegance to formal events and special occasions. Make it your treasure for Muhurtham celebrations."
  ],
  "description": "This haaralu is more than just a piece of jewelry; it's a statement of refined taste and cultural appreciation. The exquisite craftsmanship and high-quality materials ensure lasting beauty and durability. The combination of diamonds, emeralds, pearls, and gold makes it an heirloom piece to be cherished for generations. Own this symbol of prosperity and timeless elegance.",
  "tags": [
    "Haaralu",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Muhurtham",
    "Seemantham",
    "Pearls",
    "22K Gold",
    "Fine Jewelry",
    "Temple Jewelry",
    "Nakshi Work"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-49 2_0915",
  "collection": "diamond"
}