{
  "id": "necklaces-234",
  "title": "Divyam Nakshi Guttapusalu Style Haaram with Ruby & Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Cubic Zirconia",
    "Natural Rubies (Burmese origin)",
    "Natural Emeralds (Zambian origin). Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite haaram blends the classic Guttapusalu style with delicate Nakshi work. Circular motifs are meticulously crafted and studded with shimmering CZ stones, framing vibrant emerald and ruby accents. The intricate detailing and layered design showcase exceptional craftsmanship. The CZ stones are set in a pave setting to maximize brilliance.",
  "colors": [
    "Primary gold tone with vibrant red rubies and verdant green emeralds",
    "complemented by the dazzling white of the cubic zirconia."
  ],
  "occasions": [
    "Perfect for weddings (Vivaahaalu)",
    "engagements (Nischitartham)",
    "bridal wear",
    "festivals like Ugadi and Diwali",
    "and other special occasions where a touch of traditional elegance is desired. Also suitable for formal evening events."
  ],
  "description": "A stunning fusion of traditional South Indian design and modern aesthetics. The use of genuine rubies and emeralds elevates the piece, while the detailed Nakshi work demonstrates superior craftsmanship. The Hyderabadi polish ensures lasting beauty and shine. A timeless heirloom piece that can be cherished for generations. The Guttapusalu style symbolizes prosperity and auspicious beginnings.",
  "tags": [
    "Haaram",
    "Necklace",
    "Guttapusalu",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Nakshi Work",
    "Ruby",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Vivaahaalu",
    "Nischitartham",
    "Telugu Jewelry",
    "Temple Jewelry",
    "Statement Necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0314_0511",
  "collection": "diamond"
}