{
  "id": "earrings-016",
  "title": "Manmohini Emerald & Diamond Jhumka: A Timeless Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold (Svarna)",
    "Faceted Emerald Drops",
    "Brilliant Cut Diamonds (Vajraalu)",
    "Cultured Pearls. Hyderabadi Polish for a lasting shine."
  ],
  "features": "Exquisite openwork Jhumka design inspired by traditional South Indian temple architecture. The ear studs feature a central pear-shaped emerald, surrounded by a halo of sparkling diamonds and ornate gold filigree. The dome-shaped jhumkas showcase an intricate floral lattice pattern, with rows of pavé-set diamonds adding brilliance. Delicate pearl drops enhance the feminine charm of the earrings.",
  "colors": [
    "Dominant Gold (Bangaru) with vibrant Emerald Green and dazzling White Diamonds. The soft luster of the pearls complements the overall color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "festivals (Pandugalu)",
    "receptions",
    "and special occasions. Ideal for Muhurtham",
    "Sangeet",
    "and other traditional South Indian celebrations. Can also be paired with contemporary outfits for a touch of ethnic elegance."
  ],
  "description": "A true testament to Hyderabadi craftsmanship, these Jhumkas blend tradition with modern sophistication. The high-quality emeralds and diamonds offer exceptional brilliance. These earrings are meticulously handcrafted and represent a valuable investment for generations to cherish. The openwork design ensures comfortable wear while making a bold statement.",
  "tags": [
    "Jhumka",
    "Chevy Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emerald",
    "Diamond",
    "Pearl",
    "Gold",
    "22K Gold",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Vajraalu",
    "Bangaru",
    "Pandugalu",
    "Vivaham",
    "Muhurtham",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_0de52c9f-17e5-46fc-99d0-e95fd52d7bd7_0077",
  "collection": "diamond"
}