{
  "id": "necklaces-052",
  "title": "The 'Manohari' Emerald & Diamond Bridal Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Natural Emeralds (Excellent Cut and Clarity)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color). Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "A breathtaking cascade of emeralds and diamonds in a traditional floral and paisley-inspired design. The Haaram showcases a graduating pattern of rectangular and pear-shaped emeralds, each meticulously surrounded by a halo of brilliant-cut diamonds. The intricate latticework is an ode to the artistry of Hyderabadi craftsmanship, providing excellent light return and sparkle. The design utilizes a prong setting to highlight the natural beauty of each gemstone.",
  "colors": [
    "Lustrous yellow gold",
    "vibrant green emeralds",
    "and dazzling white diamonds create a rich and captivating color palette."
  ],
  "occasions": [
    "Ideal for grand celebrations such as weddings (Vivaaham/పెళ్లి)",
    "engagements",
    "anniversaries",
    "and important cultural events like Seemantham/శ్రీమంతం. Its regal style makes it perfect for adding a touch of royal elegance to any formal occasion."
  ],
  "description": "This 'Manohari' Haaram is a true masterpiece, combining timeless elegance with superior craftsmanship. The vibrant emeralds symbolize prosperity and new beginnings, making it an auspicious choice for brides and celebratory occasions. The exceptional quality of the diamonds and the meticulous design ensure that this piece will be treasured for generations. Its Hyderabadi polish guarantees a lasting brilliance. Possessing this Haaram is owning a piece of South Indian heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Seemantham",
    "Traditional Jewelry",
    "Kanthaabharanam",
    "పతకం",
    "కంఠాభరణం",
    "Emerald Haar"
  ],
  "original_id": "diamond_jewellery_656b56a7-88f0-4a2e-a8b7-2d596fd17990_0131",
  "collection": "diamond"
}