{
  "id": "necklaces-177",
  "title": "Rajputana Emerald Kanthi - A Statement of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Square-Cut Emeralds (Excellent Clarity",
    "Deep Green Hue)",
    "Polki Diamonds. Features intricate Hyderabadi Polishing for a lustrous",
    "enduring shine."
  ],
  "features": "This exquisite Kanthi necklace features five large, square-cut emeralds, each framed by delicate Polki diamonds in a classic setting. The setting is reminiscent of Mughal era design, offering a vintage inspired aesthetic. The arrangement showcases a symmetrical design, with smaller diamond accents adding a touch of brilliance between each emerald. The chain portion is meticulously crafted from gold and lined with diamonds that enhance the overall grand look.",
  "colors": [
    "Deep Emerald Green",
    "Warm Gold",
    "and Sparkling White (Polki Diamonds). This classic color palette is indicative of royal Indian jewelry."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (Vivahaalu)",
    "receptions",
    "milestone celebrations",
    "and cultural events. A perfect statement piece for brides or anyone looking to add a touch of regal elegance to their ensemble."
  ],
  "description": "This Kanthi is a testament to exceptional craftsmanship, combining the timeless appeal of emeralds and Polki diamonds. The classic design ensures enduring style, making it a valuable heirloom piece. It's a bold statement of sophistication and a symbol of prosperity and good fortune. The Hyderabadi polish guarantees long-lasting brilliance and durability.",
  "tags": [
    "Kanthi",
    "Emerald Necklace",
    "Polki Diamond",
    "Statement Jewelry",
    "Indian Wedding Jewelry",
    "Traditional Necklace",
    "Hyderabadi Jewelry",
    "Royal Jewelry",
    "Vivahaalu",
    "Emerald Haaram",
    "Gold Necklace",
    "Mughal Jewelry",
    "Heritage Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0018_0426",
  "collection": "diamond"
}