{
  "id": "necklaces-127",
  "title": "Indrani Haar: Emerald and Ruby Navratna Pendant Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "High-Quality Zambian Emeralds (oval cut)",
    "Natural Polki Diamonds",
    "Natural Ruby (pear cut). Hyderabadi Polish for superior shine and durability."
  ],
  "features": "A stunning Haaram featuring a series of vibrant Zambian Emeralds, each framed by delicate Polki diamonds in a floral pattern. The focal point is a magnificent pear-shaped natural Ruby pendant, elegantly set within a Polki diamond halo. The setting style is inspired by traditional Mughal designs, rendered with modern finesse. The back of the pendant is meticulously designed to ensure comfort and balance.",
  "colors": [
    "Gold (warm yellow)",
    "Emerald (vibrant green)",
    "Ruby (deep red)",
    "Diamond (white). This color combination is considered auspicious in South Indian traditions."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "Seemantham",
    "and other festive celebrations. Also suitable for upscale social gatherings and cultural events where you want to make a sophisticated statement."
  ],
  "description": "This Indrani Haar is a timeless investment piece, meticulously handcrafted by skilled artisans in Hyderabad. The combination of Emeralds, Rubies, and Polki diamonds symbolizes prosperity, good health, and protection. The Hyderabadi polish enhances the gold's natural luster, ensuring a lasting brilliance. The traditional design elements blended with modern sensibilities make this necklace a unique and cherished heirloom.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Navratna",
    "Vivahaalu",
    "Nischitartham",
    "Seemantham",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "ఆభరణాలు",
    "నెక్లెస్",
    "పచ్చ",
    "రూబీ",
    "పోల్కీ డైమండ్స్"
  ],
  "original_id": "diamond_jewellery_DPNK8-1606_0360",
  "collection": "diamond"
}