{
  "id": "necklaces-150",
  "title": "Polki Star Tassel Haaram - A Celestial Delight",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Natural Freshwater Pearls",
    "Ruby Beads. Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This unique Haaram showcases a star-shaped pendant adorned with meticulously set Polki diamonds. Below the star, a larger Polki is suspended, leading to a delightful tassel composed of ruby beads and freshwater pearls. The chain features a alternating ruby and pearl design that adds a touch of modern sophistication to traditional aesthetics. The piece is handcrafted by skilled artisans, reflecting exquisite attention to detail.",
  "colors": [
    "Gold",
    "White (Pearls)",
    "Red (Rubies)",
    "Clear (Polki Diamonds). The combination of red and gold is considered auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (Vivaaham)",
    "receptions",
    "festive celebrations (Sankranthi",
    "Diwali)",
    "or a sophisticated evening out. It can also complement a half-saree function or other traditional ceremonies."
  ],
  "description": "A distinctive blend of traditional Polki craftsmanship with a contemporary design. The star motif is a modern twist on classic Indian jewelry. The use of high-quality Polki diamonds and natural pearls ensures lasting beauty and value. This statement piece is sure to turn heads and become a treasured heirloom.",
  "tags": [
    "Haaram",
    "Polki",
    "Diamond Necklace",
    "Pearl Jewelry",
    "Ruby Beads",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaaham",
    "Traditional Jewelry",
    "Tassel Necklace",
    "Star Pendant",
    "Uncut Diamonds",
    "Necklace",
    "Pearl and Ruby",
    "Contemporary Haaram"
  ],
  "original_id": "diamond_jewellery_DPPD8-1632_0383",
  "collection": "diamond"
}