{
  "id": "necklaces-010",
  "title": "The Amara Diamond Grandeur Set: A Contemporary Haaram and Jhumka Ensemble",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "18K Rose Gold with Premium Quality Cubic Zirconia (CZ) stones. Expertly crafted with Hyderabadi Polish for a lasting sheen and enhanced durability. Rhodium plating for enhanced shine."
  ],
  "features": "A stunning contemporary take on the classic Haaram design. The necklace features a cascading arrangement of floral and paisley-inspired motifs. Each piece is meticulously crafted with detailed openwork and prong settings to maximize the sparkle of the CZ stones. The matching Jhumkas echo the necklace's design, creating a harmonious and elegant set.",
  "colors": [
    "Rose gold and sparkling white CZ stones. The warm rose gold provides a subtle contrast that accentuates the brilliance of the stones",
    "creating a modern and sophisticated look."
  ],
  "occasions": [
    "Ideal for weddings",
    "receptions",
    "parties",
    "and special occasions. A perfect statement piece for the modern bride or any woman who desires a touch of elegance with a contemporary twist. Also perfect for events like Sangeet",
    "Mehndi",
    "Engagement",
    "and other festive events."
  ],
  "description": "This Amara Diamond Grandeur Set is a true masterpiece of modern jewelry design. The combination of premium materials, skilled craftsmanship, and a unique design makes it a valuable addition to any jewelry collection. Its versatility allows it to be worn for both traditional and modern occasions, making it a treasured heirloom for generations to come. The premium CZ stones give the look of real diamonds at an affordable price.",
  "tags": [
    "Diamond Necklace",
    "CZ Necklace",
    "Haaram",
    "Rose Gold Jewelry",
    "Jhumka",
    "Earrings",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Party Jewelry",
    "Modern Jewelry",
    "Hyderabadi Polish",
    "Contemporary Haaram",
    "Contemporary Jhumka",
    "Telugu Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0016_0045",
  "collection": "choker"
}