{
  "id": "necklaces-264",
  "title": "Vanya Kundan and Emerald Haar: A Symphony of Tradition and Modern Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Swarna) with intricate Kundan settings. Features a central pear-shaped Zambian Emerald (Panna) of exceptional color and clarity",
    "complemented by smaller round Emeralds. High-quality cubic zirconia stones for added brilliance. Hyderabadi Polish for a lasting shine."
  ],
  "features": "This contemporary Haaram reimagines classic Kundan craftsmanship. The floral motifs are meticulously handcrafted with embedded Kundan stones. The pendant showcases a prominent pear-shaped Zambian Emerald, beautifully framed by smaller emeralds and CZs. The floral elements provide an aesthetically pleasing chain formation.",
  "colors": [
    "Primarily gold and brilliant white (from the Kundan and CZ stones)",
    "accented by vibrant green emeralds."
  ],
  "occasions": [
    "Perfect for modern celebrations and special occasions. Its lighter weight and contemporary design make it suitable for engagements",
    "receptions",
    "Sangeet",
    "or any festive gathering. A graceful choice even for a modern bride who appreciates traditional craftsmanship."
  ],
  "description": "This Kundan Haar offers the timeless beauty of traditional Kundan jewelry with a modern, wearable design. The use of genuine Zambian Emeralds elevates its value and aesthetic appeal. The Hyderabadi polish ensures a lasting, rich luster. A piece that seamlessly blends cultural heritage with contemporary style.",
  "tags": [
    "Kundan",
    "Haaram",
    "Emerald",
    "Panna",
    "Necklace",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Fine Jewelry",
    "Swarna",
    "Zambian Emerald",
    "CZ",
    "Cubic Zirconia",
    "Modern Haaram"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0344_0541",
  "collection": "diamond"
}