{
  "id": "necklaces-1006",
  "title": "Heera Moti Bridal Set - Diamond and Pearl Haaram with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold base intricately set with brilliant-cut diamonds (VVS clarity",
    "EF color). Accented with genuine freshwater pearls and precious gemstones including emeralds and rubies. Boasts a stunning Hyderabadi polish for a lasting",
    "radiant shine."
  ],
  "features": "This exquisitely crafted Haaram features a delicate filigree design encrusted with shimmering diamonds. The necklace is further adorned with lustrous freshwater pearls that cascade gracefully. Emeralds and rubies provide pops of color in the center and accents, enhancing the overall opulence. The matching Jhumkas echo the necklace's intricate design, completing the bridal look. The pendant of the Haaram highlights a detailed, intricate floral design with pearled accents around the entire jewel.",
  "colors": [
    "Primarily gold and diamond white",
    "with vibrant accents of emerald green and ruby red. The pearls add a subtle",
    "iridescent glow."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "muhurtham",
    "receptions",
    "Seemantham ceremonies",
    "and grand celebrations. Also suitable for high-end social gatherings and cultural events."
  ],
  "description": "This Heera Moti bridal set is a timeless masterpiece, showcasing exceptional craftsmanship and traditional Hyderabadi artistry. The combination of sparkling diamonds, lustrous pearls, and precious gemstones exudes elegance and grandeur. The secure setting and durable materials ensure that this set will be treasured for generations. Symbolizes prosperity, purity, and good fortune, making it a meaningful addition to any bridal trousseau.",
  "tags": [
    "Bridal Jewelry",
    "Diamond Necklace",
    "Pearl Necklace",
    "Haaram",
    "Jhumka",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Hyderabad Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Heera Moti",
    "Vaddanam",
    "Seemantham",
    "Indian Wedding",
    "Traditional Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0464_2327",
  "collection": "necklace"
}