{
  "id": "necklaces-695",
  "title": "Exquisite Neelam Haaram - Sapphire and Diamond Cascade Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal with high-quality gold plating",
    "adorned with pear-cut simulated Neelam (Sapphire) gemstones and sparkling Cubic Zirconia (CZ) stones. Features a Hyderabadi-style polish for a lasting shine and rich appearance."
  ],
  "features": "This elegant Haaram showcases a cascading design with pear-shaped Neelam stones encircled by dazzling CZ diamonds. The symmetrical arrangement and central pendant enhance its traditional appeal with a contemporary touch. The necklace uses a secure clasp ensuring a comfortable fit.",
  "colors": [
    "Deep blue (Neelam) of the gemstones contrasts beautifully with the golden base",
    "creating a rich and striking color palette."
  ],
  "occasions": [
    "Perfect for special occasions like weddings",
    "engagements",
    "parties",
    "or festive celebrations. Its versatile design makes it suitable for both traditional Telugu functions like Muhurtham or Sangeeth and modern social gatherings."
  ],
  "description": "This Neelam Haaram offers a stunning combination of traditional aesthetics and modern elegance. The high-quality simulated gemstones provide the look of luxury without the premium price. The durable gold plating ensures longevity, making it a treasured piece for years to come. Its exquisite craftsmanship reflects the rich jewelry heritage of Hyderabad.",
  "tags": [
    "Necklace",
    "Haaram",
    "Neelam",
    "Sapphire",
    "Diamond",
    "CZ",
    "Cubic Zirconia",
    "Gold Plated",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Party Wear",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Gemstone Necklace",
    "Contemporary Haaram"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-53 2_1201",
  "collection": "diamond"
}