{
  "id": "earrings-501",
  "title": "Divine Lotus Chandbali Jhumka with Polki Diamonds, Ruby, Coral, and Pearls",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (approx.)",
    "Uncut Polki Diamonds (Natural Diamonds",
    "approx. 2.5 carats)",
    "Burmese Ruby Cabochons",
    "Natural Coral Beads",
    "South Sea Pearls. Hyderabadi Kundan Setting and Polish."
  ],
  "features": "Exquisite Chandbali design featuring a Lotus motif (Kamalam) at the top, adorned with vibrant Burmese Rubies and a central Polki Diamond. A second Polki-encrusted design cascades into a Jhumka bell shape. The Jhumka is decorated with Coral beads, freshwater pearls and Polki Diamonds, arranged in a captivating cascading waterfall of rice-like pearls (biwa pearls) and coral fringe. The piece is handcrafted with traditional Hyderabadi Kundan setting techniques, showcasing exceptional detail and a rich, antique-inspired aesthetic.",
  "colors": [
    "Gold",
    "Deep Red (Ruby)",
    "White (Diamonds and Pearls)",
    "Orange/Coral (Coral)",
    "Green."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham/Pelli)",
    "receptions",
    "engagements (Nischitartham)",
    "bridal showers",
    "festivals (like Diwali",
    "Sankranthi",
    "Ugadi)",
    "or any special occasion where you want to make a regal statement. Ideal for traditional Telugu/South Indian attire",
    "such as sarees",
    "lehengas",
    "and half-sarees (Langa Voni)."
  ],
  "description": "A true masterpiece of South Indian jewelry craftsmanship. This Chandbali Jhumka seamlessly blends traditional design elements with high-quality materials. The Lotus motif symbolizes purity and enlightenment, adding a spiritual dimension. The intricate Kundan setting and antique polish showcase the skill of master artisans. Polki Diamonds, known for their unique sparkle and heritage value, make this a heirloom-worthy piece. The combination of Ruby, Coral and Pearls is considered auspicious and aesthetically striking.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "Kundan",
    "Polki Diamonds",
    "Ruby",
    "Coral",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Antique Jewelry",
    "Kamalam",
    "Chevi Diddulu",
    "Ethnic Jewelry",
    "Bridal Jewelry",
    "22K Gold"
  ],
  "original_id": "ear_rings_DPER8-1645_2631",
  "collection": "ear"
}