{
  "id": "necklaces-810",
  "title": "Diamond Grandeur: Exquisite Bridal Haaram - Jan-11779",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold (108.910 GH)",
    "featuring Pear-shaped Diamonds (D.pan(+7):-12.47(183))",
    "Round Diamonds (D.pan(1/10):-8.20(78))",
    "Marquise Diamonds (D.mq(-7):-1.24(30)",
    "D.mq(+7):-2.40(44)",
    "D.mq(1/10):-1.71(19)). All diamonds are of GH color grade and VS clarity."
  ],
  "features": "This contemporary Haaram features a cascading design with meticulously set diamonds. The piece showcases a central floral motif that radiates outwards, leading to a delicate arrangement of pear-shaped diamonds resembling teardrops or leaves. The diamonds are expertly set in a pave style, maximizing sparkle and brilliance. The design blends modern aesthetics with a subtle hint of traditional South Indian artistry.",
  "colors": [
    "Predominantly white and clear due to the white gold and diamonds",
    "offering a timeless and elegant appeal."
  ],
  "occasions": [
    "Perfect for bridal occasions (Muhurtham",
    "Reception)",
    "grand celebrations",
    "and high-profile events. Its modern design also makes it suitable for sophisticated evening wear."
  ],
  "description": "This diamond haaram is a statement piece that combines unparalleled craftsmanship with exceptional diamond quality. Its versatile design allows it to be worn with both traditional silk sarees and modern gowns. The piece is a valuable investment, offering both beauty and enduring value. Its dazzling sparkle and exquisite design will undoubtedly make you the center of attention. The delicate pear-shaped diamond arrangement gives a light and graceful feel, enhancing the overall elegance.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Bridal Jewelry",
    "Wedding Necklace",
    "South Indian Jewelry",
    "Diamond Jewelry",
    "White Gold Necklace",
    "Contemporary Jewelry",
    "Reception Jewelry",
    "Muhurtham Jewelry",
    "Hyderabadi Jewelry",
    "Party wear Necklace",
    "Diamond Haar",
    "Diamonds",
    "White Gold",
    "Vaddanam",
    "Kante",
    "Bridal Set"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-43_1404",
  "collection": "diamond"
}