{
  "id": "waistbands-017",
  "title": "Diamond and Emerald Vaddanam - The Regal Lakshmi Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "18K Gold",
    "Brilliant Cut Diamonds (16.60 carats total)",
    "Emeralds (18.05 carats total)",
    "South Sea Pearls (31.10 carats total). Hyderabadi Polish."
  ],
  "features": "This magnificent Vaddanam showcases an intricate floral and paisley design, meticulously crafted with brilliant-cut diamonds. Features 8 square-cut Emeralds, adding a touch of regal elegance. Delicate South Sea Pearls dangle from the lower edge, creating a mesmerizing sway. Traditional filigree work (Jali) provides depth and texture. The central motif is a stylized floral piece. The Vaddanam is designed with a flexible framework for comfortable wear.",
  "colors": [
    "Predominantly white (diamonds)",
    "with striking green accents (emeralds) and lustrous cream (pearls). The gold provides a subtle warm undertone."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "receptions",
    "Seemantham (baby shower)",
    "and other grand celebrations. A perfect heirloom piece to be passed down through generations."
  ],
  "description": "Crafted with meticulous attention to detail by our skilled artisans, this Vaddanam exudes timeless elegance and luxury. The combination of diamonds, emeralds, and South Sea pearls represents prosperity and good fortune, making it a cherished investment. The Hyderabadi Polish ensures lasting brilliance and durability. Represents enduring Indian tradition and heritage.",
  "tags": [
    "Vaddanam",
    "Kamarband",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Andhra Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Nakshi work",
    "Seemantham",
    "Vivaha",
    "కమ్మర్‌బంద్",
    "వడ్డాణం"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-03 3_1298",
  "collection": "diamond"
}