{
  "id": "rings-002",
  "title": "Lakshmi Devi Devotional Finger Ring - A Touch of Divinity",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold",
    "meticulously crafted with shimmering CZ stones",
    "rich Ruby accents",
    "and Emerald highlights. Features a beautifully detailed Lakshmi Devi idol crafted in oxidized metal for contrast. Hyderabadi Polish provides a lasting luster."
  ],
  "features": "This exquisite ring showcases a classic square temple design. At its heart lies the Lakshmi Devi motif, meticulously detailed and placed within an ornate filigree setting. The surrounding CZ stones are pave-set for maximum brilliance, while the rubies and emeralds add a touch of traditional South Indian color. The shank is designed for a comfortable fit, ensuring ease of wear.",
  "colors": [
    "Predominantly gold with a vibrant contrast of red (rubies)",
    "green (emeralds)",
    "and sparkling white (CZ stones). The Lakshmi Devi idol features a darker",
    "oxidized finish for enhanced detail."
  ],
  "occasions": [
    "Perfect for festive occasions like Diwali",
    "Ugadi",
    "Varalakshmi Vratham",
    "and weddings. Also a beautiful and meaningful addition to everyday wear for the devout."
  ],
  "description": "This ring seamlessly blends devotion with refined elegance. The intricate Lakshmi Devi design symbolizes prosperity and good fortune, making it a cherished heirloom piece. Crafted with the highest quality materials and traditional Hyderabadi craftsmanship, this ring is not just a piece of jewelry, but a symbol of your faith and style.",
  "tags": [
    "Ring",
    "Angu",
    "Temple Jewelry",
    "Lakshmi Devi",
    "Goddess",
    "Gold",
    "CZ",
    "Ruby",
    "Emerald",
    "Traditional",
    "South Indian",
    "Hyderabadi Jewelry",
    "Devotional",
    "Festival",
    "Wedding",
    "Vara Lakshmi Vratham",
    "Ugadi",
    "Diwali",
    "Antique Finish",
    "Filigree",
    "Pave Setting"
  ],
  "original_id": "diamond_jewellery_8ad8166d-86dc-4a2e-a7f8-28a438330e49_0154",
  "collection": "diamond"
}