{
  "id": "necklaces-645",
  "title": "Enchanting Emerald Vaalai Poo Haaram with Diamond Floral Motifs",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (Yellow and White Gold)",
    "Fine-cut Diamonds (SI clarity",
    "GH color)",
    "Natural Emeralds (Teardrop & Round Cut",
    "Medium Green Hue). Features Hyderabadi Polish for lasting sheen."
  ],
  "features": "Intricate floral designs studded with brilliant-cut diamonds and vibrant emerald accents. The Vaalai Poo (banana flower) Haaram design is modernized with delicate diamond lacework. Features pear-shaped emerald drops for graceful movement and a touch of traditional charm. The emeralds are bezel set for security and to enhance their natural luster.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "complemented by rich green emeralds. A harmonious blend of traditional South Indian color palettes."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "sangeet ceremonies",
    "and grand festive occasions like Ugadi and Sankranthi. Also suitable for upscale parties and modern celebrations where a touch of South Indian elegance is desired."
  ],
  "description": "This exquisite Haaram beautifully marries traditional South Indian design with contemporary aesthetics. The combination of sparkling diamonds and vibrant emeralds creates a captivating effect. The fine craftsmanship and high-quality materials ensure that this piece will be treasured for generations. The Vaalai Poo design symbolizes prosperity and good fortune, making it a meaningful and cherished heirloom.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Vaalai Poo",
    "Emeralds",
    "Diamonds",
    "Gold Necklace",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Festive Jewelry",
    "Ugadi",
    "Sankranthi",
    "Muhurtham",
    "Reception Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-19 3_1151",
  "collection": "diamond"
}