{
  "id": "necklaces-1574",
  "title": "Emerald and Diamond Statement Haaram - Bridal Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Platinum setting with 18K White Gold accents. Features round brilliant cut diamonds (FG color grade) and vibrant",
    "pear-shaped Zambian Emeralds (16.55 carats). The diamond weight is approximately 83.67 carats. Hyderabadi Polish for enduring brilliance."
  ],
  "features": "Exquisite floral and vine motifs are created using pave-set diamonds, framing the magnificent emeralds. The central cluster features a larger pear-shaped emerald, creating a focal point. The design showcases a modern take on the traditional Haaram, offering both elegance and statement appeal.",
  "colors": [
    "Predominantly white and green",
    "the sparkling white diamonds provide a stunning contrast to the deep green emeralds. The platinum and white gold setting enhances the vibrancy of both gemstones."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivahaalu)",
    "receptions",
    "engagement ceremonies",
    "and other significant celebrations. A standout piece for a contemporary bride embracing traditional aesthetics."
  ],
  "description": "A breathtaking statement piece, this haaram showcases exceptional craftsmanship and the allure of natural emeralds. The platinum and white gold setting ensures lasting durability and a luxurious feel. The fusion of traditional design with modern elegance makes it a versatile investment.",
  "tags": [
    "Haaram",
    "Emerald Necklace",
    "Diamond Necklace",
    "Platinum Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Statement Necklace",
    "Fine Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kanthabharanam",
    "Contemporary Haaram",
    "Zambian Emerald",
    "Pave Setting",
    "Hyderabadi Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-43 2_2279",
  "collection": "sjpl"
}