{
  "id": "earrings-246",
  "title": "Navaratna Kempu Kundan Studs - Auspicious Flower Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Natural Ruby (Kempu)",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Pearl",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye",
    "Coral",
    "all set in Kundan style. Hyderabadi Polish for a lasting luster."
  ],
  "features": "These earrings showcase the traditional Navaratna setting in a contemporary floral design. Each petal of the flower features a different gemstone, representing the nine celestial influences. The central Ruby (Kempu) is surrounded by carefully selected gemstones. The Kundan setting adds a touch of vintage charm, while the stud style offers modern wearability.",
  "colors": [
    "Predominantly gold",
    "with a vibrant spectrum of colors from the gemstones: Ruby Red",
    "Emerald Green",
    "Yellow Sapphire Yellow",
    "Diamond White",
    "Pearl White",
    "Blue Sapphire Blue",
    "Hessonite Brown",
    "Cat's Eye Green-Gray",
    "and Coral Orange."
  ],
  "occasions": [
    "Perfect for daily wear",
    "festive occasions",
    "or as an auspicious gift. Suitable for traditional ceremonies like pujas",
    "Grahapravesam",
    "or even paired with modern attire for a touch of cultural elegance. They are perfect for functions like haldi and mehendi ceremonies."
  ],
  "description": "These Navaratna earrings are more than just jewelry; they're a symbol of prosperity and well-being. The combination of traditional Kundan craftsmanship and modern design makes them versatile and unique. The vibrant gemstones are carefully selected for their quality and brilliance. The Hyderabadi polish ensures a lasting shine and durability, ensuring these earrings become a cherished heirloom.",
  "tags": [
    "Navaratna",
    "Kundan",
    "Earrings",
    "Studs",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Gemstone Jewelry",
    "Kempu",
    "Traditional Jewelry",
    "Festive",
    "Auspicious",
    "Hyderabadi Jewelry",
    "Kammalu",
    "Vintinta",
    "22K Gold"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-04-20-13-18-48_0824",
  "collection": "diamond"
}