{
  "id": "earrings-095",
  "title": "Aadhya Emerald & Diamond Gold Jhumka: A Touch of Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "ethically sourced Emerald (Marakathamani)",
    "and high-quality Cubic Zirconia. Features a stunning Hyderabadi Polish for exceptional luster and durability."
  ],
  "features": "Classic Jhumka design with intricate filigree work and delicate diamond accents surrounding a captivating teardrop Emerald center stone. The base features three charming gold ball drops. The design is inspired by traditional Andhra temple art (గుడి నమూనా) and is meticulously handcrafted by skilled artisans.",
  "colors": [
    "Predominantly warm gold",
    "complemented by the vibrant green of the Emerald and the sparkling white of the Cubic Zirconia. A traditional color palette often seen in South Indian bridal jewelry."
  ],
  "occasions": [
    "Perfect for traditional occasions like weddings (పెళ్లి)",
    "festivals (పండుగలు)",
    "and family celebrations. Also suitable for adding a touch of elegance to modern events and gatherings. Ideal for Muhurtham",
    "Seemantham",
    "and half-saree functions."
  ],
  "description": "This Jhumka seamlessly blends traditional South Indian artistry with modern jewelry design. The use of genuine Emerald and high-quality Cubic Zirconia ensures lasting beauty and value. The 22K gold construction offers exceptional durability and a rich, luxurious look. The Hyderabadi polish guarantees a high shine and tarnish resistance. A heirloom piece to be cherished for generations.",
  "tags": [
    "Jhumka",
    "Earrings",
    "చెవి దిద్దులు",
    "South Indian Jewelry",
    "Andhra Jewelry",
    "Temple Jewelry",
    "22K Gold",
    "Emerald",
    "Marakathamani",
    "Diamond",
    "Cubic Zirconia",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Filigree",
    "Gold Ball Earrings",
    "గుడి నమూనా"
  ],
  "original_id": "diamond_jewellery_c6c7f676-1b4e-4a11-8c77-05a9417438d2_0194",
  "collection": "diamond"
}