{
  "id": "bangles-094",
  "title": "Lakshmi Vanki - Divine Bangle with Gemstone Mandala",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold (Suddha Bangaram). Adorned with meticulously set Round Brilliant Cut Diamonds (Vajralu)",
    "vibrant Rubies (Erra Manikyam)",
    "a central Emerald (Pachcha) and Coral (Pagadam). Features a Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This Vanki Kada features a striking mandala design, incorporating traditional South Indian floral motifs and intricate filigree work. The center boasts a lush green emerald, surrounded by a halo of rich red rubies and sparkling diamonds. The addition of coral beads on the sides adds a touch of auspiciousness. The lattice structure offers a contemporary twist to a classic design. The bangle incorporates a secure clasp for ease of wear and removal.",
  "colors": [
    "Dominant gold hue with contrasting red of the rubies and coral",
    "the vibrant green of the emerald",
    "and the dazzling white of the diamonds. A traditional and auspicious color combination."
  ],
  "occasions": [
    "Ideal for weddings (vivahaalu)",
    "festive occasions (pandugalu)",
    "and traditional South Indian ceremonies. It's a stunning piece for the bride's trousseau (pellikuturu)",
    "especially for the muhurtham ceremony. Also perfect for modern celebratory events."
  ],
  "description": "A timeless piece that blends tradition with contemporary design. The use of high-quality gemstones and meticulous craftsmanship ensures both lasting beauty and enduring value. The mandala design symbolizes completeness and unity, making it a powerful and meaningful gift. The Vanki Kada is a representation of Goddess Lakshmi and hence the piece is not only beautiful but also auspicious.",
  "tags": [
    "Vanki",
    "Kada",
    "Bangle",
    "Gold",
    "Diamond",
    "Ruby",
    "Emerald",
    "Coral",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Indian Wedding",
    "Hyderabadi Jewelry",
    "Lakshmi",
    "Mangalsutra",
    "Vajralu",
    "Erra Manikyam",
    "Pachcha",
    "Pagadam",
    "Vivahaalu",
    "Pandugalu"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0370_0022",
  "collection": "bracelets"
}