{
  "id": "necklaces-073",
  "title": "Vasundhara Kundan & Pearl Choker - A Royal Statement",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "High-Quality Kundan Stones",
    "Natural Rubies",
    "Emeralds",
    "and Cultured Pearls. The kundan stones are carefully selected for their clarity and brilliance. The Pearls are South Sea pearls."
  ],
  "features": "This exquisite choker features a traditional Kundan setting, meticulously handcrafted by skilled artisans. The intricate floral design is adorned with vibrant Rubies and sparkling Kundan stones, creating a regal look. Emerald drops add a touch of elegance. The pearl strings are woven to provide strength and comfort. The piece showcases the famed Hyderabadi craftsmanship and attention to detail.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Emerald Green",
    "and Pearl White. The classic color combination adds a timeless charm",
    "embodying traditional South Indian aesthetics."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "bridal wear",
    "receptions",
    "and other special occasions. Suitable for traditional ceremonies like Seemantham (baby shower) and half-saree functions (Vayyarala Voobata). Can also be paired with modern outfits for a fusion look."
  ],
  "description": "This Vasundhara Choker is a testament to South Indian heritage and skilled craftsmanship. Its regal design, combined with the brilliance of Kundan stones and the allure of natural gemstones, makes it a valuable heirloom piece. The use of high-quality materials ensures its durability and lasting beauty. A true statement of grace and elegance.",
  "tags": [
    "Kundan Choker",
    "Gold Necklace",
    "Ruby Emerald Jewelry",
    "Pearl Choker",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Ethnic Jewelry",
    "Vivaham",
    "Nischitartham",
    "Seemantham",
    "Vayyarala Voobata",
    "Gadwal Choker",
    "Kundan Kanthi",
    "Mutyala Haram"
  ],
  "original_id": "diamond_jewellery_DPCK8-1255_0232",
  "collection": "diamond"
}