{
  "id": "necklaces-1515",
  "title": "Vaibhav Lakshmi Kasulaperu Haaram with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant-cut CZ Stones",
    "Pear-Shaped Emeralds (Natural",
    "SI Clarity). Features our signature Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite Haaram features a classic kasulaperu (coin) design reimagined with floral motifs encrusted with shimmering CZ stones. The radiant pear-shaped emeralds add a touch of royalty. The multi-strand design creates a cascading effect, highlighting the intricate craftsmanship. Meticulously handcrafted by artisans from the old city of Hyderabad, each coin is carefully linked to ensure a fluid and graceful drape.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and Brilliant White (CZ stones). A vibrant and auspicious color combination symbolizing prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for weddings (Veedhuka)",
    "engagement ceremonies",
    "Seemantham",
    "or any grand celebration. Its regal look also makes it ideal for festive occasions like Ugadi and Sankranti."
  ],
  "description": "A stunning blend of tradition and elegance, this Kasulaperu Haaram is a timeless investment. The use of high-quality emeralds and brilliant-cut CZs ensures exceptional sparkle and brilliance. The piece's intricate detailing and durable craftsmanship make it a cherished heirloom to be passed down through generations. Symbolically, the Kasulaperu represents wealth and prosperity, making it a meaningful and auspicious addition to your jewelry collection.",
  "tags": [
    "Kasulaperu",
    "Haaram",
    "Necklace",
    "22K Gold",
    "Emerald",
    "CZ",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Veedhuka",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Lakshmi Kasulaperu",
    "Indian Wedding",
    "Ethnic Jewelry",
    "Bridal Haaram",
    "Gold Necklace",
    "ఆభరణాలు",
    "నగలు",
    "హారం",
    "కాసులపేరు",
    "పచ్చలు"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-39_2133",
  "collection": "sjpl"
}