{
  "id": "necklaces-1239",
  "title": "Rajalakshmi Haaram: Diamond, Ruby, and Emerald Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (estimated 12.26 carats)",
    "Faceted Rubies (estimated 42.84 carats)",
    "Emerald Beads (estimated 16.59 carats)",
    "Ruby Beads (estimated 83.08 carats) . Exquisite Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "A breathtakingly opulent Haaram featuring a graduated design with cascading emerald beads and ruby accents. The intricate goldwork is meticulously set with brilliant-cut diamonds in a floral and geometric pattern. Features larger, rectangular cut rubies interspersed throughout the diamond setting for a regal touch. A detachable pendant features a large central emerald, framed by diamonds and ruby beads, adding versatility. Traditional South Indian design elements are seamlessly blended with a modern aesthetic.",
  "colors": [
    "Gold (22K)",
    "Deep Red (Rubies)",
    "Vibrant Green (Emeralds)",
    "Sparkling White (Diamonds). The classic combination of red",
    "green",
    "and gold is considered highly auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaaham)",
    "engagements (Nischithartham)",
    "Seemantham (baby shower)",
    "and other significant celebrations. Also suitable for upscale parties and cultural events where you want to make a statement."
  ],
  "description": "This Rajalakshmi Haaram is a testament to exquisite craftsmanship and timeless beauty. The combination of high-quality diamonds, rubies, and emeralds, set in rich 22K gold with a Hyderabadi polish, makes this piece a true heirloom. The detachable pendant offers versatility in styling, allowing you to adapt the necklace to different occasions. The combination of modern and traditional elements ensures it will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Ruby",
    "Emerald",
    "Diamond",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Vivaaham",
    "Nischithartham",
    "Seemantham",
    "Ethnic Jewelry",
    "Temple Jewelry",
    "Grand Necklace",
    "Manikyam",
    "Pachalu",
    "Vairam"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-59 3_1813",
  "collection": "sjpl"
}