{
  "id": "necklaces-1228",
  "title": "Stunning Diamond and Emerald Grand Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (99.650g gross weight)",
    "High-quality Diamonds (9.93 carat total diamond weight; 951 individual stones in the necklace and 2.25 carat total diamond weight; 196 stones only in the locket)",
    "Natural Rubies (4.15 carat total weight; 4 stones in the necklace and 2.45 carat total weight; 3 stones only in the locket)",
    "Emeralds (2.85 carat total weight; 2 stones in the necklace and 1.56 carat total weight; 1 stone only in the locket). Hyderabadi Polish."
  ],
  "features": "This exquisite Grand Haaram features a layered design with intricate diamond-studded floral motifs. The centerpiece consists of a large, circular pendant and drop-down locket each featuring a vibrant green emerald surrounded by a halo of sparkling diamonds. The necklace includes dangling gold beads adding movement and dimension. The piece exhibits detailed filigree work giving it a classic appeal with a modern twist. The setting is meticulously done to ensure maximum brilliance and durability.",
  "colors": [
    "Predominantly gold and white (diamonds) with pops of vibrant green from the emeralds and red from the rubies."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "Muhurtham",
    "grand receptions",
    "or any occasion where you want to make a statement. Also suitable for Seemantham or a Half-Saree function."
  ],
  "description": "This Grand Haaram is a testament to timeless elegance and superior craftsmanship. The combination of premium quality diamonds, rubies, and emeralds set in 18K gold makes it a valuable investment. Its intricate design and traditional elements reflect South Indian heritage, making it a cherished heirloom. The meticulous attention to detail and expert craftsmanship ensure lasting beauty and durability.",
  "tags": [
    "Grand Haaram",
    "Diamond Necklace",
    "Emerald Jewelry",
    "South Indian Jewellery",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Traditional Jewelry",
    "18K Gold",
    "Ruby Accent",
    "Mohana Mala",
    "Kasulaperu",
    "Addigai"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-55_1802",
  "collection": "sjpl"
}