{
  "id": "necklaces-1011",
  "title": "Manasa Diamond Haaram Set - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Ruby",
    "Natural Emerald",
    "South Sea Pearls. Exhibits a signature Hyderabadi polish for a lasting luster."
  ],
  "features": "Features an intricate floral design with diamond pavé setting, accentuated with a central emerald and ruby. Delicate South Sea pearls dangle gracefully, adding a touch of traditional elegance. The accompanying Jhumka earrings mirror the Haaram's design, completing the set with exquisite symmetry.",
  "colors": [
    "Predominantly white (diamonds) and gold",
    "complemented by the vibrant green of the emerald",
    "the rich red of the ruby",
    "and the creamy white of the South Sea pearls. A classic and auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "and other grand celebrations. A beautiful addition to a bride's trousseau (Pelli Vantalu) or for a half-saree function (Half Saree Function). Also suitable for festive occasions like Diwali and Sankranthi."
  ],
  "description": "A stunning fusion of tradition and modern design. The high-quality diamonds and South Sea pearls ensure a luxurious and lasting investment. The exquisite craftsmanship reflects the rich heritage of Hyderabad's jewelry making traditions. This set will become a cherished heirloom, passed down through generations.",
  "tags": [
    "Diamond Haaram",
    "Necklace Set",
    "Jhumka Earrings",
    "South Sea Pearls",
    "Ruby",
    "Emerald",
    "18K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Pelli Vantalu",
    "Half Saree Function",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0470_2332",
  "collection": "necklace"
}