{
  "id": "necklaces-387",
  "title": "Emerald and Ruby Nakshi Pendant Haaram - Panchala Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (Superior Quality)",
    "Natural Ruby (High Clarity)",
    "Polki Diamonds. Features exquisite Hyderabadi Polish for lasting luster."
  ],
  "features": "This stunning Haaram showcases alternating oval-cut emeralds secured with meticulously crafted Polki diamond floral accents. The intricate Nakshi work in the gold settings adds a touch of traditional elegance. The centerpiece is a teardrop-shaped ruby pendant surrounded by Polki diamonds, creating a mesmerizing focal point.",
  "colors": [
    "Vibrant green of the emeralds",
    "deep reddish-pink of the ruby",
    "warm yellow of the 22K gold",
    "and the sparkling white of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivahaalu)",
    "engagement ceremonies ( நிச்சయ తాంబూలం )",
    "Seemantham (శ్రీమంతం)",
    "Half-Saree functions (పట్టు లంగా ఫంక్షన్)",
    "and upscale gala events. An excellent choice for the modern bride seeking a blend of tradition and sophistication."
  ],
  "description": "A captivating blend of traditional South Indian artistry and modern design. The natural emeralds and ruby are of exceptional quality, promising enduring beauty and value. The Hyderabadi polish ensures a radiant and long-lasting finish. Makes a statement and celebrates the rich heritage of South Indian jewelry. A treasured heirloom piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Polki Diamond",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "22K Gold",
    "Vivaham",
    "Kanthabharanum",
    "కంఠాభరణము",
    "SriMantham",
    "Sreemantham",
    "ShreeMantham",
    "Langa Voni",
    "Langa Oni",
    "Wedding Necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20241218-WA0018_0780",
  "collection": "diamond"
}