{
  "id": "earrings-122",
  "title": "Divine Teardrop: Polki Kundan Jhumka",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds",
    "Green Tourmaline",
    "Rose Quartz drop. The Polki diamonds are set in traditional Kundan setting."
  ],
  "features": "This unique Jhumka design showcases a blend of traditional Kundan craftsmanship with a modern sensibility. The design begins with a square Polki diamond surrounded by smaller diamonds. Underneath it a triangular green tourmaline gemstone adds a pop of color. A delicate Rose Quartz teardrop hangs elegantly, adding a touch of femininity. The Kundan setting is meticulously handcrafted, enhancing the brilliance of the Polki diamonds.",
  "colors": [
    "Gold",
    "White (Polki)",
    "Green (Tourmaline)",
    "Pink (Rose Quartz). The traditional gold and white combination is accentuated by the modern addition of green and pink."
  ],
  "occasions": [
    "Perfect for engagements",
    "weddings (Muhurtham)",
    "receptions",
    "and festive occasions like Diwali or Sankranti. Also suitable for formal parties and contemporary events."
  ],
  "description": "This Jhumka embodies the rich heritage of Hyderabadi jewelry design while incorporating modern gemstone elements. The Polki diamonds possess a unique, timeless appeal. The combination of Tourmaline and Rose Quartz adds a touch of unconventional elegance. The Kundan setting ensures the durability and security of the stones. It's a versatile piece that can be worn for both traditional and modern events.",
  "tags": [
    "Jhumka",
    "Chevi Duddulu",
    "Polki",
    "Kundan",
    "Diamonds",
    "Tourmaline",
    "Rose Quartz",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Earrings",
    "Gold",
    "22K Gold",
    "Gemstone Earrings",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_DPER8-1053_0244",
  "collection": "diamond"
}