{
  "id": "necklaces-1028",
  "title": "Emerald & Diamond Leaf Haaram - Prakruthi Shobha Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold with Hyderabadi Polish; Natural Emeralds (Pear Cut",
    "High Clarity) weighing approximately 15 carats; Brilliant Cut Diamonds (VS Clarity",
    "G Color) weighing approximately 3 carats."
  ],
  "features": "This exquisite Haaram features a delicate leaf-and-vine motif. Each leaf is meticulously crafted in 18k gold and studded with pave-set diamonds. The pear-shaped emeralds are securely bezel-set, accentuating their vibrant green hue. The necklace showcases a contemporary interpretation of traditional South Indian design, blending classic elements with modern aesthetics. Fine Milgrain detailing on the goldwork adds a touch of vintage charm.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "and Sparkling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (vivahaalu)",
    "receptions",
    "upscale parties",
    "anniversary celebrations",
    "and other special occasions. Its elegant design also complements contemporary ethnic wear for modern events."
  ],
  "description": "This Haaram seamlessly blends traditional South Indian design with modern elegance. The high-quality emeralds and diamonds ensure lasting brilliance, while the Hyderabadi polish provides a rich, luxurious finish. It's a versatile piece that can be cherished for generations, making it a valuable addition to any jewelry collection. The emeralds symbolize prosperity and good fortune, making it an auspicious choice for celebratory occasions.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Fine Jewelry",
    "Gold Necklace",
    "Bridal Jewelry",
    "Contemporary Haaram",
    "Prakruthi Shobha",
    "Vivahaalu",
    "Emerald Necklace"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0487_2349",
  "collection": "necklace"
}