{
  "id": "necklaces-1061",
  "title": "Enchanting Polki & Emerald Haar: The 'Indra Dhanush' Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Natural Emerald Beads (Zambian Origin)",
    "Enamel Detailing. Features Hyderabadi polish for a lasting luster."
  ],
  "features": "This captivating Haar showcases the timeless elegance of uncut Polki diamonds, meticulously set in a closed setting. Emerald beads (paccha ralla) provide a striking contrast. The graduated design creates a cascading effect, culminating in Polki diamond drop pendants that exude regal charm. The design incorporates a vintage aesthetic with modern flair, making it a truly unique statement piece. The back features intricate gold detailing.",
  "colors": [
    "Gold (yellow gold hue)",
    "Polki Diamond (white/off-white)",
    "Emerald (deep green)."
  ],
  "occasions": [
    "Perfect for weddings (Vadhuvu",
    "Pelli)",
    "Seemantham (baby shower)",
    "half-saree functions (Langa Voni)",
    "and grand receptions. Also suitable for upscale social gatherings and festive celebrations like Diwali and Sankranthi."
  ],
  "description": "This Haar blends the rich heritage of South Indian jewelry with contemporary design sensibilities. The uncut Polki diamonds, celebrated for their natural beauty and vintage appeal, radiate an unmatched brilliance. The emerald accents add a touch of vibrant color and are considered auspicious. The handcrafted design ensures durability and uniqueness, making it a cherished heirloom. The Hyderabadi polish enhances the gold's natural luster and provides a lasting shine. This piece is not just jewelry; it's a work of art that embodies tradition, luxury, and refined taste.",
  "tags": [
    "Polki Necklace",
    "Emerald Haar",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Bridal Necklace",
    "Vadhuvu Jewellery",
    "Pelli Jewellery",
    "Uncut Diamond",
    "Zambian Emerald",
    "Paccha Ralla",
    "Traditional Jewellery",
    "Statement Necklace",
    "Indian Wedding",
    "Heirloom Jewelry",
    "22K Gold",
    "Hyderabadi Polish"
  ],
  "original_id": "radhe_diam_DPNK8-1496_2474",
  "collection": "radhe"
}