{
  "id": "earrings-260",
  "title": "Rajsi Jadau Jhumkas: Emerald Splendor with Pearl Drops",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Natural Emeralds (High Clarity",
    "Brilliant Cut)",
    "Cultured Pearls. Crafted with traditional Hyderabadi Polish for a rich",
    "enduring luster."
  ],
  "features": "Intricate Jadau setting showcasing the vibrant Emeralds. The design incorporates delicate floral motifs, reminiscent of Mughal artistry, with pearl drops adding a touch of classic South Indian elegance. Features an antique finish, highlighting the exquisite detailing and depth of the craftsmanship.",
  "colors": [
    "Lush Emerald Green",
    "Rich Gold",
    "and Creamy White Pearls create a regal and timeless color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu / పెళ్ళి)",
    "receptions",
    "festive celebrations (Pandagalu / పండగలు)",
    "and special occasions where you want to make a statement of refined elegance. Ideal for pairing with traditional silk sarees or modern Indo-Western attire."
  ],
  "description": "These Jadau Jhumkas are a testament to enduring craftsmanship and timeless design. The exquisite Emeralds symbolize prosperity and good fortune, while the pearls represent purity and wisdom. A true heirloom piece to be cherished for generations. Features the traditional Jadau setting, a labor-intensive technique perfected over centuries. The unique combination of vibrant Emeralds and lustrous Pearls sets it apart from ordinary jewelry.",
  "tags": [
    "Jhumka",
    "Jadau",
    "Emerald",
    "Pearl",
    "Earrings",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Antique Finish",
    "Vivahaalu",
    "Pandagalu",
    "చెవి దుద్దులు",
    "జడావు",
    "పచ్చలు",
    "ముత్యాలు",
    "పెళ్ళి",
    "పండగలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-27_0886",
  "collection": "diamond"
}