{
  "id": "necklaces-1105",
  "title": "Rajputana Ruby Bead Polki Haaram - An Enchanting Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Fine Quality Polki Diamonds",
    "Faceted Ruby Beads",
    "Emerald Accents",
    "South Sea Pearls. Features traditional Hyderabadi Polish for a rich",
    "warm tone."
  ],
  "features": "This stunning haaram features five strands of meticulously strung ruby beads, enhanced with intricately crafted elephant motifs set with polki diamonds and emeralds. The elaborate pendant showcases a central oval-cut emerald, surrounded by a dazzling array of uncut polki diamonds in a floral motif. The lower portion of the pendant features delicately dangling ruby beads and South Sea pearls, adding a touch of elegance. The pendant design also incorporates two peacock motifs, symbolizing prosperity and good fortune. The Polki setting is done in the traditional 'Kundun' style, showcasing the skill of our master artisans.",
  "colors": [
    "Primarily Ruby Red",
    "Emerald Green",
    "Gold",
    "and White (from the Polki diamonds and pearls). This classic South Indian color palette is considered auspicious."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivahaalu)",
    "engagement ceremonies (Muhurtham)",
    "pre-wedding celebrations",
    "and important religious functions. Its exquisite design also makes it a beautiful statement piece for upscale social events."
  ],
  "description": "This Rajaputana Ruby Bead Polki Haaram is more than just jewelry; it's an investment in artistry and heritage. The use of high-quality polki diamonds and natural rubies ensures lasting beauty and value. The traditional Hyderabadi craftsmanship and the symbolic peacock motifs add a layer of cultural significance, making it a cherished heirloom to be passed down through generations. Its distinctive design offers a seamless blend of traditional elegance and contemporary appeal.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki",
    "Diamonds",
    "Ruby",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Kundun",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Temple Jewelry",
    "Vivahaalu",
    "Muhurtham",
    "Elephant Motif",
    "Peacock Motif",
    "Heirloom Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "radhe_diam_DPPD8-664_2518",
  "collection": "radhe"
}