{
  "id": "earrings-298",
  "title": "Emerald Blossom Diamond Jhumka - Pancharatna Kundan Jhummakulu",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features emerald cabochons (approximately 2 carats total weight) and high-quality cubic zirconia stones with VVS clarity. Genuine seed pearl accents at the bottom of the jhumka."
  ],
  "features": "These elegant Jhumkas feature a floral motif at the ear lobe adorned with a central emerald. The cascading design leads to a classic bell-shaped Jhumka, intricately latticed with diamond-like CZ stones. Features a hanging seed pearl for a touch of traditional charm. The openwork design lends a modern, lightweight feel to a traditional form.",
  "colors": [
    "Gold",
    "Emerald Green",
    "and shimmering white (CZ stones). The traditional color combination is highly auspicious."
  ],
  "occasions": [
    "Perfect for weddings (Pendli)",
    "receptions",
    "Seemantham",
    "or any special occasion where you want to showcase your traditional elegance. Also suitable for formal events and festive gatherings."
  ],
  "description": "These Jhumkas beautifully blend tradition and modern aesthetics. The Hyderabadi polish ensures a lasting shine, while the high-quality CZ stones provide exceptional brilliance at an accessible price point. The emerald accents add a touch of regality and auspiciousness. A timeless design that will be treasured for generations. Lightweight and comfortable for extended wear.",
  "tags": [
    "Jhumka",
    "Jhummakulu",
    "Earrings",
    "Gold Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Emerald",
    "Cubic Zirconia",
    "CZ",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Kundan",
    "Pancharatna",
    "Pendli",
    "Seemantham",
    "Seed Pearl"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-34_1327",
  "collection": "diamond"
}