{
  "id": "earrings-498",
  "title": "Elegant Emerald and Polki Diamond Danglers - Jadau Charm",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (approximate) setting with Hyderabadi Polish. Features a central oval-cut Emerald (estimated at 2 carats) with good color saturation and clarity. Adorned with intricately set Polki diamonds",
    "known for their unique un-cut",
    "unfaceted charm. Diamond color ranges from G-H with SI clarity."
  ],
  "features": "These earrings showcase a classic three-stone drop design. The Polki diamonds are set in a 'Jadau' style, a traditional North Indian setting technique now popular in Hyderabad, where the stones are embedded into the gold without visible prongs. This creates a rich, textured look, highlighting the natural beauty of the Polki. The emerald's oval cut is expertly set within a halo of smaller Polki diamonds.",
  "colors": [
    "Predominantly gold with the vibrant green of the Emerald and the subtle shimmer of the Polki diamonds. The Hyderabadi polish enhances the warm tone of the gold."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "and other special occasions where a touch of traditional elegance is desired. Suitable for both traditional South Indian attire like sarees and lehengas",
    "as well as more modern evening wear. Great for celebrations such as Deepavali and Sankranti."
  ],
  "description": "These earrings represent the epitome of Hyderabadi craftsmanship, blending the rich tradition of Jadau with the timeless appeal of emeralds and diamonds. Polki diamonds hold significant cultural value and are considered auspicious in South Indian weddings. The quality of the emerald, combined with the intricate Jadau setting, makes this a truly unique and valuable piece.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Polki",
    "Diamond",
    "Emerald",
    "Jadau",
    "Hyderabad Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Vivaha Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Danglers",
    "Drop Earrings",
    "Pachala",
    "Kempu"
  ],
  "original_id": "ear_rings_DPER8-1609_2625",
  "collection": "ear"
}