{
  "id": "necklaces-1221",
  "title": "Emerald & Diamond Floral Nakshi Haaram with South Sea Pearl",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finely crafted in 18K (FG) Gold",
    "adorned with brilliant-cut diamonds (3.51 carats total weight)",
    "vibrant emeralds (2.63 carats total weight)",
    "and a lustrous South Sea Pearl (4.67 carats total weight). Features a light Hyderabadi polish for a subtle sheen."
  ],
  "features": "This modern haaram features a central floral motif crafted with intricate nakshi work, enhanced with sparkling diamonds. The necklace cascades with delicate diamond fringes, leading to alternating sections of diamonds and vivid green emeralds. A single, radiant South Sea pearl dangles gracefully from the central floral pendant.",
  "colors": [
    "Predominantly gold",
    "with the dazzling brilliance of white diamonds",
    "the rich green of the emeralds",
    "and the creamy luminescence of the South Sea pearl."
  ],
  "occasions": [
    "Perfect for contemporary brides",
    "grand receptions",
    "cocktail parties",
    "or any special occasion where you want to make a sophisticated statement. A modern twist on traditional elegance",
    "also suitable for Seemantham or half-saree functions."
  ],
  "description": "This exquisite haaram beautifully blends traditional nakshi craftsmanship with contemporary design sensibilities. The brilliance of the diamonds is perfectly complemented by the vibrant emeralds and the elegant South Sea pearl, making it a truly unique and timeless piece. Lightweight and comfortable to wear, yet undeniably luxurious.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emeralds",
    "Diamonds",
    "South Sea Pearl",
    "Nakshi Work",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Contemporary Jewelry",
    "Fine Jewelry",
    "Moti",
    "Pachi Work"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-53 3_1795",
  "collection": "sjpl"
}