{
  "id": "earrings-206",
  "title": "Exquisite Kundan & Coral 'Chand Bali' Style Jhumka with South Sea Pearls",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Kundan Setting",
    "High-Quality South Sea Pearls",
    "Natural Coral",
    "Rubies",
    "Emerald"
  ],
  "features": "This stunning jhumka showcases the traditional Kundan setting technique, meticulously handcrafted by skilled artisans. The 'Chand Bali' style crescent moon design is adorned with uncut diamonds (polki). Features a lotus (padmam) motif, creating a blend of traditional and modern aesthetics. Strands of lustrous South Sea pearls and vibrant coral add a touch of elegance and vibrancy. The design incorporates a delicate floral design made with rubies on the top along with the Kundan setting on the body of the earring with the pearl and coral hangings",
  "colors": [
    "Gold",
    "White (Pearls)",
    "Orange (Coral)",
    "Red (Rubies)",
    "Green (Emerald)",
    "Clear (Diamonds)"
  ],
  "occasions": [
    "Ideal for weddings (pellillu)",
    "festivals (pandugalu)",
    "traditional ceremonies (sampradaya karyakramalu)",
    "bridal wear",
    "and grand celebrations. Perfect for a Seemantham (baby shower) or any occasion where you want to make a statement."
  ],
  "description": "A timeless piece that blends tradition with modern design. Handcrafted with meticulous detail, showcasing the artistry of Hyderabadi jewelry making. The use of high-quality materials like South Sea pearls and genuine coral adds value and sophistication. The 'Chand Bali' style makes it a versatile piece that can be worn with both traditional and contemporary outfits. The combination of coral and pearls is considered auspicious in South Indian culture, representing prosperity and good fortune.",
  "tags": [
    "Jhumka",
    "Kundan",
    "Chand Bali",
    "Earrings",
    "South Sea Pearls",
    "Coral",
    "Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "చెవి దుద్దులు",
    "Pellillu",
    "Pandugalu",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Polki Diamonds"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0050_0458",
  "collection": "diamond"
}