{
  "id": "necklaces-327",
  "title": "Divya Raga Ruby Diamond Set: A Modern Take on Traditional Haaram",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "22K Gold (Huṇḍi Gold) with Hyderabadi Polish. Embellished with high-quality",
    "pear-shaped rubies and brilliant-cut diamonds (VVS clarity). Jhumka features a genuine South Sea pearl."
  ],
  "features": "This exquisite set features a modern floral Haaram design interlinked with intricate, heart-shaped motifs. The matching Jhumkas showcase a dome shape adorned with diamonds and hearts, culminating in a luminous South Sea pearl. The necklace's floral design uses the pachi setting to highlight the gemstones. The lightweight mesh chain ensures comfortable wear.",
  "colors": [
    "Rich gold tone with vibrant ruby red and sparkling white diamonds. The South Sea pearl adds a touch of creamy iridescence."
  ],
  "occasions": [
    "Perfect for weddings (vivāham)",
    "receptions",
    "engagements (nischayathartham)",
    "and festive occasions like Diwali and Sankranthi. Its contemporary design also makes it suitable for modern formal events and celebrations."
  ],
  "description": "This set beautifully blends traditional Telugu jewelry elements with a modern aesthetic. The use of genuine rubies and diamonds adds significant value. The Hyderabadi polish ensures a lasting shine. This set is a statement piece that will be treasured for generations, making it a perfect heirloom (bhāratīya parampara).",
  "tags": [
    "Haaram",
    "Jhumka",
    "Ruby Necklace",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Modern Jewelry",
    "22K Gold",
    "South Sea Pearl",
    "Vivaham",
    "Nischayathartham",
    "Bhāratīya Parampara",
    "Pachi Setting",
    "Huṇḍi Gold"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0440_0623",
  "collection": "diamond"
}