{
  "id": "necklaces-835",
  "title": "Vintage Rose Cut Diamond and Tourmaline Leaf Pendant with South Sea Pearl",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "Rose Cut Diamonds",
    "Green Tourmaline Slice",
    "South Sea Pearl",
    "Pink Tourmaline Beads. Features a Hyderabadi Polish for lasting luster."
  ],
  "features": "This unique pendant features a captivating arrangement of rose-cut diamonds surrounding a meticulously carved green tourmaline leaf. The open setting of the diamonds allows maximum light reflection, highlighting their brilliance. A lustrous South Sea pearl dangles gracefully, complemented by petite pink tourmaline beads. The leaf design provides a botanical element to add a touch of nature. The piece also showcases delicate milgrain detailing. ",
  "colors": [
    "Gold (yellow)",
    "White (diamonds)",
    "Green (tourmaline)",
    "Creamy White (pearl)",
    "Pink (tourmaline beads)."
  ],
  "occasions": [
    "Perfect for special occasions",
    "festive gatherings",
    "or adding a touch of elegance to everyday wear. Makes a stunning statement piece for contemporary weddings or engagement parties. Ideal for cocktail events."
  ],
  "description": "This one-of-a-kind pendant blends the timeless appeal of rose-cut diamonds with the natural beauty of a carved tourmaline leaf. The meticulous craftsmanship, high-quality materials, and unique design make it a valuable addition to any jewelry collection. This piece has a unique aesthetic that will grab the attention of many. It's a wearable art that makes a unique statement.",
  "tags": [
    "Pendant",
    "Rose Cut Diamonds",
    "Tourmaline",
    "Leaf Design",
    "South Sea Pearl",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Contemporary Jewelry",
    "Lightweight Pendant",
    "Aadhunika Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1648_2632",
  "collection": "ear"
}