{
  "id": "necklaces-1548",
  "title": "The Royal Vaibhavam: Diamond and Emerald Grand Bridal Necklace Set",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold (approx. 244.970 grams gross weight)",
    "brilliant-cut diamonds (approx. 34.43 carats",
    "2041 stones)",
    "natural emeralds (approx. 4.91 carats",
    "7 stones) and rubies (approx. 2.47 carats",
    "5 stones). Features Hyderabadi Kundan setting with a fine gold finish."
  ],
  "features": "This magnificent bridal necklace set features intricate filigree work ('Jali' work) with diamond-studded floral and paisley motifs. The choker (Kanthi) sits elegantly on the neck, transitioning into a longer, elaborate haaram. Features a stylized peacock motif ('Mayura' design) at the center of the haaram, symbolizing beauty and grace. Dangler drops with small gold beads add movement and charm. Upper part D.wt:-8.00(462) and Ruby:-0.021(1)",
  "colors": [
    "Predominantly gold with the sparkling brilliance of diamonds",
    "accented by the rich green of emeralds and a hint of ruby red. Creates a regal and luxurious color palette perfect for bridal wear."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (muhurtham)",
    "receptions",
    "pre-wedding ceremonies (seemantham",
    "pellikuthuru function)",
    "and significant cultural events. Its majestic design also makes it a statement piece for high-profile galas and celebrations."
  ],
  "description": "A testament to exquisite South Indian craftsmanship, this necklace set embodies timeless elegance. The combination of diamonds, emeralds, and rubies signifies prosperity and good fortune, making it a treasured heirloom. The intricate design reflects a legacy of artistry and is sure to captivate attention. Perfect for the bride who wants to make a lasting impression.",
  "tags": [
    "Bridal Necklace Set",
    "Diamond Necklace",
    "Emerald Necklace",
    "Haaram",
    "Kanthi",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Kundan Jewelry",
    "Hyderabadi Jewelry",
    "Muhurtham Jewelry",
    "Mayura Design",
    "Filigree Work",
    "Jali Work",
    "Pellikuthuru",
    "Seemantham",
    "gold jewellery",
    "emerald",
    "rubies",
    "Chow673",
    "Des-Jan-20589"
  ],
  "original_id": "sjpl_PHOTO-2024-05-24-13-54-27_2195",
  "collection": "sjpl"
}