{
  "id": "bangles-124",
  "title": "Exquisite Emerald & Diamond Vanki - A Timeless Treasure",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish",
    "featuring a central Emerald of exceptional clarity and a dazzling array of high-quality",
    "brilliant-cut diamonds. Each diamond is meticulously hand-set for maximum sparkle."
  ],
  "features": "This stunning Vanki showcases a classic South Indian design, intricately crafted with delicate filigree and openwork patterns. The emerald, a symbol of prosperity and new beginnings, is set within a frame of diamonds, creating a focal point of captivating beauty. The bracelet's design allows for comfortable wear and showcases the superb artistry of our skilled goldsmiths.",
  "colors": [
    "Rich Yellow Gold",
    "vibrant Emerald Green",
    "and the scintillating white of the Diamonds create a harmonious and regal color palette."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Muhurtham)",
    "engagement ceremonies",
    "festivals (like Ugadi and Sankranthi)",
    "and other grand celebrations. Its elegance also allows it to be worn as a statement piece for modern formal events."
  ],
  "description": "This Vanki is more than just jewelry; it's a piece of art and a cultural heirloom. The use of high-purity gold and precious gemstones ensures lasting value and enduring beauty. Its design embodies the rich traditions of South Indian craftsmanship, making it a truly special and cherished possession. The striking combination of emerald and diamonds evokes a sense of timeless elegance and opulence.",
  "tags": [
    "Vanki",
    "Baahubandhi",
    "Armlet",
    "Emerald",
    "Diamond",
    "Gold",
    "22K",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Ugadi",
    "Sankranthi",
    "Wedding Jewelry",
    "Fine Jewelry",
    "Handcrafted",
    "Filigree",
    "భారతీయుల ఆభరణాలు",
    "బంగారు గాజు",
    "వజ్రాల గాజు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0277_0475",
  "collection": "diamond"
}