{
  "id": "necklaces-1197",
  "title": "Emerald Brilliance Diamond Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "Finest Quality Diamonds (5.53 carats)",
    "Two Oval Cut Emeralds (5.38 carats and 7.23 carats)",
    "14 South Sea Pearls (16.40 carats total weight). Features a signature Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite haaram showcases a contemporary interpretation of classic South Indian jewelry. The intricate diamond patterns are interwoven in a floral and paisley motif, culminating in a central emerald and a larger pendant emerald, both set in prong settings to maximize their brilliance. Delicate South Sea pearls gracefully dangle from the diamond framework, adding a touch of traditional elegance. The back chain is a woven gold design, ensuring comfort and durability. The design blends traditional Telugu patterns with a modern openwork style.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "accentuated by the vibrant green of the emeralds and the lustrous white of the South Sea pearls. This classic combination is a hallmark of traditional South Indian bridal jewelry."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "and special occasions. Ideal as a bridal piece or for grand festive occasions like Sankranti",
    "Ugadi",
    "or Diwali. Suitable for Seemantham",
    "half-saree function (chinnaari function)",
    "and muhurtham ceremonies."
  ],
  "description": "This haaram is a unique fusion of traditional South Indian design and modern aesthetics. The meticulously crafted diamond settings and the vibrant emeralds make it a truly captivating piece. The use of genuine South Sea pearls adds a touch of timeless elegance. The durable 18K gold ensures lasting value. A testament to Hyderabad's rich jewelry-making heritage. This is a piece that can be passed down through generations.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Chinnaari Function",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Indian Jewelry",
    "18K Gold",
    "Diamonds",
    "Emeralds",
    "Pearls",
    "Telugu Jewelry",
    "Andhra Jewelry",
    "Manduva"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-45 2_1771",
  "collection": "sjpl"
}