{
  "id": "necklaces-108",
  "title": "Polki & Ruby U-Shaped Necklace - A Timeless Raas",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds (Rose Cut)",
    "Faceted Rubies. Features Hyderabadi Polish for lasting luster and a rich",
    "traditional gold hue."
  ],
  "features": "U-shaped necklace featuring intricately set polki diamonds in circular settings, interspersed with ruby pendants. The pendants are adorned with diamond petals. The design balances traditional aesthetics with a contemporary, minimalist feel. Each polki is meticulously hand-cut and set in a closed setting, ensuring maximum brilliance.",
  "colors": [
    "Gold (yellow)",
    "Diamond (white)",
    "Ruby (red). The combination of red and gold is highly auspicious in South Indian traditions",
    "symbolizing prosperity and marital bliss."
  ],
  "occasions": [
    "Perfect for weddings (kalyanam)",
    "engagements (nischitartham)",
    "festivals (like Sankranthi and Diwali)",
    "and special occasions. Also suitable for formal gatherings where you want to showcase your heritage with a touch of modern elegance."
  ],
  "description": "This polki haaram is a heirloom-worthy piece, combining the timeless appeal of uncut diamonds with the vibrant allure of rubies. The superior craftsmanship ensures durability and long-lasting beauty. Its U-shape design complements any neckline, making it a versatile addition to your jewelry collection. Represents a seamless fusion of traditional South Indian design and modern sensibilities, making it perfect for the contemporary woman.",
  "tags": [
    "Polki",
    "Diamond",
    "Ruby",
    "Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Uncut Diamonds",
    "Raas"
  ],
  "original_id": "diamond_jewellery_DPNK8-1410_0341",
  "collection": "diamond"
}