{
  "id": "necklaces-1085",
  "title": "Manikyam Pearl Kundan Haaram: The Emerald & Pearl Divine Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Pearls (Basra/South Sea)",
    "Emerald Beads",
    "Kundan Setting",
    "Center Amethyst. Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Haaram features a handcrafted pendant in the traditional Kundan setting, showcasing uncut diamonds and a central Amethyst. The pendant also displays twin peacock motifs. Strung with delicate strands of alternating emerald beads and luminous pearls. The design marries traditional Telugu craftsmanship with modern sensibilities, with intricate filigree details, and elegant drop pearls.",
  "colors": [
    "Gold (yellow)",
    "Emerald (green)",
    "Pearl (white)",
    "Amethyst (purple)",
    "Diamond (clear). Traditional South Indian color palette evokes auspiciousness and prosperity."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "Seemantham",
    "Upanayanam",
    "and special celebrations. Its elegant design also makes it suitable for formal gatherings and cultural events."
  ],
  "description": "Experience the timeless beauty of South Indian heritage with this handcrafted Haaram. The impeccable Kundan craftsmanship and the use of precious gemstones like pearls and emeralds make this piece a valuable heirloom. The Hyderabadi polish ensures a long-lasting shine. A perfect blend of tradition and modernity, this Haaram is an investment in both beauty and culture.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Pearl Necklace",
    "Emerald Necklace",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Amethyst",
    "Basra Pearl",
    "Guttapusalu",
    "Manikyam",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Vivaha",
    "Seemantham"
  ],
  "original_id": "radhe_diam_DPPD8-1263_2498",
  "collection": "radhe"
}