{
  "id": "necklaces-981",
  "title": "Divine Diamond Floral Haaram with Gemstone Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Certified Natural Diamonds (VVS Clarity",
    "Excellent Cut)",
    "Natural Emerald",
    "Natural Ruby",
    "Freshwater Pearls. Features exquisite Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This breathtaking haaram showcases a modern take on traditional floral motifs. The intricate diamond setting, resembling delicate vines and blossoms, highlights the brilliance of each stone. A central Emerald and Ruby adds a touch of color. The floral pendants are accentuated with lustrous freshwater pearl drops (Gundla Mala style) creating a classic yet contemporary look. This haaram can be converted into two individual necklaces making it even more versatile.",
  "colors": [
    "Gold (Yellow)",
    "White (Diamonds)",
    "Green (Emerald)",
    "Red (Ruby)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "engagements",
    "Seemantham ceremonies",
    "or any grand celebration where you want to make a statement. Also suitable for high-profile social events and festive occasions."
  ],
  "description": "This exquisite Diamond Floral Haaram is a testament to timeless elegance and superior craftsmanship. The piece is set with high-quality diamonds for maximum brilliance and fire, and the addition of premium gemstones makes it a luxury asset. The design blends traditional South Indian aesthetics with a modern sensibility, making it a versatile addition to your jewelry collection. Furthermore, this Haaram can be easily be converted into two individual necklaces. This piece is a heirloom-worthy investment, designed to be treasured for generations. Comes with certification for gold purity and diamond authenticity.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Floral Design",
    "Gundla Mala",
    "Emerald",
    "Ruby",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Engagement Necklace",
    "Vivahaalu",
    "Seemantham",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "Luxury Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0433_2302",
  "collection": "necklace"
}