{
  "id": "necklaces-481",
  "title": "Regal Neelam Kasulaperu Haaram - A Symphony of Sapphire and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted with precision in a high-quality metal alloy",
    "likely Silver-tone",
    "studded with brilliant-cut diamonds (Dwt: 10.64) and captivating Neelam Sapphires (13.16 carats",
    "7 stones). Meticulously set stones ensuring lasting brilliance."
  ],
  "features": "This exquisite necklace showcases a traditional Kasulaperu design, re-imagined with modern elegance. Features a central medallion with intricate diamond detailing and cascading sapphire accents, forming a breathtaking statement piece. The repeating floral motifs, all adorned with diamonds, add to its timeless appeal.",
  "colors": [
    "Primarily a dazzling white from the diamonds",
    "contrasted beautifully with the deep blue of the Neelam Sapphires",
    "creating a striking and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha)",
    "receptions",
    "milestone celebrations",
    "and upscale social gatherings. A sophisticated choice for both traditional Telugu ceremonies and contemporary events."
  ],
  "description": "This Neelam Kasulaperu Haaram is a testament to refined craftsmanship. The deep blue sapphires symbolize prosperity and good fortune, making it a cherished heirloom. Its diamond-encrusted design adds a touch of modern luxury, ensuring you'll be the center of attention. A unique blend of tradition and contemporary style makes this a truly remarkable piece.",
  "tags": [
    "Haaram",
    "Kasulaperu",
    "Neelam",
    "Sapphire",
    "Diamond Necklace",
    "Telugu Jewellery",
    "South Indian Jewelry",
    "Wedding Jewellery",
    "Festive Jewellery",
    "Statement Necklace",
    "Indian Bridal Jewellery",
    "Vilandi Jewellery",
    "Hyderabadi Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-59 2_0944",
  "collection": "diamond"
}