{
  "id": "necklaces-1101",
  "title": "Exquisite Navratna Tassel Haaram with South Sea Pearl Centerpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold Plating over Sterling Silver Base. Navratna Gemstones (Ruby",
    "Diamond",
    "Emerald",
    "Pearl",
    "Yellow Sapphire",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye",
    "Coral). South Sea Pearl (Center). The chain is crafted from Tourmaline Gemstone Beads."
  ],
  "features": "This unique Haaram showcases a modern take on traditional Navratna settings. The centerpiece features a radiant South Sea pearl, surrounded by a meticulously arranged array of Navratna gemstones in a floral pattern. Two elegant gemstone tassels hang below: one is a beaded pink tourmaline and the other is a cascade of small seed pearls. The gold-plated silver base features a fine detailing, achieved with a meticulous casting and polishing process. The vibrant gemstone arrangements and delicate pearl tassels create a mesmerizing visual harmony.",
  "colors": [
    "Multicolor (Navratna - Ruby",
    "Diamond",
    "Emerald",
    "Pearl",
    "Yellow Sapphire",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye",
    "Coral)",
    "Gold",
    "Pink",
    "and White (Pearl)"
  ],
  "occasions": [
    "Ideal for contemporary wedding receptions",
    "cocktail parties",
    "and grand celebrations. Can also be styled for festive occasions like Sankranthi and Ugadi."
  ],
  "description": "A unique blend of traditional symbolism and modern design. The use of high-quality Navratna gemstones makes this piece not just beautiful but also astrologically significant. The South Sea pearl adds a touch of timeless elegance. The modern design makes it versatile and wearable beyond traditional occasions. Hyderabadi craftsmanship ensures exceptional durability and lasting beauty.",
  "tags": [
    "Haaram",
    "Necklace",
    "Navratna",
    "South Sea Pearl",
    "Gemstone Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Tassel Necklace",
    "Modern Indian Jewelry",
    "Wedding Jewelry",
    "Sankranthi",
    "Ugadi",
    "Festival Jewelry"
  ],
  "original_id": "radhe_diam_DPPD8-1807_2514",
  "collection": "radhe"
}