{
  "id": "necklaces-661",
  "title": "Exquisite Pink Petal Diamond Haaralu: A Modern Take on a Timeless Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold with Hyderabadi Polish",
    "featuring high-quality Cubic Zirconia (CZ) and simulated pink sapphires. Stones are meticulously set in a prong setting to maximize brilliance."
  ],
  "features": "This stunning Haaram features a floral motif, with delicate pink simulated sapphires arranged to resemble Ganneru Poolu (Oleander flowers). The intricate lattice work is studded with sparkling CZ diamonds, creating a captivating contrast between the warm gold and the cool sparkle of the stones. The pendant showcases a similar floral design cascading down, adding depth and dimension. It employs a modern take on the traditional Haaralu design making it versatile.",
  "colors": [
    "Primarily gold with shimmering white (CZ diamonds) and soft pink (simulated sapphires) accents. The gentle pink adds a touch of romance and femininity."
  ],
  "occasions": [
    "Perfect for modern brides",
    "receptions",
    "engagements",
    "and even upscale family gatherings. It can also be worn for Seemantham (baby shower)",
    "half-saree functions or festivals when you wish to infuse a touch of contemporary glamour into traditional attire."
  ],
  "description": "This Haaram seamlessly blends modern design with traditional South Indian aesthetics. The dazzling CZ diamonds capture the brilliance of real diamonds at an accessible price point. The simulated pink sapphires evoke feelings of love, beauty, and grace, symbolizing a prosperous future. Its lightweight design ensures comfortable wear for extended periods. The Hyderabadi polish provides exceptional lustre and durability.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond Necklace",
    "CZ Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Ganneru Poolu",
    "Pink Sapphire",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Reception Jewelry",
    "Bridal Jewelry",
    "Bridal Haaralu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-28_1167",
  "collection": "diamond"
}