{
  "id": "necklaces-950",
  "title": "Enchanting Emerald and Diamond Kasulaperu Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold; Natural Emerald (Pear Cut and Round); Brilliant Cut Diamonds (SI Clarity",
    "G-H Color). Features a light",
    "Hyderabadi polish for enhanced luster."
  ],
  "features": "A modern take on the classic Kasulaperu, this necklace showcases a delicate floral design interspersed with sparkling diamonds. The focal point is a captivating pear-shaped Emerald, surrounded by a cluster of smaller Emeralds and diamonds. The setting is meticulously crafted to maximize the gemstones' brilliance, creating a graceful, feminine silhouette. Lightweight design ensures comfortable wear.",
  "colors": [
    "Lustrous Gold",
    "vibrant Green Emeralds",
    "and dazzling White Diamonds."
  ],
  "occasions": [
    "Ideal for both traditional celebrations such as Seemantham",
    "Half-Saree functions (Voni Function)",
    "Weddings (Pelli)",
    "and modern events like receptions",
    "cocktail parties",
    "or festive gatherings. Perfect for the bride or a special guest."
  ],
  "description": "This Kasulaperu necklace is a symbol of prosperity and beauty, meticulously handcrafted by skilled artisans. The combination of Emeralds and Diamonds offers a unique blend of traditional symbolism and contemporary elegance. Its lightweight design makes it comfortable to wear for extended periods. A statement piece that will be cherished for generations, representing heritage and refinement.",
  "tags": [
    "Kasulaperu",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Haaram",
    "Pelli Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Voni Function",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Contemporary Design",
    "Traditional Jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0344_2411",
  "collection": "necklace"
}