{
  "id": "necklaces-1516",
  "title": "Emerald Blossom Raasi Haaram - A Timeless Telugu Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (estimated based on style and origin)",
    "Natural Emeralds (estimated 16.90 carats total) with high clarity and vibrant green hue",
    "High Quality CZ Stones (estimated 1.54 carats Ruby). Handcrafted with meticulous Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite two-layered Haaram features delicate floral motifs interspersed with vibrant emeralds. The intricate setting showcases the skilled craftsmanship of our artisans. The design draws inspiration from traditional South Indian temple jewelry, blending classic aesthetics with modern elegance. Each emerald is carefully chosen and set to maximize its brilliance. Features a graduated design, with larger floral clusters at the center and gradually decreasing towards the clasp.",
  "colors": [
    "Lustrous yellow gold",
    "vivid green emeralds",
    "and dazzling white cubic zirconia create a harmonious and regal color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "engagements",
    "anniversaries",
    "Seemantham ceremonies",
    "and other grand celebrations. A statement piece for any special occasion where you want to make a lasting impression. Its versatility also allows for pairing with contemporary Indian wear for a sophisticated look."
  ],
  "description": "This Emerald Blossom Raasi Haaram is a true heirloom piece, embodying the rich cultural heritage of South India. The exquisite craftsmanship and use of high-quality materials ensure its durability and enduring beauty. The vibrant emeralds symbolize prosperity and good fortune, making it a meaningful gift for loved ones. A timeless investment that will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emerald Necklace",
    "Gold Necklace",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Raasi",
    "Vivaaham",
    "Seemantham",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "CZ Stones",
    "Floral Design",
    "Kasulaperu",
    "Addigai",
    "Andhra Jewelry",
    "Emeralds",
    "22K Gold"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-39_2134",
  "collection": "sjpl"
}