{
  "id": "necklaces-370",
  "title": "Diamond Floral Jadau Necklace with Emerald, Ruby and Pearl Drop - Vaibhav Laxmi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold with Hyderabadi Polish. Features brilliant-cut diamonds (VS Clarity",
    "G Color)",
    "a vibrant Emerald cabochon",
    "a rich Ruby cabochon",
    "and a lustrous South Sea Pearl drop. The setting is meticulously handcrafted."
  ],
  "features": "Inspired by traditional Jadau craftsmanship, this necklace features an intricate floral motif encrusted with dazzling diamonds. The pendant showcases a central emerald, leading to a larger pendant with a ruby at its heart, culminating in a single pearl drop for a touch of classic elegance. The detailed openwork design and diamond-studded floral patterns provide a regal, luxurious aesthetic.",
  "colors": [
    "Yellow Gold",
    "White (Diamonds)",
    "Green (Emerald)",
    "Red (Ruby)",
    "White (Pearl)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements ( நிச்சయించుకొనుట)",
    "receptions",
    "and other grand celebrations like Seemantham or a milestone birthday. Also suitable for high-end social events and formal gatherings."
  ],
  "description": "This exquisite Haaram is a timeless heirloom piece. The combination of high-quality diamonds, vibrant gemstones, and the classic pearl drop creates a stunning and luxurious look. It is meticulously handcrafted by skilled artisans, ensuring exceptional quality and durability. The intricate Jadau work represents a rich cultural heritage, making it a valuable addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Jadau Jewelry",
    "Emerald",
    "Ruby",
    "Pearl",
    "South Sea Pearl",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Vivaha",
    "நிச்சయించుకొనుట",
    "Seemantham",
    "Statement Necklace",
    "Floral Design"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0484_0666",
  "collection": "diamond"
}