{
  "id": "waistbands-041",
  "title": "The \"Mayura Bandham\" Diamond Vaddanam: A Timeless Masterpiece",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "Crafted with 159.400 grams of high-purity gold. Adorned with 16.18 carats (2295 pieces) of brilliant-cut diamonds",
    "4.59 carats of rubies (24 pieces)",
    "and 5.11 carats of Emeralds (2 pieces). Features a meticulous Hyderabadi polish",
    "ensuring a radiant and enduring shine."
  ],
  "features": "This Vaddanam showcases a stunning peacock (Mayura) design, a symbol of grace and beauty in South Indian culture. Intricately designed peacocks are set among floral motifs, all meticulously encrusted with diamonds. The center features a square-cut emerald, complemented by a pear-shaped emerald drop. The piece employs a pave setting for maximum diamond brilliance and features an antique finish to enhance the traditional aesthetic.",
  "colors": [
    "The color palette features the warm glow of gold",
    "the sparkling brilliance of white diamonds",
    "the rich green of emeralds",
    "and the fiery red of rubies – a traditionally auspicious combination."
  ],
  "occasions": [
    "Perfect for weddings (especially the muhurtham)",
    "Seemantham (baby shower)",
    "half-saree functions (Langa Voni ceremony)",
    "and other grand celebrations. Its timeless elegance also makes it a treasured heirloom piece for any special occasion."
  ],
  "description": "This Vaddanam is more than just jewelry; it's an investment in a piece of South Indian heritage. The combination of high-quality materials, expert craftsmanship, and traditional design makes it a truly exceptional piece. The peacock motif symbolizes beauty, prosperity, and good luck, making it a meaningful and auspicious addition to any jewelry collection. The durable construction and timeless design ensure it can be treasured for generations.",
  "tags": [
    "Vaddanam",
    "Oddaanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Traditional Jewelry",
    "Mayura",
    "Peacock",
    "ఒడ్డాణం",
    "బంగారు నగలు",
    "వజ్రాల నగలు"
  ],
  "original_id": "sjpl_PHOTO-2024-05-24-14-02-26 2_2197",
  "collection": "sjpl"
}