{
  "id": "necklaces-1680",
  "title": "The 'Rani' Diamond and Ruby Pendant Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18k Yellow Gold. Features a striking",
    "carved Ruby center stone",
    "surrounded by brilliant-cut Diamonds. Diamonds are estimated to be VS clarity and G color. Finished with a Hyderabadi Polish for lasting luster."
  ],
  "features": "This contemporary 'Haar' (necklace) reimagines traditional South Indian jewelry. The geometric diamond links create a modern, sophisticated chain. The focal point is a large, exquisitely carved Ruby pendant, in a unique hexagonal shape. The surrounding diamond halo enhances the Ruby's rich color and adds brilliance. The setting showcases a delicate pave setting for maximum sparkle.",
  "colors": [
    "Warm Yellow Gold complements the intense Ruby red. The sparkling white Diamonds create a striking contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "grand receptions",
    "and milestone anniversaries. Its modern design also allows for sophisticated evening wear",
    "making it suitable for cocktail parties and black-tie events. Makes a stunning statement piece for a bride during her reception or 'Sangeet'."
  ],
  "description": "A fusion of traditional craftsmanship and contemporary design. The carved ruby adds a touch of heritage while the diamond settings highlight its natural beauty. This 'Haar' is a heirloom-quality piece that will be cherished for generations. The unique pendant shape ensures you stand out from the crowd. The superior diamond quality guarantees exceptional brilliance.",
  "tags": [
    "Necklace",
    "Haar",
    "Diamond Necklace",
    "Ruby Pendant",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "Statement Necklace",
    "contemporary jewellery",
    "Telugu jewelry",
    "Ruby Haar",
    "Diamond Haar"
  ],
  "original_id": "stock_in_india_IMG-20241218-WA0017_2862",
  "collection": "stock"
}