{
  "id": "necklaces-375",
  "title": "The Rajkumari Diamond Haaram with Ruby Accents and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold base",
    "intricately set with brilliant-cut diamonds (VS Clarity",
    "G-H Color). Features central ruby gemstones (high quality",
    "heat treated for color enhancement). Delicate freshwater pearls dangle from the pendant for added elegance. Finished with traditional Hyderabadi polish for a lasting luster."
  ],
  "features": "This exquisite Haaram showcases a layered design, reminiscent of traditional Telugu bridal jewelry. The intricate diamond work features floral and paisley motifs, creating a breathtaking display of craftsmanship. The central ruby stones add a regal touch, while the pearl drops provide a soft, feminine contrast. The Haaram is designed with adjustable length to ensure a perfect fit, perfect for all special occassions",
  "colors": [
    "Primarily gold and white (diamonds) with pops of vibrant red from the rubies and the creamy white of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements",
    "anniversaries",
    "and special occasions like seemantham (సీమంతం) or half-saree functions. A truly regal piece for the modern woman who appreciates timeless elegance."
  ],
  "description": "This Diamond Haaram is more than just jewelry; it's a statement piece steeped in South Indian tradition. The combination of high-quality diamonds, radiant rubies, and lustrous pearls creates a mesmerizing effect. The Hyderabadi polish guarantees lasting brilliance. Own a piece of heritage and elevate your look with this stunning heirloom-worthy necklace.",
  "tags": [
    "Diamond Haaram",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Ruby Necklace",
    "Pearl Necklace",
    "22K Gold",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Kantabharanam",
    "పెళ్ళి",
    "సీమంతం",
    "Hyderabadi Polish",
    "Fine Jewelry",
    "Statement Necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0489_0671",
  "collection": "diamond"
}