{
  "id": "necklaces-072",
  "title": "Raani Haar: Ruby & Polki Diamond Choker – A Regal Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Laxmi Cut)",
    "Faceted Burmese Rubies",
    "Natural Seed Pearls. Hyderabadi Polish for enhanced luster and antique appeal."
  ],
  "features": "Multi-strand ruby bead choker with a central, intricately crafted pendant featuring a cabochon ruby centerpiece surrounded by a halo of Polki diamonds. The pendant boasts a floral-inspired design, with pear-shaped Polkis accentuating its delicate form. Ruby drops are attached at the bottom of the pendant with tiny seed pearls. Embellished gold links secure the multi-strand beaded setting.",
  "colors": [
    "Rich Ruby Red",
    "Warm Gold",
    "Sparkling White (Polki Diamonds)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "bridal showers (Pellikoduku function)",
    "traditional festivals (Sankranthi",
    "Ugadi)",
    "and high-end social gatherings. Can also be paired with modern attire for a fusion look."
  ],
  "description": "This choker is a stunning blend of traditional South Indian aesthetics and contemporary design. The vibrant Burmese rubies symbolize love and passion, while the uncut Polki diamonds represent timeless elegance. The Hyderabadi polish gives the gold a rich, antique finish, making it a true heirloom piece. Crafted by skilled artisans in Hyderabad, this necklace is a testament to the rich heritage of South Indian jewelry making. The adjustable string ensures a comfortable and perfect fit.",
  "tags": [
    "Choker",
    "Haaram",
    "Ruby",
    "Polki",
    "Diamond",
    "Kundan",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Necklace",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Heirloom Jewelry",
    "raani haar",
    "antique finish",
    "vivahaalu",
    "nischitartham",
    "pellikoduku",
    "Sankranthi",
    "Ugadi"
  ],
  "original_id": "diamond_jewellery_DPCK8-1239_0231",
  "collection": "diamond"
}