{
  "id": "necklaces-1521",
  "title": "Exquisite Diamond and Gemstone Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Yellow Gold with a Hyderabadi Polish. Features brilliant-cut diamonds (VS clarity",
    "G-H color)",
    "natural emeralds (Zambian origin",
    "excellent cut)",
    "and vibrant sapphire beads. Additional ruby accents."
  ],
  "features": "This stunning haaram showcases intricate floral motifs meticulously set with diamonds. The central pendant features a large, pear-shaped emerald surrounded by smaller emeralds and diamonds. The design incorporates delicate peacock (Mayura) motifs, a symbol of beauty and royalty. The necklace also incorporates delicate gold dangling details",
  "colors": [
    "Primarily gold and white (diamonds) with pops of vibrant green (emeralds) and royal blue (sapphires). The ruby accents provide a subtle touch of red",
    "a traditionally auspicious color."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "receptions",
    "grand parties",
    "and other special occasions. Ideal for brides seeking a show-stopping piece or for heirloom investments. Suitable for traditional Telugu ceremonies like Seemantham and Half-Saree functions."
  ],
  "description": "A true statement piece that seamlessly blends traditional South Indian design with modern elegance. The high-quality diamonds and gemstones ensure lasting brilliance and value. The intricate craftsmanship and Hyderabadi polish add a touch of royal sophistication. This haaram is more than just jewelry; it's an investment in artistry and cultural heritage. A timeless treasure to be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Sapphire",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Kantaabharanam",
    "Vivaaha",
    "Seemantham",
    "Telugu Jewelry",
    "Peacock Motif",
    "Mayura",
    "Gemstone Necklace"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-41_2139",
  "collection": "sjpl"
}