{
  "id": "necklaces-848",
  "title": "Divinity Diamond Haaram Set with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Crafted with 18K Gold",
    "meticulously set with high-quality",
    "brilliant-cut diamonds. Features a central emerald (Panacha Ratham) and a ruby gemstone (Ratna Ratham) within the earrings. Adorned with lustrous South Sea Pearls. Boasts a radiant",
    "durable 'Hyderabadi Polish'."
  ],
  "features": "This exquisite Haaram embodies classic South Indian elegance. The necklace showcases an intricate floral and leaf-motif design, encrusted with sparkling diamonds. The pendant features a stunning central emerald, surrounded by a halo of diamonds. The chandbali earrings complement the necklace perfectly, featuring delicate filigree work and pearl drops. The setting style ensures maximum brilliance of the diamonds. The floral motifs lend a distinctly Telugu touch to the piece.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with striking emerald green and ruby red accents. The pearls add a soft",
    "creamy hue that balances the brilliance of the diamonds."
  ],
  "occasions": [
    "Ideal for weddings (especially the muhurtham)",
    "receptions",
    "engagement ceremonies",
    "and other grand celebrations. Also perfect for Seemantham ceremonies",
    "half-saree functions (Voni Function)",
    "and Bharatanatyam performances."
  ],
  "description": "This Haaram set is a testament to exceptional craftsmanship and timeless design. It combines the grandeur of traditional South Indian jewelry with the modern appeal of diamonds. The 'Hyderabadi Polish' ensures long-lasting shine and durability. The use of genuine gemstones adds significant value and auspiciousness. A perfect heirloom piece to be treasured for generations. This Haaram is a true statement of grace and prosperity.",
  "tags": [
    "Diamond Haaram",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Chandbali Earrings",
    "Wedding Necklace",
    "Emerald",
    "Ruby",
    "Pearls",
    "Gold Necklace",
    "Hyderabadi Jewelry",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Voni Function",
    "Panacha Ratham",
    "Ratna Ratham",
    "traditional",
    "statement necklace",
    "heirloom jewelry",
    "Telugu jewelry"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0380_1535",
  "collection": "haaram"
}