{
  "id": "necklaces-328",
  "title": "Divine Rubies & Diamonds Haaram - A Timeless South Indian Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold Standard) with Hyderabadi Polish. Adorned with meticulously set brilliant-cut diamonds and vibrant",
    "high-quality Rubies. Finished with lustrous South Sea Pearls."
  ],
  "features": "This exquisite Haaram features intricate floral and paisley designs, painstakingly crafted by our skilled artisans. The openwork setting showcases the brilliance of each diamond, allowing light to pass through for maximum sparkle. The central pendant features a captivating ruby surrounded by a halo of diamonds and pearl drops, reminiscent of traditional temple jewelry aesthetics. The design blends seamlessly with contemporary tastes.",
  "colors": [
    "Predominantly gold with a dazzling array of white from the diamonds",
    "accentuated by the rich red of the rubies and the soft iridescence of the pearls."
  ],
  "occasions": [
    "Perfect for bridal occasions",
    "grand receptions",
    "and traditional ceremonies like muhurtham",
    "seemantham",
    "and Upanayanam. Also suitable for upscale gala events where you want to make a statement."
  ],
  "description": "This Haaram is a testament to the rich heritage of South Indian jewelry. The use of high-purity gold, combined with the fiery rubies and shimmering diamonds, creates a truly mesmerizing piece. The intricate design and impeccable craftsmanship ensure that this Haaram will be treasured for generations as a heirloom. The Hyderabadi polish enhances the gold's natural luster, providing a lasting shine. It's not just jewelry; it's a symbol of culture, tradition, and timeless elegance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Diamonds",
    "Rubies",
    "Pearls",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Temple Jewelry",
    "Kantaabharanam",
    "कंठाभरणं",
    "Andhra Jewelry",
    "Telangana Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0442_0624",
  "collection": "diamond"
}