{
  "id": "necklaces-669",
  "title": "Emerald and Diamond Peacock Haaram - Padakam Tho",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "meticulously set with brilliant-cut diamonds and featuring exquisite Emerald gemstones of exceptional clarity. The pendant is finished with a single cultured Pearl. Exhibits a fine Hyderabadi polish for lasting shine."
  ],
  "features": "A contemporary take on the classic Haaram, this necklace features intricate filigree-inspired designs studded with dazzling diamonds. The central element showcases peacock motifs, a symbol of grace and beauty in South Indian culture. The pendant (Padakam) boasts a large, pear-shaped emerald encircled by diamonds, culminating in a lustrous pearl drop. The design blends modern sensibilities with traditional Telugu artistry.",
  "colors": [
    "Gold (Yellow)",
    "Emerald (Green)",
    "Diamond (White)",
    "Pearl (Creamy White)"
  ],
  "occasions": [
    "Perfect for weddings (Vivahālu)",
    "receptions",
    "engagement ceremonies",
    "and other special occasions. Also suitable for formal events and contemporary celebrations where a touch of tradition is desired. Excellent for gifting during Seemantham or other auspicious ceremonies."
  ],
  "description": "This Emerald and Diamond Peacock Haaram is a true statement piece, blending timeless elegance with contemporary design. The high-quality emeralds and meticulously set diamonds create a captivating sparkle. The peacock motif symbolizes prosperity and good fortune, making it a meaningful and cherished heirloom. Experience the unmatched craftsmanship and cultural significance of Hyderabad's finest jewelry.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Peacock",
    "Padakam",
    "Pendant",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Vivahālu",
    "Seemantham",
    "Engagement",
    "Reception",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Filigree",
    "Pearl"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-43 2_1175",
  "collection": "diamond"
}