{
  "id": "necklaces-122",
  "title": "Polki Vaibhavam: Emerald & Diamond Slice Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds",
    "Faceted Emerald Drops. Features the signature Hyderabadi Polish for a radiant finish. Each diamond is carefully hand-selected for its unique brilliance and clarity. The emeralds are of high quality",
    "exhibiting a vivid green hue."
  ],
  "features": "This breathtaking Haar showcases a stunning arrangement of uncut Polki diamonds, each haloed by shimmering round diamonds. The emerald drops add a touch of regal elegance. The 'jadau' setting, a traditional Mughal technique, enhances the natural beauty of each Polki. The arrangement features a graduated design for a flattering silhouette, perfectly accentuating the neckline.",
  "colors": [
    "Predominantly gold with white diamond brilliance and vibrant emerald green accents. The contrast of the warm gold and cool emeralds creates a captivating visual harmony."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli)",
    "festive occasions",
    "grand celebrations",
    "and special events. An heirloom piece suitable for Muhurtham",
    "Seemantham",
    "and other traditional ceremonies",
    "adding a touch of timeless elegance to your attire."
  ],
  "description": "A testament to exquisite craftsmanship and timeless elegance, this Polki Haar is a true investment piece. The use of uncut Polki diamonds gives it a unique, antique charm, while the emerald drops add a touch of modern sophistication. Its durability ensures it can be passed down through generations, becoming a cherished family heirloom. Its design symbolizes prosperity, luck, and new beginnings.",
  "tags": [
    "Polki",
    "Haar",
    "Necklace",
    "Jadau",
    "Diamond",
    "Emerald",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Bridal Jewelry",
    "Pelli",
    "Muhurtham",
    "Seemantham",
    "Traditional Jewelry",
    "Indian Wedding",
    "कंठाभरणं",
    "పోల్కీ",
    "హార్",
    "వజ్రాలు",
    "పచ్చలు"
  ],
  "original_id": "diamond_jewellery_DPNK8-1579_0355",
  "collection": "diamond"
}