{
  "id": "necklaces-124",
  "title": "Vasundhara Polki & Emerald Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (natural",
    "rose-cut)",
    "Natural Emeralds (round cabochon cut). Features our signature Hyderabadi polish for a lasting gleam."
  ],
  "features": "This exquisite Haaram showcases a classic South Indian design with a modern twist. Lustrous emerald cabochons are gracefully interspersed with intricately set Polki diamonds in floral motifs. Each Polki is carefully hand-selected and set to maximize its brilliance. The necklace features a beautifully articulated chain, ensuring a comfortable drape. The use of open setting for the polkis allows light to shine through, enhancing their natural sparkle.",
  "colors": [
    "Primary colors include vibrant green (Emeralds) and the warm",
    "antique golden hue of the 22K gold",
    "contrasted by the bright",
    "near-colorless sparkle of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "grand celebrations (pedda panduga)",
    "auspicious occasions like Muhurtham",
    "Seemantham",
    "and special family gatherings. Its timeless elegance also makes it suitable for modern soirees and formal events."
  ],
  "description": "This Vasundhara Haaram is more than just a piece of jewelry; it is an investment in tradition and artistry. The combination of Polki and Emeralds is considered highly auspicious in South Indian culture, representing prosperity and good fortune. The use of natural, uncut diamonds and vibrant emeralds ensures its enduring value. The craftsmanship reflects generations of expertise from our artisans, ensuring heirloom quality and timeless appeal.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki",
    "Emerald",
    "Emeralds",
    "Diamonds",
    "Diamond",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Gold",
    "22K Gold",
    "Pedda Panduga",
    "Polki Diamonds",
    "Ethnic Jewelry",
    "Vasundhara",
    "कंठमाला (Kanthamala)",
    "రత్నాలహారం (Ratnala Haaram)"
  ],
  "original_id": "diamond_jewellery_DPNK8-1583_0357",
  "collection": "diamond"
}