{
  "id": "bangles-110",
  "title": "Vaaraala Gaaju - Polki and Pink Sapphire Gold Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold (approximate) with Hyderabadi Polish. Features square-cut Pink Sapphires of good clarity and Polki diamonds (uncut diamonds) with VS clarity. Settings are prong and bezel set for maximum gemstone security."
  ],
  "features": "This bangle showcases a symmetrical arrangement of square-cut Pink Sapphires and uniquely shaped Polki diamonds. The intricate goldwork around each gemstone is indicative of traditional South Indian craftsmanship, reminiscent of heritage designs. The base metal is finely detailed with a granular texture to give the piece an 'antique' finish (purathana look).",
  "colors": [
    "Predominantly gold",
    "complemented by the soft pink hue of the Sapphires and the sparkling white of the Polki diamonds. This classic combination exudes elegance and is particularly favored in South Indian weddings."
  ],
  "occasions": [
    "Perfect for weddings (Pelli)",
    "engagements (Nischitartham)",
    "festivals (Sankranti",
    "Diwali)",
    "or significant family celebrations. It can also add a touch of heritage charm to modern cocktail parties or upscale events."
  ],
  "description": "This bangle blends the enduring appeal of Polki diamonds with the vibrancy of Pink Sapphires. Its antique gold finish and impeccable craftsmanship reflect the rich cultural heritage of South India. The substantial gold weight makes it a valuable investment, while the timeless design ensures it remains a cherished heirloom for generations to come. Possessing this 'Vaaraala Gaaju' means owning a piece of tradition reimagined for the modern connoisseur.",
  "tags": [
    "Bangle",
    "Gaaju",
    "Kangan",
    "Polki Diamonds",
    "Pink Sapphire",
    "22K Gold",
    "Antique Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Pelli",
    "Nischitartham",
    "Handcrafted",
    "Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_DPBG8-1455_0221",
  "collection": "diamond"
}