{
  "id": "bangles-090",
  "title": "The \"Yashoda\" Diamond & Gold Kankanam: A Touch of Divinity",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "brilliant-cut Diamonds (VS clarity",
    "G color). Expertly crafted with a Hyderabadi polish for lasting brilliance."
  ],
  "features": "This exquisite Kankanam showcases a delicate floral and vine openwork design, intricately studded with sparkling diamonds. The centerpiece features a traditional 'GajaLakshmi' motif in antique gold finish, a symbol of prosperity and abundance. This bangle has a traditional 'V' shape with very fine open work that showcases the diamonds. The detail of 'GajaLakshmi' in the center is very important and shows the prosperity and tradition.",
  "colors": [
    "Warm gold",
    "sparkling white diamonds",
    "and antique gold accents create a harmonious blend of classic and modern aesthetics."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "bridal showers",
    "and festive occasions. A treasured heirloom for generations."
  ],
  "description": "This Kankanam is a beautiful blend of traditional South Indian artistry and modern elegance. The GajaLakshmi motif adds a touch of divinity and cultural significance, making it a truly special piece. Its high-quality materials and expert craftsmanship ensure lasting beauty and durability. The intricacy and sparkle make it a stunning addition to any bridal trousseau. Its comfort fit makes it ideal for wearing everyday.",
  "tags": [
    "Bangle",
    "Kankanam",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Diamond Bangle",
    "Gold Bangle",
    "GajaLakshmi",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "Vivaham",
    "Prosperity",
    "Heirlooom",
    "Indian Wedding"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0357_0018",
  "collection": "bracelets"
}