{
  "id": "earrings-461",
  "title": "Exquisite Kundan and Gemstone Chandbali Earrings - A Timeless Statement",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (సువర్ణం)",
    "Polki Diamonds (పోల్కి వజ్రాలు)",
    "Burmese Ruby (బర్మీస్ రూబీ)",
    "Zambian Emerald (జాంబియన్ పచ్చ)",
    "Natural Pearls (ముత్యాలు). Hyderabadi Polish."
  ],
  "features": "Classic Chandbali design with a crescent moon shape adorned with uncut Polki diamonds in a traditional Kundan setting. Features a central square-cut Emerald and a teardrop Emerald, complemented by cascading Ruby drops and delicate pearl accents. Exquisite filigree work surrounds the gemstones, adding a touch of antique charm. The top of the Chandbali displays a floral ruby design, enhanced by surrounding polkis.",
  "colors": [
    "Gold",
    "White (Polki Diamonds)",
    "Green (Emerald)",
    "Red (Ruby)",
    "White (Pearls). A vibrant and auspicious color combination typical of South Indian bridal jewelry."
  ],
  "occasions": [
    "Weddings (వివాహం)",
    "Muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "Half-Saree Function (లంగా ఓణి వేడుక)",
    "Festive Celebrations (పండుగలు)",
    "Upscale Cultural Events."
  ],
  "description": "This Chandbali earring embodies the opulence of traditional South Indian jewelry. The use of uncut Polki diamonds gives it a unique, regal aesthetic. The vibrant Ruby and Emerald gemstones are meticulously selected for their color and clarity. Handcrafted by skilled artisans in Hyderabad, this piece is a testament to enduring craftsmanship and timeless elegance. The Hyderabadi polish provides a lasting luster. This earring is a heritage piece that can be passed down through generations.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Polki Diamonds",
    "Kundan Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "Telugu Jewelry",
    "Chevi Duddulu",
    "సువర్ణం",
    "వజ్రాలు",
    "ముత్యాలు",
    "చెవి దుద్దులు",
    "Heritage Jewelry",
    "Antique Finish"
  ],
  "original_id": "ear_rings_DPCB8-957_2577",
  "collection": "ear"
}