{
  "id": "necklaces-012",
  "title": "The Elara Diamond Haaram Set: A Symphony of Tradition and Modernity",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Crafted in 18K Rose Gold with brilliant-cut Diamonds (VVS clarity",
    "G color). Features a Hyderabadi polish for a lasting shine. The gold is ethically sourced and hallmarked."
  ],
  "features": "This Haaram features a unique cascading design with interconnected teardrop motifs. The central pendant element showcases a stylized paisley (manga malai) design. Each teardrop and paisley is meticulously pave-set with shimmering diamonds, creating a breathtaking sparkle. The matching earrings echo the necklace's cascading teardrop form. Modern setting techniques meet the essence of traditional South Indian jewelry design.",
  "colors": [
    "Primarily Rose Gold and white with the sparkling brilliance of diamonds. The rose gold hue adds a warm and romantic touch."
  ],
  "occasions": [
    "Perfect for modern weddings",
    "receptions",
    "sangeets",
    "or any grand celebration where you want to make a statement. Can also be worn for special occasions like anniversaries or milestone birthdays. Ideal for a bride seeking a blend of traditional elegance and contemporary flair."
  ],
  "description": "This Elara Diamond Haaram Set is a true masterpiece, meticulously crafted by our skilled artisans. Its unique design seamlessly blends traditional South Indian aesthetics with a modern sensibility. The use of high-quality diamonds and rose gold ensures a dazzling and luxurious look. This is a statement piece that will be treasured for generations, a symbol of your discerning taste and timeless style.",
  "tags": [
    "Diamond Haaram",
    "Rose Gold Jewelry",
    "Bridal Necklace",
    "South Indian Jewelry",
    "Manga Malai",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Haaram",
    "Diamond Necklace Set",
    "Telugu Traditions",
    "Fine Jewelry"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0018_0047",
  "collection": "choker"
}