{
  "id": "necklaces-1480",
  "title": "Lakshmi Kasu Haaram with Emerald and Diamond Brilliance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VS Clarity)",
    "Natural Emeralds (Round Cut)",
    "and Fine Green Beads; Hyderabadi Polish"
  ],
  "features": "This exquisite Kasu Haaram features meticulously crafted Lakshmi coins (Kasu) intricately arranged and interlinked with delicate diamond floral motifs. The centerpiece is adorned with a stunning emerald surrounded by a halo of brilliant-cut diamonds. The necklace gracefully incorporates strands of fine green beads held together by diamond clasps, adding a touch of color and sophistication. The gold work showcases traditional Telugu craftsmanship with a contemporary twist.",
  "colors": [
    "Gold (Warm Yellow)",
    "Green (Emerald and Beads)",
    "White (Diamonds)",
    "and subtle hints of Red (Ruby)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "engagements (Nischitartham)",
    "festive occasions like Diwali and Sankranti",
    "temple visits",
    "or significant family celebrations. Ideal for brides",
    "mothers of the bride/groom",
    "or anyone wanting to make a statement with traditional elegance."
  ],
  "description": "This Kasu Haaram embodies the rich cultural heritage of South India. The Lakshmi coins symbolize prosperity and good fortune, making it a truly auspicious piece. The combination of emeralds, diamonds, and gold creates a captivating visual appeal. Crafted with exceptional attention to detail, this heirloom-quality necklace is designed to be cherished for generations. The Hyderabadi polish ensures a long-lasting, radiant finish.",
  "tags": [
    "Kasu Mala",
    "Lakshmi Haaram",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Gold Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Nischitartham",
    "Temple Jewelry",
    "Devotional Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-41-01 2_2098",
  "collection": "sjpl"
}