{
  "id": "necklaces-913",
  "title": "Manjula Antique Gold Emerald Pendant Necklace - An Elegant Addition to Your Haaram Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Emerald Cabochon (central stone)",
    "Cubic Zirconia (CZ) accents. The gold has a subtle antique finish",
    "adding depth and character to the piece."
  ],
  "features": "This necklace features a delicate flower motif chain, leading to a stunning floral pendant. The central emerald cabochon is surrounded by intricately set CZs in a traditional Hyderabadi Kundan setting. The pendant is adorned with spherical gold beads. The design incorporates elements reminiscent of traditional temple jewelry but with a lighter, more modern aesthetic. Fine filigree work is present throughout the pendant.",
  "colors": [
    "Antique Gold",
    "Emerald Green",
    "and Sparkling White (CZ). The antique gold enhances the warmth of the green emerald",
    "while the CZs provide a contrasting brilliance."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "festivals (like Sankranthi and Diwali)",
    "and other auspicious occasions. Equally suitable for a sophisticated evening event or adding a touch of traditional elegance to a contemporary outfit. Ideal for events like Seemantham or Half-Saree functions."
  ],
  "description": "This necklace is a testament to the skilled craftsmanship of Hyderabad's artisans. The antique finish provides a timeless appeal, while the combination of emerald and CZ offers a captivating sparkle. Its blend of tradition and modernity makes it a versatile piece, allowing it to be worn on various occasions. The Hyderabadi polish ensures long-lasting shine and durability. Owning this piece means owning a part of Hyderabad's rich jewelry heritage.",
  "tags": [
    "Necklace",
    "Haaram",
    "Pendant",
    "Gold",
    "Emerald",
    "CZ",
    "Hyderabadi Jewelry",
    "Antique Finish",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Kundan",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Half-Saree",
    "Spherical Bead",
    "Flower Motif",
    "Filigree Work",
    "Hyderabad Polish",
    "Andhra Jewellery",
    "Telugu Jewellery"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0307_2374",
  "collection": "necklace"
}