{
  "id": "necklaces-1230",
  "title": "The \"Chandrika\" Diamond and Emerald Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High purity gold",
    "estimated 22K",
    "meticulously studded with brilliant-cut diamonds",
    "with accents of natural rubies and emeralds. Features exquisite craftsmanship with a classic Hyderabadi polish for a lasting shine."
  ],
  "features": "This majestic haaram showcases a layered crescent design, each layer meticulously set with shimmering diamonds. The centerpiece is a captivating emerald and diamond pendant, exhibiting intricate filigree work reminiscent of traditional South Indian designs. Small jhumka-style drops adorn the lower edge, adding movement and grace. The pendant features a central emerald, surrounded by detailed ruby and diamond floral motifs.",
  "colors": [
    "Predominantly gold and diamond white",
    "with vibrant green emeralds and subtle red ruby accents. This classic color palette is deeply rooted in South Indian traditions",
    "symbolizing prosperity and auspiciousness."
  ],
  "occasions": [
    "Perfect for a grand Telugu wedding",
    "a traditional Seemantham ceremony",
    "or any significant celebration where a touch of regal elegance is desired. Also suitable for high-end gala events and formal gatherings where a statement piece is appreciated."
  ],
  "description": "A true heirloom piece, this haaram embodies the rich heritage of South Indian jewelry design. The exceptional craftsmanship, combined with the brilliance of the diamonds and the vibrancy of the emeralds, creates a captivating and unforgettable statement. The traditional design, meticulously executed with modern precision, ensures lasting beauty and enduring value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Jadau Jewelry",
    "Seemantham",
    "Muhurtham",
    "Vaddanam",
    "Kasulaperu",
    "Guttapusalu",
    "Antique Finish",
    "Heirloom Jewelry",
    "kundan"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-56 3_1804",
  "collection": "sjpl"
}