{
  "id": "bangles-157",
  "title": "Diamond Cut Bangles - 'Kadiyalu' with Modern Flair",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold",
    "featuring ethically sourced",
    "brilliant-cut diamonds. The gold has a smooth",
    "lustrous finish achieved with traditional Hyderabadi polish techniques",
    "ensuring long-lasting shine."
  ],
  "features": "These sleek Kadiyalu bangles feature a minimalist design punctuated by strategically placed, sparkling diamonds. The diamonds are securely set in a prong setting, maximizing their brilliance. The simple, elegant lines of the bangles offer a contemporary take on the traditional South Indian bangle style.",
  "colors": [
    "Predominantly yellow gold with the clear",
    "bright sparkle of diamonds",
    "creating a classic and versatile color palette."
  ],
  "occasions": [
    "Suitable for daily wear or for more formal occasions. They are a beautiful addition to a modern South Indian bride's trousseau or can be gifted for celebrations like birthdays",
    "anniversaries",
    "or housewarmings ('Gruhapravesam')."
  ],
  "description": "These bangles seamlessly blend traditional South Indian craftsmanship with a modern aesthetic, offering a timeless piece that can be cherished for generations. The high-quality gold and diamonds ensure lasting value and enduring beauty. Their minimalist design makes them incredibly versatile, easily paired with both traditional and contemporary attire. A symbol of prosperity and good fortune, these Kadiyalu are a valuable addition to any jewelry collection.",
  "tags": [
    "Bangles",
    "Kadiyalu",
    "Gold Bangles",
    "Diamond Bangles",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Modern Bangles",
    "Bridal Jewelry",
    "Daily Wear Bangles",
    "Anniversary Gift",
    "Gruhapravesam",
    "22K Gold",
    "Diamonds"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0010_0682",
  "collection": "diamond"
}