{
  "id": "earrings-169",
  "title": "Exquisite Ruby and Polki Diamond Drop Earrings - Chand Bali Inspired",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Polki Diamonds (Uncut Diamonds)",
    "Burmese Ruby. Features high-quality craftsmanship with meticulously selected gemstones."
  ],
  "features": "Classic South Indian teardrop design. The polki diamonds are set in a closed setting (kundan) reflecting traditional techniques. The earrings exhibit a Chand Bali (crescent moon) inspired silhouette, reimagined for a modern aesthetic with a cascading gemstone arrangement.",
  "colors": [
    "Rich gold hue complemented by the fiery red of the Burmese Ruby and the subtle sparkle of the Polki Diamonds. This creates a beautiful contrast embodying traditional Telugu wedding jewelry color palettes."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Muhurtham)",
    "receptions",
    "engagement parties",
    "festive celebrations",
    "or any event where you want to add a touch of regal elegance. Suitable for both traditional South Indian attire like sarees and lehengas",
    "as well as contemporary outfits."
  ],
  "description": "These earrings beautifully blend traditional South Indian artistry with modern design sensibilities. The use of high-quality Polki Diamonds and Burmese Rubies ensures lasting brilliance. The Hyderabadi polish gives the gold a rich, warm luster, adding to its antique charm. These earrings are a timeless investment piece that will be cherished for generations.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Karnaphulalu",
    "Polki Diamond",
    "Ruby",
    "Kundan",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Statement Earrings",
    "Chand Bali",
    "Uncut Diamonds",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_DPER8-755_0311",
  "collection": "diamond"
}