{
  "id": "necklaces-1093",
  "title": "Polki Diamond and Emerald Circular Pendant Haaram with Pearl Lockets",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Emerald Beads",
    "Fresh Water Pearls. Featuring Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Haaram features a circular pendant adorned with Polki diamonds arranged in a floral pattern. The pendant is accented with vibrant green emeralds. A delicate pearl tassel hangs gracefully below, interspersed with emerald beads, completing the piece. The use of Polki diamonds lends a traditional, regal touch.",
  "colors": [
    "Green (Emeralds)",
    "White (Pearls)",
    "Gold (Metal)",
    "White (Polki Diamonds). The contrast between the green and white offers a refreshing and sophisticated palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "festive occasions like Diwali or Sankranthi",
    "and traditional ceremonies such as seemantham or half-saree function. Can also be styled with modern outfits for a touch of ethnic elegance."
  ],
  "description": "This Haaram seamlessly blends traditional South Indian craftsmanship with a contemporary design. The use of Polki diamonds and emeralds signifies prosperity and good fortune, making it a cherished heirloom. The Hyderabadi polish ensures lasting brilliance and durability. Its versatile design allows it to be paired with both traditional and modern attire.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamonds",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Ethnic Jewelry",
    "Bridal Jewelry",
    "Engagement Jewelry",
    "Pendant Necklace",
    "Traditional Jewelry",
    "పతకం",
    "హారం",
    "ముత్యాలు",
    "పచ్చలు"
  ],
  "original_id": "radhe_diam_DPPD8-1593_2506",
  "collection": "radhe"
}