{
  "id": "earrings-245",
  "title": "Navratna Kundanalu: Timeless Gemstone Stud Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Swarna)",
    "featuring authentic Navratnas including Ruby (Manikyam)",
    "Pearl (Mutyam)",
    "Coral (Pagadam)",
    "Emerald (Pachcha)",
    "Yellow Sapphire (Pushyaragam)",
    "Diamond (Vajram)",
    "Blue Sapphire (Neelam)",
    "Hessonite (Gomedikam)",
    "and Cat's Eye (Vaiduryam). Set with Polki Diamonds. High-quality",
    "Hyderabadi Polish for a lasting luster."
  ],
  "features": "A classic South Indian design, each earring showcases a floral arrangement of the nine sacred gemstones (Navratnas) meticulously arranged for maximum astrological benefit and aesthetic appeal. The centerpiece gemstone is surrounded by a delicate cluster of Polki diamonds, adding brilliance and dimension. The setting is designed to enhance the unique beauty and healing properties of each gemstone, reflecting traditional Telugu craftsmanship.",
  "colors": [
    "Multicolor - Rich jewel tones of red",
    "white",
    "coral",
    "green",
    "yellow",
    "clear",
    "blue",
    "brown and grey. The golden glow of the 22K gold setting enhances the vibrancy of the Navratnas."
  ],
  "occasions": [
    "Perfect for auspicious occasions like weddings (Vivah)",
    "festivals (Panduga)",
    "housewarmings (Gruhapravesam)",
    "and traditional ceremonies like Seemantham and Half-Saree Functions. Also suitable for adding a touch of elegance to modern formal events."
  ],
  "description": "This Navratna Kundanalu is not just a piece of jewelry; it's a symbol of prosperity, health, and good fortune. Handcrafted by skilled artisans using time-honored techniques, each gemstone is carefully selected for its quality and astrological significance. A treasured heirloom to be passed down through generations, these earrings offer a blend of traditional South Indian heritage and exquisite craftsmanship.",
  "tags": [
    "Navratna",
    "Kundanalu",
    "Earrings",
    "Stud Earrings",
    "Navaratnalu",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Telugu Jewelry",
    "Gemstone Jewelry",
    "Polki Diamonds",
    "22K Gold",
    "Swarna",
    "Manikyam",
    "Mutyam",
    "Pagadam",
    "Pachcha",
    "Pushyaragam",
    "Vajram",
    "Neelam",
    "Gomedikam",
    "Vaiduryam",
    "Hyderabadi Jewelry",
    "Auspicious Jewelry",
    "Wedding Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-04-20-13-18-48 2_0823",
  "collection": "diamond"
}