{
  "id": "necklaces-635",
  "title": "Apsara Diamond Haaram with Emerald Accents and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color)",
    "Natural Emeralds (Oval Cut",
    "Zambian Origin)",
    "South Sea Pearls. Finished with a signature Hyderabadi Polish."
  ],
  "features": "This stunning two-layer Haaram features intricate floral motifs set with dazzling brilliant-cut diamonds. Each flower is meticulously crafted to capture the light, creating a breathtaking sparkle. The pendant showcases a larger floral design, accentuated by a vibrant Zambian Emerald at its center. Delicate South Sea pearls dangle gracefully from each layer, adding a touch of timeless elegance. The 'Apsara' design embodies traditional Telugu jewelry aesthetics with a contemporary flair, featuring a layered design and delicate detailing.",
  "colors": [
    "Yellow Gold",
    "White (Diamonds)",
    "Green (Emeralds)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Bridal Wear (Muhurtham",
    "Reception)",
    "Seemantham",
    "Half-Saree Function",
    "Anniversary Celebrations",
    "Upscale Social Events",
    "Festive Occasions like Diwali and Sankranthi"
  ],
  "description": "This Haaram is a perfect blend of traditional craftsmanship and modern design sensibilities. The use of high-quality diamonds and emeralds ensures exceptional brilliance and lasting value. The Hyderabadi polish gives the gold a rich, lustrous finish. It's a statement piece that will be treasured for generations, symbolizing prosperity and good fortune.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Mutyala Haaralu",
    "Vaddanam",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Diamond Jewelry",
    "Emeralds",
    "Pearls"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-09 2_1141",
  "collection": "diamond"
}