{
  "id": "necklaces-1566",
  "title": "Manoharam Moti Haaram: A Symphony of Pearls, Polkis, and Pink Carve Gemstones",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-quality alloy base with micro-plated gold finish. Featuring lustrous freshwater pearls (Moti)",
    "meticulously placed Polki diamonds",
    "NV Fancy gemstones",
    "and delicately carved Pink Carve gemstones. Hyderabadi Polish for a lasting sheen."
  ],
  "features": "A modern interpretation of the classic Haaram, this piece features an intricate floral design. Each pearl is carefully selected for its shine and size, creating a captivating cascade. The pink carve gemstones are placed to provide subtle texture to the piece. The filigree Polki diamond work adds a touch of traditional charm and brilliance.",
  "colors": [
    "Primarily white (Pearls)",
    "transparent (Polki Diamonds)",
    "with soft hues of pink and accents of orange in the gemstones. This color palette is ideal for pairing with a range of traditional and contemporary outfits."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "sangeets",
    "and other special occasions. It's also a unique piece for modern events where you want to make a statement with a touch of South Indian elegance."
  ],
  "description": "This Haaram is a testament to our expert craftsmanship, blending traditional South Indian design principles with modern aesthetics. The carefully selected pearls and Polki diamonds make it a valuable and timeless piece. This show stopping peice brings South Indian cultural heritage with it.",
  "tags": [
    "Haaram",
    "Pearl Necklace",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Hyderabadi Jewelry",
    "Indian Necklace",
    "Moti",
    "Telugu Jewelry",
    "Fancy Gems",
    "Pink Carve",
    "modern south indian"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-49 2_2270",
  "collection": "sjpl"
}