{
  "id": "earrings-483",
  "title": "Polki & Emerald Chandbali Earrings - Parijatham Pendent",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (Bangaram)",
    "Uncut Polki Diamonds",
    "Faceted Emeralds (Paccha Rallu)",
    "Seed Pearls. Showcases Hyderabadi Polish for a lasting shine."
  ],
  "features": "Features a traditional Chandbali design with a unique floral pendant. The centerpiece showcases a cluster of polki diamonds interspersed with vibrant emeralds. Dainty seed pearls add a touch of elegance to the cascading design. The setting is carefully crafted to maximize the brilliance of the polki diamonds, a testament to traditional craftsmanship.",
  "colors": [
    "Gold",
    "White (Polki Diamonds)",
    "Green (Emeralds)",
    "and Cream (Pearls). A classic South Indian color palette that exudes sophistication."
  ],
  "occasions": [
    "Perfect for weddings (Pelli)",
    "receptions",
    "festive celebrations (Sankranti",
    "Ugadi)",
    "and special occasions like Seemantham or a half-saree function. Also suitable for adding a touch of traditional glamour to modern events."
  ],
  "description": "These Chandbali earrings are a stunning example of traditional South Indian jewelry artistry. The use of uncut polki diamonds, rare emeralds, and Hyderabadi polish makes this a timeless piece. It is not only beautiful but also carries cultural significance, making it a cherished heirloom for generations to come. The combination of traditional design with a contemporary feel makes it versatile for both traditional and modern occasions.",
  "tags": [
    "Chandbali",
    "Kammalu",
    "Earrings",
    "Polki",
    "Diamond",
    "Emerald",
    "Paccha Rallu",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Gold Jewelry",
    "22K Gold",
    "Seed Pearls",
    "Bridal Jewelry",
    "Pelli",
    "Seemantham",
    "Festive",
    "Ugadi",
    "Sankranti"
  ],
  "original_id": "ear_rings_DPER8-1451_2605",
  "collection": "ear"
}