{
  "id": "necklaces-1412",
  "title": "Emerald & Diamond Peacock Haaram - Mohana Mani Kantabharanam",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base intricately set with brilliant-cut diamonds and vivid green Emeralds. Features fine Hyderabadi Polish for a lasting luster and enhanced gold hue. Emeralds are of AAA quality",
    "exhibiting excellent clarity and vibrant color."
  ],
  "features": "Inspired by traditional South Indian artistry, this Haaram showcases a magnificent peacock (Mayura) motif centerpiece, meticulously crafted with delicate diamond filigree. Alternating emerald and diamond floral design along the necklace. The central pendant features a cluster of diamonds surrounding a central emerald. The design is completed with emerald drop pendants.",
  "colors": [
    "Primarily gold",
    "white (diamonds)",
    "and emerald green. The rich gold complements the dazzling diamonds",
    "while the emeralds provide a striking pop of color",
    "creating a regal and harmonious palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "receptions",
    "Seemantham",
    "and significant celebrations. Its exquisite design also makes it a showstopping piece for high-end parties and cultural events."
  ],
  "description": "This Haaram is more than just jewelry; it's a symbol of timeless elegance and cultural heritage. The impeccable craftsmanship, combined with the rarity and beauty of the emeralds and diamonds, makes it a treasured heirloom. The peacock motif represents beauty, prosperity, and auspicious beginnings, adding to its significance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Peacock Design",
    "Mayura",
    "Kantabharanam",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "22K Gold",
    "Emerald Necklace"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-22 2_2030",
  "collection": "sjpl"
}