{
  "id": "necklaces-1543",
  "title": "Exquisite Diamond & Emerald Vaddanam with Pearl Drops",
  "category": "necklaces",
  "original_type": "Waist Belt/Chain",
  "materials": [
    "18K Yellow Gold",
    "brilliant-cut Diamonds (VVS clarity)",
    "Emeralds (natural",
    "round cut)",
    "Rubies (natural)",
    "South Sea Pearls (Moti). Features our signature Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "A stunning Vaddanam meticulously handcrafted with intricate diamond settings. Features a central peacock motif adorned with emeralds and rubies, symbolizing prosperity and grace. The lower portion showcases delicate diamond and emerald floral patterns, accented with dangling South Sea pearl drops and small jhumka elements with pearl caps. The design incorporates traditional South Indian floral and paisley (manga) patterns.",
  "colors": [
    "Predominantly gold and diamond white with vibrant emerald green and ruby accents. Soft",
    "lustrous pearl hues provide a delicate contrast."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (vivaha mahotsavam)",
    "Seemantham (baby shower)",
    "half-saree functions (laga voni function)",
    "and other traditional ceremonies. Also suitable for high-end parties and formal events where a touch of heritage and elegance is desired."
  ],
  "description": "This Vaddanam is a true heirloom piece, crafted with the highest quality materials and impeccable craftsmanship. Its traditional design, combined with modern elegance, makes it a timeless treasure. The peacock motif, a symbol of beauty and royalty, adds a touch of cultural significance. The diamonds, emeralds, and pearls are carefully selected for their brilliance and quality. A perfect embodiment of South Indian heritage and a statement of exquisite taste.",
  "tags": [
    "Vaddanam",
    "Oddiyanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Peacock Design",
    "Moti",
    "Ruby",
    "Emerald",
    "ஒட்டியாணம்",
    "ఒడ్డాణం",
    "పెళ్ళి నగలు",
    "Hyderabadi Polish"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-11-18-02 4_2170",
  "collection": "sjpl"
}