{
  "id": "necklaces-1097",
  "title": "Celestial Polki Diamond Tassel Haaram - Contemporary Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Natural Freshwater Pearls",
    "Faceted Ruby Beads. Features Hyderabadi Kundan setting technique."
  ],
  "features": "This exquisite haaram seamlessly blends traditional and contemporary elements. The pendant features a striking star motif crafted with meticulously set Polki diamonds. The lower half of the pendant features a cascading tassel made of lustrous freshwater pearls alternating with vibrant ruby beads, adding a touch of playful elegance. The gold chain is embellished with alternating ruby and pearl beads. The pendant also has a ruby cluster near the tassel that is held together with gold wiring.",
  "colors": [
    "Gold",
    "White (Pearls)",
    "Red (Ruby)",
    "Clear (Polki Diamonds)"
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement ceremonies",
    "cocktail parties",
    "and festive occasions. A modern twist on traditional bridal jewelry",
    "making it suitable for both muhurtham and pre-wedding celebrations."
  ],
  "description": "This haaram is a unique blend of traditional Hyderabadi craftsmanship and contemporary design. The use of uncut Polki diamonds and natural pearls adds a touch of timeless elegance, while the ruby and pearl tassel brings a modern flair. A statement piece that exudes sophistication and cultural richness.",
  "tags": [
    "Haaram",
    "Polki Diamond Necklace",
    "Pearl Tassel",
    "Ruby Beads",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Necklace",
    "Kundan",
    "Pearls",
    "Ruby",
    "Gemstone Necklace",
    "Wedding",
    "Muhurtham",
    "Reception",
    "Gift",
    "Star Design"
  ],
  "original_id": "radhe_diam_DPPD8-1632_2510",
  "collection": "radhe"
}