{
  "id": "necklaces-302",
  "title": "Divyamani Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with a Hyderabadi Polish for a lasting luster. Adorned with meticulously selected",
    "brilliant-cut Diamonds of VS clarity. Features a vibrant Ruby accent and an Emerald centerpiece",
    "complemented by lustrous South Sea Pearls."
  ],
  "features": "This exquisite Haaram showcases a delicate floral and paisley motif throughout its design. The intricate openwork setting enhances the brilliance of each diamond. The pendant features a traditional design, lending a touch of regal elegance. The Ruby and Emerald provide a striking contrast, evoking the vibrancy of South Indian artistry. Finished with a pearl drop design.",
  "colors": [
    "The piece boasts a radiant gold hue contrasted by the sparkling white of the diamonds",
    "the rich red of the Ruby",
    "the deep green of the Emerald",
    "and the creamy white of the South Sea Pearls. The design evokes a traditional Telugu color palette."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "receptions",
    "Seemantham ceremonies",
    "and significant anniversaries. Also a stunning statement piece for high-profile social events and celebrations."
  ],
  "description": "This Divyamani Haaram is a testament to enduring craftsmanship and timeless elegance. The combination of high-quality diamonds, precious gemstones, and lustrous pearls creates a breathtaking piece of art. Its traditional design, combined with modern sensibilities, makes it a truly unique and valuable addition to any jewelry collection. This haaram is a heirloom piece, a treasure to be cherished for generations.",
  "tags": [
    "Diamond Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "22K Gold",
    "Ruby",
    "Emerald",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Polish",
    "Traditional Necklace",
    "Indian Bridal Jewelry",
    "Fine Jewelry",
    "VS Clarity Diamonds"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0391_0588",
  "collection": "diamond"
}