{
  "id": "earrings-241",
  "title": "Aarya Floral Emerald Stud Earrings - A Timeless Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold)",
    "Natural Emerald (Oval Cut",
    "Fine Green)",
    "High-Quality Cubic Zirconia. Expertly crafted with Hyderabadi Polish for enduring luster."
  ],
  "features": "Inspired by traditional South Indian floral motifs, these stud earrings feature an intricate filigree design. A central oval-cut emerald is embraced by a delicate arrangement of sparkling cubic zirconia, creating a harmonious blend of classic and contemporary aesthetics. The openwork design allows light to pass through, enhancing the brilliance of the gemstones. The floral 'Kundan' inspiration gives it a royal touch.",
  "colors": [
    "Predominantly gold with vibrant green from the emerald and the sparkling white from cubic Zirconia."
  ],
  "occasions": [
    "Perfect for everyday wear",
    "festive occasions",
    "engagements",
    "or a special gift. Its versatile design complements both traditional attire like sarees and lehengas and modern ensembles."
  ],
  "description": "These stud earrings represent a beautiful fusion of tradition and modernity. The combination of high-quality materials, intricate craftsmanship, and a timeless design makes them a valuable addition to any jewelry collection. The emerald's vibrant green symbolizes prosperity and renewal, making it a meaningful and stylish accessory. These earnings embody the artistic finesse of Hyderabadi jewelry.",
  "tags": [
    "Earrings",
    "Studs",
    "Emerald",
    "Cubic Zirconia",
    "22K Gold",
    "Gold Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Traditional Jewelry",
    "Festive Jewelry",
    "Gift",
    "Muhurtham",
    "Engagement Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241219-WA0026_0806",
  "collection": "diamond"
}