{
  "id": "necklaces-1523",
  "title": "Enchanting Diamond & Emerald Kasulaperu Haaram - A Bridal Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "142.220 grams of high-purity Gold with Hyderabadi Polish. Features 1906 brilliant-cut diamonds totaling 9.38 carats",
    "complemented by 2 vibrant rubies weighing 1.82 carats and 2 exquisite emeralds totaling 1.17 carats. Accentuated with 28 lustrous South Sea pearls totaling 95.31 carats."
  ],
  "features": "This stunning Haaram seamlessly blends traditional South Indian design with contemporary elegance. The broad, diamond-encrusted choker leads to a delicately cascading pattern, culminating in a pendant featuring a central emerald. Adorned with pearl drops, the design evokes a sense of opulence and grace. The meticulous setting of the diamonds enhances their brilliance, while the pearl drops add a touch of classic charm. The pendant features a similarly exquisite design, mirroring the intricacy of the main piece.",
  "colors": [
    "Predominantly gold and white (diamonds) with pops of vibrant green (emeralds) and subtle red (rubies). The pearls add a soft",
    "creamy hue",
    "creating a rich and balanced color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "engagements (Nischayataartham)",
    "and other grand celebrations. Its regal design makes it a cherished heirloom piece",
    "ideal for significant life events."
  ],
  "description": "This Diamond & Emerald Kasulaperu Haaram is a statement of exquisite craftsmanship and timeless beauty. The meticulous attention to detail, the high-quality materials, and the perfect blend of traditional and modern aesthetics make it a truly unique and desirable piece. Its Hyderabadi polish ensures lasting shine and durability, making it a valuable addition to any jewelry collection. The combination of diamonds, emeralds, rubies and pearls is traditionally considered auspicious, making this Haaram not only beautiful but also a symbol of good fortune.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kasulaperu",
    "Mogappu",
    "Vivaaham",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Mogappu",
    "కంఠాభరణం",
    "Nischayataartham"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-03_2141",
  "collection": "sjpl"
}