{
  "id": "necklaces-1082",
  "title": "Indrani Polki Haaram with Emerald and Ruby Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Hallmarked)",
    "Polki Diamonds (Uncut Diamonds)",
    "Emeralds (faceted cabochon)",
    "Ruby (cabochon)",
    "Freshwater Pearls. Features a delicate Hyderabadi Polish for enhanced luster."
  ],
  "features": "This stunning Haaram showcases intricate filigree work along the necklace strand, adorned with dazzling Polki diamonds. The pendant features a striking teardrop-shaped Ruby, encircled by Emeralds and a halo of Polki diamonds. Peacock motifs (Mayura designs), are gracefully integrated into the design, adding a touch of tradition and auspiciousness. The pendant is finished with cascading emerald and pearl drops.",
  "colors": [
    "Gold",
    "White (Polki Diamonds)",
    "Green (Emeralds)",
    "Deep Red (Ruby)",
    "Cream (Pearls). The classic combination of emerald green",
    "ruby red",
    "and gold is traditionally considered auspicious in South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (kalyanam)",
    "receptions",
    "festivals (Ugadi",
    "Diwali)",
    "and other special occasions. Its contemporary design also makes it suitable for upscale modern events and celebrations."
  ],
  "description": "This Haaram is a beautiful fusion of traditional craftsmanship and modern design sensibilities. The use of high-quality Polki diamonds and vibrant gemstones ensures brilliance and timeless elegance. The Hyderabadi polish enhances the gold's luster, while the intricate peacock motifs add cultural significance. A true statement piece that will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki",
    "Diamonds",
    "Emerald",
    "Ruby",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Kalyanam",
    "Mayura",
    "Peacock",
    "Traditional",
    "Ethnic",
    "Uncut Diamonds",
    "22K Gold",
    "Ugadi",
    "Diwali",
    "Seemantham",
    "Indian Wedding",
    "Gold Necklace",
    "Emerald Necklace",
    "Ruby Necklace",
    "Pearl Drops",
    "Telugu Jewellery",
    "Hallmarked Gold"
  ],
  "original_id": "radhe_diam_DPNK8-1815_2495",
  "collection": "radhe"
}