{
  "id": "necklaces-1425",
  "title": "Enchanting Emerald & Diamond Raasi Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold setting",
    "featuring meticulously hand-selected",
    "VS clarity brilliant-cut diamonds and pear-shaped Zambian emeralds with vivid green hue. The necklace exhibits a subtle Hyderabadi Polish."
  ],
  "features": "This Haaram features a layered, cascading design reminiscent of traditional Telugu jewelry. The intricate filigree detailing and the floral motifs are inspired by classical South Indian artistry. The pear-shaped emeralds are securely set within diamond-studded halos, adding depth and brilliance. The modern design ensures a comfortable fit and allows the gemstones' beauty to shine.",
  "colors": [
    "The piece showcases a delicate contrast between the warm rose gold",
    "the dazzling white of the diamonds",
    "and the vibrant green of the Zambian emeralds",
    "a color palette known for its auspiciousness and beauty."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "weddings",
    "receptions",
    "engagements",
    "and festive occasions like Diwali or Ugadi. This piece also seamlessly transitions to modern events",
    "adding a touch of regal elegance to any ensemble. Ideal for Muhurtham",
    "Sangeeth",
    "or even a high-profile corporate event."
  ],
  "description": "This Haaram is a harmonious blend of tradition and contemporary design, making it a truly unique investment. The high-quality materials and expert craftsmanship ensure lasting beauty and value. The emeralds are known for their prosperity-bringing properties, making this piece not only beautiful but also imbued with cultural significance. The Hyderabadi polish adds a touch of understated elegance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Rose Gold Jewelry",
    "Zambian Emerald",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Raasi",
    "Wedding",
    "Muhurtham",
    "engagement"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-29 2_2043",
  "collection": "sjpl"
}