{
  "id": "earrings-190",
  "title": "Exquisite Emerald and Diamond Stud Earrings - Pancha Ratna Vanti",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold",
    "Fine Quality Emerald (Panche Ratnalu)",
    "Brilliant Cut Diamonds (Vajralu). Crafted with Hyderabadi Polish for lasting luster."
  ],
  "features": "These stud earrings feature a unique hexagonal frame adorned with sparkling diamonds. The central emerald is set within a delicate floral design reminiscent of traditional Nakshi work. The lattice framework adds a modern touch, ensuring the gemstone's brilliance is captured from every angle. The secure screw-back closure provides comfortable and worry-free wear.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "and Dazzling White (Diamonds). The contrasting colors symbolize prosperity and harmony",
    "a traditional belief in South Indian culture."
  ],
  "occasions": [
    "Perfect for everyday elegance",
    "festive occasions like Diwali and Sankranti",
    "or adding a touch of sophistication to a Seemantham ceremony. These earrings also make a thoughtful gift for birthdays",
    "anniversaries",
    "or any special occasion."
  ],
  "description": "These earrings seamlessly blend traditional South Indian design elements with a modern aesthetic. The high-quality emerald symbolizes growth and new beginnings, while the diamonds represent purity and strength. Expert craftsmanship ensures lasting beauty and durability. A versatile piece that complements both traditional and contemporary attire.",
  "tags": [
    "Earrings",
    "Studs",
    "Emerald",
    "Diamond",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Nakshi Work",
    "Pancha Ratna",
    "Panche Ratnalu",
    "Vajralu",
    "Telugu Jewelry",
    "Festive Jewelry",
    "Gift",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_f530aed6-eb50-46e5-b809-92a3d5ce69e9_0406",
  "collection": "diamond"
}