{
  "id": "necklaces-909",
  "title": "Manohari Gundla Haram - Pearl & Coral Delight",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Premium Quality Cultured Pearls (cream color)",
    "Natural Coral (red hue)",
    "Cubic Zirconia (CZ) Diamonds. Hyderabadi Polish for a lasting luster and rich",
    "warm tone."
  ],
  "features": "This exquisite Haram showcases a unique fusion of traditional and contemporary design. It features a series of geometrically shaped pendants, each centered with a vibrant coral stone and encircled by shimmering CZ diamonds. Delicate pearl drops dangle gracefully from each pendant, adding a touch of elegance and movement. The necklace is strung with a graduated series of pearl and diamond accents, culminating in a comfortable and secure fit. The setting is crafted with meticulous attention to detail, ensuring that each gemstone is perfectly showcased.",
  "colors": [
    "Golden (22K Gold)",
    "Cream (Pearls)",
    "Red (Coral)",
    "White (CZ Diamonds)"
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Muhurtham)",
    "engagements",
    "festive celebrations",
    "and formal gatherings. Its understated elegance also makes it suitable for adding a touch of sophistication to contemporary attire."
  ],
  "description": "This Manohari Gundla Haram is a testament to timeless beauty and superior craftsmanship. The combination of gold, pearls, coral, and CZ diamonds creates a captivating visual harmony. It is a statement piece that will be treasured for generations, carrying with it the cultural significance of traditional South Indian jewelry. The Hyderabadi Polish guarantees a long-lasting shine and durability.",
  "tags": [
    "Haram",
    "Necklace",
    "Gundla Haram",
    "Pearl Necklace",
    "Coral Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Ethnic Jewelry",
    "Manikyam",
    "Muthyalu",
    "Bangaram",
    "Gold Jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0303_2370",
  "collection": "necklace"
}