{
  "id": "necklaces-205",
  "title": "Manohari Kanthi Haaram - Exquisite Diamond and Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "brilliant-cut Cubic Zirconia (CZ) stones",
    "Ruby (Manikyam - మాణిక్యం)",
    "Emerald (Panna - పచ్చ)",
    "Hyderabadi Polish for a lustrous finish."
  ],
  "features": "Delicate filigree work surrounding each CZ stone creates a floral effect. The pendant features a central square-cut ruby surrounded by CZ and flanked by emerald teardrops. Traditional peacock (Mayura - మయూర) motifs are subtly incorporated in the pendant design. Dangling gold beads add a touch of traditional charm. The necklace portion is a beautifully linked chain with floral CZ accents.",
  "colors": [
    "Gold",
    "shimmering white (CZ)",
    "vibrant red (ruby)",
    "and lush green (emerald). The combination symbolizes prosperity and good fortune in South Indian culture."
  ],
  "occasions": [
    "Perfect for weddings (vivaha - వివాహ)",
    "engagements (nischitartham - నిశ్చితార్థం)",
    "festive occasions like Diwali and Sankranti",
    "or as a statement piece for a special evening. A modern interpretation of a classic",
    "suitable for the contemporary bride or the fashion-forward woman."
  ],
  "description": "This Haaram blends traditional Telugu jewelry elements with modern design sensibilities. The high-quality CZ stones provide a dazzling sparkle, while the genuine ruby and emerald add a touch of luxury. The Hyderabadi polish ensures long-lasting shine and durability. A timeless piece that can be passed down as an heirloom.",
  "tags": [
    "Haaram",
    "Necklace",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Diamond Necklace",
    "CZ Necklace",
    "Ruby",
    "Emerald",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Indian Bridal Jewelry",
    "Kanthi",
    "కంఠి హారం",
    "Temple Jewelry",
    "Mayura",
    "మాణిక్యం",
    "పచ్చ",
    "Manikyam",
    "Panna"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0281_0479",
  "collection": "diamond"
}