{
  "id": "earrings-214",
  "title": "Diamond Bangle Set - Elegant Gold Kadas",
  "category": "earrings",
  "original_type": "Bangles",
  "materials": [
    "22K Yellow Gold",
    "ethically sourced natural diamonds. High-quality Hyderabadi polish for lasting luster. Diamonds are brilliant-cut",
    "clarity SI1-SI2",
    "color G-H."
  ],
  "features": "These exquisitely designed bangles feature a minimalist yet sophisticated design. Each bangle is meticulously studded with sparkling diamonds in a pave setting. The linear arrangement of the diamonds accentuates the slender design, offering a contemporary take on traditional gold kadas (bracelets). The geometric arrangement of diamonds ensures that the light catches from every angle. The design is perfect for everyday wear or to elevate formal attire. The gold is finely crafted with smooth edges for comfortable wear.",
  "colors": [
    "Primary color is the warm yellow of 22K gold",
    "complemented by the brilliance of colorless to near-colorless diamonds."
  ],
  "occasions": [
    "Ideal for daily wear",
    "office settings",
    "casual gatherings",
    "or as a subtle yet elegant addition to festive attire. Also perfect for gifting during weddings",
    "anniversaries",
    "or other special occasions."
  ],
  "description": "Timeless elegance meets contemporary design in this stunning diamond bangle set. Expert craftsmanship ensures durability and longevity, while the diamonds add a touch of sophistication and luxury. A perfect blend of traditional charm and modern aesthetics, this set makes a versatile addition to any jewelry collection. The 'Hyderabadi polish' ensures a radiant and long-lasting shine, setting these bangles apart.",
  "tags": [
    "Bangles",
    "Gajulu",
    "Diamond Bangles",
    "Gold Bangles",
    "Kadas",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Diamond Jewelry",
    "Ethnic Jewelry",
    "Fine Jewelry",
    "Bracelets",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0025_0697",
  "collection": "diamond"
}