{
  "id": "necklaces-094",
  "title": "Rajputana Ruby Haar Set with Polki Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Natural Ruby Beads (మాణిక్యములు)",
    "Cultured Pearls",
    "Polki Diamonds (వజ్రాలు). Features Hyderabadi Kundan setting."
  ],
  "features": "This exquisite haar features multiple strands of meticulously strung ruby beads, interspersed with lustrous cultured pearls. The centerpiece is a stunning pendant adorned with uncut Polki diamonds set in a traditional Kundan setting. The pendant's design showcases floral motifs, reflecting a blend of Mughal and Rajputana influences. The ruby pendant is set within a halo of Polki diamonds, amplifying its captivating allure.",
  "colors": [
    "Rich ruby red",
    "sparkling white Polki diamonds",
    "creamy white pearls",
    "and warm golden yellow of the 22K gold."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "receptions",
    "grand celebrations",
    "or cultural events. A statement piece ideal for brides (వధువు) or to elevate any formal attire. Suitable for Muhurtham",
    "Sangeeth",
    "and other traditional ceremonies."
  ],
  "description": "A timeless piece showcasing the rich heritage of Indian craftsmanship. The combination of ruby beads and Polki diamonds creates a dazzling and regal look. The Hyderabadi Kundan setting adds a touch of royalty and authenticity. This haar is not just jewelry; it's an investment in a piece of art with enduring value and cultural significance. The multi-layered design offers a bold and opulent statement.",
  "tags": [
    "Haar",
    "Necklace",
    "Ruby",
    "Polki Diamond",
    "Kundan",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "పెళ్ళి నగల",
    "Maanikyam",
    "Vajraalu",
    "traditional jewelry",
    "Indian jewelry",
    "Hyderabadi Jewelry",
    "layered necklace",
    "multi-strand necklace",
    "pearls"
  ],
  "original_id": "diamond_jewellery_DPHR8-1241_0323",
  "collection": "diamond"
}