{
  "id": "necklaces-276",
  "title": "Lavanya Kanthaabharanam: Delicate Gold and Gemstone Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "embellished with high-quality Rubies",
    "Emeralds",
    "and Cubic Zirconia. The gold has a subtle antique finish that highlights the intricate detailing."
  ],
  "features": "This Kanthabharanam features a contemporary design with traditional South Indian influences. The necklace showcases a delicate floral chain design, adorned with ruby accents. The pendant is the focal point, featuring two peacocks (Mayura) intricately detailed and set with Emeralds. Sparkling Cubic Zirconia adds a touch of modern elegance. Features a dangler with gold balls to add a playful element.",
  "colors": [
    "Predominantly Gold with vibrant Ruby red",
    "Emerald green",
    "and shimmering white of the Cubic Zirconia. The antique gold finish adds depth and warmth to the overall color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagement ceremonies",
    "festive occasions like Sankranti",
    "or even a modern cocktail party where you want to add a touch of traditional elegance. Suitable for both Muhurtham and Receptions."
  ],
  "description": "This Kanthabharanam is a fusion of traditional South Indian artistry and contemporary design sensibilities. The high-quality materials and meticulous craftsmanship ensure a piece that is both beautiful and durable. The use of traditional motifs like peacocks (Mayura) and floral patterns adds cultural significance. This necklace is a heirloom-worthy piece that will be cherished for generations. The Hyderabadi polish gives it a rich luster and lasting shine.",
  "tags": [
    "Necklace",
    "Kanthabharanam",
    "కంఠాభరణం",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Ruby",
    "Emerald",
    "Cubic Zirconia",
    "Mayura",
    "Peacock",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0358_0555",
  "collection": "diamond"
}