{
  "id": "necklaces-075",
  "title": "Chandrika Pearl Choker with Ruby Accents - A Timeless Bandi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Freshwater Pearls",
    "Faceted Rubies. Features the signature Hyderabadi Polish for enduring luster."
  ],
  "features": "A multi-strand pearl choker featuring a central floral motif intricately studded with Polki diamonds, framed by delicate rubies. Side accents showcase stylized ruby flower designs. Ruby droplets suspended below the pendant add a touch of elegance. The choker is designed for a comfortable and secure fit, highlighting the neckline beautifully.",
  "colors": [
    "Predominantly white (pearls) with vibrant ruby red accents and a warm gold tone. The interplay of colors creates a rich and regal look."
  ],
  "occasions": [
    "Ideal for weddings (especially Muhurtham and Sangeet)",
    "festive celebrations like Diwali and Sankranthi",
    "or formal gatherings. Equally suited for a modern cocktail party",
    "adding a touch of South Indian heritage to your ensemble."
  ],
  "description": "This exquisite choker blends traditional South Indian aesthetics with a contemporary design, making it a versatile piece for any jewelry collection. The use of high-quality pearls, vibrant rubies, and Polki diamonds ensures enduring value and brilliance. The Hyderabadi polish provides a lustrous finish that will last for generations. Symbolizes purity, love, and prosperity.",
  "tags": [
    "Choker",
    "Pearl Necklace",
    "Ruby Jewelry",
    "Bandi Haaram",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Polki Diamonds",
    "22K Gold",
    "Muhurtham Jewelry",
    "Seemantham",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Ethnic Jewelry",
    "Telugu Jewelry",
    "Andhra Jewelry",
    "Mutyala Haramu",
    "Ruby Haram",
    "Polki Haram"
  ],
  "original_id": "diamond_jewellery_DPCK8-1642_0234",
  "collection": "diamond"
}