{
  "id": "necklaces-923",
  "title": "Lakshmi Kasula Haaram: Divine Grandeur in Every Glimmer",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "brilliant cut CZ diamonds",
    "Emerald",
    "and Ruby accents. Features our signature Hyderabadi polish for a lasting",
    "radiant shine."
  ],
  "features": "This exquisite Haaram showcases a central Lakshmi pendant, meticulously crafted in the traditional temple jewellery style. Flanked by intricately designed peacocks with ruby accents, the pendant is adorned with high-quality CZ diamonds set in a delicate pavé style. The necklace chain consists of two strands of diamond-studded gold settings, with an Emerald topping the pendant. A row of yellow gemstones dangle as accents.",
  "colors": [
    "Yellow Gold",
    "Emerald Green",
    "Ruby Red",
    "and Sparkling White (CZ Diamonds). A classic South Indian color palette signifying prosperity and good fortune."
  ],
  "occasions": [
    "Ideal for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "festivals like Diwali and Ugadi (ఉగాది)",
    "and other special occasions. A perfect heirloom piece for future generations. Can also be styled for elegant evening events."
  ],
  "description": "This Haaram is a testament to superior craftsmanship and traditional South Indian design. The Lakshmi motif represents prosperity and abundance, making it an auspicious piece for any occasion. The high-quality gemstones and durable 22K gold ensure lasting beauty and value. The blend of traditional design and modern setting techniques makes it a versatile and timeless piece.",
  "tags": [
    "Haaram",
    "Kasula Haaram",
    "Lakshmi Pendant",
    "Temple Jewellery",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "22K Gold",
    "CZ Diamonds",
    "Emerald",
    "Ruby",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "Festival Jewelry",
    "కంఠహారం",
    "కాసుల పేరు",
    "లక్ష్మి పేరు"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0317_2384",
  "collection": "necklace"
}