{
  "id": "earrings-631",
  "title": "Emerald Radiance Jhumka - \"Paccha Rallu Gummalu\"",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated Alloy",
    "High-Quality Cubic Zirconia (CZ) stones",
    "Emerald Green Hydrothermal Quartz",
    "Freshwater Pearl. Hyderabadi Polish for a lasting shine."
  ],
  "features": "A stunning fusion of traditional Jhumka design with contemporary elegance. Features a central pear-shaped Emerald Green Hydrothermal Quartz, surrounded by sparkling CZ stones. The Jhumka (Gummalu) design showcases intricate latticework with delicate CZ stone settings, culminating in a single lustrous freshwater pearl drop. The piece embodies a delicate balance of traditional and modern elements.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (CZ)",
    "Creamy White (Pearl)"
  ],
  "occasions": [
    "Perfect for weddings (vadhuvu)",
    "festivals (pandugalu)",
    "engagement ceremonies",
    "Seemantham (baby shower)",
    "and half-saree functions (half saree function). Also suitable for adding a touch of traditional glamour to modern celebrations and special occasions."
  ],
  "description": "Timeless design blends traditional South Indian Gummalu with contemporary style. High-quality CZ stones provide exceptional brilliance at an accessible price point. The classic Emerald Green and Pearl color combination complements various skin tones and outfits. Crafted with precision and finished with Hyderabadi Polish for enhanced durability and shine. A statement piece that reflects your refined taste and appreciation for heritage.",
  "tags": [
    "Jhumka",
    "Gummalu",
    "Earrings",
    "South Indian Jewelry",
    "Emerald",
    "CZ",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Ethnic Jewelry",
    "Fashion Jewelry",
    "Paccha Rallu",
    "Pearls"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 15_2208",
  "collection": "sjpl"
}