{
  "id": "necklaces-936",
  "title": "Divya Ratna Kasula Haaram - Emerald & Diamond Embellished Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Emeralds (Pear and Oval Cut",
    "Good Clarity)",
    "Cubic Zirconia (CZ) Diamonds (Brilliant Cut",
    "VVS Clarity). Features a delicate Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite Kasula Haaram showcases a traditional South Indian design with a modern twist. The coin (Kasulu) design is re-imagined using CZ Diamonds with embedded rubies, adding a touch of contemporary elegance. The central pendant features a detailed floral motif adorned with CZ diamonds and a captivating pear-cut Emerald. The smaller pendant features an oval-cut Emerald. Delicate gold bead (Gundu) hangings complete the look.",
  "colors": [
    "Predominantly gold with brilliant white from the CZ diamonds",
    "accentuated by the vibrant green of the Emeralds and subtle touches of Ruby Red."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagements",
    "receptions",
    "and other grand celebrations. Also suitable for Seemantham (Baby Shower) and half-saree functions. A stunning statement piece for modern formal events."
  ],
  "description": "A blend of traditional South Indian Kasula design and contemporary diamond elegance, this Haaram is a testament to exceptional craftsmanship. The use of high-quality Emeralds and CZ diamonds ensures brilliance and enduring value. The Hyderabadi Polish adds a touch of regal sophistication. A timeless heirloom piece that symbolizes prosperity and good fortune.",
  "tags": [
    "Kasula Haaram",
    "Necklace",
    "Gold Necklace",
    "Emerald Necklace",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Muhurtham Jewelry",
    "Engagement Jewelry",
    "22K Gold",
    "Gundla Haram",
    "CZ Diamonds"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0330_2397",
  "collection": "necklace"
}