{
  "id": "necklaces-1423",
  "title": "Enchanting Kusuma Haaram with Lavender and Rose Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold with brilliant-cut Diamonds",
    "Lavender Chalcedony",
    "and Rose Quartz. Features Hyderabadi Polish for enduring luster."
  ],
  "features": "Inspired by the traditional Gutta Pusalu (pearl cluster) Haaram, this piece showcases a contemporary interpretation. Floral motifs encrusted with diamonds surround the captivating Lavender Chalcedony and Rose Quartz stones. Delicate diamond-studded paisley (manga malai) patterns add a touch of traditional Telugu artistry. Features a modern chain design",
  "colors": [
    "Rose gold provides a warm backdrop",
    "complemented by the pastel hues of Lavender Chalcedony and Rose Quartz. Dazzling white diamonds enhance the color palette with their brilliance."
  ],
  "occasions": [
    "Ideal for special occasions like weddings (Vadhuvu Alankarana)",
    "receptions",
    "engagements",
    "or a sophisticated gala. The necklace's unique blend of traditional and modern design makes it suitable for both sarees and contemporary evening wear."
  ],
  "description": "This exquisite necklace is a harmonious blend of tradition and modernity. The use of high-quality gemstones and expert craftsmanship ensures both durability and lasting beauty. A statement piece that embodies elegance and sophistication. It is designed and crafted right here in Hyderabad and uses only the finest materials.",
  "tags": [
    "Necklace",
    "Haaram",
    "Diamond",
    "Rose Gold",
    "Lavender Chalcedony",
    "Rose Quartz",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Gutta Pusalu",
    "Manga Malai",
    "Kusuma Haaram",
    "Vadhuvu Alankarana"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-28 3_2041",
  "collection": "sjpl"
}