{
  "id": "earrings-657",
  "title": "Radiant Diamond Vanki Earrings - A Modern Twist on Tradition",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in 18 Karat Gold with Hyderabadi Polish",
    "adorned with meticulously selected",
    "brilliant-cut Diamonds. Estimated total diamond weight of 2.22 carats (approximate: D PAN(-7):-1.60(54) & D MQ(-7):-0.62(22)."
  ],
  "features": "These earrings showcase a modern interpretation of the classic Vanki armlet design. The earrings feature a central circular motif with concentric diamond settings, framed by intricately arranged pear-shaped diamonds resembling floral petals. The openwork design allows for maximum light reflection, enhancing the sparkle of the diamonds. Finished with a secure and comfortable post-back closure.",
  "colors": [
    "Two-tone design: Warm rose gold (18K) complements the dazzling brilliance of the colorless diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "cocktail parties",
    "or any special occasion where you desire a touch of modern elegance and South Indian flair. These earrings will add a touch of glamour to your attire for a Seemantham",
    "Sangeeth or engagement party."
  ],
  "description": "A unique blend of traditional South Indian design with modern aesthetics. High-quality diamonds ensure exceptional brilliance and lasting value. The lightweight design (Grwt:-13.500(GH)) provides comfortable wear. Handcrafted by skilled artisans, reflecting the rich heritage of Hyderabad's jewelry tradition. These earrings offer a timeless piece for your heirloom collection.",
  "tags": [
    "Diamond Earrings",
    "Chandbali",
    "Vanki",
    "South Indian Jewelry",
    "18K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Cocktail Earrings",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "Heirlooms",
    "Diamonds",
    "Rose Gold",
    "Jadau"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-38_2245",
  "collection": "sjpl"
}