{
  "id": "necklaces-824",
  "title": "Vaishnavi Emerald and Diamond Grand Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Platinum base intricately studded with brilliant-cut diamonds (approx. 1.66ct Dwt of 368 diamonds) and 15.01ct of rich",
    "deep green emeralds. Features meticulously crafted settings ensuring durability. Platinum weight 85.400 Grwt."
  ],
  "features": "This captivating Haaram features a graduating design, starting with smaller diamond and emerald motifs that increase in size towards the center. Features rectangular emeralds bordered with dazzling diamonds, interspaced with diamond floral designs, creating a cascading waterfall effect. Contemporary design elements are infused with traditional South Indian inspiration for a timeless appeal.",
  "colors": [
    "The color palette is dominated by the icy brilliance of diamonds and the lush green of the emeralds. The platinum base offers a cool",
    "modern contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "grand celebrations",
    "or any occasion where you want to make a statement. Ideal for Muhurtham",
    "Seemantham",
    "or formal events."
  ],
  "description": "This Vaishnavi Emerald and Diamond Haaram is a stunning blend of traditional grandeur and modern elegance. The use of platinum, a durable and precious metal, ensures lasting beauty. Emeralds are the stone of prosperity and good fortune. Owning this piece speaks to your refined taste and appreciation for exquisite craftsmanship.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "Platinum Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Indian Jewelry",
    "Temple Jewelry",
    "Muhurtham Jewelry",
    "Emerald",
    "Diamond",
    "Platinum",
    "Nakshi",
    "Grand Necklace",
    "Statement Jewelry",
    "occasion"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-50 2_1418",
  "collection": "diamond"
}