{
  "id": "necklaces-1257",
  "title": "Floral Symphony Necklace - A Modern Twist on the Traditional Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in a mix of 18K Rose Gold and White Gold",
    "adorned with shimmering Zircon stones and vibrant Pink Tourmaline. Features an intricate Hyderabadi Polish for enduring shine and luster."
  ],
  "features": "This exquisite necklace showcases a captivating floral design, blending modern aesthetics with traditional Haaram elements. The piece features meticulously set Zircon stones to resemble delicate flower petals, complemented by uniquely cut Pink Tourmaline gemstones. The drop pendant adds a touch of elegance. Each detail showcases exceptional craftsmanship.",
  "colors": [
    "The necklace features a beautiful blend of rose gold",
    "white gold",
    "sparkling white Zircons",
    "and vibrant pink Tourmalines",
    "creating a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for both traditional Telugu ceremonies like weddings",
    "Seemantham",
    "and half-saree functions",
    "as well as modern events and celebrations. A statement piece that elevates any ensemble."
  ],
  "description": "This necklace is a true masterpiece, combining traditional design sensibilities with contemporary styling. The high-quality materials and meticulous craftsmanship ensure both beauty and durability. Its unique floral design and vibrant color palette make it a standout piece, guaranteed to be cherished for generations.",
  "tags": [
    "Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Zircon",
    "Tourmaline",
    "Rose Gold",
    "White Gold",
    "Floral Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Seemantham",
    "Half Saree Ceremony",
    "Bridal Jewelry",
    "Contemporary Jewelry",
    "Party Wear",
    "Gift for Her"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-13-02-30 3_1853",
  "collection": "sjpl"
}