{
  "id": "necklaces-1189",
  "title": "The Padmavati Haaram: A Timeless Legacy of Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark). Embellished with exquisite Rubies",
    "Emeralds and Pink Manak (Spinel). Meticulously set with High-quality",
    "Brilliant-cut diamonds. Finished with a lustrous Hyderabadi polish for enduring shine."
  ],
  "features": "A masterpiece of traditional South Indian craftsmanship. The haaram features a layered, cascading design, reminiscent of floral motifs (Pula Jada). The centerpiece showcases a grand pendant with intricate filigree work and delicate danglers of Pink Spinel (Manak). Each diamond is carefully placed for maximum brilliance. Features a grand locket pendant.",
  "colors": [
    "Predominantly gold",
    "enhanced by the vibrant red of the rubies",
    "the lush green of the emeralds",
    "and soft pink of the spinels. This classic color palette embodies traditional Telugu weddings and auspicious occasions."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Muhurtham)",
    "Seemantham",
    "and formal gatherings. Also suitable for a bride looking for a traditional yet radiant addition to her trousseau. Its timeless design makes it a cherished heirloom for generations."
  ],
  "description": "This Padmavati Haaram is more than just jewelry; it's a statement of cultural heritage. The exceptional craftsmanship, combined with the use of high-quality gemstones, ensures its enduring beauty and value. Each piece is carefully crafted for durability and comfort, making it a pleasure to wear. It represents the epitome of South Indian bridal jewelry.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Diamond Necklace",
    "Ruby Necklace",
    "Emerald Necklace",
    "22K Gold",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Manak",
    "Spinel",
    "Pula Jada",
    "Heirloom Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-10 3_1741",
  "collection": "sjpl"
}