{
  "id": "necklaces-766",
  "title": "Exquisite Navaratan Kundan Haaram - A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold (916 Gold) with intricate Kundan settings. Features high-quality uncut Diamonds (Polki)",
    "emeralds",
    "tanzanite and pink sapphires. Finished with a classic Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "This majestic Haaram showcases traditional South Indian craftsmanship with a contemporary twist. The intricate Kundan setting highlights the brilliance of the Polki diamonds. Floral motifs are adorned with vibrant emeralds and pink sapphires, with tanzanite drops enhancing the design, creating a mesmerizing cascade effect. The central pendant continues the floral theme with a larger emerald centerpiece.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emeralds)",
    "Pink (Sapphires) and Blue (Tanzanite) - a harmonious blend of traditional South Indian colors representing prosperity and joy."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaaham)",
    "receptions",
    "Seemantham ceremonies",
    "and milestone anniversaries. A statement piece that elevates any festive ensemble."
  ],
  "description": "A true heirloom piece, this Navaratan Kundan Haaram embodies the rich cultural heritage of South India. The exceptional craftsmanship, combined with the use of precious gemstones, ensures enduring value and timeless elegance. This necklace is not just jewelry; it's a celebration of tradition and a symbol of everlasting love.",
  "tags": [
    "Kundan Necklace",
    "Haaram",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Polki Diamonds",
    "Emeralds",
    "Sapphires",
    "Tanzanite",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Vivaaham",
    "Seemantham",
    "కంఠాభరణము",
    "పెళ్లి నెక్లెస్",
    "పచ్చలు",
    "కెంపులు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-06 3_1272",
  "collection": "diamond"
}