{
  "id": "necklaces-820",
  "title": "Emerald Bloom Grand Haaram - A Timeless Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold. Features dazzling",
    "high-clarity diamonds and vibrant",
    "square-cut Emeralds. Accented with Hyderabadi Polish for a lasting shine. Total Gold Weight: 80.080 grams; Total Diamond Weight: 3.11 carats; Total Emerald Weight: 18.87 carats."
  ],
  "features": "This exquisite haaram features a floral motif, with each 'flower' intricately crafted from diamonds surrounding a central, meticulously-cut emerald. The setting provides exceptional sparkle and showcases the emerald's lush green hue. The design seamlessly blends traditional Telugu jewelry aesthetics with a contemporary setting, creating a timeless piece.",
  "colors": [
    "White (diamonds)",
    "Emerald Green (emeralds)",
    "and subtle hints of Yellow Gold beneath the white gold polish."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (పెళ్లి)",
    "receptions",
    "milestone anniversaries",
    "and significant celebrations. Adds a touch of regal elegance to modern and traditional attire alike. Suitable for Muhurtham",
    "Seemantham",
    "or any grand celebration."
  ],
  "description": "This Emerald Bloom Haaram is a testament to superior craftsmanship and exquisite design. The carefully selected emeralds, combined with the brilliance of the diamonds, create a stunning visual impact. The blend of tradition and modernity makes it a versatile investment piece, suitable for both traditional and contemporary wardrobes. A true heirloom piece that will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "White Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Polish",
    "కంఠాభరణం",
    "Pellichoopulu",
    "Muhurtham",
    "Seemantham",
    "Grand Necklace",
    "Contemporary Haaram"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-48 2_1414",
  "collection": "diamond"
}