{
  "id": "necklaces-120",
  "title": "Heera Jadau Haaram - An Heirloom of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Swarna) with intricate Jadau setting. Featuring high-quality Polki diamonds (Heera) with excellent luster and clarity. Finished with a classic Hyderabadi polish for enduring shine."
  ],
  "features": "This exquisite haaram showcases the timeless Jadau technique, a hallmark of Mughal-inspired Indian jewelry. The Polki diamonds are expertly set without wax, allowing their natural beauty to shine. The design incorporates traditional floral motifs (Puvvu) and paisley shapes, creating a visually stunning necklace. The large pendant boasts a statement Polki, adding a regal touch.",
  "colors": [
    "Predominantly gold with the natural white brilliance of the Polki diamonds. The antique gold finish enhances the vintage aesthetic."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "and other grand celebrations. Ideal for brides (Vadhuvu) seeking a statement piece or anyone desiring a touch of timeless elegance."
  ],
  "description": "A true heirloom piece crafted with exceptional skill and attention to detail. The use of high-quality Polki diamonds and 22K gold ensures lasting beauty and value. Represents a blend of rich cultural heritage and timeless design. Possesses a regal and sophisticated aesthetic, making it a statement piece for any special occasion. The Hyderabadi polish protects the gold and gives it a lasting shine.",
  "tags": [
    "Haaram",
    "Jadau",
    "Polki",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Heera",
    "Swarna",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Antique Finish",
    "Ethnic Jewelry",
    "Vivaha",
    "Nischitartham",
    "Vadhuvu",
    "Puvvu"
  ],
  "original_id": "diamond_jewellery_DPNK8-1573_0353",
  "collection": "diamond"
}