{
  "id": "earrings-313",
  "title": "Emerald & Pearl Divine Jhumka - Devatha Bell Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated",
    "Hand-selected Green Emerald",
    "Cubic Zirconia (CZ) stones",
    "High-Quality Pearls. Hyderabadi Gold Finish."
  ],
  "features": "Classic South Indian Jhumka design featuring a cascading bell shape. The earrings showcase a delicate flower design at the top, followed by a dome structure. The lower part features multiple pearl drops, adding a beautiful sway with movement. The intricate patterns on the gold surfaces are further enhanced with CZ stones, reflecting light beautifully. The earrings are crafted with meticulous attention to detail, resulting in a rich and traditional look. Fine filigree work and bead detailing enhance the overall aesthetic.",
  "colors": [
    "Gold (warm yellow tone)",
    "Emerald Green",
    "White (CZ stones)",
    "Creamy White Pearls"
  ],
  "occasions": [
    "Perfect for weddings (Pelli)",
    "engagements (Nischitartham)",
    "festivals like Diwali",
    "Sankranthi",
    "and Ugadi. Ideal for traditional ceremonies such as Seemantham",
    "and half-saree functions (Voni Function). Also suitable for grand parties and cultural events."
  ],
  "description": "Timeless design that blends heritage with modern elegance. The use of high-quality materials ensures durability and lasting beauty. The emerald adds a touch of regal charm, while the pearls provide a soft and feminine appeal. Lightweight for comfortable wear. Exquisite craftsmanship passed down through generations, making it a valuable addition to any jewelry collection. The Hyderabadi polish gives the piece a unique shine and luster.",
  "tags": [
    "Jhumka",
    "Karnika",
    "Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emerald",
    "Pearl",
    "Gold Plated",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Bridal Jewelry",
    "Traditional",
    "Ethnic",
    "Festive",
    "Devatha",
    "Pelli",
    "Nischitartham",
    "Seemantham",
    "Voni Function"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-35 24_1343",
  "collection": "diamond"
}