{
  "id": "necklaces-1253",
  "title": "Lakshmi Haar: Coral and Emerald Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Coral Beads (36.46 carats)",
    "Emerald Carving (13.31 carats)",
    "Emerald Beads (17.94 carats)",
    "South Sea Pearls (28.75 carats)",
    "High-quality Diamonds",
    "Hyderabadi Polish"
  ],
  "features": "This exquisitely crafted Haaram features a striking hexagonal pendant adorned with vibrant coral segments and sparkling diamonds, showcasing a contemporary take on traditional South Indian design. The pendant is anchored by a beautifully carved emerald drop, adding a touch of regal elegance. The layered necklace is strung with lustrous South Sea pearls, emerald beads, and coral elements, all meticulously arranged for optimal visual impact. Features a unique blend of traditional and modern aesthetics.",
  "colors": [
    "Dominant hues of rich coral red",
    "complemented by the vibrant green of the emeralds",
    "the pristine white of the pearls",
    "and the warm yellow of the gold. The diamonds provide a brilliant sparkle",
    "creating a captivating contrast."
  ],
  "occasions": [
    "Perfect for grand celebrations such as weddings (Vivah)",
    "engagements",
    "special anniversaries",
    "and important religious ceremonies. Also suitable for upscale cultural events where a statement piece is desired."
  ],
  "description": "This Haaram is a testament to exquisite craftsmanship, blending traditional South Indian design with modern sensibilities. The use of high-quality natural gemstones, including vibrant coral and emeralds, ensures lasting beauty and value. Its bold design and luxurious materials make it a true heirloom piece to be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Coral",
    "Emerald",
    "South Sea Pearls",
    "Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Temple Jewellery",
    "Hyderabadi Jewelry",
    "Vivah",
    "Wedding Jewelry",
    "Statement Necklace",
    "Traditional Jewellery",
    "Antique Finish",
    "Luxury Jewelry",
    "Muhurtham",
    "Seemantham",
    "Mangalsutra",
    "vaddanam"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-13-02-28 2_1849",
  "collection": "sjpl"
}