{
  "id": "necklaces-780",
  "title": "Diamond and Emerald Vaddanam with Pearl Drops - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Waist Belt/Chain",
  "materials": [
    "Crafted in 18K Yellow Gold. Adorned with brilliant-cut Diamonds",
    "totaling 17.90 carats. Features 18 Emeralds (totaling 15.82 carats) with vibrant green hues and two Rubies totalling 4.70 Carats. Complemented by 15 lustrous South Sea Pearls (totaling 55.75 carats). Hyderabadi Polish enhances the gold's luster."
  ],
  "features": "This exquisite Vaddanam showcases a mesmerizing design. The upper band features a delicate pattern of diamond-studded floral motifs. Square-cut Emeralds are interspersed throughout the piece, adding a touch of regal elegance. The lower edge is embellished with pearl drops hanging from intricate diamond and gold caps, creating a gentle swaying motion. The central Emerald provides a focal point with diamond accents surrounding it.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with vibrant green Emerald accents and the soft",
    "creamy white of the South Sea Pearls. The Rubies provide touches of vibrant reds."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "Seemantham (Baby Shower)",
    "Bharatanatyam performances",
    "Half-Saree Functions (Langa Voni Function)",
    "or any grand celebration where you want to make a statement."
  ],
  "description": "This Vaddanam is more than just jewelry; it's an heirloom. The combination of high-quality diamonds, emeralds, rubies, and South Sea pearls, along with meticulous craftsmanship and traditional South Indian design, makes it a truly special piece. Owning this Vaddanam is owning a piece of heritage.",
  "tags": [
    "Vaddanam",
    "Oddaanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "18K Gold",
    "Indian Wedding",
    "Seemantham",
    "Half-Saree Function"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-03 2_1297",
  "collection": "diamond"
}