{
  "id": "earrings-239",
  "title": "Aarya Kundan Jhumka Earrings with Emerald Center",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Kundan settings",
    "Natural Emerald gemstone (Oval Cut",
    "Medium Green",
    "VVS Clarity)",
    "Polki Diamonds (Uncut Diamonds)",
    "Hyderabadi Polish."
  ],
  "features": "Exquisite Kundan setting meticulously handcrafted by skilled artisans. Features an emerald centerpiece surrounded by Polki diamonds in a floral design with delicate gold filigree work. The 'Jhumka' shape adds a touch of traditional charm, perfect for blending heritage with modern sensibilities. Intricate leafy vines crafted in gold emanate from the center stone, lending a touch of nature to the design.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Polki Diamonds). The combination of gold and emerald is a classic South Indian pairing."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "Seemantham (శీమంతం)",
    "and other special occasions. These earrings can elevate both traditional silk sarees and contemporary outfits."
  ],
  "description": "These earrings are a testament to the timeless beauty of Kundan craftsmanship. The natural emerald centerpiece adds a touch of regal elegance. Crafted with high-quality materials and expert artistry, these earrings are a valuable addition to any jewelry collection. They embody both cultural significance and aesthetic appeal, making them a perfect heirloom piece. Each earring is a statement of Hyderabadi craftsmanship.",
  "tags": [
    "Kundan Earrings",
    "Jhumka",
    "చెవి దుద్దులు",
    "Emerald",
    "Polki Diamonds",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabad Jewelry",
    "Traditional Earrings",
    "Gold Earrings",
    "22K Gold",
    "Ethnic Jewelry",
    "Aarya"
  ],
  "original_id": "diamond_jewellery_IMG-20241219-WA0024_0804",
  "collection": "diamond"
}