{
  "id": "necklaces-113",
  "title": "Rajputana Polki Pearl Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Swarna)",
    "Natural Freshwater Pearls",
    "Uncut Polki Diamonds (Vaajraalu)",
    "High-Quality Rubies (Ratnalu). Features traditional Hyderabadi Polish for a rich",
    "antique sheen."
  ],
  "features": "This exquisite Haaram features four strands of meticulously strung freshwater pearls, punctuated with delicate ruby accents. The intricate pendant showcases a sunburst design crafted with uncut Polki diamonds set in a closed setting. A teardrop ruby surrounded with a diamond is featured directly below the pendant. The Jhumka-style drop at the bottom features meticulously arranged polki diamonds and culminates in ruby drops, adding a touch of regal elegance. The goldwork displays fine detailing and traditional South Indian craftsmanship.",
  "colors": [
    "Predominantly white (pearls)",
    "gold (metal)",
    "and red (rubies)",
    "creating a classic and auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "bridal showers (Seemantham)",
    "and other grand celebrations. Also suitable for formal events where you want to make a statement with timeless elegance."
  ],
  "description": "This Haaram is a testament to South Indian heritage and artistry. The combination of Polki diamonds, natural pearls, and vibrant rubies makes it a valuable investment and a cherished heirloom. The Hyderabadi Polish enhances the antique charm, making it a truly unique and unforgettable piece. The intricate design and superior craftsmanship ensure durability and lasting beauty.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki",
    "Diamonds",
    "Pearls",
    "Rubies",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Indian Jewelry",
    "Vaajraalu",
    "Ratnalu",
    "Swarna",
    "Nischitartham",
    "Vivaha",
    "Seemantham",
    "Jhumka",
    "Bridal"
  ],
  "original_id": "diamond_jewellery_DPNK8-1463_0346",
  "collection": "diamond"
}