{
  "id": "earrings-527",
  "title": "Kamalam Jhumka - A Regal Fusion of Tradition and Modernity",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Ruby",
    "Emerald",
    "Natural Pearls",
    "Coral. Features a lustrous Hyderabadi Polish."
  ],
  "features": "This exquisite Jhumka showcases a stunning lotus (Kamalam) motif at the top, meticulously handcrafted with ruby petals and a central Polki diamond. The Jhumka bells feature alternating coral and pearl strands, meticulously arranged. The Polki diamonds are set in a closed setting, enhancing their natural brilliance. This piece blends traditional temple jewelry design with modern sensibilities, creating a truly unique heirloom.",
  "colors": [
    "Predominantly gold",
    "with vibrant ruby red",
    "emerald green",
    "coral orange",
    "and the soft sheen of natural pearls. The Polki diamonds add a touch of clear brilliance."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "traditional festivals (Ugadi",
    "Sankranti)",
    "Seemantham (baby shower)",
    "and upscale social gatherings. A statement piece suitable for both traditional attire like sarees and lehengas",
    "as well as contemporary outfits."
  ],
  "description": "This Jhumka is a testament to exceptional craftsmanship, showcasing the artistry of Hyderabadi jewelry making. The use of Polki diamonds, known for their unique charm and historical significance, adds to its value. The combination of vibrant colors and traditional motifs makes it a timeless piece that will be cherished for generations. Its durability ensures it can be passed down as a precious family heirloom.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Karnaphool",
    "Polki Diamonds",
    "Ruby",
    "Pearls",
    "Coral",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Traditional Jewelry",
    "Antique Jewelry",
    "Ethnic Jewelry",
    "Kamalam",
    "Lotus Motif",
    "Telugu Jewelry"
  ],
  "original_id": "ear_rings_IMG-20240905-WA0050_2671",
  "collection": "ear"
}