{
  "id": "bangles-098",
  "title": "Rajasi Red Ruby Bangle - A Touch of Royalty",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "Certified Natural Ruby",
    "High-Quality CZ Diamonds. Features our signature Hyderabadi polish for a lasting luster."
  ],
  "features": "This exquisite bangle features a Vanki-inspired design with intricate floral motifs. The centerpiece is a captivating oval-cut Ruby, surrounded by sparkling CZ diamonds. The openwork design allows light to beautifully illuminate the gemstones. The setting style is a combination of prong and bezel setting, ensuring maximum security and brilliance. Features meticulously placed cut-throughs, a detail commonly found in traditional south Indian jewelry.",
  "colors": [
    "Golden Yellow (Gold)",
    "Deep Red (Ruby)",
    "Brilliant White (Diamonds)"
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "anniversaries",
    "and special occasions. A statement piece suitable for both traditional Telugu functions (like Seemantham) and modern cocktail parties."
  ],
  "description": "This bangle beautifully blends traditional South Indian design with a modern aesthetic. The use of high-quality materials, including a certified natural Ruby, ensures lasting beauty and value. The detailed craftsmanship showcases the skill of our artisans. The Vanki design is known for its elegance and regal appeal. The Hyderabadi polish enhances the gold's luster and prevents tarnishing, ensuring a timeless piece.",
  "tags": [
    "Bangle",
    "Vanki",
    "Ruby",
    "Diamond",
    "Gold",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Telugu Jewelry",
    "Cocktail Jewelry",
    "Party Wear",
    "Rajasi",
    "Kada",
    "Kangan"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0407_0026",
  "collection": "bracelets"
}