{
  "id": "necklaces-428",
  "title": "Exquisite Diamond and Emerald Kasu Mala Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approx. 148.660 grams gross weight",
    "11.80 grams diamond weight)",
    "Natural Rubies (approx. 9.60 carats)",
    "Natural Emeralds (approx. 10.65 carats)",
    "South Sea Pearls (approx. 48.45 carats)"
  ],
  "features": "This magnificent three-strand Haaram features intricately designed Kasu (coin) motifs alternating with delicate floral patterns. The necklace is set with brilliant-cut diamonds, complemented by vibrant round-cut rubies and emeralds. Dangles of lustrous South Sea pearls add a touch of elegance. The locket (approx. 1.49 grams diamond weight, 2.00 carats ruby weight, 1.35 carats emerald weight) is a grand floral motif studded with diamonds, ruby, and emerald. Features fine Hyderabadi Polish for a lasting shine.",
  "colors": [
    "Gold",
    "White (diamonds)",
    "Green (emeralds)",
    "Red (rubies)",
    "Cream (pearls)"
  ],
  "occasions": [
    "Ideal for weddings",
    "bridal wear (pellikuturu)",
    "grand celebrations",
    "muhurtham",
    "seemantham",
    "and upscale cultural events. It can also be worn to make a statement at modern galas and formal gatherings."
  ],
  "description": "A timeless heirloom piece showcasing exquisite South Indian craftsmanship. The combination of diamonds, emeralds, rubies, and South Sea pearls makes it a truly opulent and valuable possession. The traditional Kasu Mala design carries cultural significance and is believed to bring prosperity and good fortune. The high-quality materials and meticulous detailing ensure lasting beauty and durability.",
  "tags": [
    "Haaram",
    "Kasu Mala",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Ruby Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Pellikuturu",
    "Muhurtham",
    "Seemantham",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-09 3_0869",
  "collection": "diamond"
}