{
  "id": "necklaces-1478",
  "title": "Manoharam Emerald Bead and Diamond Peacock Haaram - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emerald Beads",
    "Brilliant Cut Diamonds. Crafted with Hyderabadi Polish for a lustrous finish."
  ],
  "features": "This exquisite haaram features a three-strand arrangement of meticulously strung emerald beads. The centerpiece boasts a captivating peacock (Mayura) motif, intricately designed with diamonds. Pear-shaped emerald drops add an elegant sway to the piece. The clasp is cleverly integrated within the peacock design. Filigree detailing enhances the overall sophistication.",
  "colors": [
    "Vibrant green from the emerald beads and drops",
    "complemented by the warm yellow of the gold and the dazzling brilliance of the white diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagement ceremonies",
    "milestone celebrations (Arangetram",
    "Seemantham)",
    "and grand festivals (Ugadi",
    "Dasara",
    "Diwali). A statement piece suitable for both traditional and contemporary celebrations."
  ],
  "description": "This haaram is more than just jewelry; it's an heirloom. The combination of high-quality emerald beads, dazzling diamonds, and intricate peacock design embodies South Indian artistry. The durable 22K gold ensures longevity, while the design resonates with cultural significance, making it a cherished possession for generations. The Hyderabadi polish gives the jewelry a rich luster, enhancing its regal appeal.",
  "tags": [
    "Haaram",
    "Emerald Necklace",
    "Diamond Necklace",
    "Peacock Jewelry",
    "Mayura",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Fine Jewelry",
    "Emerald Beads",
    "Vivahaalu",
    "Seemantham",
    "Arangetram",
    "Ugadi",
    "Dasara",
    "Diwali"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-41-00 3_2096",
  "collection": "sjpl"
}