{
  "id": "earrings-015",
  "title": "Emerald Grace Diamond Jhumka - A Timeless Heirloom",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "ethically sourced diamonds (VS clarity",
    "brilliant cut)",
    "pear shaped emeralds of fine green hue",
    "South Sea Pearl drop. The gold is finished with our signature Hyderabadi polish for a lasting gleam."
  ],
  "features": "These exquisite Jhumkas feature a captivating design with a teardrop emerald as an accent at the top and an intricate filigree jhumka framework. The intricate gold work showcases rows of diamonds set in a floral pattern. A single South Sea pearl dangles gracefully. The Jhumka's design reflects traditional Telugu artistry, perfect for adding a touch of South Indian grandeur to any look.",
  "colors": [
    "Gold",
    "emerald green",
    "and pearl white – a classic and regal combination."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements",
    "bridal showers",
    "half-saree ceremonies (Langa Voni Function)",
    "festive occasions like Sankranthi",
    "or any celebration where you desire a touch of traditional elegance. This pairs well with Kanjeevaram and Gadwal silk sarees."
  ],
  "description": "These Jhumkas are not just earrings, they're a legacy. Handcrafted by skilled artisans, this set blends the timeless appeal of South Indian jewelry with contemporary design sensibilities. The combination of diamonds, emeralds, and pearls creates a dazzling effect, while the Hyderabadi polish ensures lasting shine and durability. It’s a heirloom piece that will be cherished for generations to come.",
  "tags": [
    "Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Gold Jewelry",
    "Diamond Earrings",
    "Emerald",
    "Pearls",
    "Traditional Jewelry",
    "Karnaphoolu",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Ethnic Jewelry",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Festive Jewelry",
    "Langa Voni"
  ],
  "original_id": "diamond_jewellery_0a3cdc04-fc57-40af-a3ee-0cb673037af9_0075",
  "collection": "diamond"
}