{
  "id": "earrings-195",
  "title": "Lakshmi Temple Jhumkaalu with Emerald Accent",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish",
    "Cubic Zirconia (CZ)",
    "and Emerald Faceted Accent. Each earring boasts a solid gold foundation for enduring quality."
  ],
  "features": "Intricately handcrafted jhumkas featuring a central Goddess Lakshmi motif, indicative of traditional South Indian temple jewelry. The deity is placed within a diamond-studded circular frame, leading to delicate gold bead dangles. The top includes a crown-like design, accented with a faceted emerald.",
  "colors": [
    "Predominantly yellow gold",
    "complemented by the vibrant green of the emerald and the sparkling white of the Cubic Zirconia. The combination is a classic South Indian palette often seen in bridal jewelry."
  ],
  "occasions": [
    "Perfect for weddings",
    "temple visits",
    "festive occasions like Diwali and Dussehra",
    "and traditional ceremonies like Seemantham and Half-Saree Function. These are also suitable for formal cultural events where a touch of heritage is desired."
  ],
  "description": "These Lakshmi Temple Jhumkas are a timeless representation of South Indian heritage. The intricate craftsmanship, combined with the auspicious presence of Goddess Lakshmi, makes them not just a beautiful adornment but a symbol of prosperity and good fortune. The Hyderabadi polish adds a unique luster, ensuring the gold's radiance lasts for generations. The combination of traditional design and modern setting techniques ensures both durability and comfort.",
  "tags": [
    "Jhumka",
    "Temple Jewelry",
    "Lakshmi",
    "Goddess",
    "Gold Earrings",
    "South Indian Jewelry",
    "చెవి దిద్దులు",
    "జుంకా",
    "దేవాలయ ఆభరణాలు",
    "Hyderabadi Jewelry",
    "Traditional Earrings",
    "Wedding Jewelry",
    "Emerald",
    "Cubic Zirconia",
    "Indian Earrings"
  ],
  "original_id": "diamond_jewellery_fe65430d-8e1d-4693-a0b4-aa3dd6dd0d8e_0411",
  "collection": "diamond"
}