{
  "id": "necklaces-026",
  "title": "Rajputana Diamond Delight: Exquisite Layered Haar and Earring Set",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Crafted in 18K Rose Gold",
    "meticulously set with brilliant-cut natural Diamonds. Features a high-polish finish with a touch of Hyderabadi Zircon finish for added brilliance. Diamonds are VS clarity",
    "H color."
  ],
  "features": "This exquisite set features a four-strand Haaram necklace adorned with floral motifs and square diamond centrepieces. The intricate detailing showcases masterful craftsmanship, each diamond meticulously set for maximum sparkle. The matching Jhumka earrings echo the necklace's design, creating a harmonious and regal look. Each design element is carefully incorporated, blending traditional patterns with a modern aesthetic.",
  "colors": [
    "Rose Gold and White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "milestone celebrations",
    "and grand functions. Ideal for the modern bride who appreciates timeless elegance with a contemporary twist. Can be styled for a grand muhurtham",
    "seemantham",
    "or a dazzling reception."
  ],
  "description": "This Diamond Delight set is a statement of refined taste and enduring beauty. The intricate design and exquisite diamond setting reflect superior craftsmanship. Crafted with the highest quality materials and attention to detail, ensuring lasting beauty and durability. A treasure to be cherished for generations.",
  "tags": [
    "Diamond Jewellery",
    "Haaram",
    "Jhumka",
    "Necklace Set",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Rose Gold",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Indian Bridal Jewellery",
    "Reception Jewellery",
    "Party Wear",
    "Engagement",
    "Anniversary",
    "Gifting",
    "New Bride"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0032_0061",
  "collection": "choker"
}