{
  "id": "necklaces-351",
  "title": "Raani Haaram - Diamond and Ruby Statement Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold base",
    "adorned with brilliant-cut Diamonds (VS clarity",
    "G color) and vibrant",
    "oval-cut Rubies. Features Hyderabadi polish for a lasting luster. The gold strand is a tightly woven mesh design."
  ],
  "features": "This exquisitely crafted Raani Haaram showcases a modern take on a classic design. The necklace features a meticulously designed central motif with floral and geometric patterns intricately set with diamonds. The striking rubies add a pop of color and visual appeal. Each element is carefully placed to create a balanced and elegant statement piece. The gold woven band adds a contemporary edge.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented with rich",
    "deep red (rubies). A classic color combination that exudes opulence and sophistication."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaahaalu)",
    "receptions",
    "and high-profile events. Can also be styled for modern cocktail parties and formal dinners."
  ],
  "description": "This Raani Haaram is a true investment piece, blending the timeless beauty of traditional South Indian jewelry with modern design sensibilities. The exceptional quality of the diamonds and rubies, combined with expert craftsmanship, ensures lasting value and enduring elegance. Its versatility allows it to be worn on a variety of occasions, making it a treasured addition to any jewelry collection. A true statement piece that captures attention and radiates sophistication.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Ruby Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Vivaaham",
    "Reception Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "18K Gold",
    "Statement Necklace",
    "Contemporary Jewelry",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0465_0647",
  "collection": "diamond"
}