{
  "id": "necklaces-498",
  "title": "Exquisite Pink Sapphire & Diamond Floral Haaram - A Contemporary Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in a durable alloy with rose gold and white gold plating",
    "this haaram features brilliant-cut white diamonds and vibrant pink sapphires. The stones are set in a secure pave setting. Finished with a Hyderabadi polish for lasting shine."
  ],
  "features": "This contemporary take on the traditional Haaram showcases a delicate floral motif. Intricate detailing on the petals enhances the sparkle of the diamonds and the vibrant hues of the sapphires. Features a floral pendant at the bottom. The design blends modern aesthetics with a touch of South Indian tradition.",
  "colors": [
    "Features a stunning color palette of rose gold",
    "white",
    "and vivid pink. The pink sapphires add a pop of color",
    "while the white diamonds provide a brilliant contrast."
  ],
  "occasions": [
    "Perfect for modern brides",
    "evening receptions",
    "engagement parties",
    "or any special occasion where you want to make a statement. Also suitable for a Seemantham or half-saree function when paired with a contemporary saree or lehenga."
  ],
  "description": "This haaram is a unique blend of modern design and South Indian sensibility. The high-quality materials and expert craftsmanship ensure lasting beauty. It is a versatile piece that can be worn for both traditional and contemporary events. The floral design symbolizes new beginnings and joy, making it a meaningful gift for a loved one.",
  "tags": [
    "Haaram",
    "Necklace",
    "Pink Sapphire",
    "Diamond",
    "Floral",
    "South Indian Jewelry",
    "Contemporary Jewelry",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "Designer Necklace",
    "Seemantham",
    "Reception",
    "Engagement",
    "Bridal Jewelry",
    "Contemporary Haaram",
    "Ethnic Necklace",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-30 3_0978",
  "collection": "diamond"
}