{
  "id": "necklaces-307",
  "title": "The \"Mayura Rani\" Diamond and Gemstone Haaram: A Regal Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "meticulously set with brilliant-cut diamonds (VS Clarity",
    "G-H Color). Features genuine emerald (పచ్చ)",
    "ruby (మాణిక్యము)",
    "and freshwater pearls (ముత్యాలు)."
  ],
  "features": "This exquisite Haaram showcases a triple-layered design, culminating in a magnificent peacock (Mayura) motif. The centerpiece features two intricately crafted peacocks facing a ruby, surrounded by diamond-studded filigree work. The design incorporates traditional South Indian elements with a modern aesthetic. The pendant is a floral design, and it is surrounded by diamonds.",
  "colors": [
    "Primary gold with sparkling white diamonds. Accents of vibrant green from the emeralds",
    "deep red from the rubies",
    "and lustrous white from the pearls create a rich and harmonious color palette."
  ],
  "occasions": [
    "Perfect for grand celebrations such as weddings (వివాహ వేడుక)",
    "receptions",
    "Seemantham (సీమంతం)",
    "and other significant cultural events. Also suitable for high-end galas and formal gatherings."
  ],
  "description": "A true statement piece, the 'Mayura Rani' Haaram blends traditional South Indian design with modern luxury. The high-quality diamonds, precious gemstones, and meticulous craftsmanship make this a timeless investment. The peacock motif symbolizes beauty, prosperity, and royalty, making it an auspicious and meaningful addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "కంఠాభరణం",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Peacock Jewelry",
    "Mayura",
    "Emerald",
    "Ruby",
    "Pearls",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0396_0593",
  "collection": "diamond"
}