{
  "id": "necklaces-1060",
  "title": "Muthyala Haaram with Polki Jhumka Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Fine Quality Seed Pearls",
    "Polki Diamonds (uncut diamonds)",
    "Rubies. Features the signature Hyderabadi polish for a lasting luster."
  ],
  "features": "This exquisite Haaram features four strands of lustrous seed pearls interspersed with ruby beads. The pendant is a stunning Polki Jhumka, meticulously crafted with uncut diamonds and ruby accents. The Jhumka design showcases traditional South Indian craftsmanship, known for its intricate detailing and timeless appeal. The teardrop shaped diamond is an amazing detail and a classic design",
  "colors": [
    "White (pearls)",
    "Red (rubies)",
    "Gold (metal)",
    "Clear/White (Polki Diamonds). A classic and auspicious color combination in South Indian jewelry."
  ],
  "occasions": [
    "Ideal for weddings",
    "bridal wear",
    "festivals like Diwali and Sankranti",
    "or any special occasion where you want to make a statement. Perfect for a Muhurtham",
    "reception",
    "or even a modern gala event."
  ],
  "description": "This Muthyala Haaram with Polki Jhumka pendant is a true heirloom piece, representing timeless elegance and cultural heritage. The combination of pearls and uncut diamonds creates a luxurious and sophisticated look. The Hyderabadi polish ensures lasting shine and durability, making it a valuable investment for generations to come. The intricate craftsmanship and attention to detail make this a unique and captivating piece of jewelry.",
  "tags": [
    "Muthyala Haaram",
    "Polki Jewelry",
    "Jhumka Pendant",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Pearl Necklace",
    "Ruby Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Antique Finish",
    "Ethnic Jewelry",
    "ముత్యాల హారం",
    "పోల్కీ నెక్లెస్",
    "జుంకా",
    "దక్షిణ భారతదేశ ఆభరణాలు"
  ],
  "original_id": "radhe_diam_DPNK8-1463_2473",
  "collection": "radhe"
}