{
  "id": "necklaces-115",
  "title": "Enthralling Polki Diamond Ruby Raasi Haaram - Three Layered Radiance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (Excellent Cut",
    "VS Clarity)",
    "and a Central Pear-Shaped Ruby Cabochon. Setting is primarily in a delicate filigree style."
  ],
  "features": "A breathtaking three-layered Haaram. Each layer is meticulously crafted with uncut Polki diamonds set in a traditional filigree design. The centerpiece is a striking pear-shaped Ruby Cabochon, surrounded by a halo of Polki diamonds. The necklace embodies the classic Raasi style with a modern twist in its layered design. Features delicate openwork detailing.",
  "colors": [
    "Primarily golden hues from the 22K gold",
    "complemented by the fiery red of the Ruby and the brilliant white sparkle of the Polki Diamonds. The Hyderabadi polish gives the gold a warm",
    "antique-like appearance."
  ],
  "occasions": [
    "Ideal for grand occasions like weddings ( పెళ్లి )",
    "receptions",
    "and traditional ceremonies like Seemantham (సీమంతం ) or other important family celebrations. Makes a bold statement for any upscale event."
  ],
  "description": "This Raasi Haaram is a testament to timeless Hyderabadi craftsmanship. The use of uncut Polki diamonds adds a unique charm and authenticity, representing a rich cultural heritage. The three-layered design makes a striking and sophisticated statement. The high-quality Ruby adds a touch of royalty and good fortune, making it a treasured heirloom piece.",
  "tags": [
    "Haaram",
    "Polki Diamonds",
    "Ruby",
    "Raasi",
    "Necklace",
    "Traditional Jewellery",
    "South Indian Jewellery",
    "Hyderabadi Jewellery",
    "Uncut Diamonds",
    "Kanthabharanam",
    "పెళ్లి నెక్లెస్",
    "సీమంతం నగలు",
    "Bridal Jewelry",
    "Statement Necklace",
    "Heirloom Jewelry"
  ],
  "original_id": "diamond_jewellery_DPNK8-1508_0348",
  "collection": "diamond"
}