{
  "id": "earrings-151",
  "title": "Heera Aur Panna Jhumki: A Timeless Blend of Heritage and Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Uncut Polki Diamond (Heera) center stone",
    "Brilliant Cut Diamonds",
    "Natural Emerald (Panna) drop. Featuring the renowned Hyderabadi Polish for a lustrous shine."
  ],
  "features": "This exquisite Jhumka showcases an oval-shaped Polki diamond surrounded by a halo of glittering brilliant cut diamonds. A vibrant, pear-shaped Emerald drop adds a touch of traditional South Indian charm. The intricate detailing around the stone settings reflects superior craftsmanship. The earring is designed for comfortable wear with a secure screw-back fastening.",
  "colors": [
    "Primarily gold with a sparkling white from the diamonds and a rich green from the emerald",
    "creating a striking contrast. The natural inclusions in the Polki diamond add a unique",
    "vintage appeal."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "festivals (like Sankranthi or Ugadi)",
    "or any special occasion where you want to make a statement. Also suitable for upscale modern events where a touch of heritage is desired."
  ],
  "description": "This Jhumka is a testament to timeless design and exquisite craftsmanship. The use of Polki diamonds, a traditional Indian gemstone, lends it a regal air, while the brilliant cut diamonds add contemporary sparkle. The vibrant emerald drop symbolizes prosperity and good fortune, making it a cherished heirloom piece.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Polki Diamond",
    "Emerald",
    "Panna",
    "Heera",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Vivaham",
    "Nischitartham",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_DPER8-1580_0276",
  "collection": "diamond"
}