{
  "id": "necklaces-1454",
  "title": "Emerald Bloom Nakshi Haaram - A Touch of Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Faceted Emeralds (high clarity)",
    "Polished Diamonds (VS clarity",
    "excellent cut)",
    "Hyderabadi Polish for lasting brilliance"
  ],
  "features": "This exquisite Haaram features a classic design with a modern twist. The neckpiece is crafted with intricate Nakshi work detailing floral motifs, complemented by vibrant green emeralds set in a secure bezel setting. The central pendant boasts a square, filigree design outlined with sparkling diamonds and emeralds, finished with delicate gold bead dangles. The design blends traditional South Indian artistry with contemporary aesthetics.",
  "colors": [
    "Gold (rich yellow tone)",
    "Emerald Green",
    "Diamond White"
  ],
  "occasions": [
    "Perfect for weddings (Vadhuvu Alankarana)",
    "receptions",
    "Seemantham ceremonies",
    "festive celebrations",
    "or any special occasion where you want to make a statement. Its contemporary design also makes it suitable for formal gatherings."
  ],
  "description": "This Nakshi Haaram is more than just jewelry; it's a heirloom. The intricate craftsmanship, high-quality gemstones, and timeless design make it a valuable investment. The Hyderabadi polish ensures lasting brilliance, while the blend of traditional and modern elements makes it versatile for various occasions. Experience the grandeur of South Indian heritage with a contemporary touch. A perfect gift for the discerning woman.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamonds",
    "22K Gold",
    "Nakshi Work",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Seemantham",
    "Vadhuvu Alankarana",
    "Kasulaperu",
    "Addigai",
    "Jewellery"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-51_2072",
  "collection": "sjpl"
}