{
  "id": "earrings-338",
  "title": "Enchanting Emerald Cascade Jhumkas: Manoharam Patchala Jhumkalu",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Platinum plated base metal; studded with high-quality Cubic Zirconia and Oval cut Emerald Green hydro stones; Hyderabadi Polish for enduring shine and luster."
  ],
  "features": "Intricate filigree design inspired by traditional South Indian floral motifs, adorned with cascading teardrop Emerald green hydro stones. The elaborate setting showcases brilliant-cut Cubic Zirconia, highlighting the central emerald stone. The design balances traditional charm with modern elegance, making it a truly exceptional piece.",
  "colors": [
    "Emerald Green and Brilliant White (Cubic Zirconia)",
    "accented by the platinum plated base for a radiant",
    "luxurious look."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festive occasions like Diwali",
    "Sankranti",
    "and other traditional events. A modern touch also makes them suitable for parties and special occasions where a statement piece is desired."
  ],
  "description": "These Jhumkas beautifully merge tradition and contemporary aesthetics. The high-quality Cubic Zirconia provides a diamond-like sparkle, while the Emerald Green hydro stones offer a vibrant and luxurious feel. The elaborate design is meticulously handcrafted, ensuring exceptional quality and durability. An excellent addition to your bridal jewelry collection or a treasured gift for a loved one. These jhumkas are a true testament to Hyderabadi craftsmanship and will make you feel like royalty!",
  "tags": [
    "Jhumkas",
    "Earrings",
    "Emerald Jewelry",
    "CZ Jewelry",
    "South Indian Jewelry",
    "Traditional Earrings",
    "Indian Wedding Jewelry",
    "Karnaphool",
    "Patchala Jhumkalu",
    "Hyderabadi Jewelry",
    "Statement Earrings",
    "Cocktail Earrings",
    "Green Earrings"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-41 3_1378",
  "collection": "diamond"
}