{
  "id": "necklaces-1252",
  "title": "Floral Kundan Haaram with Ruby Accents - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (GH) setting (48.830 g)",
    "meticulously crafted Kundan setting with high-quality Ruby accents (D PAN(+7):-3.16(54) & D MQ(+7):-5.23(99))",
    "and subtle white gemstones (NV Mix:-23.62(54)). Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Kundan Haaram showcases a beautiful floral motif. Each flower is intricately handcrafted with traditional Kundan setting techniques, encapsulating vibrant Ruby gemstones. The design features delicate white gemstone accents highlighting the depth of red hue and gold. The pendant design is modern yet has traditional elements, creating a balance between modern and classic.",
  "colors": [
    "Predominantly gold with striking ruby red centers in each floral element",
    "complemented by the clear sparkle of white gemstones."
  ],
  "occasions": [
    "Perfect for weddings (vaduve)",
    "receptions",
    "engagement ceremonies",
    "Seemantham celebrations",
    "and half-saree functions (Langa Voni). Also suitable for modern gala events where you want to make a statement."
  ],
  "description": "This Kundan Haaram is a testament to timeless Indian craftsmanship. The combination of vibrant rubies, shimmering white gemstones, and the richness of gold creates a captivating piece. Kundan jewelry is known for its durability and lasting value. This Haaram is more than just jewelry; it is a cultural statement and a heirloom in making.",
  "tags": [
    "Kundan",
    "Haaram",
    "Necklace",
    "Ruby",
    "Gold",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Langa Voni",
    "Seemantham",
    "vaduve",
    "vadhuvu"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-13-02-27_1848",
  "collection": "sjpl"
}