{
  "id": "necklaces-783",
  "title": "Grand Diamond and Gemstone 'Addigai' Necklace - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Brilliant Cut Diamonds (17.85 carats",
    "1171 pieces)",
    "Emeralds (2.37 carats",
    "4 pieces)",
    "and Ruby accents (0.05 carats",
    "6 pieces + 0.01 carats in the locket). Features a radiant Hyderabadi Polish for an enduring luster."
  ],
  "features": "This Addigai features an intricate floral design and a captivating pendant. The piece showcases brilliant-cut diamonds masterfully set, interspersed with carefully placed emeralds and ruby accents for a touch of colour. Delicate golden droplets adorn the necklace and the locket, enhancing its regal appearance. The back of the necklace features a sturdy and comfortable adjustable chain for a perfect fit.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with vibrant pops of green (emeralds) and subtle touches of red (rubies). This traditional color combination is highly auspicious."
  ],
  "occasions": [
    "Perfect for weddings (vivaham)",
    "receptions",
    "engagements",
    "and grand celebrations. Ideal for brides seeking traditional elegance and for any special occasion where a statement piece is desired."
  ],
  "description": "This Addigai necklace is a testament to timeless South Indian craftsmanship and elegance. The stunning combination of diamonds, emeralds, and rubies creates a breathtaking display of luxury. Its exquisite design and durable construction make it a cherished heirloom to be passed down through generations. A perfect embodiment of tradition and sophistication.",
  "tags": [
    "Addigai",
    "Necklace",
    "Haram",
    "Vaddanam",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Nakshi",
    "Gold Jewelry",
    "Telugu Jewelry",
    "Kantaabharanam",
    "కంఠాభరణం",
    "Hyderabadi Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-24-13-54-27 2_1318",
  "collection": "diamond"
}