{
  "id": "necklaces-636",
  "title": "Emerald Blossom Diamond Haar: A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Yellow Gold",
    "featuring brilliant-cut Diamonds (VS Clarity",
    "G Color) and vibrant Emeralds (estimated 2.5 carats total). Adorned with lustrous South Sea Pearls. Finished with a protective Hyderabadi Polish for lasting shine."
  ],
  "features": "This contemporary Haaram design showcases intricate diamond settings forming a delicate floral pattern. Centralized Emeralds add a touch of royal green. The design incorporates flowing curves and symmetrical details, culminating in pearl drops for a soft, feminine touch. Features a subtle peacock motif at the necklace's focal point, a symbol of beauty and prosperity.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented with deep green emeralds and soft white pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "festive occasions",
    "or as a statement piece for any special event. Its modern design makes it suitable for both traditional and contemporary attire."
  ],
  "description": "This Haaram is a harmonious blend of modern design and traditional South Indian aesthetics. The high-quality diamonds and vibrant emeralds create a luxurious and eye-catching piece. The Hyderabadi Polish ensures long-lasting shine and durability, making it a cherished heirloom for generations to come. The subtle peacock motif symbolizes grace and adds cultural significance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emeralds",
    "South Sea Pearls",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Vivaha",
    "Temple Jewelry",
    "South Indian Wedding",
    "Diamond Haaram",
    "Pachi Work",
    "Telugu Jewelry",
    "Designer Jewelry",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-09 3_1142",
  "collection": "diamond"
}