{
  "id": "necklaces-1115",
  "title": "Empress Polki Jadau Kundan Necklace - The Maharani Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Fine Silver Alloy Base with Antique Hyderabadi Polish",
    "Uncut Polki Diamonds (Rose Cut)",
    "Natural Emeralds (Pear and Oval Cabochons)",
    "Cultured Freshwater Pearls. High purity silver is used to enhance the brilliance of the polki diamonds."
  ],
  "features": "Elaborate Polki Kundan setting handcrafted in the traditional Jadau style. The necklace features a broad collar with a floral motif using uncut Polki diamonds interspersed with vibrant pear-shaped emeralds. A stunning central pendant echoes the collar's design with a large oval emerald. Delicate pearl and emerald bead drops adorn the necklace's edge, adding a touch of elegance. The floral patterns and the central pendant showcases a timeless design that represents ancient Indian artistry.",
  "colors": [
    "Silver (antique finish)",
    "Emerald Green",
    "White (Polki diamonds)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaha)",
    "receptions",
    "and special occasions like Seemantham or Half-Saree functions. Also a stunning piece for high-end social gatherings and formal events."
  ],
  "description": "This necklace is a true heirloom piece, showcasing the exquisite craftsmanship of Hyderabadi Jadau jewelry. The use of uncut Polki diamonds gives it a unique, antique charm, while the vibrant emeralds add a touch of regal elegance. Its versatile design beautifully complements both traditional and contemporary attire. Each Polki diamond is hand-selected for its quality and brilliance. The antique finish ensures that the necklace will only grow more beautiful with age.",
  "tags": [
    "Polki Necklace",
    "Kundan Jewellery",
    "Jadau Haaram",
    "Hyderabadi Jewelry",
    "Emerald Necklace",
    "Wedding Necklace",
    "Bridal Jewelry",
    "South Indian Jewellery",
    "Traditional Necklace",
    "Antique Finish",
    "Pearls",
    "muhurtham",
    "seemantham",
    "jadau",
    "kundan",
    "polki",
    "kundan haar",
    "bridal",
    "antique"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0010_2528",
  "collection": "radhe"
}