{
  "id": "earrings-627",
  "title": "Emerald & Kundan Jhumkaalu - The 'Padmaavati' Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold plating",
    "Kundan stones",
    "Emerald gemstones",
    "Simulated Pearls. Crafted with Hyderabadi polish for lasting luster."
  ],
  "features": "These exquisitely crafted Jhumkaalu feature a traditional bell-shaped design, meticulously adorned with intricate Kundan settings. A vibrant emerald gemstone sits atop, adding a touch of regal elegance. The jhumkas are finished with delicate pearl drops, enhancing their timeless appeal. Delicate filigree work and traditional South Indian motifs are incorporated into the design, creating a piece that is both classic and contemporary. 'Kundan' stone setting showcases the craftsmanship from Rajasthan, now blended seamlessly with South Indian designs.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Kundan)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "festivals (like Ugadi and Sankranti)",
    "and other special occasions. Also suitable for modern cocktail events and grand celebrations."
  ],
  "description": "These Jhumkaalu combine traditional South Indian aesthetics with modern elegance. The vibrant emerald and the intricate Kundan work make this a truly eye-catching piece. Its superior craftsmanship and durability ensure it will be a cherished heirloom for generations to come. It radiates elegance and luxury fit for royalty, 'Maharani look'",
  "tags": [
    "Jhumka",
    "Jhumkaalu",
    "Earrings",
    "Kundan",
    "Emerald",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Vivaham",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Wedding Earrings",
    "Hyderabadi Jewelry",
    "Pearl Earrings",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Indian Wedding",
    "Kundan Jewellery",
    "ఎమరాల్డ్",
    "జుంకాలు"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 11_2204",
  "collection": "sjpl"
}