{
  "id": "necklaces-934",
  "title": "Lakshmi Kasula Haaram - Divine Temple Necklace with Polki Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (Vankara Diamond)",
    "Ruby",
    "Emeralds",
    "South Sea Pearls"
  ],
  "features": "This exquisite Haaram features a central Lakshmi pendant intricately carved with traditional temple jewellery design (గుడి నమూనా). The pendant is adorned with uncut Polki diamonds in a pave setting, enhanced by delicate floral motifs with Emerald accents. The necklace chain consists of a double strand of gold beads each individually embellished with Polki diamonds. The pendant is finished with pearl drops. The piece embodies a modern take on the traditional Kasula Peru design.",
  "colors": [
    "Predominantly gold with sparkling white from the Polki diamonds",
    "a central ruby",
    "and refreshing green from the Emeralds. The pearls provide a subtle",
    "creamy contrast."
  ],
  "occasions": [
    "Ideal for weddings",
    "muhurtham",
    "bridal wear",
    "special occasions",
    "and traditional Telugu ceremonies such as seemantham or half-saree function. It is also suitable for upscale social gatherings and celebrations."
  ],
  "description": "This Lakshmi Kasula Haaram seamlessly blends traditional South Indian design with contemporary elegance. The Hyderabadi polish gives the gold a rich luster, while the uncut Polki diamonds offer a unique sparkle. The Lakshmi motif symbolizes prosperity and divine blessings, making it a meaningful and treasured heirloom piece. The exquisite craftsmanship ensures lasting beauty and value.",
  "tags": [
    "Necklace",
    "Haaram",
    "Kasula Peru",
    "Lakshmi Pendant",
    "Temple Jewelry",
    "Polki Diamonds",
    "Uncut Diamonds",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "traditional",
    "కంఠహారం",
    "గుడి నమూనా",
    "వంకరా వజ్రం"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0328_2395",
  "collection": "necklace"
}