{
  "id": "earrings-610",
  "title": "Enchanting Indradhanush Jhumka: A Symphony of Sapphires and Diamonds",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in 18K White and Rose Gold. Features a vibrant assortment of Square Cut Sapphires in various hues",
    "meticulously set with brilliant-cut Diamonds. Diamonds are FG color",
    "VS clarity. Exquisite Hyderabadi Polish for lasting brilliance."
  ],
  "features": "A modern interpretation of the traditional Jhumka, showcasing a cascade of multicolored square-cut sapphires. The floral motif at the top is paved with dazzling diamonds, leading to delicate rose gold leaf accents also set with diamonds. The open setting allows maximum light to enhance the sapphires' natural brilliance. The design incorporates a contemporary chandelier style.",
  "colors": [
    "A vibrant rainbow of colors",
    "featuring blue",
    "orange",
    "yellow",
    "green",
    "and pink sapphires. The cool brilliance of the white gold complements the warmth of the rose gold",
    "creating a visually stunning piece."
  ],
  "occasions": [
    "Perfect for adding a pop of color and sophistication to any occasion. Suitable for weddings",
    "receptions",
    "Sangeet ceremonies",
    "Diwali celebrations",
    "or any special event where you want to make a statement. Also appropriate for elevated everyday wear."
  ],
  "description": "This Jhumka is a unique blend of traditional aesthetics and modern design. The high-quality sapphires and diamonds create a captivating sparkle. The Hyderabadi polish ensures a lasting luster. The contemporary design makes it versatile for both traditional and modern outfits.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Sapphire",
    "Diamond",
    "18K Gold",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Statement Earrings",
    "Multicolored Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Party Wear",
    "Indradhanush",
    "Contemporary Jhumka",
    "Rose Gold",
    "White Gold"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-30-48 3_1829",
  "collection": "sjpl"
}