{
  "id": "necklaces-295",
  "title": "Divine Diamond Haaram Set with Jhumkas - Anantaa Collection",
  "category": "necklaces",
  "original_type": "Necklace & Earrings",
  "materials": [
    "22K Gold (Hallmarked)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Natural Ruby (Oval Cut)",
    "Natural Emerald (Round Cut)",
    "Cultured Pearls. Features Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite Haaram showcases intricate filigree work, accented with dazzling diamonds. The pendant features a central ruby surrounded by delicate diamond petals, crowned with an emerald. Lustrous pearls are elegantly suspended from the pendant and the diamond-studded Haaram chain. The accompanying Jhumkas echo the pendant's design with emeralds and pearls, offering a complete traditional look. The design blends traditional floral motifs with modern setting techniques for maximum brilliance. This set employs a 'jadau' setting style for the gemstones, a hallmark of South Indian craftsmanship.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Deep Red (Ruby)",
    "Emerald Green",
    "and Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for bridal wear (Muhurtham)",
    "Seemantham ceremonies",
    "Half-Saree functions",
    "or any grand occasion where you want to make a statement. Also suitable for elegant evening events and upscale parties."
  ],
  "description": "This Haaram is a timeless heirloom piece, combining traditional South Indian design with the brilliance of modern diamonds. The high-quality materials and meticulous craftsmanship ensure lasting beauty and value. The inclusion of ruby and emerald represents prosperity and growth, making it an auspicious choice for special occasions. It comes with a certificate of authenticity from our esteemed jewelry store, guaranteeing the quality and purity of the gold and gemstones. The Hyderabadi polish ensures a lasting, radiant finish. 'Lakshmi Kasu Haaram' influence enhances its auspicious appeal.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Jadau Jewelry",
    "Ruby",
    "Emerald",
    "Pearls",
    "22K Gold",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Anantaa Collection",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "பாரம்பரிய நகைகள்",
    "தென்னிந்திய நகைகள்",
    "முத்து நகைகள்",
    "வைரம்",
    "மரகதம்",
    "மாணிக்கம்"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0384_0581",
  "collection": "diamond"
}