{
  "id": "necklaces-727",
  "title": "Divya Kanthi Haaram: Diamond and Gemstone Long Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Kundan setting. Features brilliant-cut Diamonds of VS clarity. Adorned with genuine Emeralds",
    "and a subtle Rose Quartz centerpiece. Finished with a lasting Hyderabadi Polish for enduring luster."
  ],
  "features": "This exquisite Haaram boasts a traditional South Indian design with a contemporary twist. The intricate lacework design incorporates floral motifs embellished with Diamonds. The cascading pendant features a central Emerald stone and delicate gold detailing. The piece showcases a 'Kasula peru' inspired border with hanging gold 'gundlu' (beads) for added grace.",
  "colors": [
    "The necklace features a harmonious blend of sparkling white Diamonds",
    "vibrant green Emeralds",
    "the soft pink of Rose Quartz",
    "and the warm glow of 22K Gold."
  ],
  "occasions": [
    "Perfect for grand occasions such as Muhurtham",
    "Seemantham",
    "weddings",
    "and formal gatherings. A statement piece for special celebrations."
  ],
  "description": "This majestic Haaram embodies timeless elegance and cultural heritage. The use of high-quality materials and expert craftsmanship ensures durability and lasting beauty. It is a symbol of prosperity and auspiciousness, making it a cherished heirloom for generations to come. The blend of traditional design with modern sensibilities makes it a versatile piece for both traditional and contemporary attire.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald",
    "Rose Quartz",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Kasula Peru",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Kundan Setting",
    "muhurtham",
    "seemantham",
    "vaddanam",
    "gundlu",
    "Andhra Jewelry",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-46-46_1233",
  "collection": "diamond"
}