{
  "id": "bangles-135",
  "title": "Aadrika Emerald & Diamond Gold Vanki - The Enchanting Armlet",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Natural Emerald (Oval Cut",
    "Deep Green",
    "SI Clarity)",
    "Brilliant-cut Diamonds (VVS Clarity",
    "E-F Color). Features a lustrous Hyderabadi Polish for a radiant sheen."
  ],
  "features": "This contemporary Vanki design blends the timeless appeal of South Indian jewelry with a modern aesthetic. The oval-cut emerald is the focal point, surrounded by a delicate floral halo of sparkling diamonds. The openwork gold design, meticulously studded with diamonds in a pavé setting, showcases impeccable craftsmanship. The unique, stylized leaf-like patterns on either side of the central floral motif add a touch of sophistication and elegance. The bangle features a comfortable hinged design for easy wear and secure fit.",
  "colors": [
    "Lustrous Yellow Gold",
    "Deep Emerald Green",
    "Dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagement parties",
    "or any special occasion where you want to make a statement. Its modern design also makes it suitable for sophisticated evening events and celebrations. Wear it with your Kanjeevaram silk saree or a chic modern dress for a truly unique look."
  ],
  "description": "This Vanki is a fusion of traditional craftsmanship and modern design. The use of high-quality materials, including a vibrant natural emerald and sparkling diamonds, ensures lasting beauty and value. The intricate design and Hyderabadi Polish reflect the rich heritage of South Indian jewelry, while the contemporary style makes it a versatile piece for the modern woman. A perfect blend of heritage and trend, making it a treasured heirloom.",
  "tags": [
    "Vanki",
    "Armlet",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Bangle",
    "Bridal Jewelry",
    "Engagement",
    "Wedding",
    "Reception",
    "22K Gold",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Pavé Setting",
    "Seemantham",
    "Muhurtham",
    "Kangan"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0366_0563",
  "collection": "diamond"
}