{
  "id": "earrings-297",
  "title": "Emerald Bloom Jhumka: A Symphony of Tradition and Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated. Features a pear-shaped Emerald gemstone with exceptional clarity and luster. Adorned with meticulously placed Zircon stones for maximum brilliance. Finished with a lustrous Pearl drop",
    "handcrafted with Hyderabadi polish."
  ],
  "features": "Classic South Indian Jhumka design reimagined with a contemporary flair. Features an intricate floral motif with a pear-shaped Emerald as the focal point. The Zircon-studded floral design cascades down to a bell-shaped Jhumka, creating a stunning visual impact. The filigree-like detailing on the Jhumka showcases the skill of our artisans. Finished with a delicate pearl drop.",
  "colors": [
    "Emerald Green",
    "Gold",
    "White (Zircon)",
    "and Pearlescent White"
  ],
  "occasions": [
    "Perfect for weddings (pellilu)",
    "festivals (pandugalu)",
    "Seemantham",
    "half-saree functions (padaharella function)",
    "or any special occasion where you want to make a statement. Equally stunning for modern events and parties."
  ],
  "description": "Embrace the timeless beauty of South Indian craftsmanship with this exquisite Jhumka. The vibrant Emerald symbolizes prosperity and new beginnings, while the Zircon stones add a touch of modern sparkle. The perfect blend of tradition and contemporary design, this Jhumka is a true heirloom piece. Durable and crafted to last generations.",
  "tags": [
    "Jhumka",
    "Kammalu",
    "Earrings",
    "Emerald",
    "Zircon",
    "Pearl",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Gold Plated Jewelry",
    "Pellilu",
    "Seemantham",
    "Padaharella function",
    "Pandugalu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-28-12-26-34 4_1326",
  "collection": "diamond"
}