{
  "id": "necklaces-953",
  "title": "Diamond Floral Cascade Haaram - A Timeless Telugu Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "meticulously set with brilliant-cut Cubic Zirconia (CZ) stones. Gold weight approximately 35 grams."
  ],
  "features": "This exquisite haaram features a delicate cascade of floral motifs, each intricately studded with sparkling CZ stones. The central pendant showcases a cluster of flowers design, reminiscent of traditional Telugu floral patterns. The subtle paisley droplets (Manga Maalai inspired) add a touch of South Indian elegance. A secure and comfortable clasp ensures perfect wear.",
  "colors": [
    "Warm Yellow Gold with dazzling clear Cubic Zirconia stones",
    "creating a radiant and luxurious appearance."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements (నిశ్చితార్థం)",
    "receptions",
    "and other special occasions. Also suitable for festive events like Sankranthi and Ugadi. Its versatile design also allows it to be paired with contemporary outfits for formal gatherings."
  ],
  "description": "This Haaram blends traditional Telugu design with modern aesthetics, offering a timeless piece that will be cherished for generations. The high-quality craftsmanship and Hyderabadi polish ensure lasting brilliance and durability. The design is lightweight and comfortable, making it perfect for extended wear during celebrations. The CZ stones provide a dazzling sparkle at an accessible price point, allowing you to achieve the look of diamonds without compromising on quality.",
  "tags": [
    "Haaram",
    "Necklace",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "22K Gold",
    "CZ Stones",
    "Hyderabadi Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Kanthaabharanam",
    "పెళ్ళి నగలు",
    "కంఠాభరణం",
    "Manga Maalai",
    "Floral Necklace",
    "Ethnic Jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0347_2414",
  "collection": "necklace"
}