{
  "id": "necklaces-1401",
  "title": "Emerald & Polki Diamond Chandrani Haar with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximate) with Hyderabadi Polish",
    "High-Quality Polki Diamonds (Uncut Diamonds)",
    "Emeralds (faceted)",
    "Freshwater Pearls. The polki diamonds are carefully selected for their brilliance and clarity."
  ],
  "features": "This Chandrani Haar features a layered design with intricate floral and paisley motifs handcrafted with Polki diamonds. Emeralds are strategically placed for a pop of color and visual interest. Dainty freshwater pearls are elegantly suspended along the bottom edge, adding a touch of traditional charm. The centerpiece is a larger paisley pendant with a central emerald, further adorned with polki diamonds. Features a secure adjustable clasp. The back of the piece is intricately finished for comfort and visual appeal.",
  "colors": [
    "Gold (warm yellow)",
    "White (Polki diamonds)",
    "Green (Emeralds)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaahaalu)",
    "receptions",
    "engagement ceremonies",
    "and festive occasions. Also suitable for modern celebrations and formal events where you want to make a statement."
  ],
  "description": "This Chandrani Haar is a stunning blend of traditional South Indian design and modern aesthetics. The use of high-quality Polki diamonds and emeralds gives it a regal look and feel. The Hyderabadi polish adds a touch of timeless elegance, making it a treasured heirloom piece. Each stone is meticulously set by expert artisans, ensuring exceptional craftsmanship and durability.",
  "tags": [
    "Chandrani Haar",
    "Polki Diamond Necklace",
    "Emerald Necklace",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Telugu Jewellery",
    "Wedding Necklace",
    "Vivaaham",
    "Engagement Necklace",
    "Statement Necklace",
    "Traditional Jewelry",
    "Hyderabadi Jewellery",
    "Indian Bridal Jewellery",
    "Haar"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-13 2_2019",
  "collection": "sjpl"
}