{
  "id": "earrings-266",
  "title": "Emerald Cascade Jhumka - పచ్చల జూకాలు (Pachala Jookalu)",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "meticulously crafted and studded with high-quality Zambian Emeralds with excellent clarity and brilliant cut. Accentuated with dazzling CZ diamonds (American Diamonds) using a Hyderabadi Kundan setting technique for a timeless appeal."
  ],
  "features": "Exquisite chandelier-style Jhumkas featuring intricate filigree work embellished with Emeralds. The design embodies the essence of traditional South Indian craftsmanship with a modern touch, perfect for the contemporary bride. The open setting allows for maximum light reflection, enhancing the brilliance of the gemstones.",
  "colors": [
    "Predominantly Emerald Green and Gold",
    "a classic and auspicious combination in South Indian jewelry",
    "complemented by the dazzling white of the CZ diamonds."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham (సీమంతం)",
    "Half-Saree functions (లంగా ఓణీ వేడుక)",
    "and other festive occasions where a touch of elegance and tradition is desired. Also suitable for high-end parties and cultural events."
  ],
  "description": "Timeless design blending tradition with modern elegance. Handcrafted by skilled artisans from Hyderabad. Features high-quality Zambian Emeralds known for their rich color. The intricate filigree work and Kundan setting showcase unparalleled craftsmanship. A heirloom piece to be cherished for generations.",
  "tags": [
    "Jhumka",
    "చెవి పోగులు",
    "Emerald",
    "పచ్చ",
    "Gold",
    "బంగారు",
    "Kundan",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal Earrings",
    "Pachala Jookalu",
    "Zambian Emeralds",
    "CZ Diamonds",
    "Filigree",
    "Traditional Earrings"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-30 2_0892",
  "collection": "diamond"
}