{
  "id": "bangles-252",
  "title": "Emerald Radiance Vanki Bangle - A Touch of Timeless Elegance",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "Base Metal: High Quality Alloy with Rose Gold Plating. Gemstones: High Quality Cubic Zirconia",
    "and central Emerald Green Gemstone. The entire piece has Hyderabadi Polish for a lasting",
    "luxurious finish. Also",
    "the metal is non-allergenic and nickel-free for sensitive skin."
  ],
  "features": "This Vanki bangle features a classic South Indian oval design, adorned with sparkling cubic zirconia. The central focus is a stunning Emerald Green oval-cut gemstone, exuding royalty. The Rose Gold plated metalwork showcases intricate detailing with circular patterns adding depth and texture to the design. A semi-open design that adds a modern touch and flexibility to fit most wrist sizes comfortably. ",
  "colors": [
    "Rose Gold metal with sparkling white cubic zirconia and a rich Emerald Green gemstone."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festivals (like Ugadi or Diwali)",
    "and grand celebrations (such as milestone birthday parties or anniversaries). It is equally suited to add a touch of glamour to semi-formal or traditional attire."
  ],
  "description": "This Vanki bracelet blends traditional design with a modern aesthetic, making it a versatile and eye-catching piece. The high-quality cubic zirconia offers exceptional sparkle, while the Emerald Green centerpiece adds a touch of sophistication. With its comfortable fit and durable Hyderabadi Polish, this Vanki will be a treasured piece in any jewelry collection. A stylish statement piece.",
  "tags": [
    "Vanki",
    "Bangle",
    "Bracelet",
    "Kada",
    "Emerald",
    "Cubic Zirconia",
    "Rose Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festival Jewelry",
    "Ugadi",
    "Diwali",
    "Telugu Jewelry",
    "Vivaha Jewelry",
    "Emerald Green",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-09-11-07-48_1114",
  "collection": "diamond"
}