{
  "id": "necklaces-1526",
  "title": "Exquisite Emerald & Diamond Bridal Choker - Kanthaabharanam",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base with Hyderabadi Polish",
    "meticulously set with brilliant-cut Diamonds (VVS clarity",
    "G color)",
    "and natural Emeralds (Zambian origin",
    "Oval and Round cuts). Accented with lustrous South Sea Pearls."
  ],
  "features": "An opulent choker design, intricately crafted with floral motifs and delicate filigree work. The centerpiece is a grand pendant adorned with a striking oval Emerald surrounded by radiating diamonds. The layered design and pearl drops add depth and elegance. Features a classic adjustable drawstring closure for a comfortable fit.",
  "colors": [
    "Predominantly white (diamonds) and green (emeralds) with a warm yellow gold tone. The pearls offer a soft",
    "creamy contrast."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Muhurtham)",
    "receptions",
    "and other formal events. Also suitable for traditional ceremonies such as Seemantham or Half-Saree functions",
    "enhancing the bride's regal appearance."
  ],
  "description": "This magnificent choker showcases the epitome of Hyderabadi craftsmanship, combining the brilliance of diamonds, the allure of emeralds, and the timeless elegance of South Sea pearls. The intricate design reflects the rich cultural heritage of South Indian jewelry, making it a valuable heirloom piece. Its adjustable drawstring closure ensures a perfect fit for any neckline, offering both beauty and comfort.",
  "tags": [
    "Bridal Jewelry",
    "Choker Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Kanthaabharanam",
    "Kasulaperu",
    "Pearls",
    "Haaram",
    "Muhurtham",
    "Seemantham",
    "Half-Saree",
    "Traditional Jewelry",
    "Indian Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-05 4_2144",
  "collection": "sjpl"
}