{
  "id": "earrings-200",
  "title": "Polki & Ruby Blossom Dangle Earrings - Sundari Jhumki",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Uncut Polki Diamonds (approx. 1.5 carats total)",
    "Natural Ruby cabochon (approx. 0.75 carats)."
  ],
  "features": "A modern take on the classic Jhumka design. The unique geometric top section features a captivating Polki diamond secured within a delicately crafted open bezel setting. A ruby cabochon, surrounded by polki petals, dangles gracefully below, catching the light with every movement. The intricate gold work showcases a subtle Hyderabadi polish, lending a rich, antique-inspired look.",
  "colors": [
    "Predominantly warm tones with a rich red Ruby",
    "complemented by the brilliance of white Polki diamonds and the golden hue of the 22K gold. The Hyderabadi polish gives the gold a slightly muted",
    "aged appearance",
    "enhancing its vintage appeal."
  ],
  "occasions": [
    "Perfect for adding a touch of traditional elegance to contemporary outfits. Ideal for festive occasions",
    "cocktail parties",
    "or even paired with a Kanjeevaram saree for a Seemantham or Half-Saree Function."
  ],
  "description": "These earrings offer a unique blend of traditional craftsmanship and modern design sensibilities. The use of high-quality, uncut Polki diamonds and a vibrant Ruby cabochon adds to their value and appeal. The Hyderabadi polish enhances the antique look and feel, making them a timeless addition to any jewelry collection. A statement piece that reflects both heritage and style.",
  "tags": [
    "Polki Earrings",
    "Jhumka",
    "Ruby Earrings",
    "Hyderabadi Jewelry",
    "Uncut Diamond",
    "Traditional Earrings",
    "South Indian Jewelry",
    "Indian Earrings",
    "Ethnic Jewelry",
    "Fine Jewelry",
    "Sundari Jhumki",
    "Gold Earrings",
    "Bridal Jewelry",
    "Seemantham",
    "Half Saree Function"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0036_0444",
  "collection": "diamond"
}