{
  "id": "necklaces-978",
  "title": "Emerald Enchantment: Modern Kundan Haaram with Pearl Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality alloy with a lustrous gold-tone finish. Adorned with sparkling cubic zirconia (CZ) stones and genuine emerald green gemstones. Features delicate freshwater pearls. Meticulously crafted with a Hyderabadi polish for enduring brilliance."
  ],
  "features": "This exquisite haaram features a contemporary Kundan setting, seamlessly blending traditional techniques with a modern aesthetic. The intricate design incorporates floral motifs accentuated with vibrant green emeralds. The central pendant boasts a mesmerizing tear-drop design, further embellished with smaller emeralds and lustrous pearls. The necklace sits gracefully with a mesh gold-tone chain.",
  "colors": [
    "Predominantly gold with striking emerald green gemstones and the soft glow of natural pearls. The green and gold combination is a timeless classic",
    "highly revered in South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festive occasions like Sankranthi and Diwali",
    "or any special event where you want to make a statement. Also suitable for modern celebrations like cocktail parties and upscale gatherings."
  ],
  "description": "This haaram is a testament to exquisite craftsmanship and timeless elegance. The modern Kundan setting offers a fresh take on traditional South Indian jewelry, making it a versatile piece for both traditional and contemporary wardrobes. The high-quality materials ensure durability and lasting brilliance, making it a cherished heirloom for generations to come. The vibrant emeralds symbolize prosperity and good fortune, adding a layer of cultural significance.",
  "tags": [
    "Haaram",
    "Kundan",
    "Necklace",
    "Emerald",
    "Pearl",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Ethnic Jewelry",
    "Kanthabharanam",
    "कंठाभरणमु",
    "Bridal",
    "Reception",
    "Festive",
    "Contemporary",
    "CZ Diamond",
    "Fashion"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0456_2439",
  "collection": "necklace"
}