{
  "id": "necklaces-770",
  "title": "Heera & Panna Bridal Grandeur: The Royal Jadau Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold base with Hyderabadi Polish. Adorned with meticulously set",
    "high-quality uncut diamonds (Polki/Jadau) and vibrant Zambian Emeralds (Panna). Features lustrous South Sea Pearls."
  ],
  "features": "An opulent Jadau Haaram showcasing traditional South Indian craftsmanship. The floral design is intricately set with uncut diamonds, creating a dazzling effect. Emeralds add a touch of regal elegance. The central pendant features a similar design, cascading down to a larger emerald. Dangles of luminous South Sea Pearls soften the overall look. The 'kundan' setting, typical of Hyderabadi jewelry, adds depth and dimension.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "complemented by the vivid green of the emeralds and the soft white of the pearls. A classic and auspicious color combination in Telugu weddings."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli/Vivahaalu)",
    "grand receptions",
    "Seemantham ceremonies",
    "and other significant celebrations. A heirloom piece to be cherished for generations."
  ],
  "description": "This Jadau Haaram is a testament to superior craftsmanship and traditional Hyderabadi artistry. The combination of uncut diamonds and emeralds is both timeless and luxurious. The meticulous setting and attention to detail ensure this piece will be a cherished heirloom. Its grandeur makes it a perfect statement piece for any special occasion. A symbol of prosperity and good fortune, making it an auspicious choice for brides.",
  "tags": [
    "Haaram",
    "Jadau Necklace",
    "Polki Necklace",
    "Uncut Diamonds",
    "Emerald Necklace",
    "Panna",
    "South Sea Pearls",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "కంఠాభరణం",
    "Bridal Haaram",
    "Pelli",
    "Vivahaalu",
    "సీమంతం"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-07 4_1276",
  "collection": "diamond"
}