{
  "id": "necklaces-1392",
  "title": "Emerald Radiance Diamond Haaram Set",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color)",
    "Natural Emeralds (Zambian",
    "Round & Square Cut)",
    "Freshwater Pearls. Features a fine Hyderabadi polish for lasting shine."
  ],
  "features": "A stunning statement necklace featuring a floral motif intricately set with dazzling diamonds. The central pendant is adorned with a captivating Zambian Emerald, surrounded by delicate diamond work. Pearl drops enhance the elegance. The design incorporates traditional South Indian floral patterns, providing a modern take on the classic Haaram style. The graduated layers offer depth and dimension.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Emerald Green",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaham/పెళ్లి)",
    "receptions",
    "grand celebrations",
    "and special occasions like Seemantham (శ్రీమంతం) or half-saree functions. A timeless piece for making a lasting impression."
  ],
  "description": "This exquisite Diamond Haaram combines the opulence of diamonds with the traditional charm of South Indian jewelry. The carefully selected Emeralds add a touch of regal sophistication, believed to bring prosperity and good fortune. Meticulously handcrafted by skilled artisans in Hyderabad, this piece is a true investment in timeless beauty and cultural heritage. Its versatile design makes it suitable for both traditional and contemporary attire.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "కంఠాభరణం",
    "పెళ్లి నగలు",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Statement Necklace",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-06_2010",
  "collection": "sjpl"
}