{
  "id": "waistbands-014",
  "title": "The Emerald and Diamond Vaddanam: \"Ananta Lakshmi\"",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold",
    "Finest Quality Diamonds (24.23 carats)",
    "Natural Emeralds (24.90 carats) and South Sea Pearls (42.33 carats). Features Hyderabadi polish for a lasting luster."
  ],
  "features": "Intricately handcrafted Vaddanam featuring a traditional South Indian design. The central motif is adorned with a large oval cut emerald, surrounded by a halo of shimmering diamonds in a pave setting. Pear-shaped emerald drops enhance the elegance, and delicate diamond-studded floral patterns link the main design to the pearl tassel border. The secure and adjustable clasp ensures a comfortable fit. The diamonds are set with high precision, maximizing their brilliance. The piece weighs 188.33 grams.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Diamonds)",
    "and Cream (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "bridal wear",
    "grand receptions",
    "traditional festivals like Ugadi and Sankranti",
    "and special occasions such as Seemantham or half-saree functions (Langa Voni Function). Can also add a touch of regal elegance to modern formal events."
  ],
  "description": "This \"Ananta Lakshmi\" Vaddanam is a true masterpiece of South Indian craftsmanship. Its timeless design combines the auspiciousness of emeralds and the brilliance of diamonds, enhanced by the gentle beauty of South Sea Pearls. The use of 22K gold ensures lasting value and durability, making it a cherished heirloom to be passed down through generations. The intricate design and meticulous craftsmanship make this piece a unique and unforgettable statement of style and tradition.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Kamarbandh",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Emerald",
    "Diamonds",
    "Pearls",
    "22K Gold",
    "Hyderabadi Polish",
    "Temple Jewelry",
    "Ugadi",
    "Sankranti",
    "Vivaha",
    "Seemantham",
    "Langa Voni",
    "Muhurtham",
    "Kasu Mala",
    "Nakshi Work"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02 3_1294",
  "collection": "diamond"
}