{
  "id": "earrings-034",
  "title": "Lakshmi Diamond Jhumka: A Symphony of Tradition and Sparkle",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold (సువర్ణము)",
    "Brilliant Cut Diamonds (వజ్రాలు)",
    "Burmese Ruby accents. Features traditional Hyderabadi Polish (హైదరాబాదీ మెరుగు) for a lasting lustre."
  ],
  "features": "Classic bell-shaped Jhumka design inspired by temple architecture, embellished with intricate filigree work. The earrings feature a floral motif top suspending a diamond studded dome adorned with a central Ruby. Finished with delicate gold bead drops (గుండ్ల డిజైన్) for added movement and sparkle. Features a secure screw-back closure.",
  "colors": [
    "Radiant Yellow Gold",
    "dazzling White Diamonds",
    "and passionate Red Rubies create a rich and timeless color palette."
  ],
  "occasions": [
    "Perfect for weddings (వివాహము)",
    "festivals (పండుగలు)",
    "engagements (నిశ్చితార్థం)",
    "or any special occasion where you want to showcase your heritage and style. Ideal for traditional ceremonies like Seemantham (సీమంతం) or a Half-Saree function (లంగా ఓణీ వేడుక)."
  ],
  "description": "Experience the timeless elegance of South Indian craftsmanship with these stunning Diamond Jhumkas. Handcrafted by skilled artisans in Hyderabad, these earrings blend traditional design with modern sparkle. The combination of 22K gold, brilliant-cut diamonds, and vibrant rubies makes these a treasured heirloom. Invest in a piece that celebrates your cultural heritage and adds a touch of luxury to any ensemble. Symbolizes prosperity and good fortune.",
  "tags": [
    "Jhumka",
    "Jhumki",
    "Earrings",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Jewelry",
    "Gold Earrings",
    "Diamond Earrings",
    "Ruby Earrings",
    "చెవి దిద్దులు",
    "జుంకాలు",
    "వజ్రాలు",
    "సువర్ణము",
    "పండుగ నగలు",
    "వివాహ నగలు",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "ethnic jewellery"
  ],
  "original_id": "diamond_jewellery_42526392-8b38-4e7d-a79b-223c5940293c_0107",
  "collection": "diamond"
}