{
  "id": "necklaces-350",
  "title": "Exquisite Diamond and Pearl Nakshi Haaram Set - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Crafted in 22K Gold with a brilliant Hyderabadi polish. Adorned with high-quality",
    "brilliant-cut diamonds (VVS clarity",
    "G color)",
    "lustrous freshwater pearls",
    "and featuring accents of Ruby and Emerald gemstones. The gold is hallmarked for purity."
  ],
  "features": "This stunning Haaram showcases intricate Nakshi work, a traditional South Indian technique involving detailed hand-engraving. The necklace features a floral motif centerpiece and a complementary pendant. The Jhumka earrings mirror the necklace's floral pattern, creating a cohesive and elegant set. The pearl drops add a touch of grace and sophistication. The filigree design adds to the antique charm.",
  "colors": [
    "The set features a warm gold tone beautifully contrasted by the dazzling white diamonds",
    "the vibrant green of the emeralds",
    "the deep red of the rubies",
    "and the soft ivory of the pearls."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings",
    "receptions",
    "muhurtham ceremonies",
    "and other special events. This set also makes a treasured gift for anniversaries",
    "milestone birthdays",
    "or a Seemantham ceremony."
  ],
  "description": "This Haaram set is a testament to exquisite craftsmanship and timeless design. The combination of traditional Nakshi work with modern diamond setting techniques creates a piece that is both culturally significant and undeniably beautiful. The high-quality diamonds and pearls ensure lasting brilliance and value. Own a piece of Hyderabad's rich jewelry heritage.",
  "tags": [
    "Diamond Haaram",
    "Nakshi Jewelry",
    "South Indian Jewelry",
    "Bridal Necklace",
    "Wedding Jewelry",
    "Jhumka Earrings",
    "Pearl Jewelry",
    "Hyderabadi Jewelry",
    "Gold Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Muhurtham Jewelry",
    "Seemantham",
    "Vaddanam",
    "Kasulaperu",
    "Addigai",
    "Kempu",
    "Pachalu"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0464_0646",
  "collection": "diamond"
}