{
  "id": "necklaces-460",
  "title": "Emerald Cascade Haaram - A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (67.610 grams)",
    "Brilliant Cut Diamonds (6.15 carats",
    "1411 stones) and Emeralds (16.46 carats",
    "15 stones). Features a refined Hyderabadi polish."
  ],
  "features": "This exquisite necklace showcases a beautifully crafted cascade design. Pear-shaped Emeralds are gracefully suspended from a delicate lattice of gold and sparkling diamonds. The floral motifs are inspired by traditional South Indian aesthetics, seamlessly blended with a modern, minimalist setting. The gold work features intricate detailing, adding depth and texture to the piece.",
  "colors": [
    "Lustrous gold",
    "vibrant green of the Emeralds",
    "and the dazzling white of the Diamonds create a captivating color harmony."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand celebrations. Its contemporary design makes it suitable for modern events while retaining the traditional charm for occasions like Seemantham (baby shower)",
    "and Half-Saree function."
  ],
  "description": "This Emerald Cascade Haaram is a statement piece, offering a unique blend of traditional South Indian design and contemporary elegance. The high-quality Emeralds and Diamonds, combined with superior craftsmanship, ensure lasting beauty and value. It's a piece that embodies sophistication and cultural richness, making it a treasured heirloom.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Seemantham",
    "Half-Saree Function",
    "Heirlooms",
    "ఆభరణాలు",
    "హారం",
    "పచ్చ",
    "వజ్రం",
    "బంగారం",
    "దక్షిణ భారతదేశ ఆభరణాలు",
    "హైదరాబాద్ ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-52 2_0923",
  "collection": "diamond"
}