{
  "id": "necklaces-1673",
  "title": "Vaidooryam Kantha Haaram: Pear-Shaped Emerald and Diamond Cascade Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K White Gold",
    "Natural Zambian Emeralds (Pear Cut)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color). Features Hyderabadi Polish for a lasting sheen."
  ],
  "features": "A modern interpretation of the traditional Haaram, this necklace showcases a cascading design with alternating pear-shaped Zambian Emeralds and brilliant-cut diamonds, all set in a delicate pave setting. The pendant features a larger pear-shaped emerald surrounded by smaller emeralds and diamonds, creating a captivating focal point. The 'adiga' (close-fitting) style makes it comfortable and elegant.",
  "colors": [
    "Vibrant Emerald Green and Sparkling White."
  ],
  "occasions": [
    "Perfect for modern weddings",
    "receptions",
    "engagement parties",
    "or a sophisticated night out. Also suitable for traditional occasions like Seemantham or Half-Saree functions when paired with simpler attire."
  ],
  "description": "This Vaidooryam Kantha Haaram is a statement piece that seamlessly blends timeless elegance with modern design. The exceptional quality of the Zambian Emeralds and VVS diamonds, combined with the intricate craftsmanship and the classic Hyderabadi polish, make it a valuable heirloom to be cherished for generations. Its versatile design ensures it complements both traditional and contemporary ensembles, offering enduring style and sophistication.",
  "tags": [
    "Haaram",
    "कंठाभरणं",
    "Emerald Necklace",
    "Diamond Necklace",
    "Zambian Emerald",
    "White Gold Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Modern Haaram",
    "Wedding Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "Indian Jewelry",
    "Vaidooryam",
    "कंठहार"
  ],
  "original_id": "stock_in_india_IMG-20241218-WA0010_2855",
  "collection": "stock"
}