{
  "id": "necklaces-1188",
  "title": "Apsara Kanti Haaram: Emerald and Diamond Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Yellow Gold. Features a generous array of brilliant-cut Diamonds (15.30 carats",
    "4196 stones) and meticulously selected Round & Square Cut Rubies (21.12 carats",
    "6 stones) and Emeralds (16.34 carats",
    "11 stones; Emerald Beads: 76.80 carats",
    "39 stones). Finished with a lustrous Hyderabadi Polish."
  ],
  "features": "This stunning Haaram showcases intricate filigree work embellished with diamond accents, complemented by strategically placed emeralds. Features a central floral motif pendant and drop-shaped green stones. Traditional South Indian aesthetics blend seamlessly with a modern open setting style, allowing maximum light to enhance the diamonds' brilliance. The cascading design creates a mesmerizing effect.",
  "colors": [
    "Predominantly gold",
    "white (diamonds)",
    "and vibrant green (emeralds). The ruby adds a dash of red to the overall vibrancy. The classic combination of gold and green evokes a sense of auspiciousness and prosperity."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand celebrations. Ideal for Muhurtham ceremonies",
    "Seemantham events",
    "and significant festivals. A statement piece for any modern Indian bride or for those seeking a touch of traditional elegance."
  ],
  "description": "A true masterpiece of craftsmanship, this Kanti Haaram is more than just jewelry; it's an heirloom. The use of high-quality diamonds and natural emeralds ensures lasting value. The intricate design reflects the rich cultural heritage of South India. The strategic color combination and impressive size makes this a standout piece that will capture attention and admiration.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Traditional Jewelry",
    "Kanti",
    "Kasu Mala",
    "Bridal",
    "Muhurtham",
    "Seemantham",
    "Engagement",
    "Antique Finish"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-10 2_1740",
  "collection": "sjpl"
}