{
  "id": "earrings-339",
  "title": "Enchanting 'Pushpa' Diamond and Pink Sapphire Jhumkas with Rice Pearls",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Base metal with Rhodium and Rose Gold Finish. Adorned with Sparkling Diamonds (NV Stns: 8.60 ct)",
    "Cushion-Cut Pink Sapphires (D PAN: 0.15 ct",
    "D MQ: 0.08 ct)",
    "and delicate Rice Pearls (Rice Moti: 3.71 ct)."
  ],
  "features": "These beautifully crafted jhumkas feature a delicate floral design, reminiscent of the 'Pushpa' motif, transitioning from a diamond-studded floral top to cascading stylized leaves set with Pink Sapphires. The design culminates in a cluster of luminous Rice Pearls, adding a touch of traditional elegance. The intricate setting enhances the brilliance of each gemstone.",
  "colors": [
    "Silver (Rhodium finish)",
    "Rose Gold",
    "delicate Pink (Sapphires)",
    "and lustrous White (Rice Pearls)."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "cocktail parties",
    "or any occasion where you want to add a touch of modern elegance with a traditional touch. Suitable for half-saree functions and other celebratory events."
  ],
  "description": "These contemporary Jhumkas seamlessly blend traditional Indian design with a modern aesthetic. The floral motif is a timeless symbol of beauty and grace. The use of Diamonds, Pink Sapphires and Rice Pearls provides a vibrant and luxurious touch. These are statement pieces that showcase exquisite craftsmanship and timeless elegance.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Diamond",
    "Pink Sapphire",
    "Rice Pearls",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Floral Design",
    "Wedding Jewelry",
    "Statement Earrings",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "Contemporary Jewelry",
    "Pushpa Design"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-41_1379",
  "collection": "diamond"
}