{
  "id": "necklaces-1334",
  "title": "Diamond Floral Vanki - An Elegant Touch of Tradition",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18K Rose Gold setting",
    "adorned with brilliant-cut diamonds. The diamonds are graded VS clarity and near colorless (G-H range). Showcases meticulous craftsmanship with a smooth",
    "Hyderabadi polish."
  ],
  "features": "A modern interpretation of the classic Vanki (armlet), this pendant features a graceful, floral motif with a symmetrical arrangement of diamond-studded ovals. The diamonds are pavé set for maximum brilliance, creating a seamless sparkle. Delicate gold detailing adds a touch of understated elegance.",
  "colors": [
    "Primarily rose gold with the dazzling white sparkle of diamonds. The rose gold provides a warm and romantic contrast to the icy brilliance of the diamonds."
  ],
  "occasions": [
    "Ideal for contemporary occasions like cocktail parties",
    "anniversaries",
    "or as a sophisticated addition to everyday wear. Its modern design also makes it suitable for fusion outfits during pre-wedding events like sangeet or mehendi."
  ],
  "description": "This Vanki pendant seamlessly blends tradition with modern design, making it a versatile piece for the discerning woman. The exceptional diamond quality and expert craftsmanship ensure lasting beauty and value. Its delicate floral motif carries a sense of femininity and grace. A unique addition to any jewelry collection.",
  "tags": [
    "Vanki",
    "Armlet",
    "Pendant",
    "Diamond Pendant",
    "Rose Gold",
    "Modern Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Engagement Gift",
    "Anniversary Gift",
    "VS Diamonds",
    "Pavé Setting",
    "Pre-Wedding Jewelry",
    "Sangeet Jewelry",
    "Mehendi Jewelry",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "Fashionable Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-47 2_1932",
  "collection": "sjpl"
}