{
  "id": "rings-005",
  "title": "Royal Rajwadi Polki & Onyx Statement Ring",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "18K Yellow Gold",
    "Sterling Silver",
    "Natural Polki Diamonds (Uncut Diamonds)",
    "Black Onyx. Features a signature Hyderabadi Polish for enhanced luster."
  ],
  "features": "A bold rectangular design features a central floral motif crafted with ethically sourced polki diamonds in a bezel setting. The backdrop consists of sleek, polished black onyx stones arranged in a geometric pattern. A pave-set border of dazzling diamonds adds a touch of modern glamour. The design seamlessly blends traditional polki craftsmanship with contemporary aesthetics.",
  "colors": [
    "Primarily a contrasting color palette featuring the deep black of onyx",
    "the warm yellow of gold settings around the central cluster",
    "the raw shine of the polki diamonds",
    "and the bright white brilliance of the surrounding diamond border. This color scheme creates a rich and luxurious feel."
  ],
  "occasions": [
    "Ideal for grand celebrations",
    "evening galas",
    "or any occasion where you want to make a statement. Also suitable for adding a touch of royal elegance to modern attire",
    "or traditional Sangeet/Cocktail parties."
  ],
  "description": "This ring showcases the unique beauty of uncut polki diamonds, a gem coveted in South Indian jewelry. The combination of polki diamonds and black onyx creates a striking contrast, while the meticulous craftsmanship and Hyderabadi polish ensure lasting beauty and heirloom quality. This is a unique piece that blends modern and traditional styles perfectly.",
  "tags": [
    "Polki Ring",
    "Diamond Ring",
    "Onyx Ring",
    "Statement Ring",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Uncut Diamonds",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Rajwadi Jewelry",
    "Contemporary Ring",
    "Ethnic Ring",
    "Engagement Ring",
    "Sangeet Jewelry"
  ],
  "original_id": "diamond_jewellery_DPCR8-1341_0240",
  "collection": "diamond"
}