{
  "id": "earrings-457",
  "title": "Elegant Ruby and Polki Diamond Chandbali Earring - 'Ganda Bharanalu'",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Faceted Ruby Cabochons",
    "Natural Seed Pearls. Expertly crafted with Hyderabadi Polish for a lasting luster."
  ],
  "features": "Classic Chandbali design featuring two gracefully mirroring peacocks, intricately embellished with uncut Polki diamonds and a deep blue sapphire. The central motif holds a delicate ruby cabochon, complemented by a cascading array of ruby drops and lustrous seed pearls. The Polki diamond setting showcases traditional Indian craftsmanship, offering a regal appeal.",
  "colors": [
    "Rich Gold",
    "Deep Ruby Red",
    "Sparkling White (Polki Diamonds)",
    "Subtle hints of Pearl White",
    "and deep sapphire blue."
  ],
  "occasions": [
    "Perfect for weddings ( పెళ్లి )",
    "receptions",
    "engagements",
    "and significant celebrations like Seemantham (శ్రీమంతం)",
    "and Half-Saree functions. Its timeless elegance also makes it a captivating accessory for contemporary cocktail parties and formal events."
  ],
  "description": "This Chandbali is a symphony of traditional artistry and timeless elegance. The rare combination of Polki diamonds and vibrant rubies, set in 22K gold with a signature Hyderabadi polish, speaks of exceptional craftsmanship and investment value. Each gem is carefully chosen for its color and clarity, ensuring a piece that will be treasured for generations. The peacock motif symbolizes beauty, love, and prosperity, making it a meaningful heirloom.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Polki Diamond",
    "Ruby",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Earrings",
    "Ethnic Jewelry",
    "చెవి దిద్దులు",
    "Ganda Bharanalu",
    "పెళ్లి",
    "Ruby Drops",
    "Peacock Motif",
    "Heirlooms"
  ],
  "original_id": "ear_rings_DPCB8-103_2573",
  "collection": "ear"
}