{
  "id": "necklaces-211",
  "title": "Enchanting Emerald Vine Necklace: A Traditional Addigai with a Modern Flair",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "High-Quality Emeralds (faceted cut)",
    "Sparkling Cubic Zirconia (CZ). Features a lustrous Hyderabadi Polish for a timeless sheen."
  ],
  "features": "This exquisite Addigai features a delicate vine design meticulously crafted in gold. Each leaf and flower is adorned with shimmering CZs, creating a captivating sparkle. The focal point showcases vibrant emeralds nestled within floral motifs, adding a touch of regal elegance. The intricate openwork and delicate filigree detailing highlight the unparalleled artistry of our skilled artisans.",
  "colors": [
    "Predominantly yellow gold with vibrant green emerald accents and brilliant white CZs."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "festivals (like Diwali and Sankranthi)",
    "and other special occasions. Also suitable for sophisticated evening wear or a touch of cultural elegance in modern settings."
  ],
  "description": "A harmonious blend of traditional Telugu jewelry design with contemporary aesthetics. The high-quality emeralds and meticulously placed CZs create a luxurious and eye-catching piece. Handcrafted by skilled artisans using time-honored techniques, ensuring exceptional durability and lasting beauty. A statement piece that adds a touch of regal grace to any ensemble.",
  "tags": [
    "Addigai",
    "Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emerald",
    "CZ",
    "22K Gold",
    "Hyderabad",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Vivahaalu",
    "Gold Necklace",
    "Indian Jewelry",
    "Contemporary Jewelry",
    "Ethnic Jewelry",
    "Fashion"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0289_0486",
  "collection": "diamond"
}