{
  "id": "necklaces-313",
  "title": "Apsara Kundan Long Haaram Set with Jhumka - Celestial Elegance",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "Crafted in 22K Gold with Kundan settings. Features uncut diamonds (Polki diamonds) with exceptional brilliance",
    "complemented by high-quality natural pearls. Accented with Ruby and Emerald gemstone cabochons. Finished with a lustrous Hyderabadi Polish."
  ],
  "features": "This exquisite Haaram features intricate peacock motifs and delicate floral patterns rendered in Kundan artistry. The cascading design culminates in a grand pendant, showcasing elaborate detailing and gem placement. The necklace is interspersed with perfectly round pearls that add a touch of classic charm. The Jhumka earrings echo the Haaram's design, ensuring a cohesive and regal look.",
  "colors": [
    "Predominantly gold with brilliant diamond sparkle. Accented with the rich red of the ruby and the verdant green of the emerald. The pearls provide a soft",
    "creamy white contrast."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements ( நிச்சయించుకోవడం)",
    "bridal wear",
    "and grand celebrations. An ideal choice for Seemantham (బారసాల) or any traditional South Indian ceremony where a statement piece is desired. This set is equally suitable for high-profile parties and events",
    "effortlessly blending traditional elegance with contemporary allure."
  ],
  "description": "This Haaram set is a testament to timeless craftsmanship and unparalleled elegance. The intricate Kundan work, combined with the brilliance of uncut diamonds and the gentle shimmer of pearls, creates a truly captivating piece. It is a heirloom-quality set that embodies cultural heritage and adds a touch of regal sophistication to any ensemble. The Hyderabadi polish enhances its luster and durability.",
  "tags": [
    "Haaram",
    "Kundan Jewelry",
    "Polki Diamonds",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Jhumka",
    "Pearls",
    "22K Gold",
    "Wedding Necklace",
    "Engagement Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Nakshi Work",
    "Bharatanatyam Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0402_0599",
  "collection": "diamond"
}