{
  "id": "necklaces-453",
  "title": "Enchanting Kasulaperu Inspired Necklace with Emerald Accents and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 3.78 DWT for the necklace",
    "1.06 DWT for the locket)",
    "Faceted Rubies (approximately 1.03 CTW on necklace",
    "0.53 CTW on locket)",
    "Emeralds (approximately 0.68 CTW on necklace",
    "0.42 CTW on locket)",
    "South Sea Pearls (13.90 CTW necklace",
    "9.85 CTW locket)",
    "meticulously set in a secure prong setting. Features a brilliant Hyderabadi Polish for exceptional luster."
  ],
  "features": "This exquisite necklace blends traditional Telugu design elements with a modern aesthetic. The necklace itself has intricate geometric patterns, embellished with rubies. Emeralds are incorporated at the central design, continuing into the pendant. The pendant is inspired by the traditional Kasulaperu design, with a floral motif at its center. Delicate pearl drops add movement and elegance. The setting emphasizes gemstone brilliance and durability.",
  "colors": [
    "Predominantly gold with vibrant ruby red accents",
    "complemented by the rich green of the emeralds and the creamy white of the South Sea pearls. This harmonious color palette is a classic choice for South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals (like Diwali or Sankranti)",
    "and special occasions. This piece transitions effortlessly from traditional ceremonies to contemporary celebrations."
  ],
  "description": "This necklace is a testament to exquisite craftsmanship and timeless design. The combination of 22K gold, vibrant gemstones, and lustrous pearls creates a piece of lasting value. The modern interpretation of the traditional Kasulaperu design makes it a versatile addition to any jewelry collection. It offers a sophisticated blend of cultural heritage and contemporary style, making it a truly special heirloom piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kasulaperu",
    "Ruby",
    "Emerald",
    "Pearl",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Contemporary Design",
    "Nischitartham",
    "Vivahaalu",
    "Mutyala Haaram",
    "Padakam",
    "Kempu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-49 3_0916",
  "collection": "diamond"
}