{
  "id": "necklaces-1049",
  "title": "Polki and Pink Tourmaline Kasulaperu Style Necklace - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds",
    "Pink Tourmaline Beads",
    "Cultured Pearls. Hyderabadi Polish for lasting brilliance."
  ],
  "features": "A stunning Kasulaperu-inspired necklace featuring meticulously set Polki diamonds in a floral motif. The central pendants are adorned with triangle-cut pink tourmalines, framed by intricate Polki settings. Delicate strands of lustrous cultured pearls and vibrant pink tourmaline beads cascade gracefully, adding movement and charm.",
  "colors": [
    "Radiant yellow gold",
    "sparkling white Polki diamonds",
    "soft pink tourmaline",
    "and creamy white pearls create a harmonious and elegant color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "receptions",
    "festive occasions (Pandugalu)",
    "or any special celebration where you want to make a statement. Also suitable for modern formal events."
  ],
  "description": "This necklace is a harmonious blend of traditional South Indian design and contemporary elegance. The use of uncut Polki diamonds gives it a unique character and heirloom quality. The pink tourmalines add a pop of color and femininity. Crafted with the highest standards of quality and durability, this necklace is a timeless investment that you will cherish for years to come. A true symbol of Telugu heritage and refined taste.",
  "tags": [
    "Haaram",
    "Polki",
    "Diamonds",
    "Pink Tourmaline",
    "Pearls",
    "South Indian Jewelry",
    "Kasulaperu",
    "Necklace",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Navratna",
    "Vivahaalu",
    "Pandugalu"
  ],
  "original_id": "radhe_diam_DPNK8-1179_2462",
  "collection": "radhe"
}