{
  "id": "necklaces-1184",
  "title": "The Emerald Bloom Haaram: A Timeless Telugu Legacy",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity gold (purity unspecified",
    "please inquire for details)",
    "this exquisite Haaram features dazzling white sapphires (7.73 carats total weight). It is beautifully accented with vibrant emeralds (19.80 carats total weight) and subtle rubies (16.20 carats). The pendant is finished with lustrous South Sea pearls (10.15 total weight)."
  ],
  "features": "This Haaram showcases a delicate floral motif, a signature element of traditional Telugu jewelry. The openwork design allows light to flood through the gemstones, maximizing their brilliance. The pendant features a stylized peacock design, a symbol of grace and beauty in South Indian culture. Features a captivating blend of traditional nakshi-inspired details and contemporary setting techniques.",
  "colors": [
    "The color palette is rich and harmonious",
    "featuring the classic combination of gold",
    "sparkling white sapphires",
    "vibrant emerald green",
    "and subtle ruby red. The white of the pearl complements the gemstones",
    "creating a regal and sophisticated look."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements",
    "milestone birthdays",
    "and other special celebrations. A stunning choice for traditional Telugu ceremonies like the Seemantham (baby shower) or half-saree function."
  ],
  "description": "This Haaram is a true statement piece, blending the timeless beauty of traditional South Indian design with modern elegance. The exceptional craftsmanship and high-quality gemstones ensure it will be a treasured heirloom for generations to come. Its unique design is a conversation starter, adding a touch of royalty to any ensemble. Invest in a piece of cultural heritage that will only appreciate in value.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emeralds",
    "Sapphires",
    "Pearls",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Nakshi",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Vivaha",
    "Seemantham",
    "Half-Saree",
    "Hyderabad Jewelry",
    "Peacock Design",
    "Heirloom Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-09 2_1736",
  "collection": "sjpl"
}