{
  "id": "necklaces-966",
  "title": "Diamond Floral Mini Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VS Clarity",
    "G-H Color)",
    "Natural Ruby (cabochon)",
    "Natural Emeralds (cabochon). Features Hyderabadi Polish for a lustrous finish."
  ],
  "features": "This exquisite mini haaram features a delicate floral design meticulously handcrafted by our skilled artisans. Each flower is studded with dazzling brilliant-cut diamonds. The necklace incorporates floral motifs and alternating ruby and emerald accents for a vibrant touch. The use of cabochon cut stones gives it a softer, more elegant feel. The design seamlessly blends traditional Indian aesthetics with a modern minimalist approach.",
  "colors": [
    "Yellow Gold",
    "White (Diamonds)",
    "Red (Ruby)",
    "Green (Emerald). A classic and auspicious color combination."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "anniversaries",
    "and festive occasions like Diwali",
    "Sankranthi",
    "and Ugadi. Its understated elegance also makes it suitable for modern social gatherings."
  ],
  "description": "This Diamond Floral Mini Haaram is a testament to exceptional craftsmanship and timeless design. The use of high-quality diamonds and precious gemstones ensures brilliance and longevity. Its versatile design allows you to wear it with both traditional and contemporary attire. The Hyderabadi polish enhances the gold's luster, making it a truly exquisite piece of jewelry. A valuable addition to your jewelry collection, representing lasting value and timeless beauty.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Floral Design",
    "Ruby",
    "Emerald",
    "Kanthaabharanam",
    "Gold Necklace",
    "Fine Jewelry",
    "Bridal Jewelry",
    "Festive Jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0364_2427",
  "collection": "necklace"
}