{
  "id": "necklaces-426",
  "title": "Vaibhav Lakshmi Haaram Set with Emeralds, Rubies, Diamonds, and Pearls",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold (estimated)",
    "High-Quality Round Brilliant Cut Diamonds (estimated 24.25 carats)",
    "Natural Emeralds (estimated 16.02 carats)",
    "Natural Rubies (estimated 4.53 carats)",
    "and South Sea Pearls (estimated 57.38 carats). Features a Hyderabadi Polish for enhanced luster and durability."
  ],
  "features": "This exquisite three-layered Haaram features intricate floral motifs and paisley designs, expertly crafted with a closed setting to showcase the brilliance of the diamonds and vibrant emeralds. The Haaram showcases traditional Telugu craftsmanship with the use of rubies, diamonds, pearls and emeralds. Delicate pearl drops enhance the necklace's elegance. The earrings echo the necklace's design, creating a cohesive and stunning set.",
  "colors": [
    "Predominantly gold with vibrant green emeralds",
    "red rubies",
    "sparkling white diamonds",
    "and lustrous white pearls. This classic color palette is highly auspicious in South Indian traditions."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "Seemantham (baby shower)",
    "half-saree functions (Voni Function)",
    "and other significant celebrations. Also suitable for upscale modern events and gala dinners."
  ],
  "description": "This Haaram is a true investment piece, blending timeless South Indian tradition with exceptional gemstone quality and craftsmanship. The intricate design and high-quality materials ensure lasting beauty and value. Owning this set is owning a piece of Telugu heritage and a symbol of prosperity (Vaibhav Lakshmi).",
  "tags": [
    "Haaram",
    "Necklace Set",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emeralds",
    "Rubies",
    "Diamonds",
    "Pearls",
    "22K Gold",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Nischitartham",
    "Voni Function",
    "Bridal Jewelry",
    "Kasulaperu",
    "Addigai"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-08_0867",
  "collection": "diamond"
}