{
  "id": "necklaces-1192",
  "title": "The \"Mayuri\" Nakshi Diamond Haaram - A Timeless Telugu Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finest 22K Gold (916 Gold) intricately set with Dazzling Natural Diamonds",
    "Emeralds (Pachala)",
    "Rubies (Ruby)",
    "and Tassels of South Sea Pearls; Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite Haaram showcases exceptional Nakshi craftsmanship, a signature of South Indian jewelry. The elaborate floral and peacock (Mayuri) motifs are intricately hand-carved. Features square emeralds, light purple stone details, accented by delicate pink bead tassels. The 'Gutta-pusalu' inspired pearl drops add a touch of classic charm. The complex detailing is further enhanced by the Hyderabadi polish, giving it a rich, antique-like finish.",
  "colors": [
    "Predominantly golden hue with the sparkle of brilliant white diamonds",
    "contrasted with the regal green of emeralds",
    "and the soft blush of pink pearl drops and ruby accents",
    "light purple stones."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivahaalu)",
    "Seemantham (Baby Shower)",
    "Half-Saree Functions (Voni Function)",
    "and other auspicious Telugu ceremonies. A statement piece for the modern bride seeking a blend of tradition and elegance",
    "also suited for high-end cultural events."
  ],
  "description": "A rare blend of traditional Telugu artistry and modern sophistication. The meticulous Nakshi work, combined with the brilliance of natural diamonds and the allure of emeralds and pearls, makes this Haaram a true heirloom piece. Symbolizing prosperity, love, and new beginnings, it is an investment in timeless beauty and cultural heritage. Its exceptional craftsmanship ensures durability, making it a treasure to be passed down through generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Nakshi Work",
    "Diamond Jewelry",
    "Emeralds",
    "Pearls",
    "Gutta Pusalu",
    "Wedding Jewelry",
    "Vivahaalu",
    "Antique Finish",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Heirloom Jewelry",
    "Kanthaabharanamu"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-11 3_1744",
  "collection": "sjpl"
}