{
  "id": "necklaces-811",
  "title": "Exquisite Diamond Floral Cascade Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-quality metal alloy with a radiant",
    "Hyderabadi-inspired polish. Adorned with brilliant-cut diamonds",
    "meticulously selected for their fire and clarity. Weights: G.wt:-134.560(GH)",
    "D.wt:-6.01(162)",
    "D.bg:-2.16(60)",
    "D.pan(+7):-11.01(187)",
    "D.pan(1/10):-5.18(55)",
    "D.mq(+7):-7.31(126)",
    "D.mq(-7):-0.95(31)",
    "D.mq(1/10):-1.55(15)."
  ],
  "features": "A breathtaking cascade of floral motifs, this Haaram features five graduating strands of intricately set diamonds. Each floral element is meticulously crafted, creating a mesmerizing play of light and brilliance. The arrangement evokes traditional South Indian design principles while incorporating a modern, lightweight feel.",
  "colors": [
    "Predominantly a dazzling white due to the diamonds",
    "with the metal adding a subtle underlying shimmer."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivah)",
    "receptions",
    "and milestone celebrations. Its exquisite design also makes it suitable for important cultural events like Seemantham or Half-Saree functions."
  ],
  "description": "This Diamond Floral Cascade Haaram is more than just jewelry; it's a statement of timeless elegance. Its design cleverly blends traditional South Indian aesthetics with contemporary trends. The exquisite diamond setting and lightweight construction make it comfortable to wear for extended periods. A true heirloom piece to be treasured for generations.",
  "tags": [
    "Diamond Haaram",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Hyderabadi Jewelry",
    "Diamond Necklace",
    "Bridal Jewelry",
    "Vivah",
    "Seemantham",
    "Half Saree Function",
    "Floral Design",
    "Cascade Necklace",
    "Telangana Jewelry",
    "Andhra Jewelry",
    "Telugu Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-44_1405",
  "collection": "diamond"
}