{
  "id": "necklaces-792",
  "title": "Exquisite Navarathna Haaramaala - A Symphony of Nine Gems",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "adorned with a medley of natural Navarathna gemstones (Ruby",
    "Diamond",
    "Emerald",
    "Yellow Sapphire",
    "Pearl",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye",
    "Coral). Features meticulously cut Marquise (MQ) and Pear-shaped (PAN) diamonds. Finished with a signature Hyderabadi polish for enduring radiance."
  ],
  "features": "A breathtaking statement piece showcasing the auspicious Navarathnas. The intricate design features a floral-inspired arrangement, with each gemstone carefully selected and set to maximize its brilliance. Delicate Diamond accents enhance the vibrant colors of the Navarathnas. The necklace is designed to sit elegantly on the neckline, highlighting the wearer's natural beauty.",
  "colors": [
    "Multicolor: A rich palette featuring the vibrant hues of the Navarathna gemstones - deep red (Ruby)",
    "sparkling white (Diamond)",
    "lush green (Emerald)",
    "sunny yellow (Yellow Sapphire)",
    "creamy white (Pearl)",
    "deep blue (Blue Sapphire)",
    "honey brown (Hessonite)",
    "shimmering gray (Cat's Eye)",
    "and fiery orange (Coral). The gold setting provides a warm and luxurious backdrop."
  ],
  "occasions": [
    "Ideal for grand celebrations",
    "weddings",
    "milestone anniversaries",
    "and religious ceremonies. Perfect for a traditional South Indian bride during her muhurtham or seemantham. Also suitable for formal events where you want to make a lasting impression."
  ],
  "description": "A masterpiece of craftsmanship, this Navarathna Haaram is not only visually stunning but also carries deep cultural significance. Navarathnas are believed to bring prosperity, good health, and protection to the wearer. This necklace is a valuable heirloom piece that can be cherished for generations to come. The exquisite Hyderabadi polish ensures lasting brilliance and durability.",
  "tags": [
    "Navarathna",
    "Haaram",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Diamond Necklace",
    "Gemstone Necklace",
    "Indian Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Haaramaala",
    "Auspicious Jewelry",
    "Grand Celebration",
    "Seemantham",
    "Muhurtham",
    "Statement Necklace",
    "Handcrafted Jewelry",
    "Heirloom Piece"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-32 3_1360",
  "collection": "diamond"
}