{
  "id": "necklaces-323",
  "title": "Divya Jyothi Diamond Haaram with Ruby Accents and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color)",
    "Faceted Ruby Cabochons",
    "Natural South Sea Pearls. The gold is finished with a traditional Hyderabadi polish for a lasting luster."
  ],
  "features": "This exquisite haaram features a delicate floral and paisley design meticulously crafted with pavé-set diamonds. The central pendant showcases a larger ruby cabochon surrounded by intricate diamond detailing, echoing the floral motifs of the necklace. The addition of lustrous South Sea pearl drops adds a touch of classic elegance. The design draws inspiration from traditional South Indian jewellery but with a modern, lighter feel.",
  "colors": [
    "Primarily gold and white from the diamonds",
    "accented by the vibrant red of the rubies and the creamy white of the pearls."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "receptions",
    "engagement ceremonies",
    "and other special occasions. Its elegant design also makes it suitable for upscale parties and cultural events."
  ],
  "description": "This haaram is a stunning blend of traditional South Indian aesthetics and contemporary design. The high-quality diamonds sparkle brilliantly, and the ruby accents add a pop of color. The use of South Sea pearls elevates the piece, making it a timeless heirloom. The craftsmanship is impeccable, ensuring durability and lasting beauty.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Ruby Jewelry",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Traditional Jewelry",
    "Indian Bridal Jewelry",
    "Fine Jewelry",
    "18K Gold",
    "VVS Diamonds",
    "South Sea Pearls",
    "Kanthi",
    "Kasulaperu",
    "Andhra Jewelry",
    "Telangana Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0434_0619",
  "collection": "diamond"
}