{
  "id": "necklaces-112",
  "title": "Moti Polki Jadau Choker with Emerald Drops: A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "22K Gold (916 Gold)",
    "Hyderabadi Seed Pearls (Moti)",
    "Uncut Diamonds (Polki)",
    "Zambian Emeralds. Features a rich",
    "antique gold finish."
  ],
  "features": "This exquisitely handcrafted choker and earring set embodies the traditional Jadau Kundan setting, with each polki diamond meticulously placed. The multi-strand pearl choker (Gutta Pusalu inspired) is punctuated with emerald and polki encrusted motifs. The pendant and earrings feature cascading emerald drops, adding a touch of regal charm. The back features intricate gold detailing, showcasing superior craftsmanship.",
  "colors": [
    "Predominantly White (Pearls)",
    "Green (Emeralds)",
    "and Antique Gold. The classic combination of colors symbolizes prosperity and growth."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals (Ugadi",
    "Sankranthi",
    "Diwali)",
    "and traditional South Indian ceremonies like Seemantham or Half-Saree Function (Langa Voni Function). Also suitable for high-end parties and cultural events."
  ],
  "description": "This set is a testament to the enduring beauty of traditional Hyderabadi jewelry. The use of genuine polki diamonds and Zambian emeralds ensures lasting value. The intricate Jadau craftsmanship, passed down through generations, makes this a true heirloom piece. The combination of traditional and modern aesthetics makes it versatile for various occasions. The Hyderabadi seed pearls are known for their lustre and are perfectly complemented by the antique gold finish.",
  "tags": [
    "Jadau Jewelry",
    "Polki Diamonds",
    "Zambian Emeralds",
    "Pearl Necklace",
    "Gutta Pusalu",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Vivahaalu",
    "Moti",
    "Kundan",
    "Haram",
    "Choker",
    "Earrings",
    "Nischitartham",
    "Seemantham",
    "Langa Voni Function"
  ],
  "original_id": "diamond_jewellery_DPNK8-1450_0345",
  "collection": "diamond"
}