{
  "id": "necklaces-1055",
  "title": "Polki & Ruby Floral Raasi Haaram - A Timeless Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Natural Polki Diamonds (Uncut Diamonds)",
    "Faceted Rubies. The gold used is ethically sourced and meticulously crafted. Polki diamonds are selected for their unique character and brilliance. The rubies are hand-picked for their vibrant color and clarity."
  ],
  "features": "Circular Polki diamond settings resembling blooming flowers are intricately linked together. Each flower setting features a delicate cluster of Polki diamonds arranged in a circular pattern, showcasing the beauty of uncut diamonds. Trillion-cut rubies are suspended below each Polki flower, adding a touch of classic South Indian flair with the traditional 'Addigai' style. The overall design balances traditional grandeur with modern elegance, making it a truly versatile piece.",
  "colors": [
    "The dominant colors are the warm",
    "rich yellow of the 22K gold",
    "the icy white of the Polki diamonds",
    "and the deep",
    "passionate red of the rubies. This classic combination evokes a sense of timeless beauty and luxury",
    "very popular in Telugu wedding jewelry."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (Pelli)",
    "engagements (Nischitartham)",
    "bridal showers (Seemantham)",
    "and other festive celebrations. This Haaram is equally fitting for a grand reception or a sophisticated evening event. Its versatility makes it a treasured addition to any jewelry collection."
  ],
  "description": "This Polki & Ruby Floral Raasi Haaram is a testament to the exquisite craftsmanship and rich heritage of Hyderabad's jewelry tradition. The use of natural Polki diamonds and vibrant rubies creates a mesmerizing effect. The traditional design is perfect for the modern woman who appreciates timeless elegance and cultural significance. A unique and heirloom-worthy piece, crafted to be cherished for generations. A true conversation starter, reflecting your impeccable taste and appreciation for artistry.",
  "tags": [
    "Polki Necklace",
    "Diamond Necklace",
    "Ruby Necklace",
    "Haaram",
    "Addigai",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Fine Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Pelli",
    "Seemantham",
    "మెడలో వేసుకునే నగలు",
    "పాతకాలపు నగలు",
    "వజ్రాల నగలు"
  ],
  "original_id": "radhe_diam_DPNK8-1410_2468",
  "collection": "radhe"
}