{
  "id": "necklaces-1554",
  "title": "Enchanting Floral Cascade Necklace - A Modern Take on the Traditional Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-quality mixed metals with a pristine white finish",
    "meticulously set with a captivating array of precious and semi-precious gemstones including pink tourmaline",
    "blue sapphires",
    "and vibrant yellow citrine. The piece is encrusted with dazzling cubic zirconia creating a brilliant sparkle."
  ],
  "features": "A captivating cascade design featuring stylized floral motifs. The arrangement showcases a harmonious blend of gemstones, set in a modern prong and pave setting style. The intricate details create a three-dimensional effect. The central motif adds focal point enhancing the necklace's overall appeal.",
  "colors": [
    "A vibrant palette of pinks",
    "blues",
    "yellows",
    "and whites",
    "creating a cheerful and eye-catching composition."
  ],
  "occasions": [
    "Perfect for grand celebrations",
    "cocktail parties",
    "wedding receptions",
    "or any special occasion where you want to make a lasting impression. A show-stopping piece for formal gatherings and high-end events."
  ],
  "description": "This statement necklace seamlessly blends contemporary design with timeless elegance. The vibrant gemstone palette and intricate craftsmanship make it a true work of art. Durable construction ensures lasting beauty, while the unique design will set you apart from the crowd. An excellent investment for your jewelry collection.",
  "tags": [
    "Necklace",
    "Statement Jewelry",
    "Floral Necklace",
    "Gemstone Necklace",
    "Cocktail Jewelry",
    "Party Jewelry",
    "Fashion Necklace",
    "High Fashion",
    "Luxury Jewelry",
    "Occasion Jewelry",
    "White Metal Jewelry",
    "Cubic Zirconia",
    "Pink Tourmaline",
    "Blue Sapphire",
    "Yellow Citrine"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-31_2233",
  "collection": "sjpl"
}