{
  "id": "necklaces-366",
  "title": "Rani Haaram: Diamond Delight with Ruby Accents and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold)",
    "Certified Diamonds (VVS Clarity",
    "Excellent Cut)",
    "Natural Ruby Center Stones",
    "Cultured Pearls. Features a unique Hyderabadi Polish for a lasting shine."
  ],
  "features": "Elaborate floral and paisley motifs intricately set with sparkling diamonds. The necklace showcases two central pendants, each adorned with a square cut ruby. Delicate pearl drops enhance the overall elegance. The piece boasts a modern interpretation of traditional South Indian nakshi work, blended seamlessly with contemporary design.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant red rubies and creamy white pearls."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "bridal showers",
    "and other grand celebrations. Also suitable for Seemantham (శ్రీమంతం)",
    "Half-Saree Functions (బాలిక సారీ వేడుక)",
    "and significant family events."
  ],
  "description": "A breathtaking statement piece combining the best of traditional craftsmanship with modern aesthetics. The high-quality diamonds and genuine rubies ensure enduring beauty and value. The Hyderabadi Polish guarantees a lasting luster. This Haaram embodies prosperity and good fortune, making it an ideal heirloom piece to be cherished for generations. A true investment in timeless elegance.",
  "tags": [
    "Haaram",
    "Bridal Necklace",
    "Diamond Necklace",
    "Ruby Necklace",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "VVS Diamonds",
    "Wedding Jewelry",
    "Kanthaabharanam",
    "పెళ్లి నగలు",
    "నిశ్చితార్థం",
    "Ruby",
    "Pearls"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0480_0662",
  "collection": "diamond"
}