{
  "id": "necklaces-1078",
  "title": "Heirloom Pastel Navratna Haaram with Polki Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Antique Finish; Natural Polki Diamonds; Navratna Gemstones including Tanzanite",
    "Ruby",
    "Sapphire",
    "Emerald; Freshwater Pearls."
  ],
  "features": "This stunning Haaram features a unique design blending traditional Navratna elements with a modern pastel color palette. The necklace showcases intricately crafted polki diamond settings around each gemstone, creating a beautiful contrast with the antique gold finish. The central pendant boasts a statement Tanzanite cabochon, surrounded by smaller polkis. Delicate strands of freshwater pearls and emerald beads are suspended throughout the necklace, adding a touch of ethereal beauty.",
  "colors": [
    "Antique Gold",
    "Pastel Blue (Tanzanite & Sapphire)",
    "Light Pink (Ruby)",
    "Emerald Green",
    "White (Polki Diamonds & Pearls)."
  ],
  "occasions": [
    "Perfect for contemporary brides",
    "grand celebrations",
    "destination weddings",
    "Receptions",
    "and special occasions where you want to make a statement."
  ],
  "description": "This piece offers a unique blend of traditional Navratna principles and contemporary design. The high-quality Polki diamonds, coupled with the rare pastel gemstone selection, make it a truly one-of-a-kind heirloom piece. The antique gold finish and meticulous craftsmanship ensure lasting beauty and value. This is a statement piece showcasing a modern take on a timeless classic.",
  "tags": [
    "Haaram",
    "కంఠాభరణం",
    "Navratna",
    "Polki Diamond",
    "Antique Gold",
    "South Indian Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Necklace",
    "Tanzanite",
    "Ruby",
    "Sapphire",
    "Emerald",
    "Pearls",
    "Contemporary Jewelry",
    "Statement Necklace",
    "Hyderabad Jewelry",
    "Seemantham Jewelry",
    "Half-Saree Function",
    "Festival Jewelry",
    "Heirloom Jewelry"
  ],
  "original_id": "radhe_diam_DPNK8-1787_2491",
  "collection": "radhe"
}