{
  "id": "necklaces-033",
  "title": "Diamond 'Addigai' Pendant - Radiant Sparkle, Modern Elegance",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold",
    "Round Brilliant Cut Diamonds (VS Clarity",
    "G Color). Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisitely crafted pendant showcases a modern interpretation of the classic Addigai style. It features a circular cluster of meticulously set diamonds surrounded by a delicate, openwork gold frame adorned with more sparkling diamonds. A single gold bead dangles gracefully below, adding a touch of traditional charm to the contemporary design.",
  "colors": [
    "Predominantly gold with brilliant white diamonds",
    "creating a striking contrast and sophisticated appeal."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "anniversaries",
    "and any special occasion where you desire a touch of radiant elegance. This pendant complements both traditional South Indian attire like sarees and lehengas",
    "as well as contemporary outfits."
  ],
  "description": "This Addigai pendant represents a seamless blend of tradition and modern aesthetics. The brilliant diamonds catch the light beautifully, creating a captivating sparkle that will turn heads. Crafted with the highest quality materials and exceptional attention to detail, this pendant is a timeless investment that you will cherish for years to come. It's a testament to Hyderabadi craftsmanship and refined elegance.",
  "tags": [
    "Addigai",
    "Pendant",
    "Diamond",
    "Gold",
    "Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Fine Jewelry",
    "22K Gold",
    "Vivaha",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Telugu Jewelry",
    "VS Clarity Diamonds",
    "G Color Diamonds",
    "Ladies Jewelry"
  ],
  "original_id": "diamond_jewellery_0aa00fb7-f6bf-48a9-b654-ff7c89d3fb54_0076",
  "collection": "diamond"
}