{
  "id": "earrings-579",
  "title": "Emerald & Diamond Chandbali Jhumkas - A Timeless Telugu Classic",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated. High-quality Cubic Zirconia (CZ) stones",
    "Faceted Emerald",
    "and Cultured Pearls. Features a lustrous Hyderabadi Polish for enhanced shine and durability."
  ],
  "features": "Intricately designed Chandbali style earrings with a cascading Jhumka. The central Emerald is meticulously set amidst a dazzling array of CZ stones. Features a delicate filigree design and elegant pearl drops. The top portion of the earrings features a floral design, which is a recurring theme in South Indian jewelry. The earrings are lightweight and comfortable to wear.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (CZ)",
    "and Pearl White. A classic South Indian color palette that exudes elegance."
  ],
  "occasions": [
    "Perfect for weddings (pellillu)",
    "receptions",
    "Sangeet",
    "Mehendi",
    "or any festive occasion. Also suitable for special occasions such as Diwali",
    "Ugadi",
    "or a half-saree function (langa voni)."
  ],
  "description": "These earrings blend traditional South Indian design with modern aesthetics. The high-quality materials ensure lasting beauty and durability. The radiant Emeralds and sparkling CZ stones create a captivating look that will turn heads. A symbol of grace and sophistication, these Chandbalis are a valuable addition to any jewelry collection and a cherished keepsake for generations to come.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Emerald",
    "CZ",
    "Pearls",
    "Hyderabad Jewelry",
    "చెవి దుద్దులు",
    "Pellillu",
    "Festive",
    "Indian Wedding",
    "Traditional Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-26_1751",
  "collection": "sjpl"
}