{
  "id": "necklaces-700",
  "title": "Divine Mohana Haaram: Peacock and Sapphire Symphony",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "High-Quality Sapphires (Deep Blue)",
    "Round Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color)",
    "Small Rubies",
    "Finished with Hyderabadi Polish"
  ],
  "features": "This exquisite Mohana Haaram showcases the revered peacock motif (Mayura) intricately embedded within a floral diamond design. The centerpiece features stunning deep blue sapphires set in a delicate pave setting, surrounded by dazzling diamonds. The unique graduated design leads to a central pendant-like arrangement with dangling gold beads (Gundla Potlu). The peacock detailing continues up the necklace, interspersed with small rubies for subtle contrast. The use of open settings maximizes the brilliance of the diamonds. Features exquisite filigree work.",
  "colors": [
    "Gold (Yellow)",
    "White (Diamonds)",
    "Deep Blue (Sapphires)",
    "Red (Rubies)"
  ],
  "occasions": [
    "Ideal for weddings",
    "grand receptions",
    "muhurtham",
    "seemantham ceremonies",
    "and upscale cultural events. A statement piece for brides and for special occasions where traditional elegance is desired."
  ],
  "description": "A blend of traditional South Indian Haaram design with a modern touch. The intricate craftsmanship and use of high-quality gemstones make this a timeless heirloom. The peacock motif symbolizes beauty, royalty, and immortality, making it an auspicious choice. Features Hyderabadi polish for lasting shine and durability. The use of certified diamonds ensures value and ethical sourcing.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Diamond Necklace",
    "Sapphire Necklace",
    "Peacock Jewelry",
    "Mayura",
    "Gundla Potlu",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Traditional Jewelry",
    "Seemantham",
    "Muhurtham",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-55 2_1206",
  "collection": "diamond"
}