{
  "id": "necklaces-1241",
  "title": "Navaratan Kasulaperu Haaram with Polki Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds",
    "Mixed Navaratna Gemstones (Ruby",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Diamond",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "Hyderabadi Polish"
  ],
  "features": "Inspired by the traditional Kasulaperu, this Haaram features a modern twist with individually bezel-set Navaratna gemstones surrounded by glittering Polki diamonds. The unique freeform shape of the gems adds an organic touch, while the gold setting enhances the vibrancy of each stone. Exquisite craftsmanship ensures a comfortable drape and secure setting.",
  "colors": [
    "Multicolor (Red",
    "White",
    "Coral",
    "Green",
    "Yellow",
    "Blue",
    "Brown) gemstones with a golden yellow metal base and sparkling white Polki diamonds. This blend of colors is considered highly auspicious in Telugu tradition."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions",
    "and special celebrations like Seemantham (సీమంతం) or Ugadi (ఉగాది). Also a striking statement piece for modern events",
    "adding a touch of South Indian heritage to contemporary attire."
  ],
  "description": "This Navaratna Haaram is a celebration of South Indian heritage and contemporary design. The use of authentic Navaratna stones is believed to bring good fortune and prosperity to the wearer. The Polki diamonds add a touch of luxury, while the Hyderabadi polish provides a rich, lasting shine. A valuable investment and a treasured heirloom piece.",
  "tags": [
    "Necklace",
    "Haaram",
    "Navaratna",
    "Kasulaperu",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Temple Jewellery",
    "Hyderabad Jewelry",
    "Wedding Jewellery",
    "Traditional Jewellery",
    "ఆభరణాలు",
    "హారం",
    "నవరత్న",
    "పెళ్లి",
    "సీమంతం",
    "ఉగాది",
    "పాలికి డైమండ్స్"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-45-07 2_1835",
  "collection": "sjpl"
}