{
  "id": "earrings-613",
  "title": "Blossom Cascade Diamond and Gemstone Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in Fine Gold (FG",
    "34.740 grams) and adorned with 498 Brilliant Cut Diamonds (3.77 carats)",
    "Marquise Cut Colored Gemstones (0.42 carats) and Pan Cut Colored Gemstones (1.67 carats)",
    "18.35 carats of 22 stones"
  ],
  "features": "A modern take on the traditional Jhumka, these earrings feature a delicate floral cascade design. Brilliant-cut diamonds pave the stylized floral elements, while marquise and pan-cut gemstones are nestled along the stem, creating a vibrant colour palette. The setting style accentuates the sparkle of the diamonds and the unique hues of the colored gemstones. This unique style blends modern aesthetics with the classic Indian appreciation for floral motifs.",
  "colors": [
    "Primarily white (diamonds) with accents of yellow",
    "pink",
    "and blue from the colored gemstones. The gold provides a warm",
    "underlying tone."
  ],
  "occasions": [
    "Perfect for festive gatherings",
    "parties",
    "or adding a touch of elegance to your everyday wear. Suitable for both traditional Indian attire and modern outfits. Can be worn during special celebrations."
  ],
  "description": "These earrings are a unique blend of traditional inspiration and contemporary design, showcasing exceptional craftsmanship. The combination of dazzling diamonds and colorful gemstones creates a captivating and versatile piece. The high-quality materials ensure lasting beauty and value. The floral design symbolizes joy and prosperity, making it a meaningful gift.",
  "tags": [
    "Earrings",
    "Jhumka",
    "Diamond Jewelry",
    "Gemstone Jewelry",
    "Floral Design",
    "Contemporary Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "partywear",
    "Gift",
    "Festival"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-30-49-1_1832",
  "collection": "sjpl"
}