{
  "id": "necklaces-1219",
  "title": "Emerald Radiance Haaram with Diamond Vines",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (61.170 g)",
    "Round Cut Diamonds (6.36 carats)",
    "Oval Cabochon Emeralds (19.02 carats). The gold features a brilliant Hyderabadi Polish for a lasting shine."
  ],
  "features": "This stunning Haaram showcases a contemporary take on traditional South Indian designs. Oval Emeralds are meticulously bezel-set and surrounded by a halo of sparkling diamonds. The delicate diamond vines gracefully cascade down from each Emerald, creating a mesmerizing effect. The design culminates in a singular Emerald drop. Meticulously crafted by skilled artisans, this piece reflects superior craftsmanship and attention to detail.",
  "colors": [
    "Vibrant green emeralds contrast beautifully with the warm yellow gold and the dazzling white diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "engagements",
    "and grand celebrations. This piece adds a touch of sophistication and cultural significance",
    "ideal for both modern and traditional attire. Makes a statement at any upscale event."
  ],
  "description": "This Haaram is a harmonious blend of tradition and modern aesthetics. The emeralds, known for their association with prosperity and good fortune, are complemented by the brilliance of meticulously set diamonds. The Hyderabadi polish ensures a lasting shine, while the robust gold setting guarantees durability. This heirloom-quality piece is not only a beautiful accessory but also an investment in timeless elegance and cultural heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaaham",
    "Seemantham",
    "Engagement",
    "Fine Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Jadau",
    "Guttapusalu"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-52_1793",
  "collection": "sjpl"
}