{
  "id": "earrings-274",
  "title": "Mayura Jhumkaalu: Diamond and Gemstone Peacock Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K Rose Gold and White Gold",
    "set with brilliant-cut Diamonds",
    "Pink Tourmaline",
    "and Smoky Quartz. Features a Hyderabadi Polish for enhanced luster."
  ],
  "features": "A modern interpretation of the classic Jhumka, these earrings feature a graceful peacock (Mayura) motif. The peacock's crest is crafted from rose gold, while the plumage is delicately rendered in white gold and encrusted with sparkling diamonds. Pink tourmaline and smoky quartz cascade below, adding a touch of color and elegance. The diamonds are individually set for maximum brilliance.",
  "colors": [
    "Rose Gold",
    "White Gold",
    "White (Diamonds)",
    "Pink (Tourmaline)",
    "Smoky Brown (Smoky Quartz)"
  ],
  "occasions": [
    "Perfect for contemporary celebrations",
    "cocktail parties",
    "or adding a touch of South Indian elegance to your everyday attire. Can also be worn at pre-wedding events like Sangeet or Mehendi."
  ],
  "description": "These Jhumkaalu are a unique fusion of traditional South Indian design and modern aesthetics. The use of high-quality diamonds and vibrant gemstones ensures lasting beauty and value. The peacock motif symbolizes beauty, royalty, and love, making these earrings a meaningful and stylish addition to any jewelry collection. The contrasting gold tones and gemstone colors create a visually stunning piece that will surely turn heads.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Peacock Jewelry",
    "Diamond Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Mayura",
    "Rose Gold",
    "White Gold",
    "Pink Tourmaline",
    "Smoky Quartz",
    "Hyderabadi Jewelry",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "Muhurtham Jewelry",
    "Sangeet Jewelry",
    "Mehendi Jewelry",
    "Designer Earrings",
    "Latest Design"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-12-30-43_0947",
  "collection": "diamond"
}