{
  "id": "bangles-145",
  "title": "Vaak - Emerald & Diamond Embellished Gold Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold",
    "Brilliant-cut Diamonds (VS clarity",
    "G-H color)",
    "Natural Emerald (Oval Cut). Features a traditional Hyderabadi polish for a rich",
    "lustrous finish."
  ],
  "features": "This exquisitely crafted bangle showcases a delicate, ornate design reminiscent of traditional South Indian floral motifs. The centerpiece is a vibrant oval-cut Emerald surrounded by a halo of sparkling diamonds. Intricate filigree work and meticulous stone settings highlight the skill of our master artisans. The bangle features an openwork design, allowing light to enhance the brilliance of the diamonds.",
  "colors": [
    "Predominantly gold",
    "with the contrasting emerald green and the sparkling white diamonds creating a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festivals (Ugadi",
    "Sankranthi",
    "Dussehra",
    "Diwali)",
    "and special occasions (anniversaries",
    "milestone birthdays). Also suitable for adding a touch of elegance to modern attire."
  ],
  "description": "This Vaak bangle seamlessly blends traditional South Indian design with contemporary aesthetics. The use of high-quality materials, including 22K gold and carefully selected emeralds and diamonds, ensures both durability and enduring beauty. The intricate craftsmanship and attention to detail make this piece a true heirloom, representing a timeless expression of South Indian heritage. Its flexibility makes it a comfortable everyday wear.",
  "tags": [
    "Bangle",
    "Kadiyam",
    "Gold Jewelry",
    "Diamond Jewelry",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Fine Jewelry",
    "Indian Bangle"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0415_0612",
  "collection": "diamond"
}