{
  "id": "necklaces-931",
  "title": "Divya Lakshmi Kasu Haaram - A Divine Diamond Embrace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Brilliant Cut Diamonds (VVS Clarity",
    "EF Color)",
    "Natural Emeralds",
    "Natural Rubies",
    "South Sea Pearls. Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite Kasu Haaram showcases traditional Telugu craftsmanship. The intricately designed 'Kasu' (coin) motifs are pave-set with dazzling diamonds. A central temple design pendant features a miniature Lakshmi idol, hand-carved with remarkable detail, framed by delicate floral filigree. The pendant is further embellished with pear-shaped emeralds and rubies. Dangles of lustrous South Sea Pearls add a touch of classic elegance.",
  "colors": [
    "Predominantly gold with brilliant diamond sparkle. Accents of vibrant green (emerald)",
    "deep red (ruby)",
    "and creamy white (pearls) create a rich",
    "auspicious palette."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "engagement ceremonies (Nischitartham)",
    "festivals (Ugadi",
    "Diwali)",
    "and other auspicious occasions. Perfect for Muhurtham attire",
    "Seemantham celebrations",
    "or a grand half-saree function (Langa Voni). Also suitable for high-end gala events where a touch of traditional opulence is desired."
  ],
  "description": "A timeless heirloom piece embodying the richness of South Indian tradition. The hand-carved Lakshmi idol represents prosperity and blessings. The high-quality diamonds and gemstones ensure lasting brilliance and value. This Haaram is a statement piece that will be treasured for generations. Its versatility allows it to be paired with both traditional sarees and contemporary outfits, making it a valuable addition to any jewelry collection.",
  "tags": [
    "Kasu Haaram",
    "Necklace",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Lakshmi Pendant",
    "Diamond Necklace",
    "Emeralds",
    "Rubies",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Hyderabadi Jewelry",
    "22K Gold",
    "பாரம்பரிய நகை",
    "లక్ష్మి హారం",
    "కెంపులు",
    "పచ్చలు",
    "ముత్యాలు"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0325_2392",
  "collection": "necklace"
}