{
  "id": "earrings-518",
  "title": "Vaishnavi Polki Jhumka: Exquisite Ruby & Polki Diamond Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Ruby (Manikyam)",
    "Emeralds (Pachalu). Features Hyderabadi Polish for enhanced luster and a lasting shine."
  ],
  "features": "These stunning jhumkas showcase a unique blend of traditional and contemporary design. The centerpiece features a square ruby, framed by Polki diamonds in a delicate setting. The design incorporates a floral motif with uncut Polki diamonds radiating outwards. The top is adorned with emerald beads in a floral arrangement, a touch of nature-inspired elegance. A dainty pink tourmaline teardrop dangles gracefully, adding movement and sparkle. The meticulous craftsmanship reflects the heritage of Hyderabad's jewelry artistry.",
  "colors": [
    "Predominantly Gold with contrasting Ruby red",
    "Emerald green",
    "Pink tourmaline",
    "and the scintillating white of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for special occasions like weddings (vivaham)",
    "engagements (nischitartham)",
    "festivals (sankranthi",
    "ugadi",
    "dussehra)",
    "and grand celebrations. Also suitable for adding a touch of elegance to contemporary Indian attire."
  ],
  "description": "These Vaishnavi Polki Jhumkas are a testament to timeless elegance. The combination of traditional Polki diamonds with vibrant gemstones and a modern design makes them a versatile and eye-catching piece. The high-quality materials, expert craftsmanship, and traditional Hyderabadi polish ensure enduring beauty and value. An investment that will be cherished for generations.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Polki Diamonds",
    "Uncut Diamonds",
    "Ruby",
    "Manikyam",
    "Emerald",
    "Pachalu",
    "Gold Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "చెవి దుద్దులు",
    "జుంకా",
    "మాణిక్యం",
    "పచ్చలు",
    "బంగారు ఆభరణాలు",
    "పెళ్ళి నగల"
  ],
  "original_id": "ear_rings_DPER8-988_2661",
  "collection": "ear"
}