{
  "id": "necklaces-382",
  "title": "Raani Haar: The Polki Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (పసిడి) with Uncut Polki Diamonds. Each diamond is carefully selected for its unique character and fire. Features a traditional Hyderabadi Polish for a rich",
    "antique luster. Accented with subtle enamel work beneath the diamonds."
  ],
  "features": "This Raani Haar features a graduating floral motif design, intricately set with uncut Polki diamonds. The necklace is designed to sit elegantly on the collarbone, showcasing the brilliance of the diamonds. It includes cascading diamond drops for added movement and sparkle. The central pendant adds a focal point, echoing the floral theme with a larger, more elaborate design. The setting is crafted using traditional Kundan techniques, ensuring each diamond is securely and beautifully displayed.",
  "colors": [
    "Predominantly gold with the white/off-white sparkle of Polki diamonds. Sublte enamel details add a soft",
    "pastel contrast."
  ],
  "occasions": [
    "Perfect for a traditional South Indian wedding (వివాహము)",
    "reception",
    "Seemantham (సీమంతం)",
    "or any grand occasion where you want to make a statement. Also suitable for upscale galas and formal events."
  ],
  "description": "This exquisite Raani Haar is a timeless heirloom, handcrafted by master artisans in Hyderabad. It combines traditional techniques with exceptional quality materials, resulting in a piece that is both culturally significant and breathtakingly beautiful. The use of uncut Polki diamonds gives it a unique character and unmatched sparkle. Its sturdy construction ensures years of enjoyment, making it a true investment piece.",
  "tags": [
    "Polki Diamonds",
    "Raani Haar",
    "South Indian Jewelry",
    "Indian Bridal Jewelry",
    "Hyderabad Jewelry",
    "Kundan Setting",
    "Uncut Diamonds",
    "Wedding Necklace",
    "Statement Necklace",
    "Ethnic Jewelry",
    "కంఠాభరణము",
    "పసిడి ఆభరణాలు",
    "పెళ్లి నగలు",
    "భారతీయ ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241218-WA0013_0775",
  "collection": "diamond"
}