{
  "id": "waistbands-011",
  "title": "Diamond and Emerald Vaddanam: The \"Haritha Lakshmi\"",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold base",
    "set with brilliant-cut diamonds (VS clarity",
    "G-H color). Features high-quality Zambian Emeralds",
    "cabochon cut",
    "complemented by carved emerald drops. Hyderabadi Polish for a lasting sheen."
  ],
  "features": "Intricate floral and paisley motifs handcrafted in a closed setting. Central Emerald is surrounded by a cluster of diamonds. The cascading emerald drops provide a graceful sway. The band features a geometric, chevron pattern, ensuring flexibility and comfort. Incorporates traditional Telugu design elements with a modern setting style.",
  "colors": [
    "Predominantly a sparkling white (diamonds) and vibrant green (emeralds) with a warm yellow gold undertone. This classic combination symbolizes prosperity and growth."
  ],
  "occasions": [
    "Perfect for weddings",
    "Seemantham ceremonies",
    "upscale parties and celebrations. A statement piece for a bride's Voni function or a grand reception. Suitable for both traditional South Indian attire and elegant contemporary outfits."
  ],
  "description": "This Vaddanam is a testament to Hyderabadi craftsmanship and reflects the rich cultural heritage of South India. The use of high-quality diamonds and vibrant Zambian emeralds makes it a valuable investment. Its unique design blends tradition with a modern aesthetic, making it a timeless piece that can be passed down through generations. The emeralds symbolize prosperity and good health, adding auspiciousness to any occasion.",
  "tags": [
    "Vaddanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Emeralds",
    "Diamonds",
    "22K Gold",
    "Traditional Jewelry",
    "Indian Jewelry",
    "ஒட்டியாணம்",
    "ఒడ్డాణం",
    "Kamarpatta"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-21_1291",
  "collection": "diamond"
}