{
  "id": "earrings-237",
  "title": "Aarya Kundan Petal Stud Earrings - Elegant Karnaphool Design",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold)",
    "Natural Kundan Polki Diamonds. Features traditional Hyderabadi Kundan setting for a rich",
    "authentic look. Gold Weight: 2.150 grams; Net Weight: 7.97 grams."
  ],
  "features": "Intricate petal design with a central cluster of Kundan Polki diamonds. The earrings feature a classic button design, reminiscent of traditional Karnaphool earrings. The Kundan setting is meticulously handcrafted, showcasing the rich heritage of Hyderabadi jewelry making. The floral motif adds a touch of femininity and grace.",
  "colors": [
    "Warm gold with the natural",
    "off-white sparkle of Kundan diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festivals (Tyohar)",
    "and traditional celebrations. These earrings are also suitable for adding a touch of elegance to modern formal events. Ideal for Muhurtham",
    "Sangeet",
    "or a special occasion."
  ],
  "description": "Crafted with authentic Hyderabadi Kundan setting, these earrings represent a timeless piece of South Indian heritage. The use of natural Kundan Polki diamonds ensures lasting brilliance and value. The traditional design makes these earrings a meaningful heirloom piece, while the modern button style ensures they can be worn with contemporary outfits as well. Durable and expertly crafted.",
  "tags": [
    "Earrings",
    "Kundan",
    "Polki",
    "Button Earrings",
    "Karnaphool",
    "Gold",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Vivaha",
    "Tyohar",
    "Muhurtham",
    "Telugu Jewelry",
    "Earrings for Sarees",
    "Ethnic Earrings"
  ],
  "original_id": "diamond_jewellery_IMG-20241219-WA0016_0796",
  "collection": "diamond"
}