{
  "id": "necklaces-1243",
  "title": "Diamond Floral Cascade Haaram - Telugu Varalakshmi Vratam Special",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in a base metal with a luxurious Hyderabadi Polish",
    "adorned with sparkling Cubic Zirconia (CZ) stones of the highest quality. The total gross weight is approximately 136.740 grams."
  ],
  "features": "This stunning Haaram features a tiered, cascading design. Each layer showcases intricately set CZ stones in a floral motif, creating a breathtaking sparkle. The gradual decrease in length and density from top to bottom creates a graceful and elegant silhouette, reminiscent of the traditional guttapusalu design but with a modern diamond-like twist. Individual tiers are linked for fluid movement and comfortable wear.",
  "colors": [
    "Primarily silver/white due to the Hyderabadi Polish and clear CZ stones",
    "creating a brilliant and classic look."
  ],
  "occasions": [
    "Perfect for special occasions like weddings",
    "receptions",
    "engagement parties",
    "Seemantham (baby shower)",
    "Varalakshmi Vratam",
    "or any grand celebration. Also suitable for modern events where a touch of traditional elegance is desired."
  ],
  "description": "This diamond-look Haaram offers unparalleled sparkle and elegance at an accessible price point. The classic yet modern design ensures it complements a wide range of outfits and styles. Crafted with attention to detail, this piece is durable and designed to be cherished for years to come. Its layered structure provides an expensive and grand look.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "CZ Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Varalakshmi Vratam",
    "Seemantham",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Cascade Necklace",
    "Floral Design"
  ],
  "original_id": "sjpl_PHOTO-2023-11-27-12-45-08 2_1837",
  "collection": "sjpl"
}