{
  "id": "necklaces-1578",
  "title": "Diamond Floral Cascade Haaram: A Symphony of Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finest quality diamonds totaling 6.01 carats (162 stones)",
    "2.16 carats (60 stones)",
    "11.01 carats (187 stones)",
    "5.18 carats (55 stones)",
    "7.31 carats (126 stones)",
    "0.95 carats (31 stones) and 1.55 carats (15 stones). The necklace is meticulously crafted in a hypoallergenic white metal alloy",
    "offering a brilliant",
    "lasting shine. Each diamond is expertly set for maximum brilliance."
  ],
  "features": "This stunning five-strand Haaram features a delicate floral design rendered entirely in dazzling diamonds. The graduating lengths of the strands create a captivating cascade effect. The intricate design showcases flower and droplet motifs connected by dainty diamond links. A modern take on a classic South Indian design, making it versatile for both traditional and contemporary occasions.",
  "colors": [
    "Predominantly white",
    "thanks to the brilliance of the diamonds and the bright white metal setting."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaha Mahotsavam)",
    "receptions",
    "and milestone birthdays. Also suitable for upscale modern events and parties where you want to make a sophisticated statement."
  ],
  "description": "This exquisite diamond Haaram is a testament to timeless elegance and exceptional craftsmanship. The cascading design and floral motifs create a breathtaking visual impact. It is designed for comfort and durability, ensuring it will remain a cherished heirloom for generations. Its modern interpretation of the traditional Haaram style allows for versatile wear.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Multi-Strand Necklace",
    "Floral Jewelry",
    "Bridal Jewelry",
    "Indian Wedding",
    "Reception Jewelry",
    "Diamond Jewellery",
    "South Indian Jewellery",
    "Contemporary Jewellery",
    "Wedding Haaram",
    "Sparkle"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-44_2283",
  "collection": "sjpl"
}