{
  "id": "earrings-264",
  "title": "Emerald-Adorned Diamond Chandbali Jhumkas",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold setting",
    "meticulously hand-set with Brilliant Cut Diamonds and Emeralds. Hyderabadi Polish for a radiant shine. Metal purity verified and hallmarked."
  ],
  "features": "Intricately designed Chandbali Jhumkas featuring a delicate lattice work design embellished with sparkling diamonds. Emerald centerstones add a pop of vibrant color. The chandelier-like structure showcases the masterful craftsmanship, a hallmark of South Indian jewelry design. Traditional Telugu design elements are incorporated for a touch of heritage.",
  "colors": [
    "Emerald Green",
    "Diamond White",
    "and Yellow Gold"
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu/పెళ్లి)",
    "receptions",
    "traditional ceremonies like Seemantham (సీమంతం)",
    "half-saree function (Teenage Sambaraalu/టీనేజ్ సంబరాలు)",
    "and festive occasions like Ugadi (ఉగాది) or Sankranthi (సంక్రాంతి). Also suitable for upscale social gatherings and parties."
  ],
  "description": "These exquisite Chandbali Jhumkas are more than just jewelry; they are heirlooms in the making. The exceptional craftsmanship, combined with the brilliance of diamonds and the richness of emeralds, ensures you'll be the center of attention. The timeless design blends seamlessly with both traditional and contemporary attire, offering versatility and unmatched elegance. A valuable investment piece that reflects your discerning taste and appreciation for South Indian artistry. Embody the 'Lakshmi Kataksham' (లక్ష్మీ కటాక్షం) with these auspicious earrings.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Earrings",
    "Karnaphool",
    "Emerald",
    "Diamond",
    "Gold",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Fashion Earrings",
    "Party Wear",
    "Fine Jewelry",
    "వినాయక చవితి",
    "సీమంతం",
    "పెళ్లి",
    "చెవి దిద్దులు"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-29 2_0890",
  "collection": "diamond"
}