{
  "id": "necklaces-1427",
  "title": "Emerald and Diamond Nakshi Haaram - Indrani Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (faceted beads and cabochons)",
    "Brilliant Cut Diamonds (VS clarity",
    "G color). Crafted with intricate Nakshi work and finished with a radiant Hyderabadi Polish."
  ],
  "features": "This exquisite Haaram features a crescent-shaped pendant meticulously handcrafted with Nakshi work, showcasing traditional South Indian floral and peacock motifs. The pendant is adorned with rows of vibrant Emeralds interspersed with sparkling Diamonds. Delicate Diamond 'Gutapusalu' (clusters of pearls) are reimagined with diamond clusters as dangles adding a modern twist to a classic design. The multiple strands of faceted emerald beads create a stunning, layered effect, finished with diamond studded gold clasp.",
  "colors": [
    "Emerald Green",
    "Gold",
    "and White (Diamond). The vibrant green of the emeralds contrasts beautifully with the warm gold and the dazzling white of the diamonds."
  ],
  "occasions": [
    "Perfect for weddings (especially Muhurtham)",
    "Seemantham",
    "Half-Saree functions",
    "or any grand celebration where you want to make a statement. Equally stunning for high-end social gatherings and formal events."
  ],
  "description": "This Haaram is a testament to exceptional craftsmanship and timeless elegance. The combination of traditional Nakshi work with modern diamond accents creates a unique and highly desirable piece. The high-quality Emeralds and Diamonds ensure lasting beauty and value. This piece is a treasured heirloom, reflecting rich cultural heritage and refined taste.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Nakshi",
    "Gutapusalu",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "22K Gold",
    "Emerald Beads",
    "Heirlooms",
    "పెళ్లి నెక్లెస్",
    "పచ్చల హారం",
    "డైమండ్ నెక్లెస్"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-33 2_2045",
  "collection": "sjpl"
}