{
  "id": "earrings-259",
  "title": "Emerald Cascade Jhumka: A Symphony of Tradition and Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish for a lasting gleam. Adorned with meticulously selected square-cut Emeralds (రత్నాలు) of exceptional clarity and dazzling Cubic Zirconia (CZ) stones. Finished with lustrous",
    "perfectly round freshwater pearls."
  ],
  "features": "These exquisite jhumkas feature a cascading design, reminiscent of blooming jasmine garlands (మల్లెపూల దండలు). The openwork floral motifs are intricately studded with CZ stones, highlighting the vivid green emeralds. The delicate pearl drops add a touch of timeless elegance and movement.",
  "colors": [
    "The color palette is a harmonious blend of rich gold",
    "vibrant emerald green",
    "and the soft ivory of the pearls",
    "a classic South Indian combination that exudes opulence."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements",
    "and festive celebrations. These jhumkas can elevate any outfit",
    "from traditional sarees ( చీరలు) to contemporary ensembles. Ideal for special occasions like Seemantham (సీమంతం) or Half-Saree functions."
  ],
  "description": "These jhumkas offer a captivating blend of traditional South Indian design and modern sensibility. The high-quality emeralds and meticulous craftsmanship ensure lasting beauty and value. The Hyderabadi polish enhances the gold's brilliance, making these earrings a true statement piece.",
  "tags": [
    "Jhumka",
    "Earrings",
    "చెవి దిద్దులు",
    "Emerald",
    "పచ్చ",
    "Pearl",
    "ముత్యం",
    "Gold",
    "బంగారం",
    "22K",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Traditional",
    "Ethnic",
    "Contemporary",
    "Cascade",
    "Floral",
    "CZ",
    "Cubic Zirconia",
    "Seemantham",
    "పెళ్లి",
    "Half Saree Ceremony"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-27 3_0885",
  "collection": "diamond"
}