{
  "id": "necklaces-128",
  "title": "Emerald & Polki Diamond Cascading Haaram - Pachala Polki Haram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Natural Oval Emeralds (high saturation",
    "excellent luster)",
    "Uncut Polki Diamonds (Kundan Setting)"
  ],
  "features": "A modern take on the traditional Haaram, featuring a symmetrical cascading design. Oval emeralds are interspersed with square polki diamonds in a bezel setting. The Hyderabadi polish enhances the gold's luster, bringing out the richness of the materials. Kundan setting for the polki diamonds provides a royal and traditional appearance. The 'T' drop design adds a contemporary flair, ideal for the modern bride or discerning collector.",
  "colors": [
    "Vibrant Green Emeralds",
    "Warm Gold",
    "Sparkling White Polki Diamonds"
  ],
  "occasions": [
    "Perfect for weddings (vivahaalu)",
    "receptions",
    "engagement ceremonies",
    "anniversaries",
    "and upscale parties. Ideal for Muhurtham or any grand celebration where a touch of elegance is desired."
  ],
  "description": "This exquisite Haaram seamlessly blends traditional South Indian artistry with contemporary design. The use of natural emeralds and uncut polki diamonds showcases the rich heritage of Indian jewelry making. The Hyderabadi polish ensures a lasting shine and the durable construction promises a timeless piece. The vibrant colors and elegant design make it a statement piece that will be cherished for generations. A testament to enduring beauty and unparalleled craftsmanship.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Pachala",
    "Polki",
    "Kundan",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Muhurtham",
    "Contemporary Jewelry",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_DPNK8-1608_0361",
  "collection": "diamond"
}