{
  "id": "necklaces-922",
  "title": "Lakshmi Kasu Mala - Divine Radiance Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "embellished with brilliant-cut Cubic Zirconia",
    "vibrant Ruby accents",
    "and emerald green stones. The centerpiece features a captivating Oval-Cut Emerald. Traditional Hyderabadi Polish ensures a lasting",
    "lustrous shine."
  ],
  "features": "This exquisite Haaram features intricately detailed Lakshmi motifs, hand-crafted by skilled artisans. The pendant showcases a complex filigree design. The cascading beadwork adds a touch of traditional elegance. Classic Temple Jewellery design reflects South Indian cultural heritage.",
  "colors": [
    "Golden",
    "White (Cubic Zirconia)",
    "Ruby Red",
    "Emerald Green. The traditional color combination enhances the piece's auspiciousness."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "engagements",
    "festivals (Ugadi",
    "Sankranti",
    "Diwali)",
    "and traditional ceremonies like Seemantham or half-saree functions (Pattu Langa function). A statement piece for grand celebrations."
  ],
  "description": "This Lakshmi Kasu Mala is more than just jewelry; it's a symbol of prosperity and divine blessings. Its exquisite craftsmanship and high-quality materials ensure durability and lasting beauty. The blend of traditional design with modern sparkle makes it a cherished heirloom. Each Lakshmi motif is meticulously detailed, showcasing the artisan's dedication and skill. It comes with authenticity certificate from our store.",
  "tags": [
    "Haaram",
    "Necklace",
    "Lakshmi",
    "Temple Jewellery",
    "South Indian Jewellery",
    "Kasu Mala",
    "Gold Necklace",
    "Wedding Jewellery",
    "Bridal Necklace",
    "Ruby",
    "Emerald",
    "Cubic Zirconia",
    "Hyderabadi Jewellery",
    "Pattu Langa",
    "Seemantham",
    "Ugadi",
    "Sankranti",
    "Vivaha Mahotsavam",
    "Bridal",
    "Divine"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0316_2383",
  "collection": "necklace"
}