{
  "id": "necklaces-940",
  "title": "Manikyam Peacock Haaram: A Timeless Telugu Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously crafted with a lustrous Hyderabadi Polish. Adorned with high-quality Rubies (Manikyam)",
    "Emeralds (Panna) and sparkling Cubic Zirconia (CZ) stones. The gold exhibits exceptional color and sheen."
  ],
  "features": "This exquisite haaram showcases a stunning peacock (Mayura) motif pendant, a symbol of beauty and grace in South Indian culture. Features intricate filigree work and a delicate arrangement of CZ stones that enhance the brilliance of the rubies and emeralds. The pendant is further enhanced with a cascade of gold bead drops adding a touch of elegance. The necklace strand itself is a double-layered design embellished with CZ settings.",
  "colors": [
    "Predominantly Gold with vibrant pops of Ruby red and Emerald green. The CZ stones offer a dazzling white sparkle",
    "creating a harmonious and eye-catching palette."
  ],
  "occasions": [
    "Perfect for traditional Telugu weddings",
    "bridal showers",
    "Seemantham",
    "or any significant cultural celebration. Equally stunning when paired with modern attire for a touch of timeless elegance. Ideal for muhurtham",
    "half-saree function and anniversaries."
  ],
  "description": "A masterpiece of South Indian craftsmanship, this haaram is more than just jewelry; it's a heritage piece. The peacock design carries profound cultural significance, representing beauty, royalty and prosperity. The combination of high-quality gold, vibrant gemstones, and intricate detailing makes this a truly unique and valuable investment. It is designed for durability, making it a treasured heirloom for generations.",
  "tags": [
    "Haaram",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Peacock Jewelry",
    "Manikyam",
    "Ruby",
    "Emerald",
    "CZ",
    "22K Gold",
    "Hyderabadi Polish",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Kantaabharanam",
    "కంఠాభరణం",
    "Mayura",
    "మయూర"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0334_2401",
  "collection": "necklace"
}