{
  "id": "earrings-494",
  "title": "Emerald Lotus Navratan Brooch - A Timeless Statement Piece",
  "category": "earrings",
  "original_type": "Brooch",
  "materials": [
    "Base Metal: 22K Gold (approximately). Gemstones: Natural Emerald (central stone)",
    "High-quality Polki Diamonds (surrounding). Hyderabadi Polish for a lustrous finish."
  ],
  "features": "Features a stylized lotus design, a traditional South Indian motif symbolizing purity and enlightenment. The central, vibrant green emerald is surrounded by meticulously placed polki diamonds. Handcrafted setting with open settings on the polkis to showcase the brilliance. The lotus design adds a unique touch. Nakshi-style work around the settings enhances the antique aesthetic.",
  "colors": [
    "Emerald Green (central gemstone)",
    "Warm Gold (metal)",
    "Sparkling White (Polki Diamonds). The contrast of the green and gold makes it a regal statement."
  ],
  "occasions": [
    "Ideal for weddings (Pellillu)",
    "receptions",
    "traditional South Indian ceremonies (like Seemantham or Half-Saree Function)",
    "formal events",
    "or as an heirloom piece. Also suitable for adding a touch of vintage glamour to modern outfits."
  ],
  "description": "This brooch seamlessly blends traditional South Indian aesthetics with modern wearability. The exceptional craftsmanship, high-quality polki diamonds, and vibrant emerald make it a truly special piece. The lotus design holds cultural significance, symbolizing prosperity and new beginnings. The gold provides value and lasting beauty. Perfect to adorn any occasion.",
  "tags": [
    "Brooch",
    "Navratan",
    "Emerald",
    "Polki Diamonds",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Antique Jewelry",
    "Pellillu",
    "Seemantham",
    "Lotus",
    "Vintage Jewelry",
    "Statement Piece",
    "Ethnic Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1591_2621",
  "collection": "ear"
}