{
  "id": "earrings-270",
  "title": "Manohari Kundanalu: Emerald and Pearl Peacock Jhumkas",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "High-Quality Emeralds (faceted square cut)",
    "Cubic Zirconia (CZ)",
    "Cultured Pearls."
  ],
  "features": "Exquisitely crafted peacock motifs form the core of these jhumkas. Featuring intricate filigree work and meticulously set CZ stones. The design incorporates a traditional temple design element at the top. The earrings feature pearl drops hanging from a floral structure at the bottom, adding movement and grace.",
  "colors": [
    "Gold (yellow)",
    "Emerald (green)",
    "White (CZ)",
    "Pearl (white). The contrast between the vibrant emeralds",
    "shimmering CZs",
    "and lustrous pearls creates a captivating aesthetic."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha)",
    "receptions",
    "festive celebrations (Ugadi",
    "Sankranti)",
    "and special occasions. These jhumkas add a touch of traditional elegance to any outfit and are perfect for a half-saree function or grand family gathering."
  ],
  "description": "These 'Manohari Kundanalu' are a testament to the rich heritage of South Indian jewelry craftsmanship. The combination of the sacred peacock motif, radiant emeralds, and lustrous pearls makes them a valuable heirloom piece. The Hyderabadi polish ensures lasting brilliance and durability. A blend of traditional and modern aesthetics means these earrings complement both traditional and contemporary attire. The fine quality of the materials makes this a worthy investment.",
  "tags": [
    "Jhumka",
    "Kundanalu",
    "Earrings",
    "Emerald",
    "Pearls",
    "Peacock",
    "Mayura",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "22K Gold",
    "CZ",
    "Cubic Zirconia",
    "Filigree",
    "Traditional",
    "Ethnic",
    "Festive",
    "Earrings"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-32_0896",
  "collection": "diamond"
}