{
  "id": "necklaces-164",
  "title": "Vaishnavi Emerald Polki Haaram - A Regal Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds",
    "High-Quality Emeralds (Pear Cut)",
    "Faceted Rubies. Features a Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Haaram showcases a cascading design with alternating Polki diamond units and vibrant emerald drops. Each polki is meticulously set in a closed setting, highlighting their natural brilliance. The design incorporates stylized peacock motifs ('Mayura' in Telugu) encrusted with rubies, adding a touch of traditional elegance. The teardrop emeralds are bezel-set with intricate gold detailing, enhancing their intense green hue.",
  "colors": [
    "Rich Yellow Gold",
    "Vivid Emerald Green",
    "Sparkling White (Polki Diamonds)",
    "Deep Ruby Red."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "and grand celebrations like Seemantham (baby shower) or a Half-Saree Function (Langa Voni Function). This statement piece will elevate any festive ensemble."
  ],
  "description": "This Haaram is a blend of timeless elegance and modern design. The use of uncut polki diamonds adds a touch of rustic charm, while the vibrant emeralds provide a striking contrast. Crafted with meticulous attention to detail by skilled artisans in Hyderabad, this piece is not just jewelry, but an heirloom to be cherished for generations. The peacock motif symbolizes beauty, royalty, and love, making it a meaningful gift.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamonds",
    "Emeralds",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Mayura",
    "Peacock Design",
    "Gold Jewelry",
    "Seemantham",
    "Langa Voni",
    "Vivaaha",
    "Telugu Jewelry",
    "Jadau Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0003_0412",
  "collection": "diamond"
}