{
  "id": "earrings-469",
  "title": "Rajkumari Polki & Ruby Jhumka Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Ruby Beads",
    "Carved Ruby Cabochons",
    "Freshwater Pearls. The gold features a lustrous Hyderabadi polish for enhanced sheen and durability."
  ],
  "features": "These exquisite Jhumkas feature a floral motif at the top, crafted with uncut Polki diamonds set in the traditional Kundan style. Below, carved ruby cabochons serve as the central element, framed by a delicate halo of Polki. Dangles of ruby beads and seed pearls add movement and a touch of South Indian elegance. The carved ruby adds a vintage touch, reminiscent of temple carvings.",
  "colors": [
    "Predominantly gold with the vibrant red of the rubies and the subtle shimmer of Polki diamonds. The white of the freshwater pearls provides a delicate contrast."
  ],
  "occasions": [
    "Perfect for weddings (pellillu)",
    "engagement ceremonies (nischitartham)",
    "festive occasions like Sankranti",
    "and can also add a touch of traditional elegance to modern cocktail parties and social gatherings."
  ],
  "description": "These Jhumkas are a testament to timeless South Indian craftsmanship. The use of high-quality uncut Polki diamonds and genuine ruby beads ensures a luxurious and eye-catching piece. The Hyderabadi gold polish guarantees lasting shine and durability. The blend of traditional design with modern wearability makes them a valuable addition to any jewelry collection.",
  "tags": [
    "Jhumka",
    "Polki",
    "Ruby",
    "Earrings",
    "South Indian Jewelry",
    "Kundan",
    "Hyderabadi Jewelry",
    "Traditional",
    "Wedding Jewelry",
    "Pellillu",
    "Nischitartham",
    "Antique Jewelry",
    "Carved Ruby",
    "Ruby Beads",
    "Freshwater Pearls",
    "Gold Earrings",
    "Indian Jewelry",
    "Ethnic Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1240_2590",
  "collection": "ear"
}