{
  "id": "necklaces-1482",
  "title": "Manohari Emerald & Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Pear Cut Emeralds (Natural",
    "Vivid Green). Features our signature Hyderabadi Polish for lasting luster."
  ],
  "features": "This exquisite haaram showcases a modern take on traditional South Indian design. It features intricate filigree work studded with sparkling diamonds, creating a delicate, lace-like effect. The pear-cut emeralds add a touch of regal elegance. The setting style ensures maximum light reflection, enhancing the brilliance of both the diamonds and emeralds. The piece incorporates a contemporary clasp for easy wear.",
  "colors": [
    "Primarily gold with brilliant white diamonds and vibrant green emeralds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "receptions",
    "engagements",
    "and special occasions like Seemantham. Its sophisticated design also makes it suitable for high-end parties and contemporary events."
  ],
  "description": "This Manohari Emerald & Diamond Haaram is a true investment piece, blending timeless elegance with modern design. The combination of high-quality diamonds and vibrant emeralds creates a captivating look. The Hyderabadi polish ensures lasting shine and durability. It's a statement piece that celebrates South Indian heritage while complementing modern sensibilities. Each gemstone is hand-selected for its quality and brilliance.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emeralds",
    "Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Vivaham",
    "Seemantham",
    "Party Wear",
    "Contemporary Design",
    "Diamond Necklace",
    "Emerald Necklace",
    "కెంపులు",
    "వజ్రాలు"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-41-01_2100",
  "collection": "sjpl"
}