{
  "id": "bangles-308",
  "title": "Diamond-Studded Gold Kangan Set - A Timeless Radiance",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "Crafted in 22K Gold (916 Gold Purity)",
    "meticulously studded with brilliant-cut Diamonds. The gold features a subtle Hyderabadi polish that enhances its lustre. Diamonds are of VS clarity",
    "showcasing exceptional brilliance."
  ],
  "features": "This exquisite bangle set features a classic row design, where dazzling diamonds are delicately set in prong settings along the entire circumference of the gold kangan. The minimalist design allows the diamonds to take center stage, creating a harmonious balance between tradition and modernity. Each diamond is carefully placed to maximize its fire and sparkle. Hinged design with secure clasp for easy wear and removal.",
  "colors": [
    "Predominantly gold with the sparkling white brilliance of diamonds. The warm hue of the gold complements the fiery sparkle of the diamonds",
    "creating a luxurious and captivating color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "Diwali",
    "and other auspicious occasions. These bangles add a touch of elegance and sophistication to any outfit. Ideal for both traditional attire and contemporary ensembles. Can be worn individually for a subtle touch or stacked for a bold statement."
  ],
  "description": "This Diamond-Studded Gold Kangan Set is a timeless investment that will be treasured for generations. The combination of high-quality gold and brilliant diamonds ensures exceptional brilliance and lasting value. The classic design transcends trends, making it a versatile addition to any jewelry collection. A symbol of prosperity and beauty, perfect for celebrating special moments. Handcrafted by skilled artisans in Hyderabad, reflecting the city's rich jewelry heritage.",
  "tags": [
    "Bangles",
    "Kangan",
    "Gaajulu",
    "Diamond Jewelry",
    "Gold Bangles",
    "22K Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Diamonds",
    "Classic Design",
    "Bridal Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-13-03-49 2_2186",
  "collection": "sjpl"
}