{
  "id": "bangles-016",
  "title": "Diamond Flower Bangles - Kanganalu",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (approx. 2.04 carats total weight)",
    "VVS Clarity. Features our signature Hyderabadi polish for a lasting shine."
  ],
  "features": "These contemporary bangles showcase a repeating floral motif, each flower meticulously set with brilliant-cut diamonds. The gold forms a graceful, undulating wave design between each floral centerpiece, adding movement and visual interest. The diamond setting ensures maximum brilliance and sparkle. The bangles feature a secure clasp closure.",
  "colors": [
    "Warm yellow gold paired with the icy white sparkle of the diamonds."
  ],
  "occasions": [
    "Ideal for special occasions like weddings (vadhuvu alankarana)",
    "engagements",
    "anniversaries",
    "or festive celebrations. These bangles also add a touch of sophisticated glamour to contemporary outfits for parties and formal events."
  ],
  "description": "These diamond bangles offer a modern take on traditional South Indian jewelry. The timeless floral design, combined with the brilliance of the diamonds and the warmth of yellow gold, creates a piece that is both elegant and eye-catching. The high-quality materials and meticulous craftsmanship ensure lasting beauty and durability, making them a valuable addition to any jewelry collection. The Hyderabadi polish enhances the gold's luster, making it truly radiant.",
  "tags": [
    "Bangles",
    "Kanganalu",
    "Diamond Bangles",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Yellow Gold",
    "Floral Design",
    "Traditional Jewelry",
    "Modern Jewelry",
    "Festive Jewelry",
    "Vadhuvu Alankarana",
    "Diamond Jewelry"
  ],
  "original_id": "bangles_IMG-20240902-WA0021_1629",
  "collection": "bangles"
}