{
  "id": "earrings-467",
  "title": "Polki Emerald Drop Jhumka - Kundan Vaibhava",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "Uncut Polki Diamonds (Rose Cut)",
    "Pear-shaped Emerald center stone. Setting is meticulously handcrafted Kundan."
  ],
  "features": "These stunning Jhumkas feature a classic teardrop (arugu poola) design, incorporating traditional Kundan craftsmanship with a modern aesthetic. The center piece features a lush pear-shaped emerald set in a framework of meticulously arranged rose-cut Polki diamonds. The Polki stones are set in the traditional Kundan style, creating a rich, textured finish. The earrings showcase a delicate diamond fringe surrounding the central emerald. The top is the same design as the bottom but smaller and without the emerald. Handcrafted by artisans in Hyderabad, using age-old techniques.",
  "colors": [
    "Dominant colors are Gold",
    "Emerald Green",
    "and shimmering White from the Polki Diamonds. The Hyderabadi polish enhances the gold's warmth",
    "beautifully contrasting with the emerald's vibrancy and the Polki's subtle sparkle."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "engagements ( நிச்சயதார்த்தம்)",
    "Seemantham (సీమంతం)",
    "and other grand celebrations. Equally stunning for a modern evening soiree where you wish to make a statement."
  ],
  "description": "These Polki Emerald Jhumkas represent a perfect blend of tradition and contemporary style. The use of uncut Polki diamonds offers a unique, vintage appeal, while the vibrant emerald adds a touch of modern luxury. Handcrafted by master artisans, each piece is a testament to Hyderabad's rich jewelry-making heritage. A valuable heirloom to be passed down through generations (వారసత్వ సంపద).",
  "tags": [
    "Polki Jhumka",
    "Kundan Jewelry",
    "Emerald Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Wedding Earrings",
    "Bridal Jewelry",
    "Indian Earrings",
    "Traditional Jewelry",
    "చెవి దిద్దులు",
    "పోల్కి జుంకా",
    "కెంపు",
    "ముత్యాలు",
    "పెళ్లి నగల"
  ],
  "original_id": "ear_rings_DPER8-1222_2588",
  "collection": "ear"
}