{
  "id": "earrings-628",
  "title": "Emerald Blossom Jhumka - Pancharatna Collection",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "meticulously handcrafted with a 'Hyderabad Polish' finish. Features a central",
    "emerald-cut Emerald (approximately 2 carats)",
    "surrounded by brilliant-cut Cubic Zirconia (CZ) stones. Accented with freshwater pearls",
    "known for their lustrous quality."
  ],
  "features": "Classic Jhumka design with a floral stud featuring a central Emerald. The tiered bell-shaped (Gopuram) design is intricately embellished with CZ stones, mimicking traditional Nakshi work. Delicately dangling freshwater pearls add a touch of grace and movement. The design blends traditional South Indian temple jewelry motifs with a modern, lightweight construction.",
  "colors": [
    "Primarily gold with vibrant green Emerald accents and shimmering white CZ stones. The freshwater pearls provide a soft",
    "creamy contrast."
  ],
  "occasions": [
    "Perfect for weddings (Pelli)",
    "receptions",
    "engagements",
    "Seemantham (baby shower)",
    "half-saree functions (Voni function)",
    "and other festive occasions. Suitable for both traditional and contemporary attire."
  ],
  "description": "A timeless design that embodies South Indian heritage and elegance. The vibrant Emerald adds a touch of royalty and sophistication. The meticulous craftsmanship ensures durability and lasting beauty. The lightweight design provides comfortable wear. The 'Hyderabad Polish' enhances the gold's luster and provides a protective finish. Excellent value given the quality of materials and craftsmanship.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "Pearls",
    "Karnaphool",
    "Pelli",
    "Wedding",
    "Engagement",
    "Traditional",
    "Hyderabad Jewelry",
    "Nakshi Work",
    "Gopuram",
    "Seemantham",
    "Voni Function",
    "Pancharatna",
    "22K Gold"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 12_2205",
  "collection": "sjpl"
}