{
  "id": "necklaces-691",
  "title": "Enchanting Emerald & Diamond Kasulaperu Haaram with Statement Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Suddha Bangaram)",
    "Natural Emeralds (Pachalu) of fine color and clarity",
    "Brilliant Cut Diamonds (Vajralu) with SI clarity and G color. Hyderabadi Polish for lasting shine."
  ],
  "features": "A unique fusion of traditional South Indian design and contemporary aesthetics. The necklace showcases a series of floral motifs interspersed with emeralds, leading to a striking square pendant. The pendant features an intricate diamond-studded floral design with a central emerald, accentuated by delicate gold bead (gundu) drops. The gold has a ridged texture providing visual depth. The setting style is a blend of prong and pave, ensuring maximum brilliance from both the emeralds and diamonds.",
  "colors": [
    "Predominantly gold with vibrant green from the emeralds and dazzling white from the diamonds."
  ],
  "occasions": [
    "Ideal for weddings (Vivaha Mahotsavam)",
    "engagements (Nischitartham)",
    "traditional festivals (Sankranti",
    "Dasara",
    "Diwali)",
    "or any special occasion (Subha karyam). A stunning statement piece for both traditional and contemporary attire."
  ],
  "description": "This Haaram offers a modern take on a classic South Indian design, seamlessly blending tradition with contemporary elegance. The high-quality emeralds and diamonds sparkle brilliantly, while the 22K gold ensures lasting value. A perfect heirloom piece to be cherished for generations. The pendant is detachable allowing to style the neck piece in different ways for modern occasions. The design will not only enhance the appearance but the use of gold will also give peace of mind.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kasulaperu",
    "Pachalu",
    "Vajralu",
    "Gold Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Statement Necklace",
    "Bridal Jewelry",
    "Ethnic Jewelry",
    "22K Gold",
    "Gold Gundu",
    "Gundu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-51_1197",
  "collection": "diamond"
}