{
  "id": "necklaces-748",
  "title": "Emerald and Polki Coin Haaram - Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximate) with intricate Polki Diamond setting and Emerald accents. Features authentic Hyderabadi Polki craftsmanship. Gold has a luminous antique finish."
  ],
  "features": "This exquisite Haaram showcases a classic South Indian coin design, each embellished with uncut Polki diamonds in a closed setting. The emerald accents add a vibrant touch of color. The pendant design features a floral motif within each coin, meticulously crafted with Nakshi work. A testament to time-honored Telugu craftsmanship.",
  "colors": [
    "Predominantly gold with the brilliance of Polki diamonds (appearing white/off-white) and vibrant green emeralds."
  ],
  "occasions": [
    "Perfect for traditional South Indian weddings",
    "Muhurtham ceremonies",
    "Seemantham (baby shower)",
    "half-saree functions (Voni Function)",
    "and grand festive occasions. Can also be styled for upscale contemporary events for a touch of heritage."
  ],
  "description": "This Polki and Emerald coin Haaram is more than just jewelry; it's a timeless heirloom. The use of authentic Hyderabadi Polki diamonds ensures unparalleled brilliance. The coin design symbolizes prosperity and good fortune, making it an auspicious choice for significant life events. The meticulous craftsmanship guarantees durability and lasting beauty, allowing it to be cherished for generations. Its blend of traditional aesthetics and gemstone vibrancy makes it a valuable addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamonds",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Jewelry",
    "Nakshi Work",
    "Ethnic Jewelry",
    "Temple Jewelry",
    "कंఠాభరణం",
    "Vaddanam",
    "Kasulaperu",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Gold Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-38 3_1254",
  "collection": "diamond"
}