{
  "id": "necklaces-1191",
  "title": "Exquisite Navratna and Diamond Grand Haaram – A Legacy of Telugu Splendor",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Brilliant Cut Diamonds (VS Clarity",
    "G-H Color)",
    "Natural Rubies",
    "Emeralds",
    "and assorted Navratna Gemstones (Sapphire",
    "Pearl",
    "Coral",
    "Hessonite",
    "Cat's Eye",
    "Yellow Sapphire)",
    "Hyderabadi Polish"
  ],
  "features": "This majestic Haaram showcases a traditional South Indian layered design, meticulously handcrafted with intricate diamond settings. The centerpiece features ornate pendants adorned with vibrant emeralds and rubies, encircled by a dazzling display of brilliant-cut diamonds. Traditional motifs are woven throughout, exemplifying fine Nakshi work. The inclusion of Navratna gemstones adds an auspicious element, believed to bring prosperity and well-being. The bottom locket boasts exquisite carvings. ",
  "colors": [
    "Predominantly gold with a radiant sparkle from the diamonds. The vibrant greens of emeralds",
    "reds of rubies",
    "and the varied hues of the Navratna gemstones create a rich",
    "colorful palette that is both traditional and eye-catching."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "Seemantham ceremonies",
    "and other significant cultural celebrations. A statement piece for half-saree functions or any event where you want to make a lasting impression."
  ],
  "description": "This Grand Haaram is a testament to timeless South Indian craftsmanship and design. The use of high-quality diamonds and authentic Navratna gemstones ensures both beauty and lasting value. The Hyderabadi polish enhances the gold's luster, creating a piece that is both elegant and durable. It’s not just jewelry; it's an heirloom, carrying cultural significance and promising enduring beauty for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Navratna",
    "Diamond Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Grand Necklace",
    "Fine Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Telugu Jewelry",
    "22K Gold",
    "VS Clarity Diamonds",
    "Emeralds",
    "Rubies",
    "Ethnic Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-11 2_1743",
  "collection": "sjpl"
}