{
  "id": "necklaces-458",
  "title": "Emerald & Diamond Floral Motif Haaram - A Timeless Telugu Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "ethically sourced Diamonds (Dwt: 4.53)",
    "Burmese Rubies (Ruby: 3.02)",
    "Zambian Emeralds (Eme: 1.84)",
    "Blue Manikyas (Blue Mny: 3.20). Features a signature Hyderabadi polish for lasting brilliance."
  ],
  "features": "This stunning Haaram features a delicate floral motif, meticulously crafted with brilliant-cut diamonds. The center pendant showcases a vibrant, pear-shaped emerald framed by diamond petals, adding a touch of regal elegance. Delicate gold leaves intertwine throughout the necklace, creating a visual masterpiece. The use of rubies and blue manikyas add depth and richness to the design.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with vibrant accents of ruby red",
    "emerald green",
    "and a subtle hint of blue."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festive celebrations like Ugadi or Diwali",
    "and milestone events like a half-saree function (Voni Function). Its contemporary design also makes it suitable for elegant parties and formal gatherings."
  ],
  "description": "This Haaram is a testament to exceptional craftsmanship and timeless elegance. The combination of precious gemstones and intricate design makes it a treasured heirloom. The use of ethically sourced materials and durable construction ensures lasting beauty. A perfect blend of traditional Telugu heritage and modern design, making it a versatile piece for any modern South Indian woman.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "kantaabharanam",
    "manikya",
    "ugadi",
    "diwali"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-51 3_0921",
  "collection": "diamond"
}