{
  "id": "earrings-107",
  "title": "Divya Kundanalu: Diamond & Gemstone Embellished Jhumka Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (SI clarity)",
    "Natural Rubies",
    "Natural Emerald. Showcases the unparalleled Hyderabadi Polish for a lasting sheen."
  ],
  "features": "Intricately designed openwork Jhumka with delicate filigree patterns inspired by traditional South Indian architecture. Features a floral motif at the stud with ruby and emerald accents. Embellished with pave-set diamonds throughout the jhumka bell and cascading beaded dangles at the bottom. The craftsmanship reflects the 'Addigai' style with a modern twist.",
  "colors": [
    "Gold (warm yellow)",
    "White (diamonds)",
    "Red (rubies)",
    "Green (emerald). The traditional combination of red",
    "green",
    "and gold symbolizes prosperity and good fortune."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "festive celebrations (Sankranthi",
    "Ugadi)",
    "temple visits",
    "or any occasion where you want to showcase traditional elegance with a touch of modern brilliance. Also ideal for half-saree function (Voni Function) and Seemantham."
  ],
  "description": "These Kundanalu are a testament to timeless elegance and impeccable craftsmanship. The combination of brilliant-cut diamonds, rich gemstones, and intricate filigree work creates a truly captivating piece. Crafted with high-purity gold and superior Hyderabadi polish ensures lasting beauty and durability. The traditional design holds significant cultural value, making it a cherished heirloom. The perfect blend of tradition and modern aesthetics.",
  "tags": [
    "Jhumka",
    "Kundanalu",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Gold Earrings",
    "Diamond Earrings",
    "Ruby",
    "Emerald",
    "Indian Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Earrings",
    "Festive Jewelry",
    "Muhurtham",
    "Voni Function",
    "Seemantham",
    "Addigai"
  ],
  "original_id": "diamond_jewellery_d246b7c0-8c3e-4214-aab4-285682be7946_0208",
  "collection": "diamond"
}