{
  "id": "necklaces-911",
  "title": "Divya Lakshmi Kasulaperu Haaram: Temple Design Necklace with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "CZ Diamonds (American Diamonds)",
    "Faceted Emeralds",
    "Rubies and South Sea Pearls. Features Hyderabadi Polish for enduring luster and enhanced detailing."
  ],
  "features": "This exquisite Haaram features a classic Kasulaperu design, with intricately crafted gold coins interspersed with shimmering CZ diamonds and rubies. The central temple design pendant showcases Goddess Lakshmi, surrounded by delicate filigree work and adorned with vibrant emeralds. The necklace is finished with cascading South Sea pearl drops, adding a touch of elegance. The arrangement creates a graceful visual flow. The design also incorporates a modern open style that allow for movement and comfort around the neck.",
  "colors": [
    "Gold (yellow)",
    "Emerald (green)",
    "Ruby (red)",
    "Pearl (creamy white)"
  ],
  "occasions": [
    "Perfect for weddings (vivahaalu)",
    "engagements (nischitartham)",
    "festivals (pandugalu)",
    "Seemantham ceremonies",
    "or any grand celebration where you want to embody timeless South Indian elegance. Can also be styled for formal events."
  ],
  "description": "This Kasulaperu Haaram is more than just jewelry; it's an heirloom piece steeped in South Indian tradition. The Goddess Lakshmi pendant symbolizes prosperity and good fortune. The combination of gold, diamonds, and emeralds creates a dazzling effect, making it a statement piece that will be treasured for generations. Handcrafted by skilled artisans in Hyderabad, this necklace showcases unparalleled craftsmanship and attention to detail, making it a valuable investment.",
  "tags": [
    "Kasulaperu",
    "Kaasu Mala",
    "Lakshmi Haaram",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Wedding Necklace",
    "Emerald Necklace",
    "Hyderabad Jewelry",
    "22K Gold",
    "CZ Diamonds",
    "Pearls",
    "Traditional Jewelry",
    "Divine Jewelry",
    "Seemantham Jewelry",
    "Panduga Jewelry",
    "ethnic jewelry",
    "necklace"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0305_2372",
  "collection": "necklace"
}