{
  "id": "necklaces-1505",
  "title": "Mayura Emerald Haaram: A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Exquisite Zambian Emeralds (Oval Cut",
    "AA Clarity)",
    "Sparkling Cubic Zirconia (CZ) Diamonds",
    "Delicate Ruby Accents. Features a fine Hyderabadi Polish for a lasting luster."
  ],
  "features": "This stunning Haaram showcases the iconic Mayura (Peacock) motif, intricately etched within circular pendants adorned with shimmering CZ diamonds. The design echoes the classic Kasulaperu style, with repeating coin-like elements interspersed with emerald-studded floral connectors. The peacock, a symbol of beauty and prosperity in Telugu culture, is rendered with meticulous detail. Features a secure S-hook clasp. Traditional Nakshi work gives the peacocks character and depth.",
  "colors": [
    "Dominant gold tone with vibrant green emeralds",
    "subtle red ruby accents",
    "and dazzling white CZ diamonds creating a harmonious and eye-catching palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "muhurtham ceremonies",
    "Seemantham (baby shower)",
    "half-saree functions (Voni function)",
    "and other grand celebrations. Also suitable for upscale social events where you want to make a statement."
  ],
  "description": "This Mayura Emerald Haaram is a timeless investment, blending the rich cultural heritage of South Indian jewelry with contemporary design sensibilities. The impeccable craftsmanship, the brilliance of the Zambian Emeralds, and the intricate detailing make it a truly unique piece. A symbol of tradition, beauty, and prosperity, it is destined to become a cherished family heirloom. Its design makes a bold statement while retaining a touch of cultural subtlety.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Mayura",
    "Peacock",
    "Emerald",
    "Ruby",
    "CZ Diamond",
    "22K Gold",
    "Traditional",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Kasulaperu",
    "Nakshi Work",
    "Hyderabadi Jewelry",
    "Bharatiya Abharanamulu",
    "Addigai",
    "Vaddanam"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-36 3_2123",
  "collection": "sjpl"
}