{
  "id": "necklaces-267",
  "title": "Divine Diamond Kasu Mala: A Modern Take on Tradition",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold with meticulously set Brilliant Cut Diamonds. Features signature Hyderabadi Polish for lasting radiance. Diamond clarity: VS",
    "Color: G-H."
  ],
  "features": "This exquisite necklace reimagines the traditional Kasu Mala. It features a delicate floral motif chain, leading to ornate mango-shaped 'Paisley' pendants studded with dazzling diamonds, interspersed with single round gold drops. The central pendant showcases a larger, more elaborate floral design, enhancing the necklace's focal point. The setting ensures maximum brilliance and secure stone placement.",
  "colors": [
    "Radiant Yellow Gold complemented by the icy brilliance of the White Diamonds",
    "creating a timeless and elegant color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and festive occasions like Diwali",
    "Sankranthi and Ugadi. Its refined design also makes it suitable for upscale parties and special events. A stunning statement piece for the modern bride or the discerning jewelry connoisseur."
  ],
  "description": "A stunning fusion of traditional South Indian design with modern sensibilities. The exceptional diamond quality ensures breathtaking sparkle and enduring value. Expert craftsmanship guarantees a piece that will be treasured for generations, making it a heirloom in the making. Exudes understated elegance and timeless appeal.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Kasu Mala",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Paisley Pendant",
    "Temple Jewelry",
    "Mohana Mala",
    "Telugu Jewellery",
    "Traditional Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0347_0544",
  "collection": "diamond"
}