{
  "id": "bangles-113",
  "title": "Manikyam & Pachala Vanki Bracelet: An Ode to Timeless Elegance",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "22K Gold",
    "Emerald (Pachala) cabochons",
    "Polki Diamonds (uncut diamonds) and small Ruby accents (Manikyam). Features traditional Hyderabadi polish for a rich",
    "antique lustre."
  ],
  "features": "A meticulously crafted Vanki bracelet, showcasing a traditional South Indian design. The bracelet is divided into 3 sections, each uniquely designed with floral patterns using Polki Diamonds. Each section features natural Emerald cabochon gemstones. Accents of tiny rubies are added. The piece demonstrates classic artisan techniques with careful attention to symmetry and proportion.",
  "colors": [
    "Deep Green (Pachala)",
    "Sparkling White (Polki Diamonds)",
    "Red (Manikyam)",
    "and Warm Yellow Gold."
  ],
  "occasions": [
    "Ideal for traditional South Indian weddings",
    "Bharatanatyam performances",
    "Seemantham ceremonies",
    "festivals like Ugadi and Sankranthi",
    "or any special occasion where a touch of cultural heritage is desired. It can also be worn at contemporary events",
    "offering a unique statement piece."
  ],
  "description": "This Vanki bracelet beautifully combines traditional design with high-quality materials, making it a timeless heirloom piece. The use of Polki diamonds and natural gemstones ensures brilliance and lasting value. The Hyderabadi polish adds a rich, antique finish that is both sophisticated and unique. This piece holds significant cultural value, representing the heritage and artistry of South Indian jewelry making.",
  "tags": [
    "Vanki",
    "Armlet",
    "Bracelet",
    "Polki Diamonds",
    "Emerald",
    "Pachala",
    "Manikyam",
    "Ruby",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Heirloom",
    "Gold Jewelry",
    "22K Gold",
    "Antique Finish",
    "Seemantham",
    "Bharatanatyam",
    "Ugadi",
    "Sankranthi"
  ],
  "original_id": "diamond_jewellery_DPER8-958_0315",
  "collection": "diamond"
}