{
  "id": "necklaces-1020",
  "title": "Maharani Diamond and Emerald Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color)",
    "Natural Emeralds (High Quality",
    "Zambian Origin)",
    "South Sea Pearls (AAA Grade). Hyderabadi Polish for lasting shine."
  ],
  "features": "This exquisite Haaram features intricate floral and paisley motifs meticulously crafted with brilliant cut diamonds. The center pendant showcases a larger emerald surrounded by a diamond halo, leading to a second ornate pendant embellished with more diamonds and gracefully dangling South Sea pearls. The necklace's design blends traditional South Indian aesthetics with a modern, lightweight structure for comfortable wear. Features the elegant scrollwork typical of South Indian jewelry, but with a lighter, more contemporary feel.",
  "colors": [
    "Yellow Gold",
    "White Diamonds",
    "Deep Green Emeralds",
    "Creamy White Pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "anniversaries",
    "and other special occasions. Suitable for brides (pellikuturu) and can be worn during muhurtham",
    "seemantham",
    "or other grand celebrations. Also makes a stunning statement piece for high-end social events."
  ],
  "description": "This Haaram is a masterpiece of craftsmanship, blending traditional South Indian design with modern elegance. The high-quality diamonds and emeralds ensure exceptional brilliance and value. The South Sea pearls add a touch of classic sophistication. The Hyderabadi polish guarantees a lasting, radiant shine. A timeless piece that will be treasured for generations. Designed for comfort and wearability while maintaining a luxurious look.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Bridal Necklace",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Pellikuturu",
    "Muhurtham",
    "Seemantham",
    "Emeralds",
    "Diamonds",
    "18K Gold"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0479_2341",
  "collection": "necklace"
}