{
  "id": "necklaces-1063",
  "title": "Ethereal Emerald & Polki Diamond Haaram - Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish. Features Polki Diamonds (Uncut Diamonds) and Zambian Emeralds. Emeralds are pear-shaped and round cut with VVS clarity. Polki Diamonds exhibit a brilliant luster and weigh approximately 12 carats in total."
  ],
  "features": "This exquisite Haaram showcases a floral motif with alternating Polki diamonds and Emeralds. The central pendant is an impressive pear-shaped emerald, framed by Polki Diamonds in a closed setting. The entire necklace features a delicate, handcrafted bezel setting, highlighting the natural beauty of the gems. Showcases Traditional Hyderabadi craftsmanship with meticulous detailing.",
  "colors": [
    "Primarily Gold",
    "Emerald Green",
    "and shimmering white from the Polki Diamonds. The contrast creates a vibrant and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్ళి)",
    "engagements (నిశ్చితార్థం)",
    "and traditional ceremonies like Seemantham (సీమంతం) or Half-Saree functions (పావుడా). Also suitable for high-end social gatherings and cultural events."
  ],
  "description": "This Haaram is a testament to timeless South Indian jewelry design. The combination of Polki Diamonds and Zambian Emeralds is highly sought after. The handcrafted Hyderabadi polish ensures a lasting shine and enhances the gold's natural luster. A heirloom piece to be cherished for generations, embodying elegance and cultural heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamonds",
    "Emerald",
    "Zambian Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "కంఠాభరణము",
    "పెళ్ళి నగలు",
    "నిశ్చితార్థం నగలు"
  ],
  "original_id": "radhe_diam_DPNK8-1510_2476",
  "collection": "radhe"
}