{
  "id": "necklaces-991",
  "title": "Diamond Delight: Kundan Work Haaram Set with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "18K Yellow Gold",
    "High-Quality Kundan Diamonds",
    "Emeralds",
    "Ruby",
    "Cultured Pearls. Hyderabadi Polish for lasting shine and durability."
  ],
  "features": "Intricate Kundan diamond setting showcasing traditional floral motifs. Features a delicate arrangement of Emerald and ruby accents, punctuated by lustrous pearl drops. The necklace's design incorporates openwork details that enhance the brilliance of the diamonds. The matching Jhumkas mirror the necklace's floral theme with a charming, lightweight design. Fine craftsmanship ensures each gemstone is securely set and the Hyderabadi polish gives the set a radiant finish.",
  "colors": [
    "Yellow Gold",
    "White (Diamonds)",
    "Green (Emeralds)",
    "Red (Ruby)",
    "Cream (Pearls). The color palette is carefully balanced for a timeless",
    "elegant appeal."
  ],
  "occasions": [
    "Perfect for weddings (Vivah)",
    "receptions",
    "engagement ceremonies",
    "or any special occasion where you want to make a statement. Also suitable for traditional events such as Seemantham or Half-Saree function (Langa Voni). This set blends seamlessly with both traditional sarees and modern ethnic wear."
  ],
  "description": "This exquisite Kundan Haaram set is a harmonious blend of tradition and modernity. The vibrant gemstones, combined with the dazzling diamonds and pearls, create a breathtaking effect. This piece is meticulously crafted by skilled artisans in Hyderabad, known for their expertise in Kundan jewelry. The Hyderabadi polish ensures long-lasting brilliance. A timeless investment piece that can be passed down through generations, carrying with it a rich cultural heritage.",
  "tags": [
    "Diamond Necklace",
    "Kundan Jewelry",
    "Haaram",
    "Jhumka",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Emerald",
    "Ruby",
    "Pearl",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Telugu Jewelry",
    "Vivah",
    "Seemantham",
    "Langa Voni",
    "Nakshi Work"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0447_2312",
  "collection": "necklace"
}