{
  "id": "earrings-666",
  "title": "Blossom Dream: Diamond, Pink Sapphire, and Rice Pearl Dangler Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K White and Rose Gold. Features Pink Sapphire (faceted cushion cut)",
    "round brilliant cut Diamonds (GH color",
    "SI clarity",
    "0.15 carat)",
    "marquise cut Diamonds (GH color",
    "SI clarity",
    "0.08 carat)",
    "and natural Rice Pearls (3.71 carats)"
  ],
  "features": "These elegant dangler earrings showcase a floral-inspired design. The earrings begin with a circular cluster of diamonds and pink sapphires. A delicate vine, pavé-set with diamonds and highlighted with rose gold, cascades down. The design culminates in a cluster of luminous rice pearls embraced by diamond-studded petals of pink sapphires. The open setting enhances the brilliance of the diamonds, and the contrasting gold tones add depth and visual interest.",
  "colors": [
    "Primarily White (diamonds",
    "white gold)",
    "Pink (sapphires)",
    "Creamy White (rice pearls)",
    "and Rose Gold."
  ],
  "occasions": [
    "Ideal for evening wear",
    "parties",
    "engagements",
    "anniversaries",
    "or as a statement piece for special occasions. Would be a lovely addition to a modern bride's trousseau."
  ],
  "description": "These earrings perfectly blend modern design with the timeless beauty of natural gems. The combination of diamonds, pink sapphires, and rice pearls creates a luxurious and sophisticated look. The craftsmanship ensures durability and longevity, making them a cherished piece for generations to come. The open setting creates maximum sparkle.",
  "tags": [
    "Earrings",
    "Dangler Earrings",
    "Diamond Earrings",
    "Pink Sapphire",
    "Rice Pearl",
    "Modern Jewelry",
    "Floral Design",
    "Party Wear",
    "Engagement Jewelry",
    "Statement Earrings",
    "White Gold",
    "Rose Gold"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-41_2254",
  "collection": "sjpl"
}