{
  "id": "necklaces-647",
  "title": "Vaishnavi Kundan and Emerald Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 91.6% purity)",
    "High-quality Kundan stones",
    "Faceted Emeralds (medium to dark green)",
    "Freshwater Pearls. Hyderabadi Polish for lasting shine and durability."
  ],
  "features": "Intricate Kundan setting showcasing the vibrant sparkle of the stones. Features a graduated design with layers of paisley motifs (Manga Malai influence). The central pendant is a showstopper with a large emerald, surrounded by kundan work and finished with delicate pearl drops. The flexible gold wire ensures comfortable wear.",
  "colors": [
    "Primary colors are gold",
    "white (Kundan)",
    "and emerald green. Pearl drops add a touch of classic elegance."
  ],
  "occasions": [
    "Perfect for weddings (Vivaham)",
    "engagements (Nischitartham)",
    "and other grand celebrations. Also suitable for traditional functions such as Seemantham (baby shower) and festivals like Diwali and Sankranthi."
  ],
  "description": "This exquisite Haaram blends traditional South Indian design with modern craftsmanship. The use of high-quality Kundan stones and natural emeralds ensures brilliance and longevity. The Hyderabadi polish guarantees a lustrous finish that will last for generations. Its substantial presence makes it a statement piece that commands attention and exudes elegance. A true heirloom piece.",
  "tags": [
    "Haaram",
    "Kundan Jewelry",
    "Emerald Necklace",
    "Pearl Drops",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Necklace",
    "Wedding Jewelry",
    "Vivaham",
    "Kasulaperu",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Manga Malai",
    "Indian Wedding",
    "Nischitartham",
    "Seemantham",
    "Green",
    "Gold"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-20 2_1153",
  "collection": "diamond"
}