{
  "id": "necklaces-722",
  "title": "Manohari Emerald and Diamond Haaram - A Timeless Telugu Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "meticulously studded with brilliant-cut Diamonds and vibrant Emeralds. Features a deep blue gem at the bottom",
    "possibly a Sapphire. Hyderabadi Polish for a lustrous finish and lasting shine."
  ],
  "features": "This stunning Haaram showcases exquisite floral and peacock motifs intricately woven together in a traditional design. The central pendant features detailed filigree work and is finished with a droplet gemstone adding movement and elegance. The alternating emerald and diamond pattern adds depth and visual interest. The setting style enhances the brilliance of each stone.",
  "colors": [
    "Primarily gold",
    "accented by the rich green of the Emeralds",
    "the dazzling sparkle of Diamonds",
    "and the deep blue gem dangling from the pendant creating a harmonious color palette."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli/వివాహం)",
    "engagements (Nischitartham/నిశ్చితార్థం)",
    "Seemantham (శ్రీమంతం)",
    "or any grand celebration where you want to make a statement of timeless elegance."
  ],
  "description": "This Haaram is more than just jewelry; it's a legacy piece. The intricate design, high-quality gemstones, and expert craftsmanship reflect the rich cultural heritage of South India. The combination of traditional motifs with a modern aesthetic makes it a versatile addition to any jewelry collection. Its durable construction ensures it will be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Pelli",
    "వివాహం",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Fine Jewelry",
    "Statement Necklace",
    "కంఠాభరణం",
    "Emerald",
    "Diamond",
    "Gold"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-46-45 2_1228",
  "collection": "diamond"
}