{
  "id": "necklaces-1025",
  "title": "Ethereal Diamond & Gemstone Raasi Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Emerald (approx. 1 Carat)",
    "Ruby (approx. 1.5 Carats)",
    "South Sea Pearl. Features a delicate Hyderabadi Polish for a lustrous finish."
  ],
  "features": "This exquisite Raasi Haaram showcases intricate floral and leafy motifs entirely encrusted with brilliant-cut diamonds. At its core, a vibrant emerald graces the center, complemented by a teardrop-shaped ruby pendant suspended below, culminating in a delicate South Sea pearl drop. The delicate design is inspired by nature and embodies the traditional 'Addigai' (అడ్డిగె) style of necklace, but with a modern twist. The open setting of the diamonds maximizes their brilliance and fire.",
  "colors": [
    "Predominantly white (diamonds) and gold",
    "accented by vibrant green (emerald) and rich red (ruby). The pearl offers a soft",
    "creamy white hue",
    "creating a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "engagements",
    "Seemantham (baby shower)",
    "half-saree functions (Langa Voni)",
    "and other grand celebrations. Its elegance also lends itself well to formal galas and red-carpet events."
  ],
  "description": "This Raasi Haaram is a true heirloom piece, meticulously crafted by skilled artisans using the finest materials. The combination of diamonds, emerald, ruby, and pearl is considered auspicious in South Indian tradition, symbolizing prosperity and good fortune. Its exquisite design and superior craftsmanship ensure lasting beauty and value. A symbol of tradition, luxury, and enduring style.",
  "tags": [
    "Diamond Necklace",
    "Raasi Haaram",
    "Emerald",
    "Ruby",
    "South Sea Pearl",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Fine Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Addigai",
    "హారం",
    "VVS Diamonds",
    "Lakshmi Kasu Mala"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0484_2346",
  "collection": "necklace"
}