{
  "id": "earrings-105",
  "title": "Mayura Jhumka: Emerald Cascades in Gold and Diamonds",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (approximately 91.6% purity)",
    "High-Quality Emerald Beads",
    "Polki Diamonds",
    "Natural Pearls",
    "Ruby accent stone. Features a brilliant Hyderabadi Polish for a lasting luster."
  ],
  "features": "These exquisite Jhumkas showcase a meticulously crafted peacock (Mayura) motif, studded with sparkling Polki diamonds and accented with a ruby. The emerald bead tassels cascade gracefully, culminating in delicate clusters of natural pearls. The dome-shaped top is reminiscent of temple jewelry architecture. The setting is skillfully done to maximize the brilliance of each diamond and the vibrancy of the emeralds.",
  "colors": [
    "Predominantly gold",
    "with vibrant green emeralds",
    "sparkling white Polki diamonds",
    "and a delicate touch of red from the ruby accent. The natural pearls provide a soft",
    "creamy contrast."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals (like Ugadi and Sankranthi)",
    "temple visits",
    "special occasions like Seemantham (baby shower)",
    "Half-Saree Function (Langa Voni Function)",
    "or a sophisticated evening event. Also suitable for adding a touch of elegance to contemporary outfits."
  ],
  "description": "These Jhumkas seamlessly blend traditional South Indian design with a contemporary aesthetic. The intricate peacock design symbolizes beauty and grace, while the high-quality emeralds represent prosperity and good fortune. Crafted with exceptional attention to detail and utilizing time-honored techniques, these earrings are not only visually stunning but also built to last. The Hyderabadi Polish ensures a long-lasting, radiant shine. A timeless piece that will be treasured for generations.",
  "tags": [
    "Jhumka",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Polki Diamonds",
    "Emerald Earrings",
    "Mayura",
    "Peacock Earrings",
    "Hyderabadi Jewelry",
    "Traditional Earrings",
    "Indian Wedding Jewelry",
    "Bridal Earrings",
    "గుండమ్మ పోగులు",
    "కెంపులు",
    "పచ్చలు",
    "ముత్యాలు"
  ],
  "original_id": "diamond_jewellery_d1ce764d-5490-4b9a-a760-279def9e6ad4_0206",
  "collection": "diamond"
}