{
  "id": "necklaces-135",
  "title": "The \"Mayuri Manoranjani\" Polki Diamond Haaram with Ruby and Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Uncut Polki Diamonds (పోల్కీ వజ్రాలు)",
    "Cabochon Ruby (మాణిక్యం)",
    "Cabochon Emeralds (పచ్చ)",
    "Natural Pearls (ముత్యాలు). Hyderabadi Polish for a rich",
    "antique luster."
  ],
  "features": "This magnificent Haaram showcases the timeless elegance of South Indian jewelry. It features intricate floral and peacock (Mayuri) motifs crafted with meticulously set Polki diamonds. A central cabochon ruby is surrounded by concentric circles of emeralds and diamond, creating a focal point of captivating color. Delicate pearl and emerald drops add graceful movement. The use of uncut Polki diamonds adds to the vintage charm and regal appeal. Handmade by skilled artisans using traditional nakshi work techniques.",
  "colors": [
    "Predominantly gold with the warm red of the ruby",
    "the lush green of the emeralds",
    "the milky white of the pearls",
    "and the subtle sparkle of the Polki diamonds."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "bridal wear (వధువు ఆభరణాలు)",
    "traditional ceremonies (సంప్రదాయ వేడుకలు)",
    "Muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "half-saree function (లంగా ఓణి వేడుక)",
    "and grand celebrations. Also suitable for making a statement at high-end social gatherings."
  ],
  "description": "This Haaram is a masterpiece of South Indian craftsmanship, combining traditional design with exceptional gemstone quality. The use of Polki diamonds adds a unique antique charm, while the ruby and emerald accents symbolize prosperity and good fortune. The intricate detailing and Hyderabadi polish make it a valuable heirloom piece. It's a statement of cultural pride and timeless elegance.",
  "tags": [
    "Haaram",
    "Haram",
    "Necklace",
    "Polki",
    "Diamond",
    "Ruby",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Gold Necklace",
    "Hyderabadi Jewelry",
    "Nakshi",
    "Temple Jewelry",
    "కంఠాభరణం",
    "వజ్రాలు",
    "మాణిక్యం",
    "పచ్చ",
    "ముత్యాలు",
    "సువర్ణము",
    "పెళ్లి",
    "ముహూర్తం",
    "సీమంతం",
    "లంగా ఓణి వేడుక"
  ],
  "original_id": "diamond_jewellery_DPNK8-1815_0368",
  "collection": "diamond"
}