{
  "id": "necklaces-1077",
  "title": "Kaleidoscope Empress Haaram: Tourmaline and Pearl Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "Faceted Emerald-cut Tourmalines (various colors",
    "VS clarity)",
    "Natural South Sea Pearls",
    "High-grade diamonds with SI clarity and G-H color. Features Hyderabadi Kundan setting for a classic touch."
  ],
  "features": "A breathtaking Haaram meticulously handcrafted with vibrant Tourmaline gemstones in emerald cuts, framed by shimmering diamonds set in a classic Kundan style. The cascade of lustrous South Sea pearls adds a touch of regal charm. The necklace features a graduating design, culminating in a large, mesmerizing tourmaline pendant also set with diamond accents. Each gemstone is meticulously hand-set, reflecting the skill of generations of artisans.",
  "colors": [
    "Multicolor - showcasing a spectrum of tourmaline hues (pinks",
    "greens",
    "peach)",
    "complemented by the bright yellow of the gold",
    "the dazzling white of the diamonds",
    "and the soft luster of the pearls."
  ],
  "occasions": [
    "Ideal for grand celebrations such as weddings (Vivaaham - వివాహం)",
    "receptions",
    "Seemantham (సీమంతం)",
    "or any occasion where you desire to make a statement. Perfect for pairing with Kanjeevaram sarees and other traditional attire."
  ],
  "description": "This Haaram represents the perfect blend of traditional craftsmanship and contemporary gemstone design. The use of genuine tourmalines, South Sea pearls, and brilliant diamonds ensures enduring value. Its bold design and vibrant colors make it a standout piece, radiating sophistication and cultural richness. A timeless heirloom to be treasured for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Tourmaline",
    "Pearl",
    "Diamond",
    "Kundan",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Statement Jewelry",
    "Vivaaham",
    "Seemantham",
    "Kantabharanam",
    "కంఠాభరణం",
    "Hyderabad Jewelry"
  ],
  "original_id": "radhe_diam_DPNK8-1763_2490",
  "collection": "radhe"
}