{
  "id": "necklaces-436",
  "title": "Mayuri Haram: Exquisite Peacock Diamond Necklace Set",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold with Hyderabadi Polish",
    "meticulously set with high-quality diamonds. Features two round-cut rubies totaling 1.58 carats and 28 emeralds totaling 5.80 carats. Excellent clarity and cut on all gemstones."
  ],
  "features": "This stunning 'Mayuri Haram' showcases the grace of peacocks, a revered motif in South Indian culture. The intricate design features two peacocks facing each other, adorned with rubies, and emeralds on the tail feathers. The necklace chain is composed of interconnected floral diamond patterns. The diamonds are set in a pave setting to maximize brilliance. Features fine filigree detailing.",
  "colors": [
    "Primarily gold and diamond white",
    "accented by the vibrant red of the rubies and the rich green of the emeralds. The traditional color combination symbolizes prosperity and happiness."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and other special occasions like Muhurtham",
    "Seemantham",
    "or a grand reception. Adds a touch of regal elegance to any attire."
  ],
  "description": "A timeless piece that blends traditional South Indian design with modern craftsmanship. The exquisite peacock motif symbolizes beauty, love, and prosperity, making it a meaningful heirloom. The Hyderabadi polish ensures a lasting luster, and the high-quality diamonds guarantee exceptional brilliance. It is a statement piece that embodies cultural significance and refined taste.",
  "tags": [
    "Haram",
    "Peacock Necklace",
    "Mayuri Haram",
    "Diamond Necklace",
    "Ruby Emerald Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Bridal Jewellery",
    "Kasulaperu",
    "Addigai",
    "Guttapusalu",
    "Andhra Jewellery",
    "Telugujewellery",
    "Grwt:-143.560",
    "Dwt:-14.90(3857)",
    "Ruby:-1.58(2)",
    "Eme:-5.80(28)",
    "Des-Oct-2784",
    "Har01001"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-11_0877",
  "collection": "diamond"
}