{
  "id": "necklaces-380",
  "title": "Ratnalanka Emerald Cascade Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Rubies (Oval Cabochon Cut)",
    "Polki Diamonds (Uncut Diamonds)",
    "Carved Emerald (Square Cushion Cut). Finished with a lustrous Hyderabadi Polish for enduring brilliance."
  ],
  "features": "This exquisite Haaram features a cascading design, starting with a string of vibrant ruby cabochons interspersed with Polki diamonds set in a floral motif. The centerpiece is a stunning carved emerald, surrounded by a halo of sparkling Polki diamonds. The setting showcases traditional Kundan craftsmanship, with intricate detailing and secure stone settings.",
  "colors": [
    "Predominantly gold with vibrant ruby red and a captivating emerald green. The Polki diamonds add a touch of timeless sparkle with their natural",
    "off-white hue."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "receptions",
    "bridal showers",
    "Seemantham (baby shower)",
    "half-saree functions (Voni Function)",
    "and other grand celebrations. Also suitable for making a statement at high-end parties and cultural events."
  ],
  "description": "A true heirloom piece, this Ratnalanka Haaram blends the richness of traditional South Indian jewelry with contemporary design sensibilities. The combination of rubies, emeralds, and Polki diamonds is considered highly auspicious and brings prosperity. The Hyderabadi polish ensures lasting shine and durability, making it a valuable investment for generations to come. The unique carved emerald adds an element of artistry and individuality.",
  "tags": [
    "Haaram",
    "Necklace",
    "Ruby",
    "Emerald",
    "Polki Diamond",
    "Kundan",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Muhurtham",
    "Seemantham",
    "Voni Function",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "Ratnalanka",
    "Andalu",
    "Sampada",
    "ఆభరణాలు",
    "పెళ్లి నెక్లెస్",
    "రత్నాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241218-WA0011_0773",
  "collection": "diamond"
}