{
  "id": "earrings-496",
  "title": "Timeless Polki Diamond Drop Earrings - A Hyderabadi Heirloom",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Enhanced with meticulous setting by Hyderabadi artisans. Features the iconic Hyderabadi Polish for a lasting brilliance and shine."
  ],
  "features": "Crafted in a classic drop design, these earrings feature three graduated sections: a round polki diamond halo, leading to a smaller connecting diamond and finishing with a teardrop-shaped Polki. The intricate setting showcases each diamond’s natural beauty, creating a mesmerizing play of light. Each diamond is delicately set by our finest artisans, emphasizing the unique nature of the diamond.",
  "colors": [
    "Predominantly gold with the translucent sparkle of Polki diamonds",
    "reflecting light beautifully."
  ],
  "occasions": [
    "Perfect for special occasions",
    "including weddings (Muhurtham)",
    "receptions",
    "and festive celebrations. Also suitable for adding a touch of regal elegance to contemporary outfits."
  ],
  "description": "A timeless piece that embodies the rich heritage of Hyderabadi craftsmanship. Polki diamonds, known for their uncut, natural beauty, hold a special place in South Indian jewelry traditions. The Hyderabadi polish ensures long-lasting brilliance and adds an element of prestige. Owning this exquisite piece means owning a slice of history and an item sure to become a family heirloom.",
  "tags": [
    "Polki Diamonds",
    "Uncut Diamonds",
    "Hyderabadi Jewelry",
    "Gold Earrings",
    "Traditional Indian Jewelry",
    "South Indian Jewelry",
    "Jhumka",
    "పెళ్ళి నగలు",
    "బంగారం దుద్దులు",
    "Jewelry",
    "Fine Jewelry",
    "Wedding Jewellery",
    "Indian Wedding",
    "Indian Bridal Jewellery",
    "heirloom jewelry",
    "Hyderabad"
  ],
  "original_id": "ear_rings_DPER8-1605_2623",
  "collection": "ear"
}