{
  "id": "necklaces-1039",
  "title": "Rajalakshmi Kundan Haaram: Ruby & Polki Diamond Grandeur",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approx. 91.6% purity)",
    "Fine Quality Polki Diamonds (Uncut Diamonds)",
    "Natural Burmese Rubies. Features Hyderabadi Polish for enduring luster."
  ],
  "features": "Elaborately crafted Kundan setting showcasing the natural brilliance of Polki diamonds. Features a regal layered design with ruby accents. The 'Kundan' work is meticulously handcrafted, creating a traditional yet modern appeal. Intricate detailing on the reverse side adds to the craftsmanship. The symmetrical design speaks of balance and harmony, key elements of South Indian jewelry.",
  "colors": [
    "Rich Golden Yellow (Gold)",
    "Deep Crimson Red (Rubies)",
    "and Sparkling White (Polki Diamonds) creating a vibrant and auspicious combination."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "festivals (Sankaranti",
    "Ugadi)",
    "and other grand celebrations. Ideal bridal jewelry. Also suitable for a red-carpet event when paired with the right attire. Suitable for Seemantham and Half-Saree Functions."
  ],
  "description": "Authentic Hyderabadi craftsmanship blending traditional techniques with modern design sensibilities. The use of high-quality Polki diamonds and Burmese rubies guarantees exceptional sparkle and enduring value. Symbolically auspicious colors and design make it a cherished heirloom. A statement piece that embodies grace, tradition, and timeless beauty. The unique Polki cut captures light beautifully, ensuring you'll be the center of attention.",
  "tags": [
    "Haaram",
    "Kundan",
    "Polki",
    "Diamond",
    "Ruby",
    "Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Antique Jewelry",
    "कंठी",
    "Kanthi",
    "Vivahaalu",
    "Nischitartham",
    "Seemantham",
    "Ugadi",
    "Half-Saree"
  ],
  "original_id": "radhe_diam_DPCK8-756_2452",
  "collection": "radhe"
}