{
  "id": "necklaces-080",
  "title": "Chandrika Polki Necklace Set with Ruby and Pearls",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (Rose Cut)",
    "Natural Ruby",
    "South Sea Pearls",
    "Seed Pearls. Crafted with Hyderabadi Kundan setting techniques."
  ],
  "features": "This exquisite necklace set features a floral Polki pendant, cascading into a triangular design with a central Ruby. Three pearl strands are suspended below, each ending with a faceted pink tourmaline. The intricate Kundan setting highlights the brilliance of the uncut diamonds, reflecting the timeless elegance of Telugu craftsmanship. The design incorporates a contemporary touch with the tourmaline drops.",
  "colors": [
    "Gold (yellow)",
    "White (Polki diamonds and pearls)",
    "Red/Pink (Ruby and Tourmaline). A classic South Indian color palette symbolizing prosperity and auspiciousness."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "engagements",
    "Seemantham ceremonies",
    "or any grand occasion where traditional elegance is desired. Also suitable for upscale modern events where a touch of cultural heritage is appreciated."
  ],
  "description": "This Polki necklace set is a true heirloom piece, representing the rich cultural heritage of Hyderabad and South India. The use of high-quality Polki diamonds and natural gemstones ensures its lasting value. The unique design blends traditional Kundan craftsmanship with contemporary aesthetics, making it a versatile addition to any jewelry collection. Its timeless appeal and exquisite craftsmanship make it a cherished possession for generations to come.",
  "tags": [
    "Polki",
    "Kundan",
    "Haaram",
    "Necklace Set",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Ruby",
    "Pearls",
    "Indian Wedding Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Heirloom Jewelry",
    "Vivaha Mahotsavam",
    "Seemantham",
    "Uncut Diamonds",
    "Rose Cut Diamonds",
    "Chandrika"
  ],
  "original_id": "diamond_jewellery_DPER8-1180_0248",
  "collection": "diamond"
}