{
  "id": "necklaces-1457",
  "title": "Exquisite Jadau Haaram with Emeralds and Sapphires",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "Faceted Emeralds (Panche Ratnalu)",
    "Sapphire Beads (Neelam)",
    "Polki Diamonds (Uncut Diamonds)."
  ],
  "features": "Intricately crafted Jadau setting showcasing the brilliance of uncut Polki diamonds. Features alternating rows of carved emeralds and diamond-studded floral motifs along the neckline. The central pendant is a larger emerald surrounded by elaborate diamond detailing, leading to delicate sapphire bead drops. The gold setting is handcrafted using traditional South Indian Nakshi work techniques.",
  "colors": [
    "Predominantly gold with vibrant green emeralds",
    "deep blue sapphires",
    "and the dazzling white of Polki diamonds. A classic Telugu color palette for auspicious occasions."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischitartham)",
    "Seemantham (Baby Shower)",
    "and other grand celebrations. A statement piece that effortlessly elevates any festive or formal attire."
  ],
  "description": "A truly unique and heirloom-worthy Jadau Haaram. The Hyderabadi polish enhances the gold's luster, while the combination of emeralds, sapphires, and Polki diamonds creates a stunning visual impact. The exquisite craftsmanship ensures longevity and enduring value. This piece embodies the rich cultural heritage of South Indian jewelry, making it a prized possession for generations to come.",
  "tags": [
    "Jadau",
    "Haaram",
    "Necklace",
    "Emerald",
    "Sapphire",
    "Polki",
    "Diamonds",
    "Gold",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Nakshi Work",
    "Panche Ratnalu",
    "Neelam",
    "కంఠాభరణం",
    "వివాహం",
    "నిశ్చితార్థం"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-52_2075",
  "collection": "sjpl"
}