{
  "id": "necklaces-056",
  "title": "Divya Nakshi Chandrabali Pendant with Diamond Accents",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Natural Diamonds (VS Clarity",
    "G-H Color",
    "Brilliant Cut). The gold used is carefully sourced for its luster and purity",
    "reflecting the timeless traditions of South Indian craftsmanship."
  ],
  "features": "This exquisite Chandrabali pendant features intricate Nakshi work, a traditional South Indian style of engraving characterized by its detailed and textured appearance. The pendant showcases delicate floral motifs enhanced with sparkling diamond accents. A central gold 'gundla' (bead) adds a touch of classic elegance. The pendant bail is seamlessly integrated into the design for a refined finish.",
  "colors": [
    "Dominantly Golden Yellow",
    "with the brilliant white sparkle of diamonds providing contrast and enhancing the overall richness."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals",
    "and special occasions. Ideal as a statement piece for a saree or lehenga. Can be worn during Seemantham",
    "Muhurtham",
    "or other traditional Telugu ceremonies. Also suitable for adding a touch of cultural elegance to modern attire."
  ],
  "description": "This Chandrabali pendant is a true masterpiece of South Indian craftsmanship. The combination of traditional Nakshi work and sparkling diamonds creates a unique and timeless piece of jewelry. It showcases the rich cultural heritage of Hyderabad while appealing to modern sensibilities. The high-quality gold and diamonds ensure durability and lasting beauty, making it a treasured heirloom.",
  "tags": [
    "Chandrabali",
    "Pendant",
    "Locket",
    "Nakshi",
    "Diamond",
    "Gold",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Gundla"
  ],
  "original_id": "diamond_jewellery_81a22bab-60c6-4fc8-8b90-da4d419b0114_0148",
  "collection": "diamond"
}