{
  "id": "necklaces-497",
  "title": "Enchanting Navratna Haar with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finely crafted in [Specify Gold Purity",
    "e.g.",
    "22K] Gold",
    "accented with a Hyderabadi Polish for a lasting luster. Showcasing a stunning array of Navratna gemstones: Ruby",
    "Diamond",
    "Emerald",
    "Yellow Sapphire",
    "Blue Sapphire",
    "Pearl",
    "Coral",
    "Hessonite",
    "and Cat's Eye. Adorned with lustrous South Sea Pearls."
  ],
  "features": "This exquisite necklace features a contemporary design with floral and leaf motifs, meticulously crafted with intricate detailing. The Navratna gemstones are set in a [Specify Setting Style, e.g., Prong Setting] arrangement, maximizing their brilliance and vibrancy. The central pendant boasts a radiating design, culminating in a delicate pearl drop.",
  "colors": [
    "A vibrant and auspicious blend of colors from the Navratna gemstones: deep red Ruby",
    "clear white Diamonds",
    "lush green Emerald",
    "bright yellow Yellow Sapphire",
    "deep blue Blue Sapphire",
    "creamy white Pearls",
    "fiery orange Coral",
    "earthy brown Hessonite",
    "and shimmering Cat's Eye. Complemented by the golden hue of the setting."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha)",
    "receptions",
    "festive celebrations such as Diwali and Sankranthi",
    "and significant family events. Adds a touch of elegance to modern gatherings and sophisticated parties as well."
  ],
  "description": "This Navratna Haar is not just a piece of jewelry; it's a symbol of prosperity, health, and well-being. The carefully selected gemstones and skilled craftsmanship reflect the rich heritage of Hyderabad's jewelry tradition, while the modern design makes it a versatile piece for any occasion. A true heirloom to be cherished for generations.",
  "tags": [
    "Navratna Haar",
    "South Indian Jewelry",
    "Gemstone Necklace",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "South Sea Pearls",
    "Auspicious Jewelry",
    "Traditional Necklace",
    "Festive Jewelry",
    "Contemporary Design",
    "Vivaha",
    "Sankranthi",
    "Diwali",
    "Haar",
    "Telugu Jewelry",
    "Navaratnalu"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-27-13-02-30 2_0977",
  "collection": "diamond"
}