{
  "id": "necklaces-469",
  "title": "Exquisite Emerald and Diamond Vaddanam Haaram Set",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 91.6% pure)",
    "Sparkling Diamonds (VVS Clarity)",
    "Premium Emeralds (Excellent Cut",
    "vibrant green hue). Features a Hyderabadi Polish for lasting luster."
  ],
  "features": "This Haaram showcases a unique geometric design with a center emerald teardrop, leading to an elaborately detailed detachable pendant. The pendant showcases the emerald center and is surrounded by diamonds and emeralds. It showcases traditional South Indian design with a modern geometric twist. Diamond pave setting enhances the sparkle.",
  "colors": [
    "Predominantly gold",
    "with brilliant white diamonds",
    "and vibrant green emerald accents",
    "creating a regal and sophisticated color palette."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Muhurtham)",
    "engagements",
    "receptions",
    "Seemantham",
    "or any special celebration where you want to make a statement. Also suitable for upscale cultural events and formal gatherings."
  ],
  "description": "This statement necklace offers a luxurious blend of traditional craftsmanship and contemporary design. The high-quality emeralds and diamonds add value and prestige. The intricate detailing and Hyderabadi polish showcase the skill of our master artisans. The detachable pendant allows for versatile styling - wear it as a Haaram or detach the pendant for a Vaddanam look, making it a truly investment-worthy piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Vaddanam",
    "South Indian Jewelry",
    "Emerald",
    "Diamond",
    "Gold",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Muhurtham",
    "Seemantham",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Temple Jewelry",
    "Kasulaperu",
    "Andhra Jewellery",
    "Telugu Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-55 2_0932",
  "collection": "diamond"
}