{
  "id": "necklaces-1052",
  "title": "Enchanting Neelam Polki Haar: A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds (approx. 3.5 carats total)",
    "Pear-shaped Neelam (Blue Sapphire - approx. 4 carats)",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite necklace features a delicate arrangement of polki diamonds, each meticulously set in a closed setting to maximize their brilliance. The necklace culminates in a striking pear-shaped Neelam pendant, surrounded by a halo of sparkling polki diamonds. The design blends traditional polki craftsmanship with a modern, minimalist aesthetic. The gold exhibits a refined 'Hyderabadi Polish,' lending a subtle luster and enhancing the antique feel.",
  "colors": [
    "Yellow Gold",
    "White (Polki Diamonds)",
    "Deep Blue (Neelam)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "anniversaries",
    "or any special occasion where you want to make a statement. Also suitable for contemporary evening wear and cocktail parties",
    "adding a touch of heritage to a modern look."
  ],
  "description": "This Polki Haar is a fusion of tradition and contemporary elegance. The uncut diamonds retain their natural beauty, offering a raw, organic feel that is both luxurious and understated. The rare Neelam (Blue Sapphire) enhances the piece's regal charm. Handcrafted by skilled artisans in Hyderabad, this necklace is a testament to exceptional craftsmanship and enduring style. The classic design ensures it will be treasured for generations.",
  "tags": [
    "Polki",
    "Haaram",
    "Neelam",
    "Blue Sapphire",
    "Uncut Diamonds",
    "Necklace",
    "Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Fine Jewelry",
    "Vivaha",
    "Anniversary",
    "Gift"
  ],
  "original_id": "radhe_diam_DPNK8-1349_2465",
  "collection": "radhe"
}