{
  "id": "necklaces-006",
  "title": "Charming Diamond Teardrop Haaram Set with Matching Earrings",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "18K Rose Gold",
    "VS Clarity Diamonds. Boasting a lustrous Hyderabadi polish for enhanced brilliance and lasting shine. Each diamond is meticulously set in a prong setting to maximize its sparkle."
  ],
  "features": "This enchanting diamond set showcases a contemporary take on the traditional Haaram. The necklace features a delicate arrangement of teardrop and heart motifs, interspersed with exquisitely crafted oval shaped designs.The openwork design lends an airy elegance. The matching earrings echo the necklace's design, creating a harmonious and stunning set.",
  "colors": [
    "Rose Gold with shimmering White Diamonds."
  ],
  "occasions": [
    "Perfect for contemporary receptions",
    "cocktail parties",
    "or adding a touch of sophistication to festive occasions. Also suitable for anniversaries",
    "birthdays",
    "and as a treasured gift."
  ],
  "description": "This Diamond Haaram set offers a modern interpretation of classic South Indian aesthetics. The diamonds are carefully selected for their brilliance and clarity, enhancing the overall beauty of the piece. The lightweight design ensures comfortable wear, making it ideal for extended occasions. The Hyderabadi polish guarantees a long-lasting luster, preserving the jewelry's beauty for years to come. This set seamlessly blends elegance with contemporary style, making it a versatile addition to any jewelry collection.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Rose Gold Jewelry",
    "Diamond Earrings",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Contemporary Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Diamond Set",
    "VS Clarity Diamonds",
    "Telugu Jewelry"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0012_0041",
  "collection": "choker"
}