{
  "id": "necklaces-984",
  "title": "Diamond Floral Motif Haaram Set with Ruby & Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "18K Yellow Gold",
    "meticulously set with brilliant-cut diamonds. Adorned with a central pear-shaped Emerald gemstone and a round Ruby gemstone. Finished with lustrous South Sea Pearls. Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisitely crafted Haaram features a delicate floral motif throughout, enhanced by intricate diamond detailing. The central pendant boasts a striking pear-shaped Emerald, complemented by a round Ruby. The matching earrings mirror the necklace's design, completing the ensemble. The necklace is finished with a unique rope chain. The pearl drops add a touch of classic elegance.",
  "colors": [
    "Predominantly gold and white (diamonds) with vibrant accents of green (emerald) and red (ruby). The pearls offer a soft",
    "creamy contrast."
  ],
  "occasions": [
    "Perfect for weddings (Pendli)",
    "receptions",
    "and special celebrations. A stunning choice for brides or anyone seeking a touch of timeless elegance for a contemporary event."
  ],
  "description": "This haaram set is a harmonious blend of tradition and modern aesthetics. The intricate diamond work, combined with the vibrant gemstones and lustrous pearls, makes it a truly captivating piece. Its enduring design and exceptional craftsmanship guarantee it will be cherished for generations, making it an excellent investment.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Emerald",
    "Ruby",
    "Pearl",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Floral Design",
    "Pendant Set",
    "Pendli",
    "Reception Jewelry",
    "Contemporary Jewelry",
    "Rope Chain"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0438_2305",
  "collection": "necklace"
}