{
  "id": "necklaces-1470",
  "title": "Divine Peacock Ad Haaram with Emerald Drop - Mohana Mala",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "High-quality gold plating over alloy. American Diamonds (AD) with excellent clarity and fire. Features a central pear-shaped Emerald stimulant and lustrous freshwater pearls. Crafted with meticulous attention to detail and finished with a lasting Hyderabadi Polish."
  ],
  "features": "This exquisite necklace showcases a classic peacock (Mayura) design, a symbol of beauty and grace. Delicately crafted floral and leaf motifs are studded with shimmering AD stones, creating a dazzling effect. The central emerald-colored drop adds a touch of regality. Pearl droplets enhance the overall charm and movement.",
  "colors": [
    "Predominantly gold and white (AD stones)",
    "complemented by the vibrant green of the emerald and the soft ivory of the pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and other special occasions. Suitable for traditional ceremonies like muhurtham",
    "seemantham",
    "or a half-saree function. This statement piece also elevates contemporary Indian or Western outfits for parties and events."
  ],
  "description": "This Mohana Mala (enchanting necklace) is a true testament to South Indian design sensibilities, blending traditional motifs with a modern aesthetic. The vibrant emerald and shimmering AD stones create a captivating look. The high-quality gold plating ensures lasting beauty and durability, making it a cherished heirloom piece. A celebration of timeless elegance and craftsmanship.",
  "tags": [
    "Haaram",
    "Necklace",
    "American Diamond",
    "AD Jewelry",
    "Emerald",
    "Pearls",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Mayura",
    "Peacock Design",
    "Wedding Jewelry",
    "Hyderabadi Polish",
    "Mohana Mala",
    "Contemporary Traditional",
    "Party Wear",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-57 3_2088",
  "collection": "sjpl"
}