{
  "id": "necklaces-1542",
  "title": "Mayura Mohana Haaram - The Peacock's Enchantment",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold",
    "studded with dazzling Cubic Zirconia (CZ) Diamonds. Accented with Emerald Green Stones",
    "South Sea Pearls. Exhibits signature Hyderabadi Polish for lasting brilliance."
  ],
  "features": "Inspired by the majestic peacock (Mayura), this Haaram features intricate floral and paisley designs meticulously encrusted with CZ diamonds. The focal point is a stylized peacock motif adorned with a vibrant cascade of pear-shaped Emerald Green stones. Lustrous South Sea pearls delicately embellish the lower edge, adding a touch of classic elegance. Features delicate filigree work.",
  "colors": [
    "Primarily gold and white (CZ diamonds)",
    "complemented by vibrant emerald green and creamy white South Sea pearls. A luxurious and regal color palette."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaha Mahotsavam)",
    "receptions",
    "and Seemantham ceremonies. A show-stopping piece for any special occasion where you want to make a lasting impression. Ideal for the modern bride seeking traditional elegance with a contemporary flair."
  ],
  "description": "A true masterpiece of Hyderabadi craftsmanship, the Mayura Mohana Haaram seamlessly blends traditional South Indian aesthetics with modern design sensibilities. The intricate detailing, the vibrant gemstone combination, and the timeless appeal of the peacock motif make this piece a treasured heirloom. This Haaram is not just jewelry; it's a statement of cultural pride and refined taste.",
  "tags": [
    "Haaram",
    "కంఠాభరణం",
    "Peacock Necklace",
    "Mayura",
    "Bridal Jewelry",
    "Wedding Necklace",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "CZ Diamonds",
    "Emerald",
    "Pearls",
    "Statement Necklace",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Vivaha",
    "Seemantham",
    "Hyderabadi Polish",
    "Designer Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-10_2160",
  "collection": "sjpl"
}