{
  "id": "necklaces-1307",
  "title": "Diamond 'Addigai' Pendant - A Touch of Telugu Tradition",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18K Yellow Gold setting. Features brilliant-cut diamonds of VS clarity and G-H color grade. Each stone is meticulously hand-set by our skilled artisans."
  ],
  "features": "This exquisite pendant draws inspiration from the classic Telugu 'Addigai' (choker necklace) design, miniaturized into a modern pendant form. It features a stylized floral motif at its heart, surrounded by graceful, sweeping lines that mimic the traditional 'Addigai' shape. The pave setting maximizes the brilliance of each diamond, creating a dazzling effect. The lightweight design ensures comfortable wear.",
  "colors": [
    "Predominantly White (diamonds) with a warm Yellow Gold accent. This timeless combination exudes sophistication and elegance."
  ],
  "occasions": [
    "Perfect for everyday wear or special occasions. A beautiful gift for weddings",
    "anniversaries",
    "or as a 'pasupu kumkuma' gift. Its delicate size makes it suitable for younger women and can be elegantly paired with both traditional South Indian attire and modern ensembles."
  ],
  "description": "This diamond pendant represents a beautiful fusion of traditional Telugu jewelry aesthetics and modern design sensibilities. Crafted with high-quality materials and meticulous attention to detail, it's a timeless piece that will be cherished for generations. Its versatile style allows for effortless integration into any wardrobe. A contemporary interpretation of classic South Indian elegance.",
  "tags": [
    "Diamond Pendant",
    "Addigai",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Modern Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "VS Clarity Diamonds",
    "18K Gold",
    "Pasupu Kumkuma Gift",
    "Anniversary Gift",
    "Contemporary Design",
    "Floral Pendant",
    "Haarams"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-36 2_1905",
  "collection": "sjpl"
}