{
  "id": "necklaces-479",
  "title": "Exquisite Emerald and Diamond Grand Haaram - The \"Indrani\"",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity gold",
    "this haaram showcases a dazzling array of brilliant-cut diamonds. The design is accented with natural",
    "vibrant green emeralds (5.15 carat and 1.77 carat) and rich red rubies (7.25 carat)",
    "meticulously set to enhance their natural beauty. Boasting a Hyderabadi polish."
  ],
  "features": "This grand haaram features a intricate, layered design that embodies traditional South Indian elegance. The floral motifs are exquisitely crafted and set with diamonds, while the emerald drops provide a captivating contrast. The pendant is detachable and can be used as a brooch. The design includes traditional motifs, and a antique finish is applied to enhance its timeless appeal.",
  "colors": [
    "The overall color scheme is a luxurious blend of golden yellow from the gold",
    "dazzling white from the diamonds",
    "vibrant green from the emeralds",
    "and touches of deep red from the rubies. This classic South Indian color palette evokes a sense of richness and tradition."
  ],
  "occasions": [
    "Perfect for a grand wedding",
    "a milestone anniversary",
    "or any occasion where you want to make a statement of timeless elegance. Ideal for a Muhurtham",
    "Seemantham",
    "or half-saree function",
    "as well as high-profile social gatherings."
  ],
  "description": "This haaram is a true heirloom piece, blending impeccable craftsmanship with timeless design. The use of high-quality emeralds and diamonds ensures its enduring value, while the detachable pendant offers versatility. It represents a fusion of traditional South Indian aesthetics with modern luxury.",
  "tags": [
    "Haaram",
    "Haram",
    "Necklace",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Emerald",
    "Diamond",
    "Ruby",
    "Nakshi Work",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Muhurtham",
    "Seemantham",
    "Grand Necklace",
    "Andhra Jewellery",
    "Telugu Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-58 3_0942",
  "collection": "diamond"
}