{
  "id": "necklaces-666",
  "title": "Emerald & Diamond Grand Collar Necklace - Pancha Ratna Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold with Hyderabadi Polish",
    "Brilliant Cut Diamonds (VVS Clarity",
    "G Color)",
    "Emeralds (Square Cut center",
    "Pear Cut dangles) - high quality precious gemstones"
  ],
  "features": "Magnificent collar necklace design featuring an intricate floral-inspired center pendant. Pavé-set diamonds accentuate the design, creating a dazzling effect. The center emerald is framed by delicate filigree work. Graduated rows of diamond bars extend from the center, culminating in elegant diamond-encrusted swirl motifs on the sides. Pear shaped emeralds are dangle at the center.",
  "colors": [
    "Predominantly white (diamonds) and green (emeralds) with yellow gold accents",
    "a classic and regal combination."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli Kuthuru)",
    "grand receptions",
    "Sangeeth functions",
    "and other special occasions where you desire to make a statement. Also ideal for anniversary gifts and significant celebrations."
  ],
  "description": "This 'Pancha Ratna Haaram' boasts exceptional craftsmanship and top-quality materials. The brilliant-cut diamonds capture the light beautifully, while the emeralds add a touch of regal elegance. The meticulous detailing and unique design make it a true heirloom piece, perfect for passing down through generations. Its intricate design and high-quality gemstones guarantee a lasting impression.",
  "tags": [
    "Necklace",
    "Haaram",
    "Emerald",
    "Diamond",
    "Collar Necklace",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Party Wear",
    "Grand Necklace",
    "Pancha Ratna",
    "Pelli Kuthuru",
    "Reception",
    "Sangeeth",
    "Filigree",
    "Pavé Setting"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-33_1172",
  "collection": "diamond"
}