{
  "id": "necklaces-1519",
  "title": "Divyamani Peacock Haaram: Exquisite Diamond and Emerald Grand Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold with Hyderabadi Polish. Adorned with brilliant-cut diamonds (VS clarity",
    "G color) and Zambian Emeralds (AAA quality",
    "vibrant green hue)."
  ],
  "features": "This stunning haaram features intricate peacock (Mayura) motifs, a symbol of beauty and grace, throughout the design. The pendant showcases a larger, elaborate peacock design, cascading down the neckline. Delicate gold beads (guttapusalu style) hang from the bottom, adding movement and shimmer. The piece is entirely handcrafted using traditional techniques, ensuring exceptional detail and quality.",
  "colors": [
    "Predominantly gold with a dazzling display of white diamonds and vibrant green emeralds. The Hyderabadi polish gives the gold a warm",
    "antique-inspired glow."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Vivaha Mahotsavam)",
    "engagements (Nischitartham)",
    "and other significant milestones. A statement piece for brides and women who appreciate timeless elegance and South Indian heritage."
  ],
  "description": "This Divyamani Haaram is a testament to South Indian craftsmanship and artistry. The use of high-quality diamonds and emeralds, combined with the symbolic peacock design, makes it a cherished heirloom. Its exceptional design, durability, and exquisite detail ensure a lasting impression. Each piece is carefully crafted by skilled artisans from Hyderabad.",
  "tags": [
    "Haaram",
    "Long Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Peacock Design",
    "Mayura",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Guttapusalu",
    "Grand Necklace",
    "Statement Necklace",
    "Indian Wedding"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-41 2_2137",
  "collection": "sjpl"
}