{
  "id": "earrings-118",
  "title": "Exquisite Polki & Gemstone Chandbali - A Timeless Telugu Classic",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Natural Pearls",
    "and Faceted Gemstone Drops (Tourmaline & Peridot). Exhibits Hyderabadi Zardosi Polish for a rich",
    "antique luster."
  ],
  "features": "A classic Chandbali design featuring a central circular motif meticulously adorned with Polki diamonds in a closed setting. The Polki stones are arranged in a floral pattern, exuding traditional elegance. Delicate pearl and gemstone drops are gracefully suspended along the bottom edge, enhancing the ethereal beauty. The earrings feature a 'kaan chain' provision (chain attachment to the hair), typical of traditional Telugu bridal jewellery.",
  "colors": [
    "Warm Gold",
    "Sparkling White (Polki)",
    "Lustrous White (Pearls)",
    "and a Vibrant Palette of Green (Peridot) and Pink/Red (Tourmaline) gemstone drops."
  ],
  "occasions": [
    "Perfect for weddings (especially Telugu Kalyanam)",
    "engagements",
    "festivals like Sankranti and Diwali",
    "and grand celebratory events. Also suitable for adding a touch of heritage elegance to sophisticated modern outfits."
  ],
  "description": "This Chandbali is a testament to Hyderabad's rich jewelry heritage. The use of uncut Polki diamonds adds a royal touch, while the colourful gemstone drops offer a contemporary twist. The piece represents timeless elegance and impeccable craftsmanship, making it a treasured heirloom for generations. Each gemstone is carefully selected for its quality and brilliance, reflecting our commitment to excellence.",
  "tags": [
    "Chandbali",
    "Jhumka",
    "Polki",
    "Diamonds",
    "Gold",
    "Pearls",
    "Gemstones",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Heirloom Jewelry",
    "Ethnic Jewelry",
    "Earrings",
    "Kaan Chain",
    "Zardosi Polish",
    "Muhurtham",
    "Kalyanam"
  ],
  "original_id": "diamond_jewellery_DPCB8-1588_0225",
  "collection": "diamond"
}