{
  "id": "necklaces-1170",
  "title": "Lakshmi Kasu Mala Pendant - A Divine Adornment",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (GWT-26.410)",
    "Brilliant Cut Diamonds (DWT-2.14)",
    "Natural Rubies (Ruby-0.30). Features a Hyderabadi Polish for a rich",
    "lustrous finish."
  ],
  "features": "This exquisite pendant showcases Goddess Lakshmi seated in a lotus posture, meticulously handcrafted with fine detailing using traditional Nakshi work techniques. The deity is surrounded by an ornate floral frame studded with sparkling diamonds. The pendant is finished with antique finish. Small rubies adorn the top and bottom providing a touch of color and enhancing the overall design.",
  "colors": [
    "Predominantly gold with bright white diamonds and a subtle pop of red from the rubies. A classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Ideal for auspicious occasions such as weddings (Vivaha)",
    "festivals (like Diwali and Ugadi)",
    "housewarmings (Gruhapravesam)",
    "and religious ceremonies. It makes a cherished heirloom piece."
  ],
  "description": "Embrace divine blessings with this meticulously crafted Lakshmi pendant. The traditional Nakshi work, combined with the brilliance of diamonds and the auspiciousness of rubies, creates a piece that is both aesthetically stunning and spiritually significant. The high-quality gold and gemstones ensure its lasting value and beauty. A perfect blend of tradition and elegance.",
  "tags": [
    "Lakshmi Pendant",
    "Kasu Mala",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Diamond Pendant",
    "Ruby Pendant",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Devotional Jewelry",
    "Hyderabadi Jewelry",
    "Andhra Jewelry",
    "Telangana Jewelry",
    "Abharanam",
    "Daivam"
  ],
  "original_id": "sjpl_PHOTO-2023-08-26-14-08-18 3_1722",
  "collection": "sjpl"
}