{
  "id": "waistbands-026",
  "title": "Mayura Nakshi Vaddanam: Peacock Motif Gold Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Yellow Gold",
    "Handcrafted with Hyderabadi Polish for a radiant luster. The gold is meticulously crafted to ensure durability and longevity."
  ],
  "features": "This exquisite Vaddanam showcases intricate Nakshi work, a hallmark of South Indian temple jewelry. The central design features majestic peacocks (Mayura), symbolizing beauty and grace. Delicate filigree detailing and intricate floral motifs are interspersed throughout the belt. The design includes adjustable links for a comfortable and secure fit. Each dangling detail is carefully crafted to add movement and shimmer.",
  "colors": [
    "Lustrous yellow gold throughout the entire piece"
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "bridal wear",
    "Seemantham (baby shower)",
    "half-saree functions (Langa Voni Function)",
    "and other grand celebrations. Also suitable for formal gatherings where you want to make a statement."
  ],
  "description": "This Vaddanam is a timeless heirloom piece, combining traditional craftsmanship with exquisite design. The intricate Nakshi work and peacock motifs represent a rich cultural heritage. The high-quality gold ensures lasting value and brilliance. It's a perfect blend of tradition and elegance, making it a coveted addition to any jewelry collection. The craftsmanship and detailed work are sure to grab attention.",
  "tags": [
    "Vaddanam",
    "Kamarband",
    "Waist Belt",
    "Gold Jewelry",
    "Nakshi",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Bridal Jewelry",
    "Vivaaham",
    "Seemantham",
    "Langa Voni",
    "Mayura",
    "Peacock",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Indian Wedding",
    "Jewellery",
    "22K Gold"
  ],
  "original_id": "diamond_jewellery_WhatsApp Image 2024-09-04 at 22.05.59_80b731fb_1427",
  "collection": "diamond"
}