{
  "id": "necklaces-1389",
  "title": "Emerald Blossom Diamond Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "meticulously crafted with brilliant-cut diamonds and vivid green emeralds. The gold is finished with a radiant",
    "long-lasting Hyderabadi Polish",
    "enhancing its luster and durability."
  ],
  "features": "This exquisite Haaram showcases a delicate floral design, intricately studded with diamonds. Two stunning emeralds are strategically placed to draw the eye and symbolize prosperity and new beginnings. Features diamond-studded paisley motifs and dangling teardrop diamond accents. The detailed craftsmanship reflects the rich heritage of South Indian jewelry making.",
  "colors": [
    "A vibrant combination of radiant yellow gold",
    "sparkling white diamonds",
    "and lush green emeralds."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements (Nischitartham)",
    "grand receptions",
    "milestone celebrations",
    "and significant cultural events. It's a statement piece that adds a touch of regal elegance to any outfit."
  ],
  "description": "This Haaram is more than just jewelry; it's an heirloom. The use of high-quality diamonds and emeralds, combined with the exceptional craftsmanship and Hyderabadi polish, ensures lasting beauty and value. It's a symbol of enduring elegance and cultural heritage, making it a perfect investment and a cherished possession. Each stone is hand-selected for its brilliance and clarity, guaranteeing a mesmerizing sparkle.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Aadhigai",
    "Nischitartham",
    "Engagement",
    "Fine Jewelry",
    "Indian Wedding",
    "Traditional Jewelry",
    "Contemporary Design",
    "Luxury Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-04_2007",
  "collection": "sjpl"
}