{
  "id": "necklaces-097",
  "title": "Divine Polki Diamond Lakshmi Haaram with Emerald Accents",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (natural inclusions)",
    "Emeralds (round cut",
    "medium green)",
    "Freshwater Pearls",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Haaram showcases traditional South Indian craftsmanship with a modern twist. The Polki diamonds are meticulously set in a closed setting, showcasing their natural beauty. Delicate emeralds are interspersed along the chain, adding vibrant color. The central pendant features a Lakshmi devi motif crafted in detailed gold nakshi work, surrounded by a halo of Polki diamonds and a border of lustrous freshwater pearls. The guttapusalu (pearl droplet) inspired design adds a timeless elegance.",
  "colors": [
    "Gold (warm yellow)",
    "White (Polki diamonds and pearls)",
    "Green (Emeralds)",
    "Hint of red from ruby in the pendant."
  ],
  "occasions": [
    "Ideal for weddings (Muhurtham)",
    "Seemantham ceremonies",
    "Half-Saree functions",
    "Bridal wear",
    "and other significant traditional events. Also suitable for high-end festive occasions and adding a touch of regal elegance to modern attire."
  ],
  "description": "A masterpiece of traditional South Indian jewelry, this Haaram is a timeless investment. The use of uncut Polki diamonds highlights the raw beauty of nature, while the Lakshmi motif brings blessings and prosperity. The Hyderabadi polish ensures a long-lasting shine. This piece is a perfect blend of cultural heritage and sophisticated design, making it a cherished heirloom.",
  "tags": [
    "Haaram",
    "Polki Diamond",
    "Emerald",
    "Necklace",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Lakshmi Pendant",
    "Gutta Pusalu",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Uncut Diamond",
    "22K Gold",
    "Telugu Jewelry",
    "Seemantham",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_DPHR8-1775_0326",
  "collection": "diamond"
}