{
  "id": "earrings-626",
  "title": "Emerald-Kissed Diamond Jhumka – A Timeless South Indian Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "meticulously handcrafted. Features a vibrant pear-shaped Emerald (కుదనపు పచ్చ) of exceptional clarity",
    "surrounded by meticulously set sparkling Diamonds. Genuine Pearls adorn the bottom. Enhanced with a fine Hyderabadi polish for a lasting shine."
  ],
  "features": "Classic Jhumka design with intricate filigree work inspired by traditional South Indian architecture. The emerald centerpiece is set in a delicate floral pattern. The cascading pearls enhance the jhumka’s graceful movement and traditional charm. Features open setting for maximum brilliance of diamonds.",
  "colors": [
    "Predominantly Gold and White (Diamond)",
    "complemented by the vibrant Green of the Emerald and the soft luster of the Pearls. A color palette that resonates with Telugu traditions."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagement ceremonies (నిశ్చితార్థం)",
    "Seemantham (శ్రీమంతం)",
    "and festive celebrations like Diwali and Ugadi. Also suitable for special occasions where you want to showcase your heritage and style."
  ],
  "description": "These Jhumkas are a harmonious blend of tradition and elegance. The combination of emeralds, diamonds, and pearls signifies prosperity and good fortune. The intricate gold work, handcrafted by skilled artisans in Hyderabad, ensures a unique and timeless piece. The excellent craftsmanship makes it a durable and treasured family heirloom.",
  "tags": [
    "Jhumka",
    "Earrings",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Jewelry",
    "Emerald",
    "Diamonds",
    "Pearls",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "పెళ్లి నగలు",
    "చెవి దుద్దులు",
    "Kundan",
    "Filigree",
    "Indian Earrings",
    "Ethnic Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 10_2203",
  "collection": "sjpl"
}