{
  "id": "necklaces-068",
  "title": "Auspicious Ganesha Vanki Pendant: Embrace Tradition with Sparkle",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "High-Quality Cubic Zirconia (CZ) Stones. Features a traditional Hyderabadi Polish for a rich",
    "lasting luster."
  ],
  "features": "This exquisite vanki pendant showcases a meticulously crafted Ganesha motif at its center, symbolizing prosperity and wisdom. The delicate filigree work is encrusted with sparkling cubic zirconia stones, adding a touch of modern glamour to the traditional design. The central Ganesha is set within a circular frame, also studded with CZs. The pendant's graceful curves are inspired by traditional vanki (armlet) designs, creating a sense of timeless elegance. A dangling gold bead enhances the pendant's overall appeal. The use of cut-out designs adds to the airy feel and lightness of the piece.",
  "colors": [
    "Predominantly yellow gold with brilliant white cubic zirconia accents."
  ],
  "occasions": [
    "Perfect for weddings",
    "festivals like Ganesh Chaturthi",
    "Diwali",
    "and Ugadi",
    "or any auspicious occasion. Its versatile design also makes it suitable for contemporary celebrations and everyday wear."
  ],
  "description": "This vanki pendant beautifully blends traditional South Indian artistry with modern design sensibilities. The Ganesha motif carries deep cultural and religious significance, while the dazzling cubic zirconia stones offer a contemporary sparkle. Crafted with high-quality materials and meticulous attention to detail, this pendant is a timeless treasure that will be cherished for generations. The Hyderabadi polish guarantees long-lasting shine and durability. A symbol of good fortune, this pendant is a unique and meaningful addition to any jewelry collection.",
  "tags": [
    "Vanki",
    "Pendant",
    "Ganesha",
    "Ganapati",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Gold Jewelry",
    "Cubic Zirconia",
    "CZ",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Festival Jewelry",
    "Auspicious Jewelry",
    "Pillayar"
  ],
  "original_id": "diamond_jewellery_cc0b462d-8efc-4d1a-92fc-15940f4ffb7b_0200",
  "collection": "diamond"
}