{
  "id": "earrings-645",
  "title": "Emerald Bloom Jhumka - A Symphony of Tradition and Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold Plated",
    "High Quality Cubic Zirconia (CZ) stones",
    "Faceted Emerald (Marakathamani) center stone",
    "Cultured Pearls. Features a lustrous Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "These stunning jhumkas feature a delicate floral design at the top, leading to a traditionally shaped jhumka (bell) adorned with intricately set CZ stones. The open filigree work showcases exceptional craftsmanship. A single, lustrous pearl adds a touch of classic charm. The Emerald adds a regal touch, reminiscent of Nizami jewelry traditions.",
  "colors": [
    "Primarily gold and white (CZ)",
    "with a vibrant pop of green from the emerald and the soft ivory of the pearl. The contrast creates a visually appealing and harmonious palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "festive occasions like Diwali and Sankranthi",
    "traditional ceremonies such as half-saree functions (Vayyaralu)",
    "or any event where you want to make a statement. Also suitable for contemporary parties and celebrations."
  ],
  "description": "These jhumkas blend traditional South Indian design with a modern aesthetic. The high-quality materials ensure lasting beauty and durability. The Emerald center stone adds a touch of luxury and prestige. The Hyderabadi polish lends a unique brilliance, setting this piece apart. They are lightweight and comfortable to wear, making them ideal for long events.",
  "tags": [
    "Jhumka",
    "Karnaphul",
    "Earrings",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "Pearls",
    "Hyderabadi Jewelry",
    "Indian Wedding",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Vayyaralu",
    "Vivahaalu",
    "Marakathamani"
  ],
  "original_id": "sjpl_PHOTO-2024-05-28-12-26-35 6_2222",
  "collection": "sjpl"
}