{
  "id": "earrings-205",
  "title": "Pushpa Polki Stud Earrings - Modern Mogra Design",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Polki Diamonds (uncut diamonds)",
    "Tourmaline",
    "set in a bezel and prong setting. The gold features a subtle Hyderabadi polish to enhance its luster without overpowering the stones."
  ],
  "features": "These earrings feature a delightful Mogra (Jasmine) flower design crafted with vibrant pink tourmaline cabochons, each petal meticulously set in gold. Suspended below is a rectangular frame that houses a striking Polki diamond, its natural inclusions adding to its unique charm. The frame itself is encrusted with pave-set diamonds, creating a halo effect that enhances the Polki's brilliance. The open back setting of the Polki diamond allows light to pass through, maximizing its sparkle. This piece elegantly blends floral motifs with geometric shapes for a sophisticated look.",
  "colors": [
    "The overall color scheme is a harmonious blend of warm gold",
    "vibrant pink (Tourmaline)",
    "and sparkling white (Polki and surrounding Diamonds)."
  ],
  "occasions": [
    "Perfect for daytime events",
    "weddings",
    "engagements",
    "or any festive occasion. Suitable for a modern take on traditional attire or to add a touch of elegance to contemporary outfits. Ideal for a Muhurtham look or an evening gala."
  ],
  "description": "This piece represents a seamless fusion of traditional Polki diamond artistry with contemporary design sensibilities. The natural beauty of the Polki diamond is accentuated by the floral and geometric frame, creating a statement piece that is both elegant and unique. The combination of tourmaline and polki adds a touch of vibrancy, while the Hyderabadi polish on the gold ensures a lasting, luxurious finish. These earrings are comfortable to wear and exude timeless sophistication.",
  "tags": [
    "Earrings",
    "Studs",
    "Polki Diamonds",
    "Tourmaline",
    "Mogra Design",
    "Flower Jewelry",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Contemporary Jewelry",
    "Fine Jewelry",
    "Muhurtham",
    "Pendali",
    "Butta"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0049_0457",
  "collection": "diamond"
}