{
  "id": "earrings-187",
  "title": "Emerald Cascade Jhumka: A Verdant Symphony of Tradition and Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Faceted Emeralds (Zambian",
    "Oval Cut",
    "VS Clarity)",
    "Polki Diamonds",
    "Freshwater Pearls. Features a Hyderabadi Polish for lasting luster."
  ],
  "features": "These exquisite Jhumkas boast a classic flower motif featuring a central oval-cut emerald surrounded by Polki diamonds, capturing the essence of traditional South Indian jewelry design. Below, a delicate cascade of emerald beads leads to tiny freshwater pearls adding a touch of contemporary flair. The setting exemplifies intricate craftsmanship, highlighting the gemstone's brilliance. The earrings are designed for comfortable wear, reflecting our commitment to quality.",
  "colors": [
    "Lustrous Gold",
    "Vibrant Green (Emeralds)",
    "Sparkling White (Diamonds)",
    "Soft White (Pearls). A traditional and auspicious color palette."
  ],
  "occasions": [
    "Perfect for festive occasions",
    "weddings ( పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "religious ceremonies",
    "and other special celebrations. Adds a touch of elegance to any saree or lehenga. Also suitable for modern cocktail parties and formal events."
  ],
  "description": "These Emerald Cascade Jhumkas are a testament to timeless South Indian elegance. The combination of vibrant emeralds, dazzling diamonds, and lustrous gold creates a striking visual impact. Each piece is handcrafted by skilled artisans, ensuring exceptional quality and durability. The emeralds symbolize prosperity and good fortune, making these earrings a cherished heirloom. They are a blend of tradition and modernity.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Emerald",
    "Polki Diamond",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "చెవి దిద్దులు",
    "Kanchipuram",
    "Hyderabad Jewelry",
    "Zambian Emerald",
    "Freshwater Pearl",
    "Ethnic Jewelry",
    "Festive Wear",
    "Muhurtham",
    "Engagement",
    "Indian Wedding"
  ],
  "original_id": "diamond_jewellery_f3293720-fd23-43c5-b0c8-5ce3de3f6c4a_0403",
  "collection": "diamond"
}