{
  "id": "earrings-226",
  "title": "Chandbali Earrings - Ruby Drop with Polki Diamonds",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold. Central stone is a deep red Ruby with a pear-cut. The earrings are embellished with Polki diamonds",
    "intricately set in a Kundan style setting. Hyderabadi Polish applied for lasting shine."
  ],
  "features": "These Chandbali earrings blend traditional and modern design elements. The pear-shaped ruby creates a focal point, surrounded by a halo of sparkling Polki diamonds. The design is reminiscent of the Mughal era and enhanced with South Indian craftsmanship. The intricate filigree work around the Polki settings exemplifies the skill of our artisans. A contemporary spin on the classic chandbali earrings. The top part of the earring features floral details of circular and petal-shaped Polki diamonds.",
  "colors": [
    "Deep Red (Ruby)",
    "Yellow Gold",
    "and Clear (Polki Diamonds). The red and gold combination is considered auspicious in South Indian traditions."
  ],
  "occasions": [
    "Ideal for weddings (పెళ్లి)",
    "receptions",
    "or festive occasions like Diwali. Suitable for half-saree functions",
    "temple visits or as a statement piece for formal events. Can also elevate a modern outfit."
  ],
  "description": "A harmonious blend of South Indian and Mughal styles. The Ruby is believed to bring prosperity and good health. The Polki diamonds add an unmatched brilliance. Handcrafted by master artisans ensuring exceptional quality and durability. The unique design sets it apart from conventional earrings.",
  "tags": [
    "Chandbali",
    "Earrings",
    "Jhumka",
    "Ruby",
    "Polki",
    "Kundan",
    "Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Chevi Duddulu",
    "Muhurtham Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Earrings",
    "Festive Jewelry",
    "Pear Cut Ruby",
    "Diamond Earrings"
  ],
  "original_id": "diamond_jewellery_IMG-20241218-WA0007_0769",
  "collection": "diamond"
}