{
  "id": "bangles-223",
  "title": "Swarna Pushpa Vanki - Diamond Floral Gold Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold (Swarna)",
    "Natural Diamonds (Vajraalu) - Round Brilliant Cut",
    "SI Clarity",
    "GH Color. Features Hyderabadi Polish for a radiant sheen."
  ],
  "features": "A delicately crafted bangle featuring a continuous floral motif. Each flower is adorned with a cluster of brilliant-cut diamonds, meticulously set in a prong setting to maximize their sparkle. The gold is formed in a fluid, wavy design, offering a contemporary take on the traditional Vanki (armlet) style. The design ensures comfortable wear and lasting beauty.",
  "colors": [
    "Radiant Yellow Gold and Sparkling White Diamonds",
    "a classic and universally flattering combination."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "receptions",
    "and festive occasions like Sankranthi or Diwali. Its modern design makes it suitable for contemporary events and everyday elegance",
    "seamlessly blending tradition and trend."
  ],
  "description": "This Swarna Pushpa Vanki is a testament to exquisite craftsmanship and timeless design. The sparkling diamonds and lustrous gold create a captivating contrast, while the floral motif symbolizes prosperity and beauty. The bangle's modern take on a traditional design makes it a versatile addition to any jewelry collection. The superior Hyderabadi polish enhances the gold's natural brilliance, ensuring a lasting investment.",
  "tags": [
    "Bangle",
    "Vanki",
    "Diamond Bangle",
    "Gold Bangle",
    "Floral Jewelry",
    "Modern Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Vajraalu",
    "Swarna",
    "Kadi",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Festive Jewelry",
    "Sankranthi",
    "Diwali"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0143_0759",
  "collection": "diamond"
}