{
  "id": "necklaces-1336",
  "title": "Diamond Floral Pendant - Vajraala Adda (వజ్రాల అడ్డ)",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18k Rose Gold base meticulously studded with ethically sourced",
    "brilliant-cut diamonds. The diamonds boast VS clarity and a G-H color grade",
    "exhibiting exceptional sparkle. Handcrafted with attention to detail",
    "ensuring both durability and timeless elegance. Hyderabadi Polish applied to the gold for a lustrous finish."
  ],
  "features": "This exquisitely designed pendant features a delicate floral motif crafted with shimmering diamonds. The contemporary 'Adda' style provides a modern twist on traditional South Indian jewelry designs. The openwork design enhances the light reflection and creates a captivating sparkle. The floral patterns symbolize prosperity and good fortune, making it a meaningful piece.",
  "colors": [
    "Primarily white (diamonds) with a subtle warmth from the rose gold setting. The rose gold enhances the brilliance of the diamonds",
    "creating a soft",
    "romantic aesthetic."
  ],
  "occasions": [
    "Perfect for everyday elegance or special occasions. It can be worn to weddings",
    "parties",
    "or even traditional events like seemantham or half-saree function (Pattu Parikini Function). Its versatile design makes it suitable for both formal and informal settings."
  ],
  "description": "This diamond floral pendant is a stunning blend of traditional and modern aesthetics. Its intricate diamond work and rose gold setting exude sophistication and luxury. A timeless piece that can be cherished for generations, it's an investment in enduring style and cultural significance. The design ensures maximum light reflection, giving it exceptional brilliance and sparkle. Handcrafted by skilled artisans in Hyderabad.",
  "tags": [
    "Diamond Pendant",
    "Adda",
    "Vajraala Adda",
    "Rose Gold",
    "Floral Design",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Modern Indian Jewelry",
    "Wedding Jewelry",
    "Diamond Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-47_1934",
  "collection": "sjpl"
}