{
  "id": "necklaces-541",
  "title": "Elegant Diamond Mangalsutra Pendant - Contemporary Vaari",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "18K Yellow Gold with meticulously set Brilliant Cut Diamonds. Each diamond is of VS clarity and G-H color grade",
    "reflecting exceptional brilliance. Features Hyderabadi polish for a lasting luster."
  ],
  "features": "A captivating floral and geometric pattern defines this modern Mangalsutra pendant. The design blends traditional motifs with a contemporary openwork style. The secure prong setting maximizes the light exposure for each diamond, enhancing its sparkle. The graceful curves and symmetrical design are both elegant and symbolic.",
  "colors": [
    "Predominantly white (diamonds) and yellow (gold). The contrast enhances the visual appeal and complements a variety of skin tones and outfits."
  ],
  "occasions": [
    "Perfect for daily wear or special occasions. Its modern design makes it suitable for both traditional Indian events like weddings and festivals",
    "as well as contemporary gatherings and celebrations. Ideal for a modern bride or woman who appreciates a blend of tradition and style."
  ],
  "description": "This Mangalsutra pendant offers a modern take on a traditional symbol of marriage. Its brilliant diamonds and elegant design make it a statement piece. Handcrafted with precision and care in Hyderabad, it showcases exceptional craftsmanship and quality materials. A timeless piece that can be treasured for generations.",
  "tags": [
    "Mangalsutra",
    "Pendant",
    "Diamond Jewelry",
    "Indian Jewelry",
    "Hyderabad Jewelry",
    "Vaari",
    "Wedding Jewelry",
    "Contemporary Design",
    "Modern Mangalsutra",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Floral Design",
    "Gold Pendant",
    "Diamond Pendant"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-29_1024",
  "collection": "diamond"
}