{
  "id": "bangles-270",
  "title": "Sparkling Gold Kangan Set - Traditional Vaala Jouelu with Modern Brilliance",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Yellow Gold",
    "brilliant-cut Cubic Zirconia (CZ). Features our signature Hyderabadi polish for unparalleled shine and durability."
  ],
  "features": "These exquisite kangans boast a delicate, open design, featuring clusters of round brilliant-cut CZ stones prong-set along a slender 22K gold frame. The design offers a modern interpretation of the classic 'vaala jouelu,' blending traditional aesthetics with a contemporary minimalist style. The prong setting maximizes the sparkle of each CZ, creating a dazzling effect.",
  "colors": [
    "Warm Yellow Gold with dazzling white Cubic Zirconia."
  ],
  "occasions": [
    "Perfect for daily wear",
    "festive occasions like Sankranthi",
    "Ugadi",
    "or Diwali",
    "and modern celebrations. Ideal for adding a touch of sparkle to your casual or ethnic attire. A sophisticated choice for office parties or casual get-togethers."
  ],
  "description": "These bangles offer a contemporary take on traditional South Indian jewelry, making them versatile and timeless. The 22K gold and brilliant-cut CZ stones combine to create a captivating sparkle. The Hyderabadi polish ensures lasting shine and durability. A comfortable and stylish addition to any jewelry collection. The minimalist design makes it easy to pair with other bangles or bracelets.",
  "tags": [
    "Bangles",
    "Kangan",
    "Vaala Jouelu",
    "22K Gold",
    "Cubic Zirconia",
    "CZ",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Ethnic Jewelry",
    "Gold Bangles",
    "Contemporary Jewelry",
    "Festive Jewelry",
    "Ugadi",
    "Sankranthi",
    "Diwali",
    "Gudi Padwa"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-13-03-49 3_1312",
  "collection": "diamond"
}