{
  "id": "necklaces-134",
  "title": "Enchanting Indrani Haar: A Symphony of Pastel Gemstones",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "set with high-quality Emeralds (Panche Rallu)",
    "Rubies (Erra Rallu)",
    "and delicate Amethyst gemstones. The setting is accentuated with brilliant-cut Cubic Zirconia (CZ) for added sparkle. Finished with a refined Hyderabadi polish."
  ],
  "features": "This contemporary Haaram showcases a unique blend of traditional and modern design. It features a central pendant with a large, mesmerizing emerald surrounded by intricate filigree work inspired by South Indian floral motifs. The necklace is embellished with alternating emerald, ruby, and amethyst beads, creating a harmonious pastel color palette. Each gemstone is meticulously set using a prong setting to maximize brilliance and security.",
  "colors": [
    "Pastel Green (Emerald)",
    "Pink (Ruby)",
    "and Lavender (Amethyst) against a backdrop of warm yellow gold. The CZ adds a touch of white sparkle."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "festive occasions like Diwali and Sankranthi",
    "or even a sophisticated evening event. It can also be worn for a Seemantham or Half-Saree function",
    "adding a touch of regal elegance."
  ],
  "description": "This Indrani Haar is a statement piece that seamlessly blends South Indian heritage with contemporary aesthetics. The carefully selected gemstones, the Hyderabadi polish, and the unique design make it a truly special and valuable addition to any jewelry collection. The harmonious color palette and intricate detailing ensure it will be cherished for generations. The exquisite gemstone quality assures long lasting shine.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Ruby",
    "Amethyst",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Seemantham",
    "Half-Saree",
    "Panche Rallu",
    "Erra Rallu",
    "Gemstone Necklace",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Hyderabadi Polish"
  ],
  "original_id": "diamond_jewellery_DPNK8-1803_0367",
  "collection": "diamond"
}