{
  "id": "bangles-301",
  "title": "Radiant Gold & Diamond Vanki Bangles: The Twisting Vine Collection",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold (916 Hallmark) with meticulously set",
    "high-clarity brilliant-cut diamonds. Features a Hyderabadi Polish for a lasting",
    "rich luster."
  ],
  "features": "A pair of stunning Vanki bangles featuring a unique 'twisting vine' design. Each bangle showcases a continuous flow of diamonds, expertly channel-set between ribbons of polished gold. The Vanki design represents traditional grace with a modern twist. The open design makes them easy to wear and adjust slightly.",
  "colors": [
    "Predominantly radiant gold with the bright",
    "white sparkle of the diamonds creating a beautiful contrast."
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham/పెళ్లి)",
    "engagements",
    "anniversaries",
    "or any special occasion where you want to make a statement. These bangles add a touch of sophistication to both traditional South Indian attire (like silk sarees) and modern ensembles."
  ],
  "description": "These bangles are a testament to timeless elegance and expert craftsmanship. The design combines traditional South Indian artistry with modern aesthetics, making them a truly unique piece. The high-quality diamonds provide exceptional brilliance, while the 22K gold ensures lasting value and durability. The 'Vanki' style signifies prosperity and good fortune, making this set a meaningful heirloom.",
  "tags": [
    "Bangles",
    "Vanki",
    "Kadiyalu",
    "Diamond Bangles",
    "Gold Bangles",
    "22K Gold",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "వంకీ",
    "కడియాలు",
    "పెళ్లి",
    "muhurtham",
    "engagement"
  ],
  "original_id": "sjpl_PHOTO-2024-05-22-13-03-46 2_2178",
  "collection": "sjpl"
}