{
  "id": "necklaces-1185",
  "title": "Vaibhavam Pancha Layam Haaram: A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "featuring premium quality Burmese Rubies (9.60ct - 8 stones)",
    "Zambian Emeralds (10.65ct - 18 stones)",
    "and lustrous South Sea Pearls (48.45ct - 20 stones). Locket details: Diamond weight-1.49(474)",
    "Ruby-2.00(1)",
    "Emerald-1.35(1)."
  ],
  "features": "This exquisite Pancha Layam (five-layered) Haaram showcases intricate floral motifs throughout, meticulously set with glittering diamonds, vibrant rubies, and lush emeralds. The central pendant is a masterpiece of nakshi work, featuring a large, captivating emerald centerpiece. Delicate pearl drops adorn each layer, adding a touch of classic elegance. The Hyderabadi polish enhances the gold's rich luster, creating a timeless appeal.",
  "colors": [
    "Predominantly gold with vibrant splashes of ruby red and emerald green",
    "complemented by the soft ivory of the South Sea Pearls. The diamonds add a brilliant white sparkle",
    "creating a captivating contrast."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "Seemantham (baby shower)",
    "half-saree functions (Voni function)",
    "and formal galas. A statement piece that commands attention and elevates any ensemble."
  ],
  "description": "This Haaram is a testament to Hyderabad's rich jewelry heritage, blending traditional craftsmanship with contemporary design. The combination of premium gemstones, intricate nakshi detailing, and the auspicious Pancha Layam design makes it a valuable heirloom piece. Its durability ensures it can be cherished for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Pancha Layam",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Rubies",
    "Emeralds",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Muhurtham",
    "Seemantham",
    "Voni Function",
    "Kantabharanam",
    "Nakshi Work",
    "Hyderabadi Polish"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-09 3_1737",
  "collection": "sjpl"
}