{
  "id": "necklaces-888",
  "title": "Aarya Antique Gold Haaram with Kundan and Gemstone Peacock Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 51.1 grams)",
    "Polki Kundan Diamonds",
    "Ruby Cabochon",
    "Emerald Cabochon. Features exquisite Hyderabadi polish for a rich",
    "antique finish. Chain weight is approximately 48.82 grams."
  ],
  "features": "This stunning Haaram showcases intricate filigree work accented with Polki Kundan diamonds, creating a regal and timeless aesthetic. The central pendant features a graceful peacock motif, meticulously crafted within a circular frame and adorned with more Kundan stones. Delicate gold beads dangle gracefully, adding movement and sparkle. The necklace features peacock details and floral accents along the neck piece.",
  "colors": [
    "Antique Gold",
    "White (Kundan diamonds)",
    "Ruby Red",
    "Emerald Green."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "traditional ceremonies like Seemantham (baby shower)",
    "half-saree function (Langa Voni Function)",
    "and grand festive occasions. A statement piece perfect for the modern bride seeking a touch of heritage."
  ],
  "description": "This Haaram is a testament to South Indian artistry, blending traditional motifs with high-quality materials. The antique gold finish adds a vintage charm, while the Kundan diamonds offer unmatched brilliance. The peacock pendant symbolizes beauty and prosperity, making it a meaningful and cherished heirloom. Its durable construction ensures lasting beauty for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kundan Jewelry",
    "Polki",
    "Peacock Pendant",
    "Antique Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Vivahaalu",
    "Wedding Jewelry",
    "Seemantham",
    "Langa Voni Function",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Nakshi Work"
  ],
  "original_id": "jewellery_IMG-20241219-WA0019_1598",
  "collection": "jewellery"
}