{
  "id": "necklaces-836",
  "title": "Rajalakshmi Ruby Pendant - A Timeless Adornment",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold. Central Ruby (approx. 5 carats",
    "oval cut",
    "rich red hue)",
    "Polki Diamonds (flat cut",
    "rose-cut)",
    "Fresh Water Pearls. Hyderabad Polish"
  ],
  "features": "This exquisite pendant features a central oval-cut ruby surrounded by a halo of shimmering Polki diamonds, showcasing traditional South Indian elegance. The design incorporates three delicate danglers, each featuring a Polki diamond set in an ornate gold casing, culminating in a cluster of luminous fresh water pearls atop carved ruby beads. The intricate filigree work on the gold settings adds a touch of vintage charm.",
  "colors": [
    "Rich Red (Ruby)",
    "Champagne Gold",
    "Sparkling White (Polki Diamonds)",
    "Creamy White (Pearls)"
  ],
  "occasions": [
    "Perfect for weddings (pellikuturu)",
    "engagements (nischitartham)",
    "festive occasions like Sankranthi and Diwali",
    "and special events (party wear). Can also be worn as a statement piece for contemporary outfits."
  ],
  "description": "This Rajalakshmi Ruby Pendant is a stunning blend of traditional South Indian design and timeless elegance. The vibrant ruby represents passion and prosperity, while the Polki diamonds add a touch of brilliance. Handcrafted with meticulous attention to detail, this pendant is a heirloom piece that will be cherished for generations. The Hyderabadi polish gives the gold a unique luster that enhances the beauty of the gemstones. The use of rubies and pearls is highly auspicious and brings good fortune.",
  "tags": [
    "Pendant",
    "Locket",
    "Ruby",
    "Polki Diamond",
    "Fresh Water Pearls",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Pellikuturu",
    "Nischitartham",
    "Rajalakshmi",
    "Ruby Pendant",
    "Tolkatties"
  ],
  "original_id": "ear_rings_DPER8-1657_2636",
  "collection": "ear"
}