{
  "id": "necklaces-1001",
  "title": "Diamond Floral U-Shaped Haaram - A Blossoming Splendor",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Ethically Sourced Natural Diamonds (Color: G-H",
    "Clarity: VS-SI)",
    "Hyderabadi Polish"
  ],
  "features": "This captivating necklace features a delicate U-shaped design, meticulously handcrafted with intricate floral motifs. The diamonds are pavé-set, maximizing brilliance and creating a continuous sparkle. The chain is a flexible mesh style, crafted for comfort and durability. The 'kundan' inspired setting gives a timeless aesthetic. Delicate diamond leaves cascade downwards, creating a graceful and feminine silhouette.",
  "colors": [
    "Warm Yellow Gold",
    "Dazzling White Diamonds"
  ],
  "occasions": [
    "Perfect for wedding receptions",
    "engagement parties",
    "sangeet ceremonies",
    "or any occasion where you want to make a statement. Also suitable for upscale social events and modern cocktail parties. Can also adorn a bride for her 'Muhurtham'."
  ],
  "description": "This exquisite diamond necklace seamlessly blends modern design with traditional Indian aesthetics. The high-quality diamonds provide exceptional brilliance, while the expert craftsmanship ensures lasting beauty. The unique floral design symbolizes growth and prosperity, making it a meaningful and treasured heirloom. The comfortable chain makes this piece easy to wear for extended periods, making it a perfect choice for brides and party-goers alike.",
  "tags": [
    "Diamond Necklace",
    "Choker",
    "Haaram",
    "Floral Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "18K Gold",
    "Pavé Setting",
    "Fine Jewelry",
    "कंठाभरणमु",
    "Bridal Necklace",
    "Cocktail Jewelry",
    "South Indian Jewelry",
    "Contemporary Jewelry"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0459_2322",
  "collection": "necklace"
}