{
  "id": "necklaces-1128",
  "title": "The 'Indrani' Heritage Haaram - A Symphony of Rose Quartz, Emeralds and Diamonds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Antique Hyderabadi Polish. Features cushion-cut Rose Quartz (clarity VVS)",
    "Round-cut Emeralds",
    "and meticulously set Polki Diamonds. The pendant showcases a uniquely carved Aquamarine gemstone."
  ],
  "features": "This 'Indrani' Haaram seamlessly blends tradition and contemporary aesthetics. The design incorporates a classic leaf pattern with emeralds and polki diamonds. The focal point is a large, intricately carved Aquamarine pendant, surrounded by a delicate filigree of gold and diamonds. Rose Quartz stones add a touch of modern elegance and balance.",
  "colors": [
    "The overall color palette is a beautiful blend of pastel pink (Rose Quartz)",
    "vibrant green (Emeralds)",
    "translucent light blue (Aquamarine)",
    "and the warm glow of antique-finished gold. The diamonds add brilliant sparkle."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "receptions",
    "Seemantham (baby shower)",
    "and other significant celebrations. Its unique design also makes it a statement piece for high-end galas and formal events."
  ],
  "description": "This Haaram is a testament to exceptional craftsmanship and timeless elegance. The combination of traditional design elements with modern gemstone choices creates a truly unique piece. The carved Aquamarine pendant adds an artistic flair, making it a heirloom-worthy treasure. The Hyderabadi polish enhances the gold's luster and durability. A true reflection of South Indian heritage with a contemporary touch.",
  "tags": [
    "Haaram",
    "Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Rose Quartz",
    "Emeralds",
    "Diamonds",
    "Polki",
    "Aquamarine",
    "Hyderabadi Polish",
    "Wedding Jewelry",
    "Seemantham Jewelry",
    "Antique Gold",
    "Temple Jewelry",
    "Vilandi",
    "Vilandi Jewellery"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0024_2542",
  "collection": "radhe"
}