{
  "id": "necklaces-720",
  "title": "Rajputana Jadau Kundan Haaram - Emerald and Ruby Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము) with Hyderabadi Polish. Set with high-quality Kundan stones",
    "faceted rubies",
    "and vibrant emeralds (పచ్చలు) of VS clarity. The pendant features a cabochon emerald center."
  ],
  "features": "This exquisite haaram showcases intricate Rajputana-inspired Jadau craftsmanship, featuring meticulously placed Kundan stones. The pendant boasts a delicate floral design (పూల డిజైన్), enhanced by the brilliant rubies and emeralds. The settings are all hand-done, showcasing the skill of our master artisans. The graduated design and adjustable dori ensure a comfortable and secure fit. Has Hyderabadi finish for an exquisite antique look.",
  "colors": [
    "Primarily gold",
    "with the striking contrast of ruby red",
    "emerald green",
    "and the white brilliance of Kundan stones. This traditional color combination (సంప్రదాయ రంగులు) is highly auspicious in South Indian culture."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham (శీమంతం)",
    "or any special occasion where you want to make a statement. It's also ideal for a half-saree function or a grand festive celebration like Diwali or Ugadi."
  ],
  "description": "This Haaram is a timeless heirloom piece, embodying the rich heritage of South Indian jewelry. The meticulous Jadau work, combined with the vibrant gemstones, makes it a true work of art. The use of 22K gold ensures lasting value, and the Hyderabadi polish gives it a regal antique look. This piece is not only beautiful but also carries cultural significance, making it a cherished addition to any jewelry collection.",
  "tags": [
    "Kundan Haaram",
    "Jadau Jewelry",
    "Emerald Necklace",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Bridal Necklace",
    "కంఠాభరణం",
    "సువర్ణము",
    "పచ్చలు",
    "సంప్రదాయ నగల",
    "వివాహ నగల",
    "Hyderabadi Polish",
    "Rajputana Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-46-44 2_1226",
  "collection": "diamond"
}