{
  "id": "necklaces-118",
  "title": "Rajputana Polki Haaram with Ruby Accents - A Royal Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds with a high carat weight (clarity estimated SI)",
    "Oval-cut Rubies of deep red hue. Handcrafted with Hyderabadi Kundan setting."
  ],
  "features": "This exquisite Haaram showcases the classic Rajputana Polki setting, meticulously handcrafted by skilled artisans from Hyderabad. The elaborate floral and paisley motifs are characteristic of South Indian heritage jewelry. The central pendant features a prominent Ruby surrounded by layers of shimmering Polki diamonds. The necklace incorporates an antique finish, adding to its old-world charm and creating a captivating contrast with the brilliance of the diamonds.",
  "colors": [
    "Predominantly Gold",
    "with the fiery red of the Rubies offering a striking contrast. The Polki diamonds exude a soft",
    "white brilliance",
    "enhancing the overall warmth of the piece."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "weddings (Vivahaalu)",
    "and significant religious ceremonies. Also ideal for special occasions like Seemantham (baby shower)",
    "half-saree functions (Voni Function)",
    "or any event where you want to make a grand statement."
  ],
  "description": "This Polki Haaram is more than just jewelry; it's a piece of art and a symbol of South Indian heritage. The use of high-quality Polki diamonds, coupled with expert Hyderabadi craftsmanship, ensures a lasting investment. Its timeless design makes it a cherished heirloom, to be passed down through generations. Polki Diamonds offer a unique vintage look, unlike the modern brilliant cut, making this haaram a truly unique choice. The careful arrangement of diamonds and rubies demonstrates the artisan's mastery and attention to detail. The antique finish enhances the richness and depth of the gold, creating a captivating aesthetic.",
  "tags": [
    "Haaram",
    "Polki Necklace",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Indian Wedding Jewelry",
    "Bridal Necklace",
    "Antique Jewelry",
    "Ruby Necklace",
    "Diamond Necklace",
    "Hyderabadi Jewelry",
    "Vivahaalu",
    "Seemantham",
    "Voni Function",
    "Heirloom Jewelry",
    "Traditional Jewelry"
  ],
  "original_id": "diamond_jewellery_DPNK8-1562_0351",
  "collection": "diamond"
}