{
  "id": "necklaces-1137",
  "title": "Eternal Splendor: Polki Diamond and Emerald Haar",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (superior clarity",
    "antique luster)",
    "Natural Emerald (oval cabochon",
    "deep green hue). Features signature Hyderabadi Polish for enhanced brilliance."
  ],
  "features": "This regal Haar showcases a cascading arrangement of Polki diamonds, each meticulously hand-set in a closed setting to maximize their inherent brilliance. The square diamond motifs create a geometric contrast to the round diamond links. The centerpiece is a captivating natural Emerald, surrounded by a halo of Polki diamonds in a floral motif. The design reflects classic South Indian aesthetics with a contemporary twist, perfectly suited for the modern bride.",
  "colors": [
    "Warm Gold",
    "Sparkling White (Polki Diamonds)",
    "Deep Green (Emerald)"
  ],
  "occasions": [
    "Ideal for grand occasions like weddings (Vivaham)",
    "receptions",
    "anniversaries",
    "and significant cultural events. Perfect for a bride's Muhurtham or any special occasion where you desire to make a statement."
  ],
  "description": "This Haar is a testament to timeless elegance and exquisite craftsmanship. The use of uncut Polki diamonds, a signature of Mughal-era jewelry, lends it a unique, antique charm. The contrasting colors of the Polki diamonds and the Emerald create a striking visual appeal. Made with high-quality 22K gold and showcasing superior craftsmanship, this is an heirloom piece that will be cherished for generations. Its traditional design with a modern touch makes it versatile and wearable with both traditional and contemporary attire.",
  "tags": [
    "Haar",
    "Necklace",
    "Polki Diamonds",
    "Emerald",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Vivaham",
    "Uncut Diamonds",
    "22K Gold",
    "Emerald Necklace",
    "Moghalai Haar",
    "antique finish"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0039_2555",
  "collection": "radhe"
}