{
  "id": "necklaces-817",
  "title": "Emerald Cascade Haaram - A Timeless Statement of Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in a durable alloy with Hyderabadi Polish. Adorned with approximately 57.80 carats of vibrant Green Emeralds (17 pieces) and sparkling Diamonds totaling approximately 17.58 carats (253 pieces- 239 weighing around 15.93 carats and 14 weighing around 1.65 carats). Smaller diamonds are used for the embellishments around the emeralds. This haaram also contains D.pan(+7):-6.45(101)",
    "D.pan(1/10):-1.14(10)",
    "D.pan(1/6):-11.50(81)",
    "D.pan(1/5):-3.74(18)",
    "D.pan(1/4):-0.30(1)"
  ],
  "features": "This stunning haaram showcases a contemporary take on a traditional South Indian design. The piece features graduated, pear-shaped Emeralds, each surrounded by a cluster of brilliant-cut Diamonds. The Diamonds are meticulously set to maximize their brilliance and create a cascading effect. The design balances the rich green of the Emeralds with the dazzling sparkle of the Diamonds, creating a visual symphony of color and light.",
  "colors": [
    "Vibrant Green Emeralds",
    "Dazzling White Diamonds",
    "subtle gold."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "grand receptions",
    "and special celebrations. An excellent choice for modern brides seeking a fusion of tradition and contemporary style. This haaram is also ideal for formal events where you want to make a lasting impression."
  ],
  "description": "This Emerald Cascade Haaram is a statement piece that embodies elegance and sophistication. The combination of exquisite Emeralds and sparkling Diamonds, coupled with meticulous craftsmanship, makes it a valuable investment. This haaram seamlessly blends traditional South Indian aesthetics with modern design sensibilities, making it a timeless heirloom to be treasured for generations. The rich green of the emeralds symbolizes prosperity and growth, adding a touch of auspiciousness to the piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Reception",
    "Statement Piece",
    "Fine Jewelry",
    "Contemporary Design",
    "Telugu Jewelry",
    "Green Gemstone"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-18-01-46_1411",
  "collection": "diamond"
}