{
  "id": "rings-037",
  "title": "Vaibhavam Flower Brooch - A Timeless Heritage Jewel",
  "category": "rings",
  "original_type": "Brooch",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Ruby Cabochon (Central Stone)",
    "Polki Diamonds (Uncut Diamonds) with VS clarity",
    "Hyderabadi Polish for a lasting luster."
  ],
  "features": "Classic flower motif, meticulously handcrafted with traditional South Indian filigree work ('Jali' work) surrounding the central ruby. Features a raised setting to highlight the cabochon ruby and antique style Polki diamonds. The overall design incorporates elements reminiscent of temple jewelry (devasthanam alankarana) in a wearable modern form. The Polki diamonds are strategically placed to maximize brilliance and create a unique antique charm.",
  "colors": [
    "Gold (warm yellow)",
    "Ruby (deep pinkish-red)",
    "Polki Diamonds (off-white/grey tones)."
  ],
  "occasions": [
    "Perfect for adding a touch of elegance to any outfit",
    "especially for traditional South Indian events such as weddings",
    "engagements",
    "festivals (like Sankranti or Ugadi)",
    "or family functions. Also suitable for formal events where a touch of cultural heritage is desired."
  ],
  "description": "This exquisite brooch is a celebration of South Indian craftsmanship, featuring high-quality materials and intricate design details. The use of Polki diamonds lends an air of timeless elegance, while the ruby adds a touch of vibrancy and prosperity. It's a versatile piece that can be worn on a saree, blouse, or even a coat, making it a valuable addition to any jewelry collection. Possessing this brooch means owning a small piece of Telugu cultural heritage (Telugu samskruti).",
  "tags": [
    "Brooch",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Temple Jewelry",
    "Polki Diamonds",
    "Ruby",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Antique Finish",
    "Filigree",
    "Jali work",
    "Weddings",
    "Festivals",
    "Heritage Jewelry",
    "Vaddanam"
  ],
  "original_id": "ear_rings_DPER8-1613_2628",
  "collection": "ear"
}