{
  "id": "necklaces-025",
  "title": "The Empress Collection: Rose Gold Floral Cascade Haaram Set with Matching Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "Crafted in lustrous 18K Rose Gold with Hyderabadi Polish. Features intricately set Cubic Zirconia (CZ) stones exhibiting exceptional brilliance."
  ],
  "features": "This modern take on the classic Haaram features a cascading floral design with geometric openwork. The necklace showcases a striking teardrop pendant, mirroring the central hexagonal motif found in the elegantly elongated Jhumkas. The open setting allows light to dance through the CZ stones, maximizing their sparkle. Meticulously crafted floral motifs enhance the feminine allure.",
  "colors": [
    "Primarily Rose Gold",
    "complemented by the dazzling white of the CZ stones creating a warm",
    "romantic and luxurious color palette."
  ],
  "occasions": [
    "Perfect for sangeets",
    "receptions",
    "cocktail parties",
    "and modern Indian weddings. Its versatility also makes it suitable for formal events and sophisticated gatherings."
  ],
  "description": "This exceptional piece flawlessly blends traditional sensibilities with contemporary design. The intricate floral work and the geometric elements create a statement piece that's both elegant and modern. The Hyderabadi polish ensures lasting shine and durability. It is a celebration of both heritage and modern aesthetics, making it a cherished addition to your jewelry collection.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace",
    "Earrings",
    "Rose Gold",
    "Cubic Zirconia",
    "CZ",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Contemporary Jewelry",
    "Traditional Jewelry",
    "Floral Design",
    "Geometric Design",
    "Bridal Jewelry",
    "Pendili Jewellery",
    "Pelli Jewellery"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0031_0060",
  "collection": "choker"
}