{
  "id": "necklaces-737",
  "title": "Apsara Kundan Haaram: A Touch of Celestial Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "meticulously crafted with high-quality Kundan settings. The necklace features dazzling Cubic Zirconia (CZ) stones that mimic the brilliance of Polki diamonds. Central pendant showcases a vibrant Emerald cabochon flanked by delicate Rubies. Hyderabadi Polish lends a rich",
    "lustrous finish."
  ],
  "features": "This exquisite Haaram showcases a classic mango (paisley) motif, arranged in an elegant cascading design. The Kundan settings, crafted with meticulous precision, amplify the brilliance of the CZ stones. The central pendant is a masterpiece, featuring an intricate floral design with the Emerald cabochon at its heart. The traditional design is elevated with modern setting techniques for enhanced durability and shine.",
  "colors": [
    "Predominantly gold with the sparkling white of the CZ stones. The Emerald and Ruby accents provide a touch of contrasting color",
    "adding depth and richness to the design."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "festive celebrations like Diwali and Sankranthi",
    "and traditional ceremonies such as Seemantham or Half-Saree Functions. Its timeless elegance also makes it suitable for upscale social events and gatherings."
  ],
  "description": "This Apsara Kundan Haaram blends traditional Telugu design with modern craftsmanship. The dazzling CZ stones offer a luxurious look without compromising on affordability. The intricate Kundan work and the vibrant gemstone accents create a piece that is both timeless and eye-catching. It's a statement piece that embodies the rich cultural heritage of Hyderabad, ensuring you stand out with grace and sophistication. The durable construction and secure settings ensure this Haaram will be a cherished heirloom for generations.",
  "tags": [
    "Haaram",
    "Kundan",
    "CZ",
    "Cubic Zirconia",
    "Necklace",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Vivaaham",
    "Seemantham",
    "Half-Saree Function",
    "Mango Mala",
    "Paisley",
    "Emerald",
    "Ruby",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Gold Necklace",
    "Bridal Jewelry",
    "kundan haar"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-34_1243",
  "collection": "diamond"
}