{
  "id": "necklaces-1012",
  "title": "Manikyam and Mutyala Jadau Haaram: Emerald and Pearl Diamond Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (916 Gold)",
    "Natural Emeralds (Manikyam)",
    "Brilliant Cut Diamonds (Vaajralu)",
    "South Sea Pearls (Mutyalu). Features Hyderabadi Jadau craftsmanship known for its intricate gem setting."
  ],
  "features": "This exquisite Haaram showcases the timeless Jadau technique, where uncut diamonds are meticulously embedded into the gold. The floral motifs are intricately detailed, reminiscent of Mughal-era designs. The pendant features a central pear-shaped Emerald surrounded by a halo of diamonds. Delicate pearl drops (Mutyala Guchu) add a touch of classic South Indian elegance.",
  "colors": [
    "Lustrous Yellow Gold",
    "Vibrant Green Emeralds",
    "Dazzling White Diamonds",
    "and Creamy White Pearls. The traditional color combination is considered auspicious and brings prosperity."
  ],
  "occasions": [
    "Perfect for a grand occasion such as a wedding (Vivaha Mahotsavam)",
    "engagement (Nischitartham)",
    "or any festive celebration. An ideal piece for the bride (Vadhuvu) or to be gifted during a Seemantham (baby shower) or Half-Saree Function (Langa Voni Function)."
  ],
  "description": "This Jadau Haaram is a masterpiece of Hyderabadi craftsmanship. The use of high-quality Emeralds and South Sea Pearls, combined with the brilliance of the diamonds, makes it a truly luxurious piece. The intricate design reflects the rich cultural heritage of South India, making it a valuable heirloom piece to be cherished for generations. The traditional significance of Manikyam (Emeralds) and Mutyalu (Pearls) is believed to bring good fortune and prosperity to the wearer.",
  "tags": [
    "Jadau Haaram",
    "Emerald Necklace",
    "Pearl Necklace",
    "Diamond Necklace",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Manikyam",
    "Mutyalu",
    "Vaajralu",
    "22K Gold",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry",
    "कंठाभरणं",
    "సంప్రదాయ జడావు హారం"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0471_2333",
  "collection": "necklace"
}