{
  "id": "necklaces-1549",
  "title": "The 'Chandrika Haaram': Diamond, Emerald, and Tanzanite Bridal Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity gold",
    "adorned with brilliant-cut diamonds",
    "vibrant emeralds (panchala pache)",
    "and rare tanzanite (TNZ Manya) beads. Features Hyderabadi polish for a lasting shine."
  ],
  "features": "This statement haaram features intricate floral and paisley (manga malai) motifs meticulously embedded with sparkling diamonds. Emeralds are strategically placed to enhance the design's richness. Cascading tanzanite beads add a touch of modern elegance. The detachable pendant echoes the haaram's design, offering versatility.",
  "colors": [
    "Predominantly white (diamonds) and gold",
    "accentuated by the green of the emeralds",
    "pink of the rubies and blue of the tanzanite beads",
    "creating a harmonious and regal color palette."
  ],
  "occasions": [
    "Perfect for a grand Indian wedding (Vivahaalu)",
    "reception",
    "or other celebratory occasions like Seemantham (baby shower) or Half-Saree Function (Langa Voni Function). Makes a stunning heirloom piece."
  ],
  "description": "This Chandrika Haaram is a masterpiece of South Indian craftsmanship, blending traditional design with modern gemstone accents. The use of high-quality diamonds, emeralds and rare tanzanite guarantees lasting value and beauty. Its versatile design allows for multiple styling options, making it a cherished addition to any bridal trousseau (పెళ్లి కానుకలు).",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "Tanzanite",
    "Bridal Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Manga Malai",
    "Vivahaalu",
    "Seemantham",
    "Half Saree Function",
    "Kantaabharanam",
    "పెళ్లి కానుకలు",
    "Necklace",
    "Indian Wedding"
  ],
  "original_id": "sjpl_PHOTO-2024-05-24-13-54-28 3_2196",
  "collection": "sjpl"
}