{
  "id": "bangles-260",
  "title": "Diamond-Studded Love Knot Bracelet: A Contemporary Elegance",
  "category": "bangles",
  "original_type": "Bracelet",
  "materials": [
    "18K Yellow Gold",
    "brilliant cut diamonds",
    "total gold weight approximately 10.460 grams",
    "diamond weight 1.00 carats. Features meticulously placed diamonds with excellent cut and clarity. Hyderabadi polish ensures a lasting luster."
  ],
  "features": "A gracefully winding bracelet featuring an interwoven design culminating in a heart-shaped knot. Embellished with pavé-set diamonds that follow the curves of the gold creating a seamless, radiant look. The heart motif provides a focal point, symbolizing love and commitment. Contemporary yet timeless, ideal for the modern South Indian woman.",
  "colors": [
    "Yellow Gold and Sparkling White Diamonds",
    "a classic combination for a luxurious aesthetic."
  ],
  "occasions": [
    "Perfect for engagements",
    "anniversaries",
    "cocktail parties",
    "or elevating everyday attire. A statement piece that adds a touch of elegance to any ensemble",
    "from traditional sarees to modern dresses."
  ],
  "description": "This diamond bracelet is more than just an accessory; it's a symbol of modern love and enduring style. The combination of brilliant-cut diamonds and lustrous yellow gold offers a radiant and sophisticated look. Crafted with precision and attention to detail, it's a testament to superior craftsmanship and lasting beauty. Designed to be cherished for generations, this bracelet combines traditional jewelry making with a contemporary design, making it truly unique. Offers a modern take on traditional jewelry making.",
  "tags": [
    "Bracelet",
    "Diamond Bracelet",
    "Gold Bracelet",
    "Yellow Gold",
    "Heart Motif",
    "South Indian Jewelry",
    "Modern Jewelry",
    "Engagement",
    "Anniversary",
    "Diamonds",
    "contemporary"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-09-11-07-52_1124",
  "collection": "diamond"
}