{
  "id": "waistbands-021",
  "title": "Diamond Emerald Peacock Vaddanam - A Royal Waist Belt (Odyanam)",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold",
    "Brilliant Cut Diamonds (21.50 Carats)",
    "Emerald (7.80 Carats)",
    "Rubies (10.91 Carats)",
    "South Sea Pearls (91.70 Carats)",
    "Hyderabadi Polish"
  ],
  "features": "Intricately designed vaddanam featuring a central peacock motif. The peacock is embellished with ruby eyes, surrounded by dazzling brilliant-cut diamonds. A central teardrop shaped emerald is also set on the piece. The intricate filigree design is complemented by a delicate row of South Sea pearl drops, adding a touch of regal elegance. The piece boasts traditional South Indian craftsmanship, with each diamond meticulously set for maximum brilliance.",
  "colors": [
    "Gold",
    "White (Diamonds)",
    "Green (Emerald)",
    "Red (Rubies)",
    "Cream (Pearls)"
  ],
  "occasions": [
    "Ideal for weddings (Vivaha Mahotsavam)",
    "Seemantham (Baby Shower)",
    "Half-Saree Function (Langa Voni Function)",
    "and other grand celebrations. A statement piece for any special occasion where you want to exude timeless elegance."
  ],
  "description": "This exquisite vaddanam is a true heirloom piece, blending traditional South Indian design with modern elegance. The central peacock motif symbolizes beauty, prosperity, and good fortune. The combination of brilliant-cut diamonds, vibrant emeralds, and lustrous South Sea pearls creates a stunning visual impact. Handcrafted by skilled artisans in Hyderabad, this piece showcases exceptional quality and timeless appeal. A perfect investment in your jewelry collection, destined to be cherished for generations.",
  "tags": [
    "Vaddanam",
    "Odyanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Peacock Design",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Gold Jewelry",
    "Temple Jewelry",
    "Nakshi Work",
    "Vivaha Mahotsavam",
    "Seemantham",
    "Langa Voni Function",
    "22K Gold"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-24-13-54-20 3_1316",
  "collection": "diamond"
}