{
  "id": "necklaces-1212",
  "title": "Emerald Blossom Diamond Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Hallmarked)",
    "4.36 carats of Brilliant Cut Diamonds (SI Clarity",
    "G-H Color)",
    "3.28 carats of Emeralds (Oval Cut",
    "Zambian Origin)",
    "12.90 carats of South Sea Pearls (Round",
    "Lustrous). Hyderabadi Polish for lasting shine."
  ],
  "features": "Features a floral motif with interspersed diamond 'flowers'. Two Emeralds are beautifully placed within delicate filigree designs, culminating in a pendant adorned with South Sea pearls. The necklace showcases a contemporary take on traditional South Indian design with meticulous detailing and a flexible chain for comfortable wear.",
  "colors": [
    "Golden Yellow (Gold)",
    "Sparkling White (Diamonds)",
    "Deep Green (Emeralds)",
    "Creamy White (Pearls). A classic and elegant combination."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "engagement ceremonies",
    "and upscale social gatherings. A statement piece suitable for both traditional Indian attire and modern evening wear. Ideal for Seemantham or any other special occassion."
  ],
  "description": "This exquisite Haaram embodies timeless elegance with a modern twist. The brilliant diamonds sparkle beautifully, complementing the vibrant Emeralds and lustrous South Sea pearls. It's crafted with impeccable attention to detail and designed for lasting durability, making it a cherished heirloom for generations. Experience the blend of heritage and contemporary style with this statement piece.",
  "tags": [
    "Diamond Necklace",
    "Haaram",
    "Emerald Jewelry",
    "South Sea Pearls",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Contemporary Design",
    "Hyderabadi Jewelry",
    "22K Gold",
    "Vivaha",
    "Mutyalu",
    "Pachala Haaram",
    "Engagement",
    "Reception",
    "Ethnic Jewelry",
    "Floral Design",
    "Bridal Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-50 2_1786",
  "collection": "sjpl"
}