{
  "id": "necklaces-961",
  "title": "Divine Ganesha Kasu Mala: A Touch of Tradition & Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (పసిడి)",
    "Natural Coral Beads (పగడాలు)",
    "High-Quality Cubic Zirconia (CZ) stones",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Kasu Mala features intricately designed gold coins (kasulu) adorned with shimmering Cubic Zirconia, interspersed with delicate mango (paisley) motifs, also with CZ stones, adding a touch of modern elegance to the traditional design. The central pendant showcases a finely detailed Lord Ganesha motif. Each element is meticulously handcrafted by skilled artisans from Hyderabad, known for their expertise in jewelry making. The floral-shaped pendants are surrounded with coral beads, adding a touch of tradition and auspiciousness. Small Gold beads are hanged in the pendant for added detail and rich look.",
  "colors": [
    "Gold (Yellow-Gold)",
    "Coral (Red-Orange)",
    "White (Cubic Zirconia)"
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "festivals (పండుగలు)",
    "temple visits",
    "and other auspicious occasions. Also suitable for engagements",
    "Seemantham (శీమంతం)",
    "and as a treasured heirloom."
  ],
  "description": "This Kasu Mala is more than just a piece of jewelry; it's a symbol of prosperity, good fortune, and divine blessings. The exquisite craftsmanship, combined with the auspiciousness of Lord Ganesha and the vibrant colors, makes it a truly unique and valuable addition to your jewelry collection. The Hyderabadi polish guarantees a lasting shine and durability.",
  "tags": [
    "Kasu Mala",
    "Necklace",
    "Gold Jewelry",
    "Ganesha Pendant",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Pagadamala",
    "కంఠాభరణం",
    "కాసుల పేరు",
    "పగడాలు",
    "పసిడి",
    "వినాయకుడు"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0356_2422",
  "collection": "necklace"
}