{
  "id": "necklaces-195",
  "title": "Maharani Polki Haaram Set with Ruby Accents",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "Base Metal: High-quality Alloy with Hyderabadi Polish. Gemstones: Uncut Polki Diamonds",
    "Ruby Cabochons (estimated VS clarity)",
    "Freshwater Pearls. Setting: Kundan Setting"
  ],
  "features": "This majestic haaram features a graduated design of intricately placed uncut polki diamonds, interspersed with lustrous freshwater pearls. The central pendant showcases a prominent ruby cabochon surrounded by polki diamonds, culminating in a fringe of delicate pearl drops. The matching jhumka earrings echo the pendant's design, creating a harmonious and regal look. The kundan setting style, a hallmark of traditional Indian jewelry, ensures the gemstones are securely held while maximizing their brilliance. The Hyderabadi polish gives the piece a subtle antique finish.",
  "colors": [
    "Predominantly white and silver from the polki diamonds and the Hyderabadi polished metal",
    "accented with the deep red of the ruby cabochons and the creamy white of the pearls."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "receptions",
    "and traditional ceremonies like Seemantham or Half-Saree functions. Also suitable for upscale gala events and celebrations where a touch of regal elegance is desired."
  ],
  "description": "This Polki Haaram set embodies the grandeur of Hyderabad's royal heritage. The use of uncut polki diamonds, each unique in its natural form, guarantees exclusivity. The superior Hyderabadi polish ensures a lasting luster. Its timeless design makes it a cherished heirloom piece to be passed down through generations. The ruby accents symbolize passion and prosperity, adding a deeper layer of meaning to this already stunning set.",
  "tags": [
    "Polki",
    "Haaram",
    "Jhumka",
    "Kundan",
    "Hyderabadi Jewelry",
    "Ruby",
    "Pearls",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Seemantham",
    "Vivaha",
    "Bridal Jewelry",
    "Uncut Diamonds",
    "Polki Diamond Necklace",
    "Temple Jewelry",
    "Jewellery Sets",
    "Vaddanam"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0042_0450",
  "collection": "diamond"
}