{
  "id": "necklaces-1167",
  "title": "Lakshmi Kasu Haaram Pendant - Emerald Cascade",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Gold (916 Gold) pendant intricately set with brilliant-cut Diamonds",
    "featuring rich Emeralds and subtle Ruby accents. The pendant showcases exceptional craftsmanship with meticulous detailing. The design benefits from a radiant Hyderabadi Polish."
  ],
  "features": "The pendant features a central Lakshmi idol seated on a lotus, surrounded by intricately detailed peacocks. The design employs a combination of bezel and pave settings for the diamonds, enhancing their brilliance. A cascading arrangement of oval-cut Emeralds adds a touch of traditional elegance. The Lakshmi idol incorporates traditional Nakshi work, showcasing exceptional detailing and artistry.",
  "colors": [
    "The piece is predominantly gold with the sparkle of diamonds. The vibrant green of the Emeralds provides a beautiful contrast",
    "while the rubies add a subtle pop of red."
  ],
  "occasions": [
    "Perfect for weddings (muhurtham)",
    "festivals (like Diwali",
    "Ugadi)",
    "religious ceremonies",
    "or special occasions such as seemantham or half-saree function. This piece adds a touch of traditional grandeur to any ensemble."
  ],
  "description": "This pendant is more than just jewelry; it's a piece of art with deep cultural and religious significance. The Lakshmi motif is believed to bring prosperity and good fortune. The superior craftsmanship ensures durability and lasting beauty. This piece is a testament to traditional South Indian jewelry making and a valuable addition to any heirloom collection.",
  "tags": [
    "Lakshmi Pendant",
    "Temple Jewellery",
    "Nakshi Work",
    "Emeralds",
    "Diamonds",
    "22K Gold",
    "Haaram Pendant",
    "South Indian Jewelry",
    "Devotional Jewelry",
    "Hyderabadi Jewelry",
    "Kasu Mala Pendant",
    "Traditional Jewellery",
    "Muhurtham Jewelry",
    "Seemantham Jewelry",
    "Festival Jewelry",
    "Goddess Lakshmi",
    "Antique Finish"
  ],
  "original_id": "sjpl_PHOTO-2023-08-26-14-08-17 2_1719",
  "collection": "sjpl"
}