{
  "id": "necklaces-342",
  "title": "Emerald Elegance: Antique Finish AD Stone Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal alloy with gold tone finish",
    "embellished with high-quality American Diamond (AD) stones and synthetic emeralds. Simulated pearls add a touch of classic elegance. Features a durable gold tone chain."
  ],
  "features": "This striking haaram features a detailed floral and geometric design studded with sparkling AD stones and vivid green emeralds. The central pendant showcases a captivating combination of these stones. Delicate pearl drops add a touch of traditional charm and movement. The design blends traditional South Indian aesthetics with modern sensibilities, suitable for a variety of occasions.",
  "colors": [
    "Primarily gold (metal)",
    "white (AD stones)",
    "and green (emeralds)",
    "with the soft luster of white pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "and traditional South Indian ceremonies like muhurtham",
    "seemantham",
    "and other festive events. Also suitable for adding a touch of elegance to formal modern occasions."
  ],
  "description": "This haaram offers a perfect blend of tradition and contemporary style. The high-quality AD stones provide a brilliant sparkle, mimicking the allure of real diamonds at an accessible price. The rich color combination of emeralds, AD stones, and pearls is timeless and complements a wide range of outfits. Durable construction ensures lasting beauty and enjoyment.",
  "tags": [
    "Haaram",
    "Necklace",
    "AD Stone Jewelry",
    "Emerald Jewelry",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Reception Jewelry",
    "Engagement Jewelry",
    "Contemporary Jewelry",
    "Ethnic Jewelry",
    "Gold Tone",
    "Seemantham",
    "Muhurtham",
    "Half-Saree Function",
    "Jadau Style",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0456_0638",
  "collection": "diamond"
}