{
  "id": "necklaces-1047",
  "title": "Polki Diamond 'Trishul' Haaram with Emerald Pendant - Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Emerald (Oval Cabochon cut)",
    "Rhodium Polish. Crafted with authentic Hyderabadi artistry."
  ],
  "features": "This exquisite Haaram features a unique 'Trishul' (trident) design motif using triangular Polki diamonds, each framed by a delicate pave setting of smaller diamonds. The necklace culminates in a captivating oval Emerald cabochon pendant, surrounded by more Polki diamonds in a floral halo design. The setting is meticulously crafted to showcase the natural beauty of the Polki diamonds. ",
  "colors": [
    "Predominantly gold and white (from the diamonds) with a vibrant deep green from the emerald pendant. A classic and regal color combination."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements",
    "and other special occasions like Seemantham (శీమంతం) or a grand reception. Its modern design also makes it suitable for sophisticated parties and events."
  ],
  "description": "This Haaram is a true statement piece, blending traditional Indian craftsmanship with a modern aesthetic. The use of uncut Polki diamonds gives it a unique antique charm, while the Emerald pendant adds a touch of regal elegance. Made with high-quality materials and expert craftsmanship, this is an heirloom piece to be cherished for generations. The 'Trishul' design element makes it an auspicious and meaningful gift.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamonds",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Wedding Jewelry",
    "22K Gold",
    "Hyderabad Jewelry",
    "Trishul",
    "Antique Finish",
    "Ethnic Jewelry",
    "కంఠాభరణం",
    "పెళ్లి",
    "శీమంతం",
    "పాలిష్ వజ్రాలు"
  ],
  "original_id": "radhe_diam_DPNK8-1130_2460",
  "collection": "radhe"
}