{
  "id": "necklaces-077",
  "title": "Manikyam & Emerald Polki Gundla Mala - The Royal Choice",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Rubies (Manikyam)",
    "Zambian Emeralds (Paccha)",
    "Polki Diamonds (Uncut Diamonds)",
    "Natural Seed Pearls. Finished with a signature Hyderabadi Antique Polish."
  ],
  "features": "A captivating multi-strand gundla mala featuring vibrant ruby and emerald beads. The central pendant is meticulously crafted with polki diamonds set in an intricate floral design, accented with a mesmerizing emerald centerpiece. Delicate drops of emeralds, rubies, and seed pearls add a touch of regal elegance. The pendant's design echoes traditional South Indian artistry with a modern, sophisticated flair.",
  "colors": [
    "Rich ruby red",
    "vibrant emerald green",
    "sparkling white (polki diamonds)",
    "and warm gold tones create a luxurious and timeless palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "festive occasions (Ugadi",
    "Sankranthi)",
    "and grand celebrations. A showstopper for a bride or a statement piece for any special event."
  ],
  "description": "A unique blend of traditional craftsmanship and modern design. The use of high-quality rubies and emeralds adds significant value and a touch of royalty. Polki diamonds offer a distinct, antique appeal. The multi-strand design is both elegant and comfortable to wear. This piece is a symbol of prosperity and good fortune, making it a cherished heirloom.",
  "tags": [
    "Gundla Mala",
    "Ruby Necklace",
    "Emerald Necklace",
    "Polki Jewelry",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Hyderabadi Jewelry",
    "Vivaaham",
    "Manikyam",
    "Paccha",
    "Antique Polish",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Heirlooms"
  ],
  "original_id": "diamond_jewellery_DPCK8-624_0236",
  "collection": "diamond"
}