{
  "id": "necklaces-1528",
  "title": "Vaibhav Laxmi Grand Diamond Haaram with Emerald and Sapphire Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "meticulously set with brilliant-cut Diamonds (VVS Clarity",
    "E-F Color). Features vibrant Emeralds (Zambian Origin) and captivating Sapphire drops with gold caps. Hyderabadi Polish for lasting brilliance."
  ],
  "features": "A breathtaking statement piece boasting intricate filigree work and a traditional South Indian floral design. The central pendant features a prominent Emerald, surrounded by cascading diamond-studded motifs. Sapphire drops add a touch of regal elegance. Expertly crafted using Nakshi techniques for a timeless appeal.",
  "colors": [
    "Primarily gold and dazzling white (diamonds) accented by vivid green Emeralds",
    "pink stones",
    "and deep blue Sapphires. The contrast creates a rich and luxurious aesthetic."
  ],
  "occasions": [
    "Perfect for weddings (vivahaalu)",
    "grand receptions",
    "milestone anniversaries",
    "and other significant celebrations. An ideal choice for brides seeking a traditional yet sophisticated look",
    "especially for muhurtham and seemantham ceremonies."
  ],
  "description": "A true heirloom piece showcasing exceptional craftsmanship and luxurious materials. The intricate detailing, combined with the brilliance of the diamonds and the vibrancy of the gemstones, makes it a timeless investment. Its traditional design and cultural significance make it a cherished piece for generations. A symbol of prosperity and good fortune, embodying the rich heritage of South Indian jewelry.",
  "tags": [
    "Haaram",
    "కంఠాభరణం",
    "Diamond Necklace",
    "Bridal Jewelry",
    "Wedding Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emerald",
    "Sapphire",
    "Nakshi Work",
    "Filigree",
    "Hyderabadi Jewelry",
    "Fine Jewelry",
    "Statement Necklace",
    "Indian Wedding",
    "Muhurtham Jewelry",
    "Vivahaalu",
    "Bridal Haaram"
  ],
  "original_id": "sjpl_PHOTO-2024-05-21-18-28-06 2_2146",
  "collection": "sjpl"
}