{
  "id": "necklaces-312",
  "title": "Divya Ratna Haaram Set - Exquisite Diamond and Gemstone Necklace with Jhumka Earrings",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold",
    "D/VVS Clarity Diamonds",
    "Natural Emerald",
    "Natural Ruby",
    "South Sea Pearls. Features Hyderabadi Polish for lasting luster."
  ],
  "features": "Intricate floral designs adorned with meticulously set diamonds. The pendant features a teardrop-shaped emerald at its center, surrounded by a halo of diamonds and cascading South Sea Pearls. The matching Jhumka earrings echo the necklace's floral motif and pearl detailing. The necklace is articulated for comfortable wear and a flattering drape. Floral design, diamond setting, south sea pearls.",
  "colors": [
    "Primarily gold and white (diamonds)",
    "accented by the vibrant green of the emerald",
    "red ruby and the creamy luster of the South Sea Pearls."
  ],
  "occasions": [
    "Perfect for bridal wear",
    "Muhurtham (ముహూర్తం)",
    "Seemantham (సీమంతం)",
    "weddings",
    "grand receptions",
    "and other special occasions where you want to make a statement. The set can be adapted for engagement ceremonies and other festive gatherings."
  ],
  "description": "This Divya Ratna Haaram Set is a testament to the skill of South Indian artisans. The brilliant diamonds, vibrant gemstones, and lustrous pearls create a luxurious and unforgettable look. The combination of traditional design and modern elegance makes this set a timeless investment, showcasing the essence of Telugu heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "South Sea Pearls",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Kanthabharanam",
    "Muhurtham",
    "Seemantham",
    "Traditional Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0401_0598",
  "collection": "diamond"
}