{
  "id": "necklaces-772",
  "title": "Emerald and Diamond Bridal Kantha Haaram: The \"Haritha Shobha\"",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణము)",
    "Certified Diamonds (వజ్రాలు) with VS Clarity",
    "Emeralds (పచ్చలు) with Excellent Cut",
    "South Sea Pearls (ముత్యాలు). Features Hyderabadi Polish for a lasting shine."
  ],
  "features": "Intricate floral-inspired diamond lattice work. The central pendant showcases a pear-shaped Emerald surrounded by a dazzling halo of diamonds. Pearl drops provide a delicate, feminine touch. The necklace features a unique adjustable clasp for a perfect fit, maintaining the traditional Haaram's opulent look.",
  "colors": [
    "Gold (బంగారు)",
    "Sparkling White Diamonds",
    "Vibrant Green Emeralds",
    "and Lustrous Cream Pearls."
  ],
  "occasions": [
    "Perfect for a Telugu Wedding (పెళ్ళి)",
    "Muhurtham (ముహూర్తం)",
    "Engagement (నిశ్చితార్థం)",
    "Seemantham (సీమంతం)",
    "or any grand celebratory occasion. Also",
    "ideal for a special event where you wish to exude timeless elegance and make a memorable statement."
  ],
  "description": "This 'Haritha Shobha' Haaram is a testament to Hyderabad's rich jewelry-making heritage. The high-quality emeralds and diamonds are carefully selected for their brilliance and color. The intricate design represents the finest craftsmanship, ensuring a heirloom piece that can be passed down through generations. Its adjustable nature caters to modern needs while upholding tradition, creating a unique blend of beauty and functionality. The Hyderabadi Polish offers unmatched luster and durability, making this piece a lasting investment.",
  "tags": [
    "Haaram",
    "Kantha Haaram",
    "Bridal Necklace",
    "Wedding Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Emerald Necklace",
    "Diamond Necklace",
    "Hyderabadi Jewelry",
    "Muhurtham Jewelry",
    "Indian Wedding",
    "22K Gold",
    "Pearls",
    "Vaddanam",
    "Pelli Jewellery",
    "Traditional Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-08 2_1278",
  "collection": "diamond"
}