{
  "id": "necklaces-866",
  "title": "Apoorva Kundan and Pearl Haaram with Matching Jhumka Set",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "22K Gold Plated. High-quality Kundan stones with meticulously placed White CZ stones. Featuring lustrous freshwater pearls",
    "a ruby accent stone",
    "and an emerald drop. Hyderabadi Polish for lasting shine."
  ],
  "features": "This exquisite Haaram showcases intricate Kundan work, a hallmark of traditional Indian jewelry. The floral motifs are embellished with dazzling CZ stones. The pendant features a central emerald drop for added opulence. The matching Jhumkas echo the Haaram's design, featuring pearl drops and a ruby accent.",
  "colors": [
    "Gold",
    "White",
    "Cream",
    "Red",
    "and Green. The combination of gold and pearls is a classic South Indian pairing",
    "while the ruby and emerald add a vibrant touch."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "receptions",
    "Seemantham (baby shower)",
    "half-saree functions (Langa Voni)",
    "or any grand celebration. Also suitable for formal events where you want to make a statement."
  ],
  "description": "This Haaram set is a masterpiece of traditional craftsmanship combined with modern sensibilities. The Hyderabadi polish ensures longevity, while the Kundan work exudes timeless elegance. It is a heirloom-worthy piece that can be passed down through generations, embodying cultural richness and tradition.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Kundan Jewelry",
    "Pearl Necklace",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "CZ Stones",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "Seemantham",
    "Vivaha Mahotsavam",
    "Langa Voni"
  ],
  "original_id": "haaram_diamond_open_IMG-20241113-WA0399_1553",
  "collection": "haaram"
}