{
  "id": "necklaces-201",
  "title": "Divya Haaram: Temple-Inspired Polki Diamond and Coral Goddess Necklace",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (సువర్ణం)",
    "Uncut Polki Diamonds (పోల్కీ వజ్రాలు)",
    "Natural Coral beads",
    "Rubies",
    "Emeralds",
    "Freshwater Pearls. Features signature Hyderabadi Polish for a rich",
    "antique luster."
  ],
  "features": "This magnificent Haaram showcases a central temple pendant depicting divine figures, meticulously handcrafted with Nakshi work. The pendant is adorned with rubies and polki diamonds set in a closed setting to enhance their brilliance. Three strands of natural coral beads graduate in size, interspersed with rows of polki diamonds. The base of the pendant features delicate pearl and coral tassel drops, punctuated with emerald beads. The intricate filigree detailing and temple motif reflect traditional South Indian artistry.",
  "colors": [
    "Warm tones of gold",
    "vibrant coral orange",
    "rich ruby red",
    "lush emerald green",
    "and the shimmering brilliance of colorless polki diamonds",
    "complemented by the soft luster of freshwater pearls. The contrasting colors create a visually stunning and auspicious palette."
  ],
  "occasions": [
    "Ideal for weddings (వివాహం)",
    "bridal wear (పెళ్లి దుస్తులు)",
    "Seemantham (సీమంతం)",
    "or any grand celebration where a touch of timeless elegance is desired. A statement piece perfect for muhurtham (ముహూర్తం) ceremonies and formal events."
  ],
  "description": "A true heirloom piece, this Haaram is a testament to the enduring beauty of South Indian jewelry craftsmanship. The combination of precious gemstones, high-karat gold, and intricate temple design makes it a valuable investment and a symbol of cultural heritage. The Polki diamonds add a touch of royal grandeur, while the temple motif invokes blessings and prosperity. The Hyderabadi polish gives the piece a unique, vintage charm, setting it apart from modern designs.",
  "tags": [
    "Haaram",
    "Polki Diamond Necklace",
    "Temple Jewelry",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Bridal Jewelry",
    "Coral Necklace",
    "Nakshi Work",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "కంఠాభరణం",
    "పోల్కీ వజ్రాల నెక్లెస్",
    "గుడి ఆభరణాలు",
    "దక్షిణ భారత ఆభరణాలు",
    "సాంప్రదాయ నెక్లెస్",
    "పెళ్లి ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0052_0460",
  "collection": "diamond"
}