{
  "id": "necklaces-088",
  "title": "Heera-Haritha Jadau Pendant - Diamond, Emerald, and Coral Statement Piece",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22k Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Natural Emeralds (faceted oval cabochons)",
    "Natural Coral beads. Features an antique Hyderabadi polish for a vintage appeal."
  ],
  "features": "Intricate Jadau setting showcasing the brilliance of Polki diamonds in a floral-inspired motif. The pendant features three dangles, each adorned with vibrant emeralds and coral beads for a touch of color. The design incorporates traditional South Indian artistry, reminiscent of Mughal influences prevalent in Hyderabadi jewelry. The Polki diamonds are carefully hand-set, emphasizing the craftsmanship.",
  "colors": [
    "Golden yellow (gold)",
    "White (diamonds)",
    "Emerald Green (emeralds)",
    "Coral Red (coral). A classic and auspicious color combination in South Indian jewelry."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagement ceremonies (nischitartham)",
    "and festive occasions like Diwali or Sankranthi. Can also be styled with contemporary outfits for a statement look."
  ],
  "description": "A rare and exquisite piece of heritage jewelry. The use of Polki diamonds and natural gemstones ensures its value and timelessness. Handcrafted by skilled artisans in Hyderabad, preserving traditional Jadau techniques. The unique combination of diamonds, emeralds, and coral makes it a striking conversation starter.",
  "tags": [
    "Jadau",
    "Polki",
    "Diamond",
    "Emerald",
    "Coral",
    "Pendant",
    "Haaram",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "Antique Finish",
    "Wedding Jewelry",
    "Ethnic Jewelry",
    "Nischitartham",
    "Sankranthi",
    "Diwali",
    "Heera",
    "Jadau Ka Kam"
  ],
  "original_id": "diamond_jewellery_DPER8-1661_0298",
  "collection": "diamond"
}