{
  "id": "necklaces-1579",
  "title": "Emerald Cascade Diamond Haaram - A Timeless Statement Piece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Finely crafted in high-grade platinum",
    "this haaram features meticulously set brilliant-cut diamonds. The focal point is a stunning 6.15 carat pear-shaped emerald",
    "showcasing exceptional clarity and vibrant green hue. Ruby accent stones add a touch of crimson sparkle."
  ],
  "features": "This modern haaram design features a cascading arrangement of diamond-encrusted leaves, gracefully flowing towards the center. A large pear-cut emerald, secured in a bezel setting, serves as the central focal point. The intricate lattice work is a nod to traditional South Indian jewelry design, interpreted with a contemporary flair.",
  "colors": [
    "Primarily silver (platinum) and sparkling white (diamonds)",
    "accented by the vibrant green of the emerald and the subtle crimson of the rubies."
  ],
  "occasions": [
    "Perfect for grand celebrations like weddings (Veedukollu)",
    "receptions",
    "and milestone anniversaries. Also suitable for high-end galas and red carpet events where a statement piece is desired."
  ],
  "description": "This Haaram seamlessly blends traditional inspiration with modern design sensibilities. The use of platinum and high-quality diamonds ensures lasting value and brilliance. The emerald symbolizes prosperity and new beginnings, making it a meaningful heirloom piece. Its unique design sets it apart from conventional heavy gold haarams while maintaining an opulent aesthetic.",
  "tags": [
    "Haaram",
    "Platinum Necklace",
    "Diamond Necklace",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "Hyderabadi Jewelry",
    "Veedukollu",
    "Reception Jewelry",
    "Contemporary Design",
    "Emerald Haaram"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-45 2_2284",
  "collection": "sjpl"
}