{
  "id": "bangles-114",
  "title": "Lakshmi Kada - Regal Ruby & Emerald Floral Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Rubies (Burmese origin",
    "round cut)",
    "Natural Emerald (Zambian origin",
    "cabochon cut)",
    "Fine Quality Cubic Zirconia (CZ) Diamonds. Crafted with intricate detail and finished with a radiant Hyderabadi Polish for lasting brilliance."
  ],
  "features": "This exquisite bangle features a stunning floral motif at its center, adorned with a vibrant circle of meticulously set rubies surrounding a captivating emerald cabochon. The design showcases delicate filigree work and is embellished with sparkling CZ diamonds for added brilliance. The openable Kada design ensures ease of wear while maintaining its regal aesthetic. Notice the subtle pink enamel work that adds a modern flair to the traditional design.",
  "colors": [
    "Rich Gold",
    "Deep Red (Rubies)",
    "Vibrant Green (Emerald)",
    "Sparkling White (CZ Diamonds)",
    "Soft Pink (Enamel)."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festivals (like Diwali and Sankranthi)",
    "engagements (Nischitartham)",
    "baby showers (Seemantham)",
    "and other auspicious occasions. Can also be styled for contemporary celebrations and elegant gatherings."
  ],
  "description": "This Lakshmi Kada embodies timeless elegance and cultural significance. The use of high-quality rubies, emeralds, and CZ diamonds combined with meticulous gold craftsmanship ensures lasting beauty and value. The Hyderabadi polish provides a brilliant sheen, while the traditional floral design and pink enamelling make it a versatile piece that bridges tradition and modern style. Represents prosperity and good fortune.",
  "tags": [
    "Kada",
    "Bangle",
    "Gold Bangle",
    "Ruby Bangle",
    "Emerald Bangle",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Vivaha",
    "Seemantham",
    "Nischitartham",
    "Lakshmi",
    "Nakshi",
    "22K Gold",
    "916 Gold",
    "Vanki",
    "Bajuband"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0264_0465",
  "collection": "diamond"
}