{
  "id": "necklaces-1498",
  "title": "Exquisite Mango Design Kasulaperu Haaram with Emerald Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark)",
    "meticulously studded with high-quality Cubic Zirconia (CZ) stones and accented with vibrant Emeralds. Features a rich Hyderabadi Polish for a lasting shine."
  ],
  "features": "This stunning Haaram showcases the timeless mango (paisley) design, known as 'Kasulaperu'. Each mango motif is intricately crafted and pavé-set with sparkling CZ stones. The centerpiece is a graceful pendant featuring a central Emerald surrounded by CZ accents. The overall design reflects a blend of traditional South Indian artistry and modern jewelry making techniques.",
  "colors": [
    "Dominant color is Gold",
    "complemented by the brilliance of white CZ stones and the deep green hue of Emeralds. The Emerald-Gold combination is highly auspicious in South Indian tradition."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "engagements",
    "Muhurtham",
    "Seemantham",
    "half-saree functions",
    "and other significant celebrations. Also suitable for making a statement at high-end social events."
  ],
  "description": "This Haaram embodies the rich cultural heritage of South Indian jewelry. Its intricate design, coupled with the use of high-quality materials and meticulous craftsmanship, ensures both beauty and durability. The Kasulaperu design is a timeless classic, representing prosperity and good fortune. The Emerald pendant adds a touch of elegance and sophistication, making it a truly unforgettable piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Kasulaperu",
    "Mango Design",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Emerald",
    "CZ",
    "Cubic Zirconia",
    "Hyderabadi Jewelry",
    "Muhurtham",
    "Seemantham",
    "Engagement",
    "22K Gold",
    "Swarna Abharanalu",
    "Mangai Maalai"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-50-34 2_2116",
  "collection": "sjpl"
}