{
  "id": "earrings-186",
  "title": "Navaratna Pushpa Karnam: Auspicious Gemstone Floral Studs",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Natural Navaratna Gemstones (Ruby",
    "Diamond",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "Polki Diamonds. Hyderabadi Polish for a lasting luster."
  ],
  "features": "Exquisite floral design inspired by South Indian temple architecture, meticulously crafted with a central ruby surrounded by the auspicious nine gemstones (Navaratna). Features an open setting to maximize gemstone brilliance and intricate filigree work. Delicate Polki diamonds accentuate the gemstones, enhancing their individual colors.",
  "colors": [
    "Multicolor - Red",
    "White",
    "Pink",
    "Orange",
    "Green",
    "Yellow",
    "Blue",
    "Brown",
    "Grey. The gold provides a warm",
    "radiant backdrop that complements the vibrant gemstones."
  ],
  "occasions": [
    "Ideal for weddings",
    "festive celebrations (like Sankranthi",
    "Diwali)",
    "and cultural events. A perfect gift for baby showers (seemantham)",
    "half-saree functions",
    "or any auspicious occasion where blessings and prosperity are desired. Also suitable for adding a touch of tradition to modern attire."
  ],
  "description": "These earrings are not only visually stunning but also carry deep traditional significance. Navaratna jewelry is believed to bring good fortune, health, and prosperity to the wearer. The meticulous craftsmanship and high-quality materials ensure a piece that will be treasured for generations. An embodiment of Hyderabadi artistry and South Indian heritage.",
  "tags": [
    "Earrings",
    "Studs",
    "Karnam",
    "Navaratna",
    "Nine Gemstones",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Temple Jewelry",
    "Polki Diamonds",
    "22K Gold",
    "Telugu Jewelry",
    "Shubham",
    "Seemantham",
    "Muhurtham"
  ],
  "original_id": "diamond_jewellery_f2c338f2-18a1-4c85-b563-1b1f4801ff62_0402",
  "collection": "diamond"
}