{
  "id": "necklaces-364",
  "title": "Diamond and Ruby Floral Raasi Haaram - A Timeless Masterpiece",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Finest Quality Natural Diamonds (VS Clarity",
    "G Color)",
    "Premium Oval Cut Rubies. Expertly crafted with a fine Hyderabadi polish for a lasting luster."
  ],
  "features": "A delicate floral design featuring intricately set diamonds forming stylized flowers and vines. The vibrant rubies are meticulously bezel-set, adding a touch of regal elegance. The necklace showcases a modern aesthetic while retaining a touch of traditional Raasi Haaram design with its floral motifs. The floral connectors are studded with diamonds to create a continuous flow.",
  "colors": [
    "Yellow Gold",
    "Dazzling White Diamonds",
    "Rich Red Rubies."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "receptions",
    "special occasions",
    "and sophisticated evening events. This versatile piece can also be worn for a Seemantham ceremony or a milestone birthday celebration."
  ],
  "description": "This exquisite Raasi Haaram beautifully blends modern design with traditional South Indian sensibilities. The brilliant diamonds and vibrant rubies create a striking contrast, enhancing the necklace's overall appeal. The fine Hyderabadi polish ensures a lasting shine and unparalleled durability. This is a statement piece that will be cherished for generations, a true heirloom in the making.",
  "tags": [
    "Diamond Necklace",
    "Ruby Necklace",
    "Haaram",
    "Raasi Haaram",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaaham",
    "Seemantham",
    "Floral Jewelry",
    "Diamond",
    "Ruby",
    "Gold",
    "18K Gold",
    "Contemporary Jewelry",
    "Designer Jewelry",
    "Hyderabad"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0478_0660",
  "collection": "diamond"
}