{
  "id": "necklaces-405",
  "title": "Dazzling Diamond Dangler Pendant - A Modern Twist on Tradition",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "Crafted in luminous 18K Yellow Gold",
    "this pendant is studded with 0.80 carats of meticulously set brilliant-cut diamonds. The diamonds exhibit exceptional clarity and sparkle",
    "adding a touch of modern elegance. The gold showcases our signature Hyderabadi polish for a rich",
    "lasting shine."
  ],
  "features": "This pendant features a unique spiral design, with diamonds gracefully encircling each curve. The open setting allows maximum light to penetrate the diamonds, enhancing their brilliance. Its sleek, minimalist design offers a contemporary take on traditional jewelry, perfect for the modern woman.",
  "colors": [
    "The piece features a harmonious blend of warm yellow gold and the icy white sparkle of diamonds",
    "creating a classic and versatile color palette."
  ],
  "occasions": [
    "This pendant is versatile enough for everyday wear and special occasions alike. Perfect for adding a touch of sophistication to a casual outfit or complementing an elegant evening gown. Its modern design makes it suitable for both traditional and contemporary events."
  ],
  "description": "This diamond dangler pendant is a perfect blend of modern aesthetics and timeless elegance. The high-quality diamonds and expert craftsmanship ensure lasting beauty and value. Its unique design makes it a standout piece, ideal for those who appreciate contemporary jewelry with a touch of sophistication. It's a truly versatile piece that can be cherished for years to come.",
  "tags": [
    "Pendant",
    "Diamond Pendant",
    "Gold Pendant",
    "Dangler",
    "Contemporary Jewelry",
    "Modern Design",
    "Hyderabadi Jewelry",
    "Diamond Jewelry",
    "Gift",
    "Women's Jewelry",
    "18K Gold",
    "Elegant",
    "Sparkling",
    "Fine Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-05-23-13-13-39 2_0846",
  "collection": "diamond"
}