{
  "id": "necklaces-1283",
  "title": "Enchanting Diamond Vaddanam Pendant - Adorn Yourself in Timeless Elegance",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "Crafted in 22K Yellow Gold with Hyderabadi Polish. Features meticulously set",
    "brilliant-cut diamonds with VS clarity and G color grade",
    "totaling approximately 2 carats. Gold hallmark certified for purity."
  ],
  "features": "This contemporary pendant draws inspiration from the traditional South Indian Vaddanam (waist belt). It showcases a graceful, crescent-shaped design adorned with sparkling diamonds in a pave setting. The delicate floral motifs on either side add a touch of femininity and traditional charm. The openwork design ensures a lightweight and comfortable wear.",
  "colors": [
    "Predominantly yellow gold with the dazzling white brilliance of diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Veedukolu",
    "Pellikuturu)",
    "receptions",
    "and festive occasions (Ugadi",
    "Sankranthi). This versatile piece can also elevate your style for modern events and cocktail parties. A beautiful choice for a Seemantham ceremony as well."
  ],
  "description": "This exquisite pendant seamlessly blends traditional South Indian aesthetics with modern design sensibilities. The brilliant diamonds and high-quality gold ensure lasting value and sparkle. The lightweight design guarantees comfort, making it perfect for all-day wear. Its versatile design makes it a statement piece for both traditional and contemporary outfits.",
  "tags": [
    "Diamond Pendant",
    "Vaddanam",
    "Oddiyanam",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Temple Jewelry",
    "Gold Jewelry",
    "Diamonds",
    "22K Gold",
    "Festive Jewelry",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Pellikuturu",
    "Seemantham",
    "Ugadi",
    "Sankranthi"
  ],
  "original_id": "sjpl_PHOTO-2024-04-26-11-54-04_1880",
  "collection": "sjpl"
}