{
  "id": "earrings-162",
  "title": "Floral Emerald and Polki Diamond Jhumka - Chandrika Kundan Jhummilu",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold",
    "Polki Diamonds (uncut diamonds)",
    "Emeralds",
    "Hyderabadi Pearls",
    "Diamond accents. The gold is finished with a special antique Hyderabadi polish for added depth and richness."
  ],
  "features": "The Jhumka features a floral motif top with round emeralds and a central Polki diamond. The Jhumka dome showcases three large Polki diamonds set in a traditional Kundan style. Delicate gold chains with emerald bead drops add a touch of movement and sparkle. The Jhumka concludes with a single Hyderabadi pearl, providing a classic finish.",
  "colors": [
    "Dominant colors are gold",
    "green (emeralds)",
    "and white (Polki diamonds and pearl). The antique gold finish adds a warm",
    "vintage feel."
  ],
  "occasions": [
    "Perfect for weddings (Pendli)",
    "engagements (Nischitartham)",
    "festive occasions like Diwali and Sankranthi",
    "or any event where you want to showcase your traditional elegance. Ideal for pairing with Kanjeevaram sarees or elegant lehengas."
  ],
  "description": "This Jhumka seamlessly blends traditional Telugu jewelry artistry with the brilliance of Polki diamonds and emeralds. The craftsmanship showcases the expertise of Hyderabadi artisans, ensuring a high-quality and timeless piece. The combination of emeralds, diamonds and pearl creates a sophisticated and eye-catching design, representing both heritage and contemporary style.",
  "tags": [
    "Jhumka",
    "Kundan",
    "Polki Diamond",
    "Emerald",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Pendli",
    "Jhummilu",
    "Telugu Jewelry",
    "Ethnic Earrings",
    "Indian Earrings",
    "Antique Gold Finish",
    "Earrings"
  ],
  "original_id": "diamond_jewellery_DPER8-1650_0294",
  "collection": "diamond"
}