{
  "id": "necklaces-1235",
  "title": "Manohari Emerald & Ruby Diamond Haaram with South Sea Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Diamonds (GH Color",
    "SI Clarity)",
    "Faceted Emeralds",
    "Round Rubies",
    "South Sea Pearls; Meticulously crafted with Hyderabadi Polish for a lasting shine."
  ],
  "features": "This exquisite Haaram features a cascading design with intricate filigree work embellished with diamonds. The necklace incorporates square-cut emeralds and round rubies, adding a touch of traditional South Indian elegance. The delicate strands of South Sea Pearls dangle gracefully, enhancing the overall grandeur. The detachable pendant showcases similar stone setting along with dangling pearls. This is a modern take on the traditional Pachala and Manikyam combination.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "White (Pearls)"
  ],
  "occasions": [
    "Ideal for weddings",
    "bridal wear (pellikuturu)",
    "receptions",
    "Seemantham ceremonies",
    "Half-Saree functions (langa voni function)",
    "and other grand celebrations."
  ],
  "description": "This Diamond Emerald & Ruby Haaram is a timeless masterpiece that blends traditional South Indian artistry with contemporary design. The use of high-quality diamonds, emeralds, rubies, and pearls ensures lasting beauty and value. The Hyderabadi polish guarantees a brilliant shine, making it a cherished heirloom for generations to come. The balance of stones invokes prosperity and auspiciousness, while the pearls give a delicate, feminine touch.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald",
    "Ruby",
    "Pachala",
    "Manikyam",
    "South Sea Pearls",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "కంఠాభరణం",
    "Pellikuturu",
    "Seemantham",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-58 2_1809",
  "collection": "sjpl"
}