{
  "id": "necklaces-1583",
  "title": "Emerald and Diamond Navratna Haaram - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Yellow Gold",
    "Natural Diamonds (FG Color)",
    "Zambian Emerald (7.43 ct)",
    "Ruby (10.55 ct)",
    "Neelam (11.74 ct). Features a Hyderabadi Polish for a lasting",
    "radiant finish."
  ],
  "features": "A breathtaking two-layered Haaram, meticulously crafted with a delicate diamond leaf pattern that showcases superior craftsmanship. The pendant features a stunning square-cut Zambian Emerald, surrounded by a halo of sparkling diamonds and the other navaratnas, creating a captivating focal point. The leaf patterns create a light and airy design, perfect for showcasing the radiance of each gemstone.",
  "colors": [
    "Primarily gold with a vibrant green Emerald",
    "ruby red and sapphire blue accentuated by the brilliance of white diamonds. This color palette is traditionally considered auspicious and is perfect for any important occasion."
  ],
  "occasions": [
    "Ideal for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "receptions",
    "Seemantham (శ్రీమంతం)",
    "half-saree functions (పసుపు దారాల ఫంక్షన్)",
    "and other grand celebrations. Can also elevate any contemporary outfit for a touch of regal elegance."
  ],
  "description": "This exquisite Emerald and Diamond Haaram seamlessly blends traditional South Indian aesthetics with modern jewelry design. The use of high-quality gemstones, including a significant Zambian Emerald, ensures lasting beauty and value. Its intricate design and Hyderabadi polish reflect a heritage of craftsmanship, making it a treasured heirloom piece. Navratna stones are considered very auspicious and bring good luck. This haaram makes a statement, its elegance never failing to be impressive.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Emerald Necklace",
    "Navratna",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "Kempu",
    "Pasupu Daaram",
    "Kanthabharanam",
    "పెళ్లి",
    "నిశ్చితార్థం",
    "శ్రీమంతం",
    "కంఠాభరణం",
    "పసుపు దారాల ఫంక్షన్",
    "Emerald",
    "Ruby",
    "Sapphire",
    "Neelam"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-46 3_2288",
  "collection": "sjpl"
}