{
  "id": "waistbands-020",
  "title": "Exquisite Diamond and Gemstone Vaddanam (Waist Belt) - A Timeless Treasure",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "Crafted in high-purity Gold",
    "meticulously studded with brilliant-cut Diamonds. Features a central Emerald (4.66 carats total weight)",
    "accentuated by Ruby accents (0.84 carats total weight)",
    "Pink Beads (3.82 Carats total weight) and complemented by Blue Moonstone (26.32 carats total weight) drops. Finished with a durable and lustrous Hyderabadi Polish."
  ],
  "features": "This Vaddanam showcases a classic South Indian design with intricately arranged diamond 'mango' motifs (Paisley). The central piece features a captivating floral design with the emerald as the focal point, bordered by rubies and diamonds. Delicate Blue Moonstone drops add a touch of elegance and movement. The setting is designed for maximum brilliance and security, ensuring lasting beauty.",
  "colors": [
    "Predominantly white (diamonds)",
    "with accents of vibrant green (emerald)",
    "subtle pink (rubies)",
    "and deep blue (Moonstones)",
    "creating a captivating and traditional color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "Seemantham",
    "Bharatanatyam performances",
    "traditional ceremonies",
    "and festive celebrations. A statement piece to elevate any special occasion outfit."
  ],
  "description": "A true heirloom piece, this Vaddanam combines traditional craftsmanship with modern elegance. The brilliant diamonds and vibrant gemstones create a captivating sparkle that will turn heads. The sturdy construction ensures durability, making it a treasured possession for generations to come. Owning this piece is not just about owning jewelry; it's about owning a piece of South Indian heritage.",
  "tags": [
    "Vaddanam",
    "Oddiyanam",
    "Waist Belt",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "Blue Moonstone",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Muhurtham",
    "Seemantham",
    "Bharatanatyam",
    "Paisely",
    "Mango Design",
    "Antique Finish",
    "Gold Jewelry",
    "Temple Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-04_1301",
  "collection": "diamond"
}