{
  "id": "necklaces-1476",
  "title": "Enchanting Emerald and Diamond Haaram - Kasulaperu Inspired",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Emeralds (Pear Cut and Beads)",
    "High-Quality CZ Diamonds. Features traditional 'Hyderabadi Polish' for a rich",
    "lustrous finish."
  ],
  "features": "This exquisite haaram boasts a delicate floral motif with intricate detailing. Pear-cut emeralds serve as focal points, complemented by cascading emerald beads. The pendant features a similar floral design, richly studded with CZ diamonds and finished with dainty gold bead drops, reminiscent of a modern Kasulaperu. Secure claw settings ensure gemstone safety and longevity. The setting is finished with an open back to allow the natural beauty of the gemstones to shine.",
  "colors": [
    "Lustrous Gold",
    "Vibrant Green (Emerald)",
    "Sparkling White (CZ Diamonds)",
    "Subtle Red (Rubies)"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "receptions",
    "engagements",
    "and grand celebrations. Also suitable for upscale parties and functions where a touch of traditional elegance is desired."
  ],
  "description": "This haaram seamlessly blends traditional South Indian aesthetics with contemporary design. The use of high-quality emeralds and CZ diamonds provides exceptional brilliance and value. The craftsmanship reflects the rich jewelry-making heritage of Hyderabad, promising a timeless piece that can be cherished for generations. The 'Hyderabadi Polish' enhances the gold's luster and ensures lasting beauty.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Kasulaperu",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Festive Jewelry",
    "Grand Necklace",
    "Ethnic Jewelry",
    "Bridal Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-59_2094",
  "collection": "sjpl"
}