{
  "id": "necklaces-101",
  "title": "Rajkumari Polki Ruby Choker - A Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds (approx. 5 carats)",
    "Faceted Rubies (approx. 8 carats)",
    "Cultured Pearls. Features a Hyderabadi polish for a rich",
    "enduring luster."
  ],
  "features": "This exquisite choker features a classic Gutta Pusalu design with ruby droplets cascading like tiny gems. The polki diamonds are meticulously set in a closed setting, showcasing their natural beauty. The graduated ruby arrangement creates a stunning visual effect. The choker is finished with pearl hangings on each side, adding a touch of traditional charm.",
  "colors": [
    "Rich Yellow Gold",
    "Vibrant Ruby Red",
    "Sparkling White (Polki Diamonds)",
    "Soft Pearl White."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "Seemantham ceremonies",
    "half-saree functions",
    "and other special occasions. A statement piece for any bridal ensemble or for adding a touch of regal elegance to formal events."
  ],
  "description": "A masterpiece of traditional South Indian craftsmanship, this Polki Ruby choker embodies timeless elegance. The use of high-quality uncut polki diamonds and vibrant rubies makes it a valuable heirloom piece. Its Gutta Pusalu design is culturally significant, symbolizing prosperity and good fortune. The durable Hyderabadi polish ensures that this necklace will retain its luster for generations to come. A truly regal addition to any jewelry collection.",
  "tags": [
    "Polki",
    "Diamonds",
    "Ruby",
    "Gutta Pusalu",
    "South Indian Jewelry",
    "Traditional Necklace",
    "Bridal Jewelry",
    "Hyderabad Jewelry",
    "22K Gold",
    "Wedding Necklace",
    "Indian Jewelry",
    "Seemantham",
    "Half Saree",
    "Necklace",
    "Jewellery",
    "Haaram",
    "Kasulaperu",
    "BridalHaaram",
    "TempleJewellery"
  ],
  "original_id": "diamond_jewellery_DPNK8-1144_0334",
  "collection": "diamond"
}