{
  "id": "necklaces-733",
  "title": "Enchanting Kundan & Emerald Mohana Mala - A Timeless Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Hallmark) with Premium Kundan Setting",
    "Faceted Emeralds (High Clarity)",
    "and Brilliant-Cut Cubic Zirconia (CZ). Expertly crafted with traditional Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Haaram features a traditional circular Kundan setting, intricately detailed with concentric circles of CZ stones surrounding vibrant green Emeralds. The design gracefully tapers towards the neckline for a comfortable and flattering fit. Subtle ruby accents are added for enhanced appeal. The back of the necklace showcases a secure and adjustable gold chain closure.",
  "colors": [
    "Primarily gold with striking green Emeralds and sparkling white CZ stones. Subtle ruby accents provide a touch of warmth and contrast. The color palette evokes a sense of opulence and tradition."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu/పెళ్లి)",
    "engagements (Nischitartham/నిశ్చితార్థం)",
    "and other grand celebrations. An ideal heirloom piece for bridal wear or special family functions like seemantham or half-saree function (Langa Voni Function/ లంగా ఓణి వేడుక). Can also be styled with modern South Indian attire for a sophisticated statement."
  ],
  "description": "Experience the allure of tradition with this stunning Kundan and Emerald Haaram. Its meticulous craftsmanship, high-quality gemstones, and timeless design make it a treasured addition to any jewelry collection. The Hyderabadi polish ensures a radiant and long-lasting shine. This piece embodies cultural significance, making it a cherished family heirloom for generations to come.",
  "tags": [
    "Haaram",
    "Kundan Jewelry",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Temple Jewelry",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Ethnic Jewelry",
    "కంఠహారం",
    "పెళ్లి నగలు",
    "ఆకుపచ్చ కెంపుల నక్లెస్",
    "సంప్రదాయ నగల"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-50-33 2_1239",
  "collection": "diamond"
}