{
  "id": "necklaces-1426",
  "title": "Enchanting Emerald & Diamond Vanki Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold",
    "Brilliant Cut Diamonds (SI Clarity",
    "G-H Color)",
    "Natural Oval Emeralds. Features a fine Hyderabadi polish for a lasting lustre."
  ],
  "features": "This exquisite Vanki Haaram features a traditional 'Vanki' (వంకీ) design reimagined with modern sensibilities. The delicate foliage motifs are intricately set with sparkling diamonds. The piece is further embellished with vibrant oval emeralds, creating a captivating contrast. The graduated design and a striking emerald pendant enhance its visual appeal. ",
  "colors": [
    "Rose Gold",
    "Emerald Green",
    "and Dazzling White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "receptions (విందు)",
    "engagement ceremonies (నిశ్చితార్థం)",
    "and other grand occasions. This versatile piece can also elevate your style for special events and celebrations."
  ],
  "description": "This Vanki Haaram is a testament to superior craftsmanship and timeless design. The blend of traditional 'Vanki' motif with modern diamond and emerald accents makes it a unique and highly desirable piece. The use of high-quality materials ensures both beauty and longevity. The rose gold provides a warm and flattering tone on all skin types. Owning this Haaram is not just about wearing jewelry; it's about embracing South Indian heritage and making a lasting impression. ",
  "tags": [
    "Vanki",
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Gold Necklace",
    "Fine Jewelry",
    "పెళ్లి నగలు",
    "హారం",
    "వంకీ"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-29_2044",
  "collection": "sjpl"
}