{
  "id": "necklaces-1007",
  "title": "Aabharana Sundari: Diamond & Ruby Floral Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (Hallmarked)",
    "Natural Rubies (Oval Cut",
    "Fine Clarity)",
    "Brilliant Cut Diamonds (VS Clarity",
    "G Color). Expertly crafted with a Hyderabadi Polish for enduring brilliance."
  ],
  "features": "This exquisite Haaram blends traditional South Indian design principles with a contemporary floral motif. The necklace features a cascading floral pattern set with shimmering diamonds. A central teardrop ruby adds a touch of regal charm. The centerpiece is a large, intricately designed floral pendant featuring a prominent oval-cut ruby surrounded by a halo of dazzling diamonds. The design subtly incorporates elements reminiscent of nakshi work, offering a modern interpretation of this ancient technique.",
  "colors": [
    "Predominantly gold and white (diamonds)",
    "with a striking contrast provided by the deep red hue of the rubies. The warm gold complements the cool brilliance of the diamonds",
    "enhancing the richness of the rubies."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha Mahotsavam)",
    "receptions",
    "anniversaries",
    "and significant festivals like Sankranti and Diwali. Its elegant design also makes it suitable for upscale social gatherings and contemporary celebrations."
  ],
  "description": "This haaram represents a harmonious blend of tradition and modernity. The use of high-quality materials and meticulous craftsmanship ensures a timeless piece that can be treasured for generations. The Hyderabadi polish guarantees lasting shine and durability. The floral design is both aesthetically pleasing and symbolically represents prosperity and new beginnings (Subhrambha).",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Necklace",
    "Ruby Necklace",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Floral Design",
    "22K Gold",
    "VS Clarity Diamonds",
    "Red Ruby",
    "Indian Jewelry",
    "Contemporary Jewelry",
    "Grandiose",
    "Aabharanam"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0466_2328",
  "collection": "necklace"
}