{
  "id": "necklaces-1222",
  "title": "Emerald and Diamond Floral Nakshi Haaram with Pearl Drop",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "Natural Emeralds (7.51ct",
    "17 pieces) with vibrant green hue",
    "Brilliant Cut Diamonds (3.66ct",
    "1140 pieces) with excellent clarity",
    "Natural South Sea Pearl (3.88ct",
    "1 piece)"
  ],
  "features": "Intricate floral Nakshi work showcasing traditional South Indian craftsmanship. The necklace features a graduated floral design with alternating emerald and diamond motifs. The pendant is a large, elaborately designed floral medallion with a central emerald and a delicate pearl drop, adding a touch of timeless elegance. The setting ensures maximum brilliance and security for the precious gemstones.",
  "colors": [
    "Predominantly gold with vibrant green emeralds",
    "sparkling white diamonds",
    "and a lustrous cream-colored pearl."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha Mahotsavam)",
    "engagements (Nischitartham)",
    "festive occasions like Diwali and Sankranthi",
    "and traditional ceremonies like Seemantham or Half-Saree Functions. Also suitable for high-end parties and special events where a touch of heritage is desired."
  ],
  "description": "This exquisite Haaram blends traditional South Indian design with modern elegance. The vibrant emeralds and brilliant diamonds create a captivating sparkle, while the lustrous pearl adds a touch of grace. It's a heirloom-quality piece that can be cherished for generations, embodying the rich cultural heritage of Andhra Pradesh. The Nakshi craftsmanship reflects the superior artistry of Hyderabad's finest jewelers.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Pearl",
    "Nakshi",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Andhra Jewelry",
    "Vivaha",
    "Nischitartham",
    "Seemantham",
    "Traditional Jewelry",
    "22K Gold",
    "916 Gold",
    "Mutyam"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-53_1796",
  "collection": "sjpl"
}