{
  "id": "necklaces-1139",
  "title": "Heirloom Polki & Ruby Antique Finish Haaram Set with Jhumkas",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "22K Gold with Hyderabadi Antique Polish",
    "Natural Polki Diamonds",
    "Burmese Rubies (Kempu)",
    "South Sea Pearls. Meticulously handcrafted using traditional Kundan setting techniques."
  ],
  "features": "This magnificent Haaram showcases a layered Polki design with a central ruby embellishment. The pendant features a regal floral motif in Polki, complemented by delicate South Sea pearl droplets. The matching Jhumkas echo the Haaram's design, creating a cohesive and stunning set. Expertly crafted with intricate detailing, exhibiting superior craftsmanship.",
  "colors": [
    "Antique Gold finish",
    "Sparkling White (Polki Diamonds)",
    "Deep Red (Burmese Rubies)",
    "Creamy White (South Sea Pearls). A classic South Indian color palette evoking royalty and tradition."
  ],
  "occasions": [
    "Perfect for bridal wear (pellikuturu)",
    "weddings",
    "engagements",
    "festive occasions (Dasara",
    "Diwali",
    "Sankranthi)",
    "and grand celebrations like muhurtham or seemantham. Also suitable for upscale events demanding a touch of traditional elegance."
  ],
  "description": "A timeless heirloom piece showcasing exquisite craftsmanship and traditional South Indian design. The use of natural Polki diamonds and Burmese rubies ensures enduring value and unmatched brilliance. The antique finish adds a touch of vintage charm, while the high gold content guarantees lasting investment. A true testament to Hyderabad's rich jewelry heritage.",
  "tags": [
    "Haaram",
    "Jhumka",
    "Necklace Set",
    "Polki",
    "Kundan",
    "Ruby",
    "Kempu",
    "South Sea Pearls",
    "Antique Finish",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Heirloom Jewelry",
    "Hyderabad Jewelry",
    "Traditional Jewelry",
    "Pellikuturu",
    "Muhurtham",
    "Seemantham"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0042_2558",
  "collection": "radhe"
}