{
  "id": "necklaces-1144",
  "title": "Navratna Polki Haaram - The Jewel of Auspicious Beginnings",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Navratna Gemstones (Ruby",
    "Diamond",
    "Pearl",
    "Coral",
    "Emerald",
    "Yellow Sapphire",
    "Blue Sapphire",
    "Hessonite",
    "Cat's Eye)",
    "Hyderabadi Polish"
  ],
  "features": "This exquisite Haaram features nine traditionally auspicious Navratna gemstones, each meticulously carved and set in a Kundan setting with sparkling Polki diamonds. The unique design showcases rectangular gemstone pendants alternating with circular Polki diamond clusters, creating a harmonious blend of color and brilliance. The 'Guttiapusalu' style chain adds a touch of traditional Telugu design, completed with a secure and comfortable clasp.",
  "colors": [
    "Multicolor (Navratna Gemstone colors: Red",
    "White",
    "Yellow",
    "Blue",
    "Green",
    "etc.)",
    "Gold",
    "White (Polki Diamonds)"
  ],
  "occasions": [
    "Ideal for traditional Telugu occasions like weddings (Vivaham)",
    "engagement ceremonies (Muhurtham)",
    "baby showers (Seemantham)",
    "and other festive celebrations. This Haaram is also a stunning statement piece for high-end modern events and grand receptions."
  ],
  "description": "This Navratna Haaram not only enhances your beauty but also carries immense cultural significance. Each of the nine gemstones represents a different planet and is believed to bring positive energy, prosperity, and protection. The use of high-quality Polki diamonds and the intricate Kundan setting showcase exceptional craftsmanship. The Hyderabadi polish ensures a lasting shine and luster, making this a valuable heirloom piece.",
  "tags": [
    "Navratna Haaram",
    "Polki Diamond Necklace",
    "Kundan Jewelry",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Gemstone Necklace",
    "Auspicious Jewelry",
    "Vivaham",
    "Muhurtham",
    "Seemantham",
    "Haaram",
    "Guttiapusalu",
    "Diamond",
    "Gold",
    "Gemstones"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0051_2563",
  "collection": "radhe"
}