{
  "id": "necklaces-1456",
  "title": "Exquisite Kundan and Emerald Floral Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold with Kundan Setting. Features carefully selected emeralds with vivid green color and a stunning rose quartz centerpiece. Hyderabadi Polish for a lasting luster and exquisite finish."
  ],
  "features": "This Haaram features intricate Kundan work throughout. The design incorporates floral motifs and elegant paisley shapes, showcasing the artistry of traditional Indian craftsmanship. The centerpiece highlights a magnificent rose quartz, surrounded by vibrant emeralds. The necklace showcases a fusion of traditional and contemporary design, rendering it a versatile piece.",
  "colors": [
    "Primarily gold with brilliant white Kundan stones",
    "accented by the rich green of the emeralds and the soft pink of the rose quartz."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagements",
    "and other special occasions. Ideal for brides who appreciate timeless elegance. Suitable for traditional events like muhurtham or seemantham ceremonies",
    "as well as sophisticated modern gatherings."
  ],
  "description": "This Kundan Haaram is a masterpiece of craftsmanship, blending traditional design with modern elegance. The exceptional quality of the emeralds and the mesmerizing rose quartz creates a unique focal point. The intricate Kundan work demonstrates the rich heritage of Indian jewelry making, ensuring you wear a piece of art.",
  "tags": [
    "Kundan",
    "Haaram",
    "Necklace",
    "Emerald",
    "Rose Quartz",
    "Gold",
    "22K Gold",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Muhurtham",
    "Seemantham",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Kundan Jewellery",
    "गले का हार (Gale ka haar)",
    "ముత్యాల హారం (Mutyala haram)"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-52 3_2074",
  "collection": "sjpl"
}