{
  "id": "rings-016",
  "title": "Rajputana Royal Cocktail Ring - A Timeless Splendor",
  "category": "rings",
  "original_type": "Ring",
  "materials": [
    "22K Gold (916 Hallmark). Featuring premium Burmese Rubies",
    "iridescent Moonstones",
    "and uncut Polki Diamonds (Vilandi). Finished with our signature Hyderabadi Polish for a lustrous shine."
  ],
  "features": "This exquisite ring showcases a classic floral (puvvu) design. A vibrant central ruby is surrounded by sparkling polki diamonds, luminous moonstones, and smaller rubies, creating a regal display. The open setting allows light to pass through the stones, maximizing their brilliance. The band is meticulously crafted for comfort and durability. All settings are hand-finished by our skilled artisans.",
  "colors": [
    "Gold",
    "Ruby Red",
    "Moonstone White (milky)",
    "and Diamond White (sparkling). The classic combination of red and white symbolizes prosperity and purity in South Indian traditions."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "festive celebrations (Sankranthi",
    "Diwali)",
    "and grand social gatherings. This ring is a statement piece that will elevate any outfit."
  ],
  "description": "This ring is more than just jewelry; it's an heirloom. The use of high-quality materials and traditional craftsmanship ensures lasting beauty and value. Its unique design blends tradition and elegance, making it a conversation starter and a symbol of refined taste. The timeless appeal makes it a perfect investment for future generations. Also, the ring's adjustable sizing provides unparalleled comfort.",
  "tags": [
    "Ring",
    "Statement Ring",
    "Cocktail Ring",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Ruby",
    "Moonstone",
    "Polki Diamonds",
    "Vilandi",
    "22K Gold",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Nischitartham",
    "Puvvu",
    "floral design."
  ],
  "original_id": "diamond_jewellery_DPER8-965_0318",
  "collection": "diamond"
}