{
  "id": "necklaces-320",
  "title": "Mayura Ratna Haaram Set: A Symphony of Emeralds, Rubies, and Diamonds",
  "category": "necklaces",
  "original_type": "Necklace and Earrings",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Faceted Emeralds (Zambian)",
    "Faceted Rubies (Burmese)",
    "Brilliant Cut Diamonds (VS Clarity",
    "G-H Color)",
    "South Sea Pearl (for Earrings)"
  ],
  "features": "This exquisite three-strand Haaram features elegant peacock (Mayura) motifs intricately crafted with diamonds, serving as focal points. The necklace is adorned with alternating emeralds and rubies, set in a meticulously crafted bezel setting. Small floral diamond accents separate each gemstone strand. The matching Jhumka earrings feature a similar design with a pearl drop.",
  "colors": [
    "Gold",
    "Emerald Green",
    "Ruby Red",
    "Diamond White",
    "Pearl White"
  ],
  "occasions": [
    "Perfect for weddings (Muhurtham)",
    "engagement ceremonies",
    "Seemantham (baby shower)",
    "half-saree functions",
    "and grand festive celebrations. Also suitable for high-end cultural events and formal gatherings."
  ],
  "description": "This Mayura Ratna Haaram is a timeless heirloom piece showcasing superior craftsmanship. The peacock motif symbolizes beauty, royalty, and prosperity, making it an auspicious adornment. The combination of emeralds, rubies, and diamonds is considered highly valuable and aesthetically pleasing in South Indian jewelry. The lustrous Zambian Emeralds and Burmese Rubies are carefully selected for their rich color and brilliance. Experience the elegance of tradition combined with unparalleled quality. The matching Jhumkas complete the look adding to the overall grandeur.",
  "tags": [
    "Haaram",
    "Necklace",
    "Jhumka",
    "Earrings",
    "Diamond",
    "Emerald",
    "Ruby",
    "22K Gold",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Muhurtham",
    "Mayura",
    "Peacock",
    "Traditional Jewelry",
    "Ratna",
    "Gemstone Jewelry",
    "Hyderabad Jewelry",
    "Indian Bridal Jewelry",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0411_0608",
  "collection": "diamond"
}