{
  "id": "bangles-166",
  "title": "Diamond-Studded Gold Bangles - Kadiyam Collection",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "18K Yellow Gold with Diamond Accents. Each bangle is meticulously crafted from high-quality 18-karat yellow gold known for its radiant color and lasting durability. The diamonds are hand-selected for their brilliance and clarity",
    "showcasing a stunning sparkle. Hallmarked for authenticity and gold purity."
  ],
  "features": "These modern bangles feature a sleek and minimalist design. Geometric diamond settings are precisely spaced along the bangle to create a captivating sparkle. The diamonds are set in a prong setting that enhances their brilliance. Simple yet elegant design makes them suitable for any modern style.",
  "colors": [
    "Yellow Gold and White Diamonds"
  ],
  "occasions": [
    "Everyday wear",
    "Festive occasions",
    "Wedding Anniversary",
    "Cocktail Parties",
    "Engagement Parties. These bangles can be worn for casual outings",
    "parties",
    "or even paired with traditional attire for a contemporary twist on classic elegance."
  ],
  "description": "A contemporary take on traditional Indian bangle designs. Showcases the perfect blend of modern aesthetics and timeless elegance. Crafted with high-quality materials and exceptional attention to detail, these bangles are built to last a lifetime. The diamond accents add a touch of luxury and sophistication, making them a valuable addition to any jewelry collection.",
  "tags": [
    "Bangles",
    "Kadiyam",
    "Gold Bangles",
    "Diamond Bangles",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Modern Jewelry",
    "Festive Jewelry",
    "Wedding Jewelry",
    "Hyderabad Jewelry",
    "Gold Kada",
    "Diamond Kada",
    "Designer Bangles",
    "Yellow Gold",
    "Geometric Design"
  ],
  "original_id": "diamond_jewellery_IMG-20241130-WA0023_0695",
  "collection": "diamond"
}