{
  "id": "necklaces-432",
  "title": "Magnificent Diamond & Gemstone Haaram with Intricate Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in high-purity gold. Features brilliant-cut diamonds (estimated clarity VVS)",
    "accented with rich rubies",
    "and lush emeralds. Pink Mny detailing. Finished with a traditional Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite Haaram showcases a cascading floral pattern, meticulously crafted with pavé-set diamonds. The pendant features a central emerald surrounded by a halo of diamonds and a cluster of pink Mny drops. Design inspired by Mughal artistry, reflecting the grandeur of Hyderabad's rich heritage.",
  "colors": [
    "Predominantly gold with the sparkling white brilliance of diamonds. Accented by the vibrant red of rubies",
    "the deep green of emeralds",
    "and the soft pink of the pink mny gemstones."
  ],
  "occasions": [
    "Perfect for weddings (వివాహం)",
    "receptions",
    "and other grand celebrations. Also ideal for special occasions such as Seemantham (సీమంతం)",
    "half-saree functions (లంగా వోని ఫంక్షన్)",
    "and other festive events."
  ],
  "description": "This Haaram is a true masterpiece, blending traditional South Indian design with modern gemstone setting techniques. Its timeless elegance, exceptional craftsmanship, and significant gemstone weight make it a valuable heirloom piece. The vibrant colors and sparkling diamonds will make you the center of attention. Its heritage craftsmanship and durability is an investment for generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Ruby",
    "Emerald",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Vivaham",
    "Kanthabharanam",
    "కంఠాభరణం",
    "లంగా ఓని ఫంక్షన్",
    "Langavoni Function",
    "Diamond Necklace",
    "Ethnic Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-10 3_0873",
  "collection": "diamond"
}