{
  "id": "waistbands-039",
  "title": "The Emerald Peacock Vaddanam - A Regal Waist Belt",
  "category": "waistbands",
  "original_type": "Waist Belt",
  "materials": [
    "22K Gold (916 Hallmark)",
    "Natural Diamonds (21.50 carats",
    "SI Clarity)",
    "Burmese Rubies (10.91 carats)",
    "Zambian Emerald (7.80 carats)",
    "South Sea Pearls (91.70 carats). Hyderabadi Polish for lasting shine."
  ],
  "features": "This stunning Vaddanam features intricate filigree work in a peacock motif, a symbol of beauty and royalty in South Indian culture. The central pendant showcases a vibrant Zambian Emerald. Small Burmese Rubies are set as the peacock's eyes and Diamonds are Pavé set. Dangles of genuine South Sea pearls add graceful movement. The piece reflects a classic Temple Jewelry design with a modern touch.",
  "colors": [
    "Primarily Gold with flashes of Emerald Green",
    "Ruby Red",
    "Diamond White",
    "and lustrous Pearl White."
  ],
  "occasions": [
    "Perfect for weddings",
    "Seemantham",
    "half-saree functions (Voni Function)",
    "and grand celebrations. This piece will become a family heirloom",
    "showcasing timeless elegance."
  ],
  "description": "This Vaddanam is a testament to exquisite craftsmanship and traditional South Indian design. The use of high-quality materials, including 22K gold, natural diamonds, Burmese rubies, Zambian emeralds, and South Sea pearls, ensures its enduring value. The intricate peacock design, a symbol of grace and prosperity, adds a unique cultural touch. Its weight and substantial feel signify luxury and quality.",
  "tags": [
    "Vaddanam",
    "Oddiyanam",
    "Waist Belt",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Peacock Design",
    "Emerald",
    "Ruby",
    "Diamond",
    "Pearl",
    "22K Gold",
    "Hyderabadi Jewelry",
    "Seemantham",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Voni Function",
    "Filigree",
    "Nakshi Work",
    "Kasu Mala",
    "Jewellery",
    "Indian Fashion",
    "traditional"
  ],
  "original_id": "sjpl_PHOTO-2024-05-24-13-54-20 3_2191",
  "collection": "sjpl"
}