{
  "id": "necklaces-215",
  "title": "Dazzling Diamond & Gemstone Haaram: A Symphony of Tradition and Sparkle",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features brilliant-cut diamonds (VVS clarity",
    "G color)",
    "complemented by vibrant rubies and emeralds. The pearls are freshwater cultured."
  ],
  "features": "A contemporary take on the classic Haaram, this piece showcases a unique chevron pattern meticulously set with diamonds. The central pendant features a floral design with gemstone accents, incorporating traditional South Indian motifs. The delicate droplet pendants add a touch of grace and movement.",
  "colors": [
    "Predominantly gold and white (diamonds) with pops of red (rubies) and green (emeralds). The Hyderabadi polish enhances the warmth of the gold."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and grand celebrations. Also suitable for modern cocktail parties and upscale events where a statement piece is desired. Ideal for a modern bride looking to blend tradition with contemporary elegance."
  ],
  "description": "This Haaram is a true masterpiece, blending timeless South Indian design principles with modern diamond setting techniques. The superior craftsmanship ensures durability and lasting beauty. The exquisite combination of diamonds, rubies, and emeralds makes it a valuable heirloom to be cherished for generations. The piece's unique design will make you the center of attention at any event.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Ruby",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "Traditional Jewelry",
    "Contemporary Jewelry",
    "Indian Jewellery",
    "கல்யாண நகை (Kalyana Nagai)",
    "ముత్యాల హారం (Mutyala Haaram)",
    "వజ్రాల నెక్లెస్ (Vajrala Necklace)",
    "పెళ్లి నగల (Pelli Nagalu)"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0293_0490",
  "collection": "diamond"
}