{
  "id": "necklaces-043",
  "title": "Swarna Valli: Emerald, Coral, and Diamond Pendant",
  "category": "necklaces",
  "original_type": "Pendant",
  "materials": [
    "22K Yellow Gold",
    "Faceted Emerald (approx. 2 carats)",
    "Natural Coral (approx. 3 carats)",
    "and Sparkling White CZ Diamonds. Hyderabadi Polish finish for lasting shine."
  ],
  "features": "This pendant features a graceful crescent shape meticulously crafted from 22K gold. Delicate filigree work inspired by traditional Telugu floral motifs adorns the piece, interspersed with dazzling CZ diamonds. A central vibrant green Emerald provides a focal point, complemented by a suspended round Coral drop. The openwork design enhances the pendant's lightness and intricate detail. Can be worn as a pendant or as a Vaddanam centerpiece",
  "colors": [
    "Golden Yellow (Gold)",
    "Emerald Green",
    "Coral Red",
    "and Sparkling White (Diamonds). A classic and auspicious South Indian color palette."
  ],
  "occasions": [
    "Ideal for weddings",
    "engagements",
    "anniversaries",
    "and festive occasions. Also a stylish and elegant addition to any modern outfit. Perfect for Seemantham (baby shower) or a half-saree function."
  ],
  "description": "This pendant is a beautiful blend of traditional South Indian design and modern elegance. The combination of Emerald, Coral, and Diamonds is considered highly auspicious. The craftsmanship is impeccable, ensuring a piece that will be treasured for generations. Handcrafted in Hyderabad.",
  "tags": [
    "Pendant",
    "Locket",
    "Vaddanam",
    "Addigai",
    "Emerald",
    "Pachala",
    "Coral",
    "Pagadam",
    "Diamonds",
    "Jewellery",
    "South Indian Jewellery",
    "Telugu Jewellery",
    "Hyderabad Jewellery",
    "Filigree",
    "Gold",
    "22K Gold",
    "Traditional",
    "Wedding",
    "Festive",
    "Auspicious",
    "Seemantham",
    "Half Saree"
  ],
  "original_id": "diamond_jewellery_3dbedff2-f281-404d-9ab3-50a27c2d1d78_0105",
  "collection": "diamond"
}