{
  "id": "necklaces-1592",
  "title": "Emerald Radiance: Diamond and Emerald Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in [Assuming White Gold based on the image] White Gold. Featuring 15.01 carats of vibrant Emeralds (బచ్చలికూర రంగు పచ్చలు)",
    "with diamonds of FG color totaling 9.90 carats. High clarity diamonds are meticulously set in a prong setting to maximize brilliance."
  ],
  "features": "This Haaram blends modern design with traditional South Indian influences. The necklace features a graduated design, with larger Emeralds set as focal points, surrounded by intricate arrangements of diamond petals. Delicate diamond clusters gracefully hang from the Emeralds, creating a mesmerizing movement. The 'Kasulaperu' (coin necklace) effect is achieved through the meticulously arranged diamond elements which are like leaves.",
  "colors": [
    "The color scheme is dominated by the brilliant white of the diamonds",
    "complemented by the lush green of the Emeralds. The white gold provides a cool",
    "modern backdrop that enhances the colors of the gemstones."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (పెళ్లి)",
    "receptions",
    "or milestone birthdays. Ideal for a bride's muhurtham",
    "or for an elegant evening gala. Makes a stunning statement piece for cultural festivals and family celebrations (కుటుంబ వేడుకలు)."
  ],
  "description": "This exquisite Haaram is a harmonious blend of timeless elegance and modern design. The use of high-quality Emeralds and diamonds ensures enduring beauty and investment value. Its unique design is both striking and graceful, making it a true heirloom piece. The prong setting highlights the brilliance of the diamonds. Makes an elegant statement.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Telugu Jewelry",
    "Pelli Jewellery",
    "Muhurtham Jewelry",
    "Statement Necklace",
    "Fine Jewelry",
    "Emeralds",
    "Diamonds",
    "White Gold",
    "Kasulaperu",
    "కంఠహారం",
    "పచ్చలు",
    "వజ్రాలు",
    "పెళ్లి నగలు",
    "తెలుఁగు నగలూ"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-50 2_2297",
  "collection": "sjpl"
}