{
  "id": "necklaces-972",
  "title": "Manohari Diamond Haaram with Ruby and Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "Brilliant Cut Diamonds (VVS Clarity",
    "E-F Color)",
    "Natural Ruby (Burmese)",
    "South Sea Pearls"
  ],
  "features": "This modern Haaram features a delicate vine-like setting for the diamonds, creating a shimmering cascade. The centerpiece showcases a stylized peacock (Mayura) design, subtly incorporating traditional South Indian motifs within a contemporary framework. The pendant features a central Ruby cabochon surrounded by diamonds and finished with delicate South Sea pearl drops for a touch of classic elegance.",
  "colors": [
    "Primarily gold and white from the diamonds",
    "with a striking accent of deep red from the ruby and a soft",
    "iridescent cream from the pearls."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and formal gatherings. It's a statement piece for the modern bride (vadhu) or for special occasions like anniversaries and milestone celebrations. Can also be worn with indo-western outfits."
  ],
  "description": "This Haaram is a masterpiece of contemporary jewelry design blended seamlessly with traditional South Indian elements. The high-quality diamonds ensure brilliance and enduring value. The stylized peacock design is a symbol of grace and beauty, while the ruby adds a touch of auspiciousness (shubham). The delicate pearl drops offer a feminine and sophisticated finish. Crafted with meticulous attention to detail in Hyderabad, using only the finest materials.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Ruby Jewelry",
    "South Sea Pearls",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Mayura",
    "Peacock",
    "Hyderabadi Jewelry",
    "Telugu Jewelry",
    "Vaddanam (though not a Vaddanam",
    "related in style)",
    "Shobha",
    "Shubham",
    "Vadhu",
    "contemporary jewelry"
  ],
  "original_id": "necklace_diamond-open-close_IMG-20241113-WA0374_2433",
  "collection": "necklace"
}