{
  "id": "necklaces-778",
  "title": "Emerald and Diamond Grandeur: Bridal Raasi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold with Hyderabadi Polish. Showcasing brilliant-cut Diamonds with exceptional clarity (VVS) and vibrant Emeralds of exceptional color",
    "cut into pear and round shapes. Adorned with South Sea Pearls."
  ],
  "features": "A breathtaking tiered design, inspired by traditional South Indian motifs, meticulously handcrafted. The upper tiers feature stylized floral patterns paved with diamonds. Emeralds are bezel-set, adding a touch of regal elegance. The central pendant showcases a large emerald encircled by diamonds in a floral arrangement. Delicate pearl drops enhance its graceful appeal. Includes traditional `Lakshmi Kasu` (coin) detailing.",
  "colors": [
    "The piece features a stunning contrast of rich emerald green",
    "sparkling white diamonds",
    "the creamy luster of South Sea pearls",
    "and the warm glow of yellow gold. A classically elegant and auspicious color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaah)",
    "Seemantham (baby shower)",
    "and other grand celebrations. This Raasi Haaram is ideal for a traditional Telugu bride looking to make a statement."
  ],
  "description": "This Raasi Haaram embodies the rich heritage of South Indian jewelry craftsmanship. Each diamond and emerald is carefully selected for its exceptional quality and brilliance. Its timeless design ensures it will be cherished for generations. The Hyderabadi polish gives the gold a unique luster and durability. A symbol of prosperity and good fortune, this piece is more than just jewelry; it is an heirloom.",
  "tags": [
    "Haaram",
    "కంఠాభరణము",
    "Necklace",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Emerald",
    "Diamond",
    "Pearls",
    "Hyderabad",
    "Traditional Jewelry",
    "Telugu Jewelry",
    "Lakshmi Kasu",
    "Raasi",
    "Muhurtham",
    "Seemantham",
    "Heirloom",
    "Vaddanam"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-28-09_1284",
  "collection": "diamond"
}