{
  "id": "necklaces-1024",
  "title": "Emerald Diamond Grand Haaram - Navaratna Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with a Hyderabadi Polish for exceptional luster. Adorned with brilliant-cut diamonds (VVS clarity",
    "G color) surrounding a central emerald and ruby. The pendant features a pear-shaped emerald and is finished with lustrous South Sea Pearls."
  ],
  "features": "This exquisite Haaram features a floral motif pendant intricately set with diamonds, rubies, and a rich green emerald. The design showcases a blend of traditional South Indian artistry with modern diamond setting techniques. The bottom pendant is further enhanced by danging South Sea Pearls adding a touch of timeless sophistication.",
  "colors": [
    "Primarily gold and white (diamonds) with striking accents of green (emeralds) and red (rubies). The creamy white of the South Sea Pearls complements the overall color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu)",
    "engagements (Nischayathartham)",
    "Seemantham ceremonies",
    "and grand celebrations. Also suitable for upscale parties and red-carpet events where you want to make a statement."
  ],
  "description": "This Haaram is a true heirloom piece, blending traditional South Indian design with the brilliance of modern diamond cutting. The use of high-quality emeralds, rubies, and South Sea Pearls ensures lasting beauty and value. The meticulous craftsmanship and Hyderabadi polish guarantee a piece that will be treasured for generations. Owning this Haaram is not just owning jewelry; it's owning a piece of South Indian heritage.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald",
    "Ruby",
    "South Sea Pearls",
    "22K Gold",
    "Hyderabadi Polish",
    "Indian Jewelry",
    "Wedding Jewelry",
    "Vivahaalu",
    "Nischayathartham",
    "Seemantham",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Grand Necklace",
    "Vaddanam"
  ],
  "original_id": "necklace_diamond-open_IMG-20241113-WA0483_2345",
  "collection": "necklace"
}