{
  "id": "earrings-505",
  "title": "Raani Haar Inspired Emerald, Ruby, and Pearl Dangler Earrings",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Yellow Gold. Features a cushion cut Ruby",
    "an emerald-cut Emerald",
    "and a South Sea Pearl. Encrusted with VVS clarity",
    "E/F color diamonds with a total carat weight of 5 carats. Hyderabadi Polish applied for a rich",
    "lustrous finish."
  ],
  "features": "Inspired by the design of Raani Haar necklaces, these earrings feature a cascading design. The upper section features a Ruby surrounded by diamonds, leading to the Emerald. Each gemstone is set within a halo of pavé-set diamonds. A lustrous South Sea Pearl dangles gracefully at the bottom. The setting is meticulously crafted to maximize the brilliance of each gemstone.",
  "colors": [
    "The design combines the vibrant pink of Ruby",
    "the rich green of Emerald",
    "the shimmering white of Diamonds",
    "the warm tones of yellow Gold",
    "and the creamy iridescence of Pearl creating a regal color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaha)",
    "receptions",
    "and other grand celebrations. These earrings add a touch of regal elegance to any formal attire."
  ],
  "description": "These earrings are a unique fusion of traditional and modern aesthetics. The regal gemstone choices create a rare balance of precious materials to elevate one's look. Meticulous craftsmanship ensures the piece's durability and makes it a timeless heirloom. The combination of traditional design and modern sparkle makes these earrings a truly special piece.",
  "tags": [
    "Earrings",
    "Chandbali",
    "Ruby",
    "Emerald",
    "Pearl",
    "Diamond",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Partywear",
    "Traditional Jewelry",
    "Heirlooms",
    "Vivaaha",
    "Function Jewelry",
    "Grand Celebration",
    "Statement Earrings",
    "Telugu Jewelry"
  ],
  "original_id": "ear_rings_DPER8-1764_2638",
  "collection": "ear"
}