{
  "id": "necklaces-1194",
  "title": "Exquisite Diamond and Emerald Antique Finish Haaram with Pearl Drops",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Premium 22K Gold with Hyderabadi Polish. Adorned with sparkling Diamonds (Dwt: 7.18)",
    "two Oval Cut Rubies totaling 2.74 carats",
    "two Emeralds totaling 1.99 carats",
    "and lustrous South Sea Pearls (Moti: 33.30). The locket alone boasts an additional 1.56 Dwt. of Diamonds and 11.70 carats of Pearls."
  ],
  "features": "This contemporary Haaram showcases intricate filigree work, complemented by an antique finish that adds a touch of old-world charm. The open setting allows maximum light reflection, enhancing the brilliance of the diamonds. The necklace features a central Emerald stone flanked by diamond-studded floral motifs, leading to delicate pearl drops for a touch of elegance. The detachable pendant mirrors the floral motif, creating a cohesive and stunning design.",
  "colors": [
    "The color palette is dominated by the warm golden hue of the 22K gold",
    "accentuated by the vibrant green of the emeralds and rubies",
    "and the creamy white of the pearls. This classic South Indian combination is timeless and sophisticated."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Vivaha)",
    "receptions",
    "anniversaries",
    "and festive celebrations like Ugadi and Dussehra. Its contemporary design also makes it suitable for upscale modern events and parties."
  ],
  "description": "This Haaram is a true statement piece, expertly handcrafted in Hyderabad. The antique finish adds a unique vintage appeal, while the high-quality diamonds, emeralds, and pearls ensure lasting value. The versatile design seamlessly blends traditional South Indian aesthetics with modern sensibilities, making it a cherished addition to any jewelry collection. The detachable pendant provides flexibility in styling.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Necklace",
    "Pearl Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Antique Finish",
    "Temple Jewelry",
    "Moti Mala",
    "Vaddanam",
    "Vivaha",
    "Muhurtham"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-44 2_1768",
  "collection": "sjpl"
}