[
  {
    "id": "rings-001",
    "title": "Raashi Pushpa Vanki Rings - Embellished Bandhi",
    "category": "rings",
    "original_type": "Rings",
    "materials": [
      "22K Gold with Hyderabadi Polish",
      "Ruby Cabochon Center",
      "Emerald accents",
      "and Cubic Zirconia pavé setting. Gold purity guaranteed. Superior craftsmanship for long lasting brilliance."
    ],
    "features": "Intricate floral design inspired by traditional South Indian 'Raashi Pushpa' motifs. The circular arrangement features a Ruby center encircled by Emeralds and sparkling Cubic Zirconia. The 'vanki' style openwork design provides a unique look that blends traditional aesthetics with modern comfort and wearability.",
    "colors": [
      "Predominantly Gold with vibrant Ruby Red and Emerald Green accents. The Cubic Zirconia offers a dazzling white sparkle. Classic and auspicious color palette for traditional occasions."
    ],
    "occasions": [
      "Perfect for weddings (Vivahaalu)",
      "festivals (Pandugalu)",
      "and special celebrations. Also suitable as a statement piece for contemporary events and gatherings. A thoughtful gift for Seemantham or other auspicious ceremonies."
    ],
    "description": "This ring is a contemporary take on the classic vanki armlet, offering the same timeless appeal in a more wearable design. Crafted with high-quality materials and meticulous attention to detail, this ring embodies the rich heritage of South Indian jewelry. Its unique design and vibrant color palette make it a statement piece that is sure to turn heads. Guaranteed to retain its luster and value over time.",
    "tags": [
      "Vanki",
      "Ring",
      "Gold Ring",
      "Ruby",
      "Emerald",
      "Cubic Zirconia",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "Raashi Pushpa",
      "Embellished Bandhi",
      "Wedding Jewelry",
      "Festival Jewelry",
      "Bridal Jewelry",
      "Pandugalu",
      "Vivahaalu",
      "Seemantham",
      "Women's Ring",
      "Statement Ring"
    ],
    "original_id": "diamond_jewellery_0eaea4f5-8dd7-443c-a003-b8993751cb5c_0078",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-001/image.jpg",
    "thumbnailPath": "/products/rings/rings-001/thumbnail.jpg"
  },
  {
    "id": "rings-002",
    "title": "Lakshmi Devi Devotional Finger Ring - A Touch of Divinity",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "meticulously crafted with shimmering CZ stones",
      "rich Ruby accents",
      "and Emerald highlights. Features a beautifully detailed Lakshmi Devi idol crafted in oxidized metal for contrast. Hyderabadi Polish provides a lasting luster."
    ],
    "features": "This exquisite ring showcases a classic square temple design. At its heart lies the Lakshmi Devi motif, meticulously detailed and placed within an ornate filigree setting. The surrounding CZ stones are pave-set for maximum brilliance, while the rubies and emeralds add a touch of traditional South Indian color. The shank is designed for a comfortable fit, ensuring ease of wear.",
    "colors": [
      "Predominantly gold with a vibrant contrast of red (rubies)",
      "green (emeralds)",
      "and sparkling white (CZ stones). The Lakshmi Devi idol features a darker",
      "oxidized finish for enhanced detail."
    ],
    "occasions": [
      "Perfect for festive occasions like Diwali",
      "Ugadi",
      "Varalakshmi Vratham",
      "and weddings. Also a beautiful and meaningful addition to everyday wear for the devout."
    ],
    "description": "This ring seamlessly blends devotion with refined elegance. The intricate Lakshmi Devi design symbolizes prosperity and good fortune, making it a cherished heirloom piece. Crafted with the highest quality materials and traditional Hyderabadi craftsmanship, this ring is not just a piece of jewelry, but a symbol of your faith and style.",
    "tags": [
      "Ring",
      "Angu",
      "Temple Jewelry",
      "Lakshmi Devi",
      "Goddess",
      "Gold",
      "CZ",
      "Ruby",
      "Emerald",
      "Traditional",
      "South Indian",
      "Hyderabadi Jewelry",
      "Devotional",
      "Festival",
      "Wedding",
      "Vara Lakshmi Vratham",
      "Ugadi",
      "Diwali",
      "Antique Finish",
      "Filigree",
      "Pave Setting"
    ],
    "original_id": "diamond_jewellery_8ad8166d-86dc-4a2e-a7f8-28a438330e49_0154",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-002/image.jpg",
    "thumbnailPath": "/products/rings/rings-002/thumbnail.jpg"
  },
  {
    "id": "rings-003",
    "title": "Exquisite Pushyaragam (Pink Sapphire) Flower Ring with Diamond Halo",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "Natural Pink Sapphires (Pushyaragam) - Heart Cut",
      "Brilliant Cut Diamonds - VS Clarity",
      "E-F Color. Hyderabadi Polish for lasting luster."
    ],
    "features": "Intricately designed flower motif with a central bloom of vibrant heart-cut pink sapphires. The petals are encircled by a shimmering halo of pavé-set diamonds creating a dazzling effect. Openwork detailing on the shank enhances the ring's elegance. The design is inspired by traditional floral patterns, giving it a timeless appeal.",
    "colors": [
      "Gold (yellow)",
      "Pink (sapphires)",
      "White (diamonds)"
    ],
    "occasions": [
      "Perfect for weddings (Vivaha)",
      "engagements",
      "anniversaries",
      "or any special occasion where you desire to make a bold statement. A stunning addition to your jewelry collection for festive celebrations like Diwali or Sankranti."
    ],
    "description": "This ring embodies the essence of luxury and craftsmanship. The combination of vibrant pink sapphires and sparkling diamonds is simply breathtaking. The superior quality of the gemstones, coupled with the meticulous setting, ensures that this piece will be treasured for generations. Its classic design makes it a versatile piece that can be worn with both traditional and modern attire.",
    "tags": [
      "Ring",
      "Pushyaragam",
      "Pink Sapphire",
      "Diamond",
      "Gold",
      "Floral",
      "Statement Ring",
      "Wedding Jewelry",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Engagement Ring",
      "Vivaha",
      "Hyderabad Jewelry",
      "Fine Jewelry",
      "VS Clarity",
      "Diamond Halo"
    ],
    "original_id": "diamond_jewellery_DMCR8-1663_0216",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-003/image.jpg",
    "thumbnailPath": "/products/rings/rings-003/thumbnail.jpg"
  },
  {
    "id": "rings-004",
    "title": "Gulabi Polki and Emerald Cocktail Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "Uncut Polki Diamonds (Rose Cut)",
      "Emeralds (faceted)",
      "Diamond melee (natural)"
    ],
    "features": "The ring features a floral motif with uncut Polki diamonds forming the petals, interspersed with vibrant emeralds. Surrounded by diamond melee, creating a brilliant halo. The setting uses a traditional kundan technique to showcase the beauty of uncut diamonds. The gold has a traditional Hyderabadi finish. A statement piece of wearable art that perfectly marries classic design with contemporary flair.",
    "colors": [
      "Gold",
      "Emerald Green",
      "White (Polki Diamonds)"
    ],
    "occasions": [
      "Ideal for weddings",
      "receptions",
      "festive occasions",
      "or any event where you want to make a statement."
    ],
    "description": "This ring is a true heirloom piece, crafted with authentic Polki diamonds and vibrant emeralds. Its unique design and exceptional craftsmanship make it a valuable addition to any jewelry collection. The blend of traditional Kundan artistry with a modern cocktail ring style makes it both timeless and on-trend. The gold is 22K, ensuring lasting shine and durability. The Hyderabadi finish adds a touch of regal elegance.",
    "tags": [
      "Polki",
      "Kundan",
      "Ring",
      "Emerald",
      "Diamond",
      "Gold",
      "Flower",
      "Traditional",
      "Hyderabadi Jewelry",
      "South Indian Jewelry",
      "Indian Jewelry",
      "Wedding Jewelry",
      "Partywear",
      "Cocktail Ring"
    ],
    "original_id": "diamond_jewellery_DPCR8-1340_0239",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-004/image.jpg",
    "thumbnailPath": "/products/rings/rings-004/thumbnail.jpg"
  },
  {
    "id": "rings-005",
    "title": "Royal Rajwadi Polki & Onyx Statement Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "18K Yellow Gold",
      "Sterling Silver",
      "Natural Polki Diamonds (Uncut Diamonds)",
      "Black Onyx. Features a signature Hyderabadi Polish for enhanced luster."
    ],
    "features": "A bold rectangular design features a central floral motif crafted with ethically sourced polki diamonds in a bezel setting. The backdrop consists of sleek, polished black onyx stones arranged in a geometric pattern. A pave-set border of dazzling diamonds adds a touch of modern glamour. The design seamlessly blends traditional polki craftsmanship with contemporary aesthetics.",
    "colors": [
      "Primarily a contrasting color palette featuring the deep black of onyx",
      "the warm yellow of gold settings around the central cluster",
      "the raw shine of the polki diamonds",
      "and the bright white brilliance of the surrounding diamond border. This color scheme creates a rich and luxurious feel."
    ],
    "occasions": [
      "Ideal for grand celebrations",
      "evening galas",
      "or any occasion where you want to make a statement. Also suitable for adding a touch of royal elegance to modern attire",
      "or traditional Sangeet/Cocktail parties."
    ],
    "description": "This ring showcases the unique beauty of uncut polki diamonds, a gem coveted in South Indian jewelry. The combination of polki diamonds and black onyx creates a striking contrast, while the meticulous craftsmanship and Hyderabadi polish ensure lasting beauty and heirloom quality. This is a unique piece that blends modern and traditional styles perfectly.",
    "tags": [
      "Polki Ring",
      "Diamond Ring",
      "Onyx Ring",
      "Statement Ring",
      "Indian Jewelry",
      "Hyderabadi Jewelry",
      "Uncut Diamonds",
      "Telugu Jewelry",
      "South Indian Jewelry",
      "Rajwadi Jewelry",
      "Contemporary Ring",
      "Ethnic Ring",
      "Engagement Ring",
      "Sangeet Jewelry"
    ],
    "original_id": "diamond_jewellery_DPCR8-1341_0240",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-005/image.jpg",
    "thumbnailPath": "/products/rings/rings-005/thumbnail.jpg"
  },
  {
    "id": "rings-006",
    "title": "Nilaveni Diamond Ring - A Touch of Celestial Elegance",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "High-Quality Kundan Stones",
      "Faceted Polki Diamonds. Features Hyderabadi Polish for a lasting luster."
    ],
    "features": "A striking floral motif ring. The central stone is accented by intricate kundan work in shades of deep midnight blue, resembling petals. Sparkling Polki diamonds are meticulously set between the 'petals', adding brilliance. The 'petals' surround the primary stone in a symmetrical, ray-like pattern, exhibiting a modern take on a traditional design.",
    "colors": [
      "Dominant colors include gold",
      "deep blue (Kundan)",
      "and clear white (Polki diamonds)."
    ],
    "occasions": [
      "Perfect for weddings",
      "engagements",
      "or any special occasion where you want to make a statement. Adds a touch of sophistication to traditional attire like sarees and lehengas",
      "but can also beautifully accent contemporary outfits."
    ],
    "description": "Handcrafted by master artisans, this ring showcases the rich heritage of Hyderabadi jewelry. The combination of Kundan and Polki diamonds creates a unique and eye-catching piece. The quality of the materials ensures that this ring will be a cherished heirloom for generations. The design blends tradition with contemporary sensibilities for a modern bride.",
    "tags": [
      "Ring",
      "Kundan",
      "Polki Diamond",
      "Hyderabadi Jewelry",
      "Indian Jewelry",
      "Traditional Jewelry",
      "Wedding Ring",
      "Engagement Ring",
      "Floral Ring",
      "Swarna Mudrika"
    ],
    "original_id": "diamond_jewellery_DPCR8-1343_0241",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-006/image.jpg",
    "thumbnailPath": "/products/rings/rings-006/thumbnail.jpg"
  },
  {
    "id": "rings-007",
    "title": "Manikya Polki Kundan Ring - A Timeless Heirloom",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "Crafted in high-purity Gold",
      "adorned with exquisite uncut Polki diamonds and vibrant Manikya (Ruby) accents. Hyderabadi Polished for a lasting luster."
    ],
    "features": "This stunning ring features a floral motif meticulously handcrafted with traditional Kundan setting. The central Polki diamond is surrounded by smaller, carefully placed Polkis and is flanked by the bright red accent colors around the edges. The overall design reflects Mughal and South Indian design sensibilities, making it a true statement piece.",
    "colors": [
      "Primarily Gold and White (Polki Diamonds)",
      "with a vibrant touch of Ruby Red (Manikya) accents."
    ],
    "occasions": [
      "Perfect for weddings (Vivaaha)",
      "engagements",
      "festive celebrations like Diwali and Sankranti",
      "and other special occasions. A regal choice for the modern bride and a treasured addition to any heirloom collection."
    ],
    "description": "This exquisite ring embodies the rich heritage of South Indian jewelry design with the Hyderabadi finesse. The use of Polki diamonds, known for their unique uncut beauty, elevates the piece to a heirloom status. Its enduring design and impeccable craftsmanship make it a worthwhile investment and a conversation starter.",
    "tags": [
      "Kundan",
      "Polki",
      "Diamond Ring",
      "Manikya",
      "Ruby",
      "South Indian Jewelry",
      "Hyderabadi Jewelry",
      "Bridal Ring",
      "Wedding Jewelry",
      "Anguthi",
      "Traditional Jewelry",
      "Indian Jewelry",
      "Fine Jewelry",
      "Vivaaha",
      "Gift",
      "Statement Ring"
    ],
    "original_id": "diamond_jewellery_DPCR8-1355_0242",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-007/image.jpg",
    "thumbnailPath": "/products/rings/rings-007/thumbnail.jpg"
  },
  {
    "id": "rings-008",
    "title": "The \"Padma Rani\" Polki and Pink Stone Cocktail Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (916 Gold) setting with Hyderabadi Polish. Features uncut Polki diamonds (Natural Diamonds) in a closed setting and carefully placed",
      "high-quality pink stones."
    ],
    "features": "A striking floral design, blending traditional Polki diamond craftsmanship with a modern cocktail ring silhouette. The center Polki is surrounded by petals of pink stones and smaller polkis, creating a stunning visual effect. The gold setting showcases the unique fire of the uncut diamonds and creates a beautiful border",
    "colors": [
      "Predominantly gold",
      "with brilliant white sparkle from the Polki diamonds and soft pink stones."
    ],
    "occasions": [
      "Perfect for weddings (Muhurtham)",
      "receptions",
      "and festive occasions. Also suitable as a statement piece for cocktail parties or special events."
    ],
    "description": "This ring offers a unique blend of traditional Hyderabadi craftsmanship and contemporary design. The use of natural Polki diamonds adds a touch of heritage and timeless appeal, while the pink stones give it a unique, modern twist. A true statement piece that will be treasured for generations.",
    "tags": [
      "Polki",
      "Diamond Ring",
      "Cocktail Ring",
      "Pink Stone",
      "Hyderabadi Jewelry",
      "Indian Jewelry",
      "Wedding Ring",
      "Engagement Ring",
      "Festive Jewelry",
      "अंगूठी",
      "Gold Ring",
      "Statement Ring",
      "Natural Diamonds",
      "Uncut Diamonds"
    ],
    "original_id": "diamond_jewellery_DPCR8-1394_0243",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-008/image.jpg",
    "thumbnailPath": "/products/rings/rings-008/thumbnail.jpg"
  },
  {
    "id": "rings-009",
    "title": "Enchanting Emerald & Diamond Vanki (Armlet)",
    "category": "rings",
    "original_type": "Armlet",
    "materials": [
      "22K Gold",
      "Natural Emeralds (Oval and Pear-Shaped Cuts)",
      "Polki Diamonds. Hyderabadi Gold Polish for a rich",
      "antique luster."
    ],
    "features": "Features a classic Vanki (armlet) design, inspired by the mango/peacock motif of South Indian tradition. Exquisite arrangement of lush green emeralds and uncut Polki diamonds. The dangling Polki diamonds add movement and a touch of regal elegance. The open setting allows maximum light to illuminate the gemstones, enhancing their brilliance. The gold framework uses a delicate, filigree-inspired design.",
    "colors": [
      "Vibrant Green (Emeralds)",
      "Sparkling White (Polki Diamonds)",
      "Rich Yellow (Gold). A timeless color palette reflecting South Indian opulence."
    ],
    "occasions": [
      "Perfect for traditional South Indian weddings (Vivaha Mahotsavam)",
      "Bharatanatyam performances",
      "Seemantham (baby shower)",
      "housewarmings",
      "or any special occasion where you want to radiate grace and cultural pride. Also suitable for high-end contemporary events where you want to make a statement with a piece of wearable art."
    ],
    "description": "This exquisite Vanki (armlet) is a testament to the unparalleled craftsmanship of Hyderabad's finest artisans. The combination of precious emeralds and natural Polki diamonds makes it a valuable heirloom piece to be treasured for generations. Its unique design seamlessly blends tradition with modern aesthetics, making it a versatile addition to your jewelry collection. Own a piece of South Indian heritage and radiate timeless beauty.",
    "tags": [
      "Vanki",
      "Armlet",
      "Emerald",
      "Polki Diamonds",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Traditional Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Seemantham",
      "Vivaha Mahotsavam",
      "Heritage Jewelry",
      "Antique Finish",
      "22K Gold",
      "Pachala",
      "Polki",
      "Bajubandh"
    ],
    "original_id": "diamond_jewellery_DPER8-1447_0265",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-009/image.jpg",
    "thumbnailPath": "/products/rings/rings-009/thumbnail.jpg"
  },
  {
    "id": "rings-010",
    "title": "Emerald Blossom Polki Ring - Ratnagarbha Pachala Anguliya",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (Svarnam)",
      "Natural Emerald Cabochon",
      "Polki Diamonds (Uncut Diamonds) - Superior Clarity",
      "Hyderabadi Polish"
    ],
    "features": "Intricate floral design with a central Emerald cabochon surrounded by shimmering Polki diamonds. The setting showcases a delicate openwork pattern, enhancing the brilliance of the gemstones. Features a modern interpretation of the traditional 'Mogra' flower design, popular in South Indian jewelry. The use of Polki diamonds adds a rustic, antique charm. Handcrafted by skilled artisans in Hyderabad, known for their exceptional craftsmanship.",
    "colors": [
      "Lustrous gold with a vibrant green Emerald center and sparkling white Polki diamonds."
    ],
    "occasions": [
      "Perfect for special occasions such as weddings (Vivaha)",
      "engagements (Nischitartham)",
      "festivals (like Diwali",
      "Ugadi)",
      "or as a statement piece for any evening event. Adds a touch of regal elegance to any outfit."
    ],
    "description": "This ring is a harmonious blend of traditional South Indian design and modern elegance. The use of genuine Polki diamonds and a vivid Emerald cabochon makes it a truly unique piece. Handcrafted in Hyderabad, known for its rich jewelry heritage, it is a valuable addition to any jewelry collection. Symbolizes prosperity and good fortune, making it a cherished heirloom. Exquisite craftsmanship ensures durability and lasting beauty.",
    "tags": [
      "Ring",
      "Anguliya",
      "Emerald",
      "Pachala",
      "Polki Diamond",
      "Uncut Diamond",
      "South Indian Jewelry",
      "Hyderabad Jewelry",
      "Mogra Flower",
      "Traditional Jewelry",
      "Wedding Jewelry",
      "Festive Jewelry",
      "Cocktail Ring",
      "Indian Jewelry",
      "Fine Jewelry",
      "22K Gold",
      "Swarnam",
      "Ratnagarbha"
    ],
    "original_id": "diamond_jewellery_DPER8-1591_0282",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-010/image.jpg",
    "thumbnailPath": "/products/rings/rings-010/thumbnail.jpg"
  },
  {
    "id": "rings-011",
    "title": "Exquisite Polki Kundan Ring - A Timeless Statement Piece",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (approximate",
      "as this is Polki setting)",
      "Uncut Polki Diamonds",
      "Hyderabadi Polish for a subtle",
      "lasting sheen."
    ],
    "features": "This ring showcases a beautiful floral design meticulously set with uncut Polki diamonds. The setting is a classic Kundan style, reflecting the traditional craftsmanship of Hyderabad. The use of 'closed setting' enhances the brilliance of each individual polki. The band of the ring is designed for comfortable wear.",
    "colors": [
      "Predominantly gold with sparkling white Polki diamonds. The Hyderabadi Polish lends a slightly antique golden hue",
      "enhancing the richness."
    ],
    "occasions": [
      "Perfect for weddings (Vivaha)",
      "engagements",
      "festive occasions like Diwali or Sankranthi",
      "or any special event where you want to make a statement. Also suitable for a sophisticated evening out."
    ],
    "description": "This Polki Kundan ring is a testament to timeless South Indian elegance. Each uncut diamond is hand-selected and expertly set, creating a piece that is both luxurious and culturally significant. The Hyderabadi Polish ensures a durable and lustrous finish. A truly unique investment piece to be treasured for generations.",
    "tags": [
      "Polki Ring",
      "Kundan Jewelry",
      "Indian Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Diamond Ring",
      "Uncut Diamond",
      "Gold Ring",
      "Hyderabadi Jewelry",
      "Angusam",
      "ఉంగరం",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Festive Jewelry",
      "Engagement Ring",
      "Vintage Style"
    ],
    "original_id": "diamond_jewellery_DPER8-1614_0290",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-011/image.jpg",
    "thumbnailPath": "/products/rings/rings-011/thumbnail.jpg"
  },
  {
    "id": "rings-012",
    "title": "Lakshmi Vilasam: Rose Cut Diamond and Ruby Vanki Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (916 Hallmark)",
      "Rose Cut Diamond",
      "Natural Rubies. Features Hyderabadi Polish for a rich",
      "enduring luster."
    ],
    "features": "Classic Vanki ring design reimagined for contemporary wear. The centerpiece is a stunning rose-cut diamond, surrounded by a halo of brilliant-cut diamonds and vibrant rubies. The openwork gold setting showcases intricate filigree detailing, highlighting the gemstones' natural beauty. The design incorporates subtle temple jewelry inspirations, reflecting timeless South Indian artistry.",
    "colors": [
      "Rich gold",
      "deep red rubies",
      "and dazzling white diamonds."
    ],
    "occasions": [
      "Perfect for engagements",
      "weddings (vadhuvu)",
      "anniversaries",
      "or as a treasured heirloom piece. Also suitable for festive occasions like Ugadi",
      "Sankranthi",
      "and Diwali."
    ],
    "description": "This Vanki ring embodies the essence of South Indian tradition with a modern sensibility. The rose-cut diamond offers a unique sparkle and timeless appeal. Handcrafted by skilled artisans in Hyderabad, this piece boasts exceptional craftsmanship and durability. The combination of rubies and diamonds symbolizes prosperity and good fortune, making it an auspicious addition to any jewelry collection.",
    "tags": [
      "Vanki",
      "Ring",
      "Diamond Ring",
      "Ruby Ring",
      "Rose Cut Diamond",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Hyderabadi Jewelry",
      "Gold Ring",
      "Telugu Jewelry",
      "Wedding Jewelry",
      "Engagement Ring",
      "Nakshi",
      "Filigree",
      "22K Gold",
      "Ugadi",
      "Sankranthi",
      "Diwali",
      "vadhuvu"
    ],
    "original_id": "diamond_jewellery_DPER8-198_0306",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-012/image.jpg",
    "thumbnailPath": "/products/rings/rings-012/thumbnail.jpg"
  },
  {
    "id": "rings-013",
    "title": "Pushpa Chakra Ring - Kundan and Ruby Floral Statement",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold Plated base metal. Features high-quality Kundan stones (Polki Diamonds Simulants) and square-cut Rubies. Finished with a protective Hyderabadi Polish for lasting shine."
    ],
    "features": "Intricate floral design inspired by the 'Pushpa Chakra' motif. The central cluster showcases brilliant Kundan stones, each meticulously set by hand. The contrasting square-cut rubies add a pop of color and enhance the overall allure. Modern design making it a versatile ring.",
    "colors": [
      "Gold",
      "White (Kundan stones)",
      "and Ruby Red."
    ],
    "occasions": [
      "Perfect for special occasions",
      "festive celebrations like Diwali and Sankranthi",
      "wedding receptions",
      "or adding a touch of elegance to your everyday ensemble. A sophisticated addition to your ring collection."
    ],
    "description": "This Kundan ring is a statement piece, that will certainly garner attention. Crafted with precision and attention to detail, reflecting the rich heritage of South Indian jewelry craftsmanship. The contrasting colors and floral design make it a captivating accessory.",
    "tags": [
      "Kundan Ring",
      "Ruby Ring",
      "Floral Ring",
      "Statement Ring",
      "Indian Jewelry",
      "Telugu Jewelry",
      "Hyderabad Jewelry",
      "Festive Jewelry",
      "Wedding Jewelry",
      "Pushpa Chakra",
      "Polki",
      "Kundan",
      "Ruby",
      "gold plated"
    ],
    "original_id": "diamond_jewellery_DPER8-378_0307",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-013/image.jpg",
    "thumbnailPath": "/products/rings/rings-013/thumbnail.jpg"
  },
  {
    "id": "rings-014",
    "title": "Indrani Ruby Bloom Ring - A Touch of Timeless Elegance",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "Natural Ruby (oval cut",
      "fine color)",
      "Cubic Zirconia. Features a lustrous Hyderabadi Polish for a regal sheen."
    ],
    "features": "This captivating cocktail ring showcases a vibrant, oval-cut natural ruby at its heart, encircled by a delicate filigree of gold and shimmering Cubic Zirconia. The openwork design lends an airy feel, while subtle floral motifs (inspired by the traditional 'Kamal' or lotus) add a touch of South Indian heritage. The setting is meticulously crafted to enhance the brilliance of the stones.",
    "colors": [
      "Rich ruby red",
      "warm gold",
      "and sparkling white (Cubic Zirconia) create a striking contrast that is both eye-catching and sophisticated."
    ],
    "occasions": [
      "Perfect for special occasions",
      "engagements",
      "parties",
      "or as a statement piece to elevate your everyday style. This ring also makes a thoughtful gift for anniversaries and other significant milestones. Can also be worn during festivals like Ugadi",
      "Sankranthi."
    ],
    "description": "A stunning blend of traditional design and modern elegance, this ring is handcrafted with meticulous attention to detail. The high-quality ruby and the Hyderabadi polish give it a luxurious feel and lasting value. This ring is a true heirloom piece, perfect for adding a touch of Indian heritage to any ensemble.",
    "tags": [
      "Ring",
      "Cocktail Ring",
      "Ruby",
      "22K Gold",
      "Hyderabadi Jewelry",
      "Indian Jewelry",
      "Traditional Jewelry",
      "Kamal Design",
      "Floral Ring",
      "Ugadi",
      "Sankranthi",
      "Jewellery",
      "Bangaru Angara",
      "Ratna Angara"
    ],
    "original_id": "diamond_jewellery_DPER8-712_0310",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-014/image.jpg",
    "thumbnailPath": "/products/rings/rings-014/thumbnail.jpg"
  },
  {
    "id": "rings-015",
    "title": "Rani Ruby & Polki Blossom Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (approximate)",
      "High-quality Polki Diamonds (Uncut Diamonds)",
      "Ruby Cabochons. Features a Hyderabadi Polish for a radiant sheen."
    ],
    "features": "This exquisite ring features a floral blossom design, meticulously handcrafted with Polki diamonds set in a closed setting (kundan setting). The pear-shaped Ruby cabochons add a pop of color and elegance. The ring showcases the fusion of traditional Indian craftsmanship with a modern aesthetic.",
    "colors": [
      "Predominantly gold",
      "accented by the vibrant red of the rubies and the subtle brilliance of the Polki diamonds."
    ],
    "occasions": [
      "Perfect for weddings",
      "receptions",
      "engagement ceremonies",
      "or any special occasion where you want to make a statement. Also suitable for upscale parties and events."
    ],
    "description": "A stunning blend of tradition and contemporary design, this ring features high-quality Polki diamonds and vibrant rubies. The Hyderabadi polish enhances the gold's luster, ensuring lasting beauty and value. It's a timeless piece that can be passed down through generations.",
    "tags": [
      "Ring",
      "Polki Diamond",
      "Ruby",
      "Cocktail Ring",
      "Indian Jewelry",
      "Traditional Jewelry",
      "Kundan Setting",
      "Gold Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry",
      "Engagement Ring",
      "Event Jewelry",
      "Contemporary Jewelry",
      "south indian jewelry"
    ],
    "original_id": "diamond_jewellery_DPER8-962_0316",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-015/image.jpg",
    "thumbnailPath": "/products/rings/rings-015/thumbnail.jpg"
  },
  {
    "id": "rings-016",
    "title": "Rajputana Royal Cocktail Ring - A Timeless Splendor",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (916 Hallmark). Featuring premium Burmese Rubies",
      "iridescent Moonstones",
      "and uncut Polki Diamonds (Vilandi). Finished with our signature Hyderabadi Polish for a lustrous shine."
    ],
    "features": "This exquisite ring showcases a classic floral (puvvu) design. A vibrant central ruby is surrounded by sparkling polki diamonds, luminous moonstones, and smaller rubies, creating a regal display. The open setting allows light to pass through the stones, maximizing their brilliance. The band is meticulously crafted for comfort and durability. All settings are hand-finished by our skilled artisans.",
    "colors": [
      "Gold",
      "Ruby Red",
      "Moonstone White (milky)",
      "and Diamond White (sparkling). The classic combination of red and white symbolizes prosperity and purity in South Indian traditions."
    ],
    "occasions": [
      "Perfect for weddings (Vivaha)",
      "engagements (Nischitartham)",
      "festive celebrations (Sankranthi",
      "Diwali)",
      "and grand social gatherings. This ring is a statement piece that will elevate any outfit."
    ],
    "description": "This ring is more than just jewelry; it's an heirloom. The use of high-quality materials and traditional craftsmanship ensures lasting beauty and value. Its unique design blends tradition and elegance, making it a conversation starter and a symbol of refined taste. The timeless appeal makes it a perfect investment for future generations. Also, the ring's adjustable sizing provides unparalleled comfort.",
    "tags": [
      "Ring",
      "Statement Ring",
      "Cocktail Ring",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Hyderabadi Jewelry",
      "Ruby",
      "Moonstone",
      "Polki Diamonds",
      "Vilandi",
      "22K Gold",
      "Traditional Jewelry",
      "Ethnic Jewelry",
      "Wedding Jewelry",
      "Vivaha",
      "Nischitartham",
      "Puvvu",
      "floral design."
    ],
    "original_id": "diamond_jewellery_DPER8-965_0318",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-016/image.jpg",
    "thumbnailPath": "/products/rings/rings-016/thumbnail.jpg"
  },
  {
    "id": "rings-017",
    "title": "Aaradhya: Emerald & Polki Diamond Floral Cocktail Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "Natural Emerald (Oval Cut)",
      "Polki Diamonds (Uncut Diamonds)"
    ],
    "features": "Floral design with an eye-catching oval-cut Emerald at the center, surrounded by meticulously set Polki diamonds in a floral pattern. Traditional craftsmanship with a modern flair. The gold features a Hyderabadi polish, enhancing its luster and longevity. The setting of the Polki diamonds allows maximum light reflection, showcasing their natural brilliance.",
    "colors": [
      "Gold (yellow)",
      "Emerald (green)",
      "Polki Diamonds (white/off-white)"
    ],
    "occasions": [
      "Perfect for weddings",
      "receptions",
      "anniversary celebrations",
      "cocktail parties",
      "and other special occasions where a bold statement is desired. Suitable for both traditional Indian attire and modern western wear."
    ],
    "description": "This ring is a stunning blend of traditional South Indian jewelry techniques and modern design sensibilities. The high-quality Emerald exudes royalty and sophistication, while the Polki diamonds add a touch of timeless elegance. Crafted with the finest materials and meticulous attention to detail, this ring is a valuable investment that will be treasured for generations.",
    "tags": [
      "Ring",
      "Cocktail Ring",
      "Emerald",
      "Polki Diamond",
      "Uncut Diamond",
      "Gold",
      "22K Gold",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Engagement Ring",
      "Anguleeyakam",
      "Traditional Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry"
    ],
    "original_id": "diamond_jewellery_DPLR8-1662_0331",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-017/image.jpg",
    "thumbnailPath": "/products/rings/rings-017/thumbnail.jpg"
  },
  {
    "id": "rings-018",
    "title": "Aishwarya Diamond Vanki Ring: A Touch of Royal Grace",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "18K Yellow Gold",
      "Brilliant Cut Diamonds (VVS Clarity",
      "E-F Color)",
      "Square-Cut Ruby (High Quality",
      "Vivid Red)",
      "Hyderabadi Polish"
    ],
    "features": "This Vanki-inspired ring showcases a central, vibrant square-cut ruby surrounded by a floral halo of meticulously set brilliant-cut diamonds. The openwork design allows light to flow freely, maximizing brilliance. The setting is crafted with the renowned Hyderabadi polish, giving it a unique luster and refined finish. The ring's design pays homage to the traditional 'Vanki' armlet, reimagined for a modern ring style.",
    "colors": [
      "Yellow Gold",
      "White Diamonds",
      "Vivid Red Ruby"
    ],
    "occasions": [
      "Ideal for weddings (vivaha)",
      "engagement ceremonies (nischitartham)",
      "festive occasions like Sankranti and Diwali",
      "as well as upscale parties and evening events. Can be worn as a statement piece to elevate any outfit."
    ],
    "description": "This Aishwarya Diamond Vanki Ring embodies timeless elegance and modern design sensibilities. The vibrant ruby symbolizes love and passion, while the sparkling diamonds represent enduring commitment. Expertly crafted with the famed Hyderabadi polish, this ring is a true heirloom piece that will be cherished for generations. It's a testament to exquisite craftsmanship and luxurious materials.",
    "tags": [
      "Ring",
      "Vanki",
      "Ungaram",
      "Diamond",
      "Ruby",
      "Yellow Gold",
      "Hyderabadi Jewelry",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Engagement Ring",
      "Wedding Ring",
      "Fine Jewelry",
      "Diamond Ring",
      "Gemstone Ring",
      "Fashion Ring",
      "Ethnic Ring",
      "Statement Ring",
      "Nakshi",
      "Vivaha",
      "Nischitartham"
    ],
    "original_id": "diamond_jewellery_IMG-20241219-WA0002_0782",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-018/image.jpg",
    "thumbnailPath": "/products/rings/rings-018/thumbnail.jpg"
  },
  {
    "id": "rings-019",
    "title": "Dazzling Diamond Blossom Ring - Vairaala Ungaram",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "18K Yellow Gold (G/W: 2.980)",
      "Round Brilliant Cut Diamonds (N/W: 2.862). Features a Hyderabadi polish for lasting luster."
    ],
    "features": "A captivating cluster design evoking a blooming flower, with numerous brilliantly cut diamonds expertly set to maximize sparkle. The prongs holding the diamonds are delicately crafted for a secure and elegant setting.",
    "colors": [
      "Warm yellow gold juxtaposed with the icy brilliance of white diamonds creates a timeless and sophisticated color palette."
    ],
    "occasions": [
      "Perfect for everyday elegance",
      "engagement proposals",
      "anniversary celebrations",
      "or as a cherished gift for special occasions like birthdays and weddings. Suitable for modern and traditional attire."
    ],
    "description": "This exquisite diamond ring combines classic design with superior craftsmanship, offering exceptional brilliance and enduring beauty. A timeless statement piece, showcasing the brilliance of ethically sourced diamonds set in luxurious gold. The piece is carefully crafted for longevity and comfort.",
    "tags": [
      "Diamond Ring",
      "Ungaram",
      "Vairaala Ungaram",
      "Cluster Ring",
      "Engagement Ring",
      "Hyderabadi Jewelry",
      "Yellow Gold",
      "Fine Jewelry",
      "Anniversary Gift",
      "Wedding Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Diamonds"
    ],
    "original_id": "diamond_jewellery_IMG-20241219-WA0009_0789",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-019/image.jpg",
    "thumbnailPath": "/products/rings/rings-019/thumbnail.jpg"
  },
  {
    "id": "rings-020",
    "title": "Platinum & Diamond Band Ring with Teal Accents",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "Platinum (950 purity)",
      "Round Brilliant Cut Diamond (VS1 clarity",
      "G color)",
      "Teal-colored gemstones (likely Tourmaline or Zircon)",
      "Hyderabadi Polish finish."
    ],
    "features": "Contemporary band design with a centrally set round brilliant cut diamond. The stone is held in a secure bezel setting. Unique teal gemstones flank the diamond, adding a pop of color and modern flair. The platinum band boasts a high-polish finish for enhanced shine.",
    "colors": [
      "Platinum (silvery-white)",
      "Diamond (colorless/white)",
      "Teal (blue-green)."
    ],
    "occasions": [
      "Engagement",
      "Anniversary",
      "Promise Ring",
      "Everyday Wear",
      "Modern Celebrations."
    ],
    "description": "This ring beautifully blends modern design with high-quality materials. The platinum offers exceptional durability and hypoallergenic properties. The teal accents provide a striking contrast to the brilliant diamond, making it a truly unique piece. It is perfect for the modern woman who appreciates understated elegance and bold color.",
    "tags": [
      "Platinum Ring",
      "Diamond Ring",
      "Band Ring",
      "Engagement Ring",
      "Teal Gemstone",
      "Tourmaline",
      "Zircon",
      "Contemporary Jewelry",
      "Hyderabadi Polish",
      "Gift for Her",
      "Anniversary Gift",
      "Modern Design"
    ],
    "original_id": "diamond_jewellery_IMG-20241219-WA0017_0797",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-020/image.jpg",
    "thumbnailPath": "/products/rings/rings-020/thumbnail.jpg"
  },
  {
    "id": "rings-021",
    "title": "Platinum Diamond Band - Timeless Elegance",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "Platinum 950. Center diamond",
      "brilliant cut",
      "estimated SI1 clarity",
      "H color. High polished finish."
    ],
    "features": "Clean, contemporary design with a centrally set round brilliant diamond. Features a channel setting with sleek, minimalist lines for a modern aesthetic. Provides comfort fit shank for all day wear.",
    "colors": [
      "Platinum (silver/white) and brilliant white diamond."
    ],
    "occasions": [
      "Engagement",
      "Anniversary",
      "Gift for Loved One",
      "everyday wear"
    ],
    "description": "Combines classic diamond sparkle with a modern platinum setting. Its timeless design makes it a perfect symbol of enduring love. Exceptional craftsmanship and quality materials ensure lasting beauty and value.",
    "tags": [
      "platinum ring",
      "diamond ring",
      "engagement ring",
      "wedding band",
      "modern ring",
      "contemporary jewelry",
      "anniversary gift",
      "diamond band",
      "mens ring"
    ],
    "original_id": "diamond_jewellery_IMG-20241219-WA0018_0798",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-021/image.jpg",
    "thumbnailPath": "/products/rings/rings-021/thumbnail.jpg"
  },
  {
    "id": "rings-022",
    "title": "Apsara Engagement Ring: A Modern Twist on Timeless Elegance",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "18K Gold (Yellow Gold Shank",
      "White Gold Setting). Features a brilliant-cut diamond (estimated at 0.75 carat",
      "clarity SI1",
      "color G-H). Hyderabadi Polish for lasting luster."
    ],
    "features": "A captivating split shank design with a central brilliant-cut diamond held in a uniquely crafted white gold setting. The shoulders of the ring feature subtle, intricate hand-engraved detailing. The setting enhances the diamond's brilliance, making it appear larger and more radiant. The split shank creates a modern, open aesthetic.",
    "colors": [
      "Two-tone: Yellow Gold and White Gold. The diamond exhibits colorless brilliance."
    ],
    "occasions": [
      "Engagement",
      "Anniversary",
      "Milestone Celebrations",
      "Daily Wear"
    ],
    "description": "This ring seamlessly blends modern design with the timeless appeal of diamonds. The unique setting and split shank make it a standout piece, perfect for the modern bride-to-be. The high-quality diamond guarantees exceptional sparkle and lasting beauty. Crafted with meticulous detail and Hyderabadi Polish ensures durability and a rich luster that will be cherished for generations.",
    "tags": [
      "Engagement Ring",
      "Diamond Ring",
      "Gold Ring",
      "Modern Ring",
      "Split Shank",
      "Hyderabadi Jewelry",
      "Contemporary Jewelry",
      "Bridal Jewelry",
      "Promise Ring",
      "Cocktail Ring"
    ],
    "original_id": "diamond_jewellery_IMG-20241219-WA0020_0800",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-022/image.jpg",
    "thumbnailPath": "/products/rings/rings-022/thumbnail.jpg"
  },
  {
    "id": "rings-023",
    "title": "Navaratna Vaibhavam Ring: The Auspicious Gemstone Bloom",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "Authentic Navaratna Gemstones (Ruby",
      "Pearl",
      "Coral",
      "Emerald",
      "Yellow Sapphire",
      "Diamond",
      "Blue Sapphire",
      "Hessonite",
      "Cat's Eye)",
      "Brilliant Cut Diamonds. Features signature Hyderabadi setting."
    ],
    "features": "This exquisite ring features the sacred Navaratna arrangement, with a central, large Polki diamond embraced by the nine auspicious gemstones. Each gemstone is carefully selected for its clarity, color, and astrological significance, set in a halo of sparkling diamonds to amplify its radiance. The gold setting is meticulously crafted to showcase the natural beauty of the gemstones and to enhance their positive energies.",
    "colors": [
      "Multicolor – Radiant array of gemstone hues (red",
      "white",
      "orange",
      "green",
      "yellow",
      "colorless",
      "blue",
      "brown",
      "grey) complemented by the warm yellow of 22K gold and the brilliant sparkle of white diamonds."
    ],
    "occasions": [
      "Ideal for weddings (Vivaaham)",
      "housewarmings (Gruhapravesam)",
      "auspicious ceremonies",
      "or to elevate your everyday attire with a touch of timeless elegance and divine protection. Also perfect for gifting on special occasions",
      "Seemantham or Baby showers."
    ],
    "description": "This Navaratna ring combines the rich traditions of South Indian jewelry with the modern sensibilities of fine craftsmanship. Each gemstone is believed to bring specific benefits, offering the wearer protection, prosperity, and overall well-being. The Hyderabadi setting ensures lasting beauty and durability, making this ring a treasured heirloom for generations to come.",
    "tags": [
      "Navaratna",
      "Ring",
      "Anguleeyakam",
      "Gemstone",
      "Gold",
      "Diamond",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Hyderabad",
      "Traditional",
      "Auspicious",
      "Wedding",
      "Vivahaalu",
      "Hyderabadi Polish",
      "Polki Diamond",
      "Indian Jewelry",
      "Seemantham",
      "Baby Shower"
    ],
    "original_id": "diamond_jewellery_PHOTO-2023-04-20-13-18-49 2_0825",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-023/image.jpg",
    "thumbnailPath": "/products/rings/rings-023/thumbnail.jpg"
  },
  {
    "id": "rings-024",
    "title": "Navaratna Vaagai Ungarala: The Auspicious Gemstone Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "Natural Navaratna Gemstones (Ruby",
      "Pearl",
      "Coral",
      "Emerald",
      "Yellow Sapphire",
      "Diamond",
      "Blue Sapphire",
      "Hessonite",
      "Cat's Eye)",
      "Cubic Zirconia"
    ],
    "features": "A traditional Navaratna ring featuring nine auspicious gemstones arranged in a floral pattern, surrounded by glittering cubic zirconia. Handcrafted with fine milgrain detailing around each gemstone setting. This 'vaagai' (design) represents prosperity and good fortune.",
    "colors": [
      "Gold (yellow)",
      "Multi-colored Navaratna gemstones (red",
      "white",
      "orange",
      "green",
      "yellow",
      "blue",
      "brown",
      "gray)",
      "White (Cubic Zirconia)"
    ],
    "occasions": [
      "Ideal for auspicious occasions like weddings (Vaddanam)",
      "housewarmings",
      "and festivals like Ugadi and Sankranthi. Also",
      "perfect as a meaningful gift or a statement piece for daily wear."
    ],
    "description": "This Navaratna ring is meticulously handcrafted by skilled artisans, ensuring exceptional quality and detail. The nine gemstones are believed to bring balance, harmony, and good luck to the wearer. A true heirloom piece that embodies tradition and elegance. The inclusion of Cubic Zirconia enhances the sparkle and brilliance of the ring while keeping it accessible.",
    "tags": [
      "Navaratna",
      "Ungarala",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Gemstone Ring",
      "Auspicious Jewelry",
      "Traditional",
      "22K Gold",
      "Hyderabad Jewelry",
      "Indian Wedding",
      "Festive Jewelry",
      "Vaddanam",
      "Ugadi",
      "Sankranthi"
    ],
    "original_id": "diamond_jewellery_PHOTO-2023-05-16-12-22-52_0833",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-024/image.jpg",
    "thumbnailPath": "/products/rings/rings-024/thumbnail.jpg"
  },
  {
    "id": "rings-025",
    "title": "Diamond Vanki - Modern Nagas Design",
    "category": "rings",
    "original_type": "Armlet",
    "materials": [
      "18K Yellow Gold",
      "Brilliant Cut Diamonds (VS Clarity",
      "G-H Color)"
    ],
    "features": "Features a stylized floral motif at the center. The armlet uses an open, geometric lattice design, adorned with delicate diamond clusters that enhance its modern appeal while subtly hinting at traditional 'Mogappu' motifs. Features flexible joints for comfortable wear.",
    "colors": [
      "Yellow Gold and Sparkling White Diamonds"
    ],
    "occasions": [
      "Perfect for weddings",
      "engagements",
      "receptions",
      "and upscale social gatherings. A versatile piece that beautifully complements both traditional sarees and contemporary evening wear."
    ],
    "description": "This contemporary Vanki offers a fresh take on a classic design. The brilliance of the diamonds, combined with the sleek gold setting, makes it a standout piece. Its adjustable design ensures a comfortable fit. The timeless elegance ensures it will remain a cherished heirloom.",
    "tags": [
      "Vanki",
      "Armlet",
      "Diamond Jewelry",
      "South Indian Jewelry",
      "Wedding Jewelry",
      "Hyderabad Jewelry",
      "Contemporary Jewelry",
      "Nagas Design",
      "Traditional Jewelry",
      "Floral Design",
      "Bahuband",
      "Bajubandh"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-03 2_1001",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-025/image.jpg",
    "thumbnailPath": "/products/rings/rings-025/thumbnail.jpg"
  },
  {
    "id": "rings-026",
    "title": "Diamond Floral Vanki - A Timeless Elegance",
    "category": "rings",
    "original_type": "Armlet",
    "materials": [
      "18K Yellow Gold base",
      "adorned with meticulously set",
      "brilliant-cut White Diamonds. Features Hyderabadi Polish for a lasting luster."
    ],
    "features": "This contemporary Vanki draws inspiration from floral motifs, exhibiting delicate diamond petals in a cascade design. The open-ended design offers adjustable comfort. The intricate setting enhances the brilliance of each diamond, creating a mesmerizing sparkle.",
    "colors": [
      "Predominantly White (diamonds) with a warm Yellow Gold base."
    ],
    "occasions": [
      "Perfect for weddings",
      "engagements",
      "receptions",
      "or any grand celebration. Its modern design also makes it suitable for upscale parties and social events."
    ],
    "description": "This Diamond Floral Vanki is a statement piece that blends modern design with timeless elegance. The exceptional quality of the diamonds and meticulous craftsmanship ensure enduring beauty and value. It’s a perfect gift for the discerning woman who appreciates unique and sophisticated jewelry.",
    "tags": [
      "Vanki",
      "Armlet",
      "Kankanam",
      "Diamond Jewelry",
      "Yellow Gold",
      "Modern Jewelry",
      "Wedding Jewelry",
      "Hyderabadi Jewelry",
      "Engagement Jewelry",
      "Floral Design",
      "Jewelry"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-43 2_1047",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-026/image.jpg",
    "thumbnailPath": "/products/rings/rings-026/thumbnail.jpg"
  },
  {
    "id": "rings-027",
    "title": "Dazzling Diamond Vanki/Armlet Upper Arm Band Design",
    "category": "rings",
    "original_type": "Armlet",
    "materials": [
      "18K Yellow Gold base",
      "meticulously set with high-quality",
      "brilliant-cut diamonds. Diamonds are of VS clarity and G color",
      "ensuring maximum sparkle. Hyderabadi Polish for a lasting luster."
    ],
    "features": "A contemporary take on the traditional Vanki design, featuring an elegant, openwork leaf and vine motif. Each diamond is carefully pave-set, creating a continuous shimmer. The design allows for comfortable wear on the upper arm, perfectly balanced and secure. Upper arm band is of high quality.",
    "colors": [
      "Predominantly golden with sparkling white diamonds"
    ],
    "occasions": [
      "Perfect for weddings",
      "receptions",
      "cocktail parties",
      "and special occasions where you want to make a sophisticated statement. This piece elevates any ethnic or Western outfit."
    ],
    "description": "A fusion of traditional South Indian artistry with modern design sensibilities. The high-quality diamonds and expert craftsmanship ensure a timeless piece that will be treasured for generations. Vanki is considered auspicious and a symbol of strength and beauty. This piece is comfortable, secure, and dazzling to behold.",
    "tags": [
      "Vanki",
      "Armlet",
      "Diamond Jewelry",
      "బాహుబందీ",
      "South Indian Jewelry",
      "Wedding Jewelry",
      "Fine Jewelry",
      "Pave Setting",
      "Hyderabad Jewelry",
      "Contemporary Design",
      "Ethnic Jewelry",
      "Indian Jewelry",
      "Women's Jewelry",
      "occasion jewelry"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-44 3_1050",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-027/image.jpg",
    "thumbnailPath": "/products/rings/rings-027/thumbnail.jpg"
  },
  {
    "id": "rings-028",
    "title": "Swarna Lakshmi Vaddanam: Exquisite 22K Gold Waist Belt",
    "category": "rings",
    "original_type": "Waist Belt",
    "materials": [
      "22K Yellow Gold",
      "expertly crafted with a signature Hyderabadi Polish. The high purity gold ensures enduring luster and value. Hand-finished detailing throughout."
    ],
    "features": "A classic South Indian Vaddanam featuring intricate filigree work in a floral and heart motif. The central piece highlights Goddess Lakshmi, symbolizing prosperity and abundance. Dangles along the bottom edge add a touch of movement and elegance. Traditional detailing with a modern, lightweight design for comfortable wear.",
    "colors": [
      "Lustrous Yellow Gold"
    ],
    "occasions": [
      "Ideal for traditional South Indian weddings (Vivaha)",
      "Seemantham ceremonies",
      "Half-Saree functions (Langa Voni Utsavam)",
      "and other auspicious occasions. Also suitable as a statement piece for formal events and cultural celebrations."
    ],
    "description": "This Vaddanam is a timeless investment piece. The 22K gold ensures lasting value, while the traditional Lakshmi motif holds significant cultural and spiritual importance. The intricate filigree work and Hyderabadi polish exemplify exceptional craftsmanship. It is a symbol of heritage, tradition, and enduring beauty, perfect for passing down through generations.",
    "tags": [
      "Vaddanam",
      "Kamarbandh",
      "Waist Belt",
      "Gold Jewelry",
      "22K Gold",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Hyderabadi Jewelry",
      "Lakshmi",
      "Temple Jewelry",
      "Wedding Jewelry",
      "Vivaha",
      "Seemantham",
      "Langa Voni",
      "Filigree",
      "Swarna",
      "Kasulaperu",
      "Bridal Jewelry",
      "Indian Jewelry",
      "Jewellery"
    ],
    "original_id": "diamond_jewellery_WhatsApp Image 2024-09-04 at 22.01.06_7f769ec1_1426",
    "collection": "diamond",
    "imagePath": "/products/rings/rings-028/image.jpg",
    "thumbnailPath": "/products/rings/rings-028/thumbnail.jpg"
  },
  {
    "id": "rings-031",
    "title": "Pushpa Vanam Ring - A Floral Symphony of Gemstones",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold with Hyderabadi Polish. Features vibrant orange Sapphires with heart cut at the center and sparkling Cubic Zirconia (CZ) accents throughout. The gold boasts a warm",
      "rich luster indicative of fine South Indian craftsmanship."
    ],
    "features": "This striking ring showcases a floral motif, expertly handcrafted with intricate detailing. The heart cut sapphires form the central flower, complemented by a halo of sparkling CZs. The openwork design creates depth and allows light to dance through the stones, enhancing their brilliance. The overall design blends traditional floral elements with a modern, bold aesthetic.",
    "colors": [
      "Radiant gold is accented by the fiery orange of the Sapphires and the dazzling white of the CZs",
      "creating a warm and captivating color palette."
    ],
    "occasions": [
      "Perfect for special occasions",
      "weddings (Vivaha)",
      "festivals (like Diwali or Sankranti)",
      "or any event where you want to make a statement. Equally suitable for adding a touch of glamour to your evening wear."
    ],
    "description": "This Pushpa Vanam Ring is a testament to exquisite craftsmanship and timeless design. The vibrant Sapphires and sparkling CZs are carefully selected for their quality and brilliance. The Hyderabadi Polish enhances the gold's natural luster, ensuring a lasting shine. Its unique floral design makes it a truly special piece that will be treasured for years to come.",
    "tags": [
      "Ring",
      "Floral Ring",
      "Statement Ring",
      "Orange Sapphire",
      "CZ",
      "Cubic Zirconia",
      "22K Gold",
      "Hyderabadi Polish",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Wedding Jewelry",
      "Engagement Ring",
      "Fine Jewelry",
      "Pushpa Vanam",
      "Vivaha",
      "Diwali",
      "Sankranti"
    ],
    "original_id": "ear_rings_DMCR8-1663_2568",
    "collection": "ear",
    "imagePath": "/products/rings/rings-031/image.jpg",
    "thumbnailPath": "/products/rings/rings-031/thumbnail.jpg"
  },
  {
    "id": "rings-032",
    "title": "Rose Quartz 'Aarush' Ring - A Touch of Modern Elegance",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "18K Rose Gold",
      "Rose Quartz (Cabochon cut)",
      "Brilliant Cut Diamonds (VS Clarity",
      "G Color). Features Hyderabadi polish for lasting shine."
    ],
    "features": "This unique ring showcases a stunning cabochon-cut rose quartz at its center, encircled by a delicate halo of brilliant-cut diamonds. The open-work design of the gold band adds a modern, airy feel, while still maintaining a classic circular silhouette. The Hyderabadi polish enhances the gold's warmth and luster.",
    "colors": [
      "Rose Gold",
      "Soft Pink (Rose Quartz)",
      "Sparkling White (Diamonds)"
    ],
    "occasions": [
      "Perfect for cocktail parties",
      "evening events",
      "or as a stylish statement piece for everyday wear. Also suitable for modern engagements or anniversaries."
    ],
    "description": "This ring is a captivating fusion of modern design and gemstone charm. The rose quartz is believed to bring love and positive energy, making it a thoughtful gift. The Hyderabadi polish ensures lasting brilliance, while the exquisite diamond detailing elevates the piece to a luxurious level. A truly unique design you won't find anywhere else.",
    "tags": [
      "Ring",
      "Rose Gold",
      "Rose Quartz",
      "Diamond",
      "Cocktail Ring",
      "Modern Jewelry",
      "Hyderabadi Polish",
      "Gemstone Jewelry",
      "Statement Ring"
    ],
    "original_id": "ear_rings_DMER8-1457_2571",
    "collection": "ear",
    "imagePath": "/products/rings/rings-032/image.jpg",
    "thumbnailPath": "/products/rings/rings-032/thumbnail.jpg"
  },
  {
    "id": "rings-033",
    "title": "Vaishnavi Polki Kundan Cocktail Ring - A Blossoming Splendor",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold",
      "Uncut Polki Diamonds (approx. 3 carats)",
      "Emeralds (approx. 1.5 carats)",
      "Hyderabadi Polish",
      "Enamel work."
    ],
    "features": "This stunning ring features a flower-inspired design with a central Polki diamond surrounded by alternating emeralds and Polki diamonds. The detailed Kundan setting showcases the natural beauty of the uncut diamonds. The band has delicate engraving. Intricate enamel work can be seen in the back of the ring enhancing its beauty.",
    "colors": [
      "Gold",
      "Emerald Green",
      "White (Polki Diamonds)."
    ],
    "occasions": [
      "Perfect for weddings (vivaha)",
      "engagements (nischitartham)",
      "festive occasions like Diwali",
      "and upscale cocktail parties. A statement piece to elevate any outfit."
    ],
    "description": "This Polki Kundan cocktail ring is a testament to timeless elegance and superior craftsmanship. The combination of uncut Polki diamonds and vibrant green emeralds creates a captivating contrast. The Hyderabadi polish enhances the gold's luster, making it a heirloom-worthy piece that will be cherished for generations. A fusion of traditional and modern design for the contemporary woman.",
    "tags": [
      "Polki",
      "Kundan",
      "Ring",
      "Anguthi",
      "Diamond",
      "Emerald",
      "Hyderabadi Jewelry",
      "Indian Jewelry",
      "Wedding Jewelry",
      "Cocktail Ring",
      "Statement Ring",
      "Traditional Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Vivaha",
      "Nischitartham"
    ],
    "original_id": "ear_rings_DPCR8-1340_2578",
    "collection": "ear",
    "imagePath": "/products/rings/rings-033/image.jpg",
    "thumbnailPath": "/products/rings/rings-033/thumbnail.jpg"
  },
  {
    "id": "rings-034",
    "title": "Statement Polki Diamond Ring with Smoky Quartz Accents",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "Base Metal with Rhodium Finish",
      "Smoky Quartz",
      "Polki Diamonds (Uncut Diamonds)",
      "Gold accents in the polki setting."
    ],
    "features": "A modern ring featuring a rectangular design. It showcases three rectangular pieces of Smoky Quartz framed by sparkling melee diamonds. In the center there's a floral arrangement of Polki diamonds set in gold. The contrasting color of the smoky quartz and the brilliance of the polki diamonds create a stunning focal point.",
    "colors": [
      "Smoky Gray",
      "Gold",
      "White (Diamonds)",
      "Silver (Rhodium finish)."
    ],
    "occasions": [
      "Ideal for modern social gatherings",
      "parties",
      "receptions",
      "and making a bold statement at contemporary events. Suitable as a cocktail ring."
    ],
    "description": "This ring is a fusion of modern design and traditional Polki diamond setting. The smoky quartz provides a unique contrast to the brilliance of the diamonds making it an eye catching piece. A perfect statement piece for those who appreciate unique designs and quality craftsmanship.",
    "tags": [
      "Ring",
      "Statement Ring",
      "Polki Diamonds",
      "Smoky Quartz",
      "Modern Jewelry",
      "Contemporary Design",
      "Party Wear",
      "Cocktail Ring",
      "ఉంగరం",
      "వజ్రం",
      "ఉంగరం"
    ],
    "original_id": "ear_rings_DPCR8-1341_2579",
    "collection": "ear",
    "imagePath": "/products/rings/rings-034/image.jpg",
    "thumbnailPath": "/products/rings/rings-034/thumbnail.jpg"
  },
  {
    "id": "rings-035",
    "title": "Nilakamalam Kundan Ring - Neelam Sobha",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold setting with Hyderabadi Polish. Features a central uncut Polki Diamond and blue enamel accents. Embellished with surrounding cubic zirconia for enhanced sparkle."
    ],
    "features": "This captivating ring draws inspiration from the Neelakamalam (Blue Lotus), showcasing a flower-like design. The intricate Kundan setting showcases a central polki diamond, surrounded by blue enamel segments and cz accents . The arrangement creates a regal and opulent look, perfect for adding a touch of traditional elegance to any ensemble.",
    "colors": [
      "Gold",
      "White (Diamond)",
      "Blue (Enamel)"
    ],
    "occasions": [
      "Suitable for weddings",
      "engagements",
      "festivals (like Sankranthi",
      "Ugadi)",
      "traditional celebrations",
      "and parties. Can also be worn as a statement piece for special occasions."
    ],
    "description": "This ring is a stunning example of Hyderabadi craftsmanship, blending traditional Kundan techniques with a modern aesthetic. The piece is not only visually striking, but also carries cultural significance, making it a cherished heirloom. The use of real Polki diamonds further enhances its value and prestige. Its unique design and high-quality materials ensure lasting beauty and durability.",
    "tags": [
      "Kundan Ring",
      "Polki Diamond",
      "Hyderabadi Jewelry",
      "Neelakamalam",
      "Blue Lotus",
      "Traditional Indian Jewelry",
      "Engagement Ring",
      "Wedding Ring",
      "Anguleeyakam",
      "Telugu Jewelry",
      "South Indian Jewelry",
      "Ethnic Ring",
      "Floral Design",
      "Handcrafted",
      "Fine Jewelry"
    ],
    "original_id": "ear_rings_DPCR8-1343_2580",
    "collection": "ear",
    "imagePath": "/products/rings/rings-035/image.jpg",
    "thumbnailPath": "/products/rings/rings-035/thumbnail.jpg"
  },
  {
    "id": "rings-036",
    "title": "Gulabi Kundan Rang – The Rosy Radiance Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold with Hyderabadi Polish",
      "Rose Quartz",
      "Polki Diamonds (Uncut Diamonds). Gold purity verified; Polki diamonds are ethically sourced with VS clarity"
    ],
    "features": "This exquisite ring features a traditional Kundan setting with a captivating rosette arrangement of Polki diamonds surrounding a larger central diamond. The outer border is delicately inlaid with cabochon-cut rose quartz, creating a stunning contrast and adding a touch of contemporary flair. The back of the ring showcases intricate gold detailing, reflective of traditional Hyderabadi craftsmanship.",
    "colors": [
      "Primarily a combination of warm yellow gold",
      "translucent rose pink from the rose quartz",
      "and sparkling white from the Polki diamonds. The Hyderabadi polish enhances the gold's luster."
    ],
    "occasions": [
      "Perfect for traditional occasions like weddings (Vivaham)",
      "engagements (Nischitartham)",
      "festivals (Panduga)",
      "or simply to add a touch of regal elegance to your everyday attire. It also blends beautifully with modern outfits for cocktail parties and special events."
    ],
    "description": "This ring is a stunning fusion of traditional artistry and contemporary design. The use of genuine Polki diamonds and natural rose quartz lends it an unparalleled elegance. The Hyderabadi polish ensures lasting brilliance and showcases the superior craftsmanship of our artisans. It's a statement piece that speaks volumes about your refined taste and appreciation for heritage.",
    "tags": [
      "Kundan",
      "Ring",
      "Anguleeyakam",
      "Polki",
      "Diamonds",
      "Rose Quartz",
      "Hyderabadi",
      "Gold",
      "Indian Jewelry",
      "Traditional",
      "South Indian Jewelry",
      "Wedding Jewelry",
      "Festive Jewelry",
      "Gulabi",
      "Engagement Ring",
      "Ethnic"
    ],
    "original_id": "ear_rings_DPCR8-1394_2582",
    "collection": "ear",
    "imagePath": "/products/rings/rings-036/image.jpg",
    "thumbnailPath": "/products/rings/rings-036/thumbnail.jpg"
  },
  {
    "id": "rings-037",
    "title": "Vaibhavam Flower Brooch - A Timeless Heritage Jewel",
    "category": "rings",
    "original_type": "Brooch",
    "materials": [
      "22K Gold (916 Hallmark)",
      "Natural Ruby Cabochon (Central Stone)",
      "Polki Diamonds (Uncut Diamonds) with VS clarity",
      "Hyderabadi Polish for a lasting luster."
    ],
    "features": "Classic flower motif, meticulously handcrafted with traditional South Indian filigree work ('Jali' work) surrounding the central ruby. Features a raised setting to highlight the cabochon ruby and antique style Polki diamonds. The overall design incorporates elements reminiscent of temple jewelry (devasthanam alankarana) in a wearable modern form. The Polki diamonds are strategically placed to maximize brilliance and create a unique antique charm.",
    "colors": [
      "Gold (warm yellow)",
      "Ruby (deep pinkish-red)",
      "Polki Diamonds (off-white/grey tones)."
    ],
    "occasions": [
      "Perfect for adding a touch of elegance to any outfit",
      "especially for traditional South Indian events such as weddings",
      "engagements",
      "festivals (like Sankranti or Ugadi)",
      "or family functions. Also suitable for formal events where a touch of cultural heritage is desired."
    ],
    "description": "This exquisite brooch is a celebration of South Indian craftsmanship, featuring high-quality materials and intricate design details. The use of Polki diamonds lends an air of timeless elegance, while the ruby adds a touch of vibrancy and prosperity. It's a versatile piece that can be worn on a saree, blouse, or even a coat, making it a valuable addition to any jewelry collection. Possessing this brooch means owning a small piece of Telugu cultural heritage (Telugu samskruti).",
    "tags": [
      "Brooch",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Temple Jewelry",
      "Polki Diamonds",
      "Ruby",
      "22K Gold",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Antique Finish",
      "Filigree",
      "Jali work",
      "Weddings",
      "Festivals",
      "Heritage Jewelry",
      "Vaddanam"
    ],
    "original_id": "ear_rings_DPER8-1613_2628",
    "collection": "ear",
    "imagePath": "/products/rings/rings-037/image.jpg",
    "thumbnailPath": "/products/rings/rings-037/thumbnail.jpg"
  },
  {
    "id": "rings-038",
    "title": "Floral Polki Diamond Ring",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22k Gold with Uncut Polki Diamonds and Round Diamonds. Hyderabadi Polish for a rich",
      "lasting luster."
    ],
    "features": "A striking floral design centered around a larger, round diamond, surrounded by delicately arranged Polki diamonds. Intricate filigree work enhances the sparkle and adds a touch of vintage charm.",
    "colors": [
      "Gold with sparkling white Polki diamonds and round diamonds."
    ],
    "occasions": [
      "Perfect for special occasions",
      "weddings",
      "engagements",
      "or any event where you want to make a statement. Also suitable for adding a touch of elegance to your everyday ensemble."
    ],
    "description": "This ring is a unique fusion of traditional Polki artistry and modern design. The use of high-quality materials and Hyderabadi craftsmanship ensures its beauty and longevity. A timeless piece to be cherished for generations.",
    "tags": [
      "Ring",
      "Diamond Ring",
      "Polki",
      "Uncut Diamonds",
      "Gold Ring",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Hyderabadi Jewelry",
      "Floral Ring"
    ],
    "original_id": "ear_rings_DPER8-1614_2629",
    "collection": "ear",
    "imagePath": "/products/rings/rings-038/image.jpg",
    "thumbnailPath": "/products/rings/rings-038/thumbnail.jpg"
  },
  {
    "id": "rings-039",
    "title": "Rajputana Polki Kundan Ring - Heritage Bloom",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold with Hyderabadi Polish",
      "Uncut Polki Diamond center stone",
      "High-Quality Rubies",
      "and Diamond Simulants (CZ)"
    ],
    "features": "Intricate floral design with a central Polki diamond surrounded by concentric layers of diamond simulants and vibrant rubies. Features an open setting, allowing light to enhance the brilliance of the gemstones. The design showcases the traditional Kundan setting, where the stones are embedded with gold foil for a secure and aesthetically pleasing finish.",
    "colors": [
      "Gold (yellow)",
      "Diamond (white/clear)",
      "Ruby (red)"
    ],
    "occasions": [
      "Perfect for weddings (Vaduవు)",
      "engagements (Nischitartham)",
      "festivals (Ugadi",
      "Sankranti)",
      "and other special occasions where a touch of traditional elegance is desired. Also suitable for modern cocktail parties and sophisticated gatherings."
    ],
    "description": "This ring beautifully marries the timeless appeal of Kundan jewelry with a contemporary aesthetic. The Polki diamond adds a unique, natural sparkle, while the ruby accents bring a touch of regal color. Crafted with meticulous attention to detail and using only the finest materials, this ring is a true investment piece that will be cherished for generations. The Hyderabadi polish ensures a lasting luster and antique charm.",
    "tags": [
      "Kundan Ring",
      "Polki Diamond",
      "Ruby Ring",
      "South Indian Jewelry",
      "Traditional Ring",
      "Wedding Ring",
      "Engagement Ring",
      "Hyderabadi Jewelry",
      "భారతీయ ఆభరణాలు",
      "దక్షిణ భారత ఆభరణాలు",
      "Kundan ఆభరణాలు",
      "wedding",
      "engagement",
      "bridal"
    ],
    "original_id": "ear_rings_DPER8-198_2645",
    "collection": "ear",
    "imagePath": "/products/rings/rings-039/image.jpg",
    "thumbnailPath": "/products/rings/rings-039/thumbnail.jpg"
  },
  {
    "id": "rings-040",
    "title": "Lakshmi Kamal Ring - Ruby & Diamond Floral Design",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Yellow Gold",
      "Natural Ruby (Oval Cut",
      "approximately 3 carats",
      "SI clarity)",
      "Polki Diamonds (Uncut",
      "Rose Cut)"
    ],
    "features": "Features a classic floral motif with a centrally set oval-cut ruby. Surrounded by delicately placed Polki diamonds adding brilliance. The gold lattice design offers a light and comfortable wear, reflecting Hyderabadi jewelry craftsmanship.",
    "colors": [
      "Rich Ruby Red",
      "Luminous Gold",
      "Sparkling White (Diamonds)"
    ],
    "occasions": [
      "Perfect for weddings",
      "engagements",
      "anniversaries",
      "or as a statement piece for special occasions. Also suitable as a traditional gift for celebrations such as Seemantham or festivals."
    ],
    "description": "This ring is a blend of traditional Indian aesthetics and modern wearability. The vibrant ruby symbolizes love and passion, making it a timeless and meaningful piece. The detailed gold work showcases the skill of our artisans, ensuring a high-quality, durable investment. The unique Polki diamond setting is a reflection of classic Hyderabadi jewelry.",
    "tags": [
      "Ring",
      "Vanki Anguleeyakam",
      "Ruby",
      "Diamond",
      "Polki",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry",
      "Engagement Ring",
      "Festive Jewelry",
      "Traditional",
      "Floral Design",
      "Gold"
    ],
    "original_id": "ear_rings_DPER8-712_2649",
    "collection": "ear",
    "imagePath": "/products/rings/rings-040/image.jpg",
    "thumbnailPath": "/products/rings/rings-040/thumbnail.jpg"
  },
  {
    "id": "rings-041",
    "title": "Exquisite Polki & Ruby Ring - A Timeless Treasure",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Yellow Gold setting",
      "studded with uncut Polki Diamonds (natural",
      "layered diamonds) and vibrant Ruby accents. Features delicate fine diamond accents",
      "Hyderabadi polish for a lasting lustre."
    ],
    "features": "A captivating symmetrical design featuring a central row of Ruby, surrounded by a dazzling array of Polki diamonds. The open setting allows light to permeate the Polki stones, enhancing their natural brilliance. Finely crafted prongs ensure secure gemstone placement. The ring boasts a low profile, making it comfortable for everyday wear or special occasions.",
    "colors": [
      "Warm Yellow Gold",
      "striking Ruby Red",
      "and shimmering",
      "milky White Polki diamonds with subtle flashes of light. A classic and regal color combination."
    ],
    "occasions": [
      "Ideal for weddings (pellilu)",
      "engagements",
      "anniversaries",
      "festive celebrations like Diwali or Sankranthi",
      "or any special occasion where you want to make a statement. Also perfectly suited for adding a touch of understated luxury to evening wear."
    ],
    "description": "This ring is a unique blend of traditional charm and contemporary elegance. The use of Polki diamonds, a hallmark of Indian jewelry, gives it a distinctive and regal appeal. The Hyderabadi polish enhances the gold's natural warmth, ensuring lasting beauty. Crafted with meticulous attention to detail, this ring is a true investment piece that will be treasured for generations.",
    "tags": [
      "Polki Ring",
      "Diamond Ring",
      "Ruby Ring",
      "Indian Jewelry",
      "Traditional Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Ring",
      "Engagement Ring",
      "Ethnic Jewelry",
      "Statement Ring",
      "Pellilu",
      "Sankranthi",
      "Fine Jewelry",
      "Handcrafted Jewelry",
      "Uncut Diamond",
      "Telugu Jewelry",
      "Dimaond Pittalu"
    ],
    "original_id": "ear_rings_DPER8-962_2655",
    "collection": "ear",
    "imagePath": "/products/rings/rings-041/image.jpg",
    "thumbnailPath": "/products/rings/rings-041/thumbnail.jpg"
  },
  {
    "id": "rings-042",
    "title": "Muthyam & Ruby Vanki Ring - A Timeless Telugu Tradition",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (approximate)",
      "Natural Rubies (Central cabochon and surrounding stones)",
      "Polki Diamonds (Uncut Diamonds)",
      "Natural Pearls (Muthyam). Features a traditional Hyderabadi Polish for a rich",
      "antique luster."
    ],
    "features": "This exquisite vanki ring showcases a classic floral motif design. The central ruby is surrounded by a halo of polki diamonds, followed by a ring of vibrant rubies and lustrous pearl stones. The open setting maximizes the brilliance of each stone. The floral arrangement echoes traditional Telugu jewelry design principles.",
    "colors": [
      "Predominantly gold",
      "with vibrant red rubies",
      "sparkling white polki diamonds",
      "and iridescent white pearls. The warmth of the gold complements the cool tones of the pearls and the fiery rubies creating a rich and vibrant palette."
    ],
    "occasions": [
      "Perfect for engagements",
      "weddings (especially Telugu weddings)",
      "festivals (like Sankranthi",
      "Diwali",
      "Dasara)",
      "and other special occasions. This ring is a statement piece suitable for both traditional and contemporary attire."
    ],
    "description": "This vanki ring is a unique blend of traditional Telugu craftsmanship and timeless elegance. The use of natural rubies, polki diamonds, and pearls signifies prosperity and good fortune. The Hyderabadi polish gives the ring a vintage charm, making it a valuable heirloom piece to be treasured for generations. The piece showcases the rich jewelry heritage of Andhra Pradesh and Telangana region.",
    "tags": [
      "Ring",
      "Vanki Ring",
      "Ungarala Batti",
      "Telugu Jewelry",
      "South Indian Jewelry",
      "Ruby Ring",
      "Pearl Ring",
      "Polki Diamond",
      "Uncut Diamond",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Wedding Jewelry",
      "Engagement Ring",
      "Muthyam",
      "Manikyam",
      "Gold Ring",
      "Floral Design",
      "Antique Finish"
    ],
    "original_id": "ear_rings_DPER8-965_2657",
    "collection": "ear",
    "imagePath": "/products/rings/rings-042/image.jpg",
    "thumbnailPath": "/products/rings/rings-042/thumbnail.jpg"
  },
  {
    "id": "rings-043",
    "title": "The 'Padmaragam' Bloom Ring: Emerald & Polki Diamond Statement",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (916 Gold Purity) with Hyderabadi Polish",
      "featuring a striking Oval-Cut Emerald (estimated 4-5 carats) and surrounded by Uncut Polki Diamonds (approx. 1.5 carats total weight)."
    ],
    "features": "This exquisite ring features a floral-inspired design, reminiscent of traditional 'Addigai' necklace motifs. The central Oval Emerald is bezel-set, emphasizing its rich color. The surrounding Polki diamonds are set in a 'kundan' style, showcasing the natural beauty of the uncut stones. The band is intricately detailed, adding to the overall regal appearance.",
    "colors": [
      "Deep Emerald Green",
      "Warm Gold",
      "and the distinctive brilliance of Polki Diamonds."
    ],
    "occasions": [
      "Perfect for special occasions like weddings (Vivaah",
      "Kalyanam)",
      "engagement ceremonies",
      "and grand celebrations. An ideal statement piece to complement traditional silk sarees or modern evening wear."
    ],
    "description": "This ring is a testament to Hyderabad's rich jewelry heritage. The combination of a vibrant Emerald and glittering Polki diamonds offers a unique blend of tradition and luxury. Each Polki diamond is unique, ensuring that your ring is truly one-of-a-kind. The 22K gold ensures lasting value and durability.",
    "tags": [
      "Ring",
      "Gold Ring",
      "Emerald",
      "Padmaragam",
      "Polki Diamond",
      "Kundan",
      "Hyderabad Jewelry",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Indian Jewelry",
      "Statement Ring",
      "Floral Ring",
      "Engagement Ring",
      "Wedding Jewelry",
      "Ethnic Jewelry",
      "22K Gold",
      "916 Gold",
      "Addigai Motif"
    ],
    "original_id": "ear_rings_DPLR8-1662_2665",
    "collection": "ear",
    "imagePath": "/products/rings/rings-043/image.jpg",
    "thumbnailPath": "/products/rings/rings-043/thumbnail.jpg"
  },
  {
    "id": "rings-044",
    "title": "Diamond Cluster Ring - Sparkling Floral Brilliance",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "18K White Gold",
      "Round Brilliant Cut Diamonds (VS Clarity",
      "G Color)",
      "Gross Weight: 2.980 grams",
      "Net Weight: 2.862 grams"
    ],
    "features": "Classic cluster setting with a floral motif. The arrangement of diamonds creates the illusion of a larger, more impactful single stone. Features prong setting. Polished to a mirror finish for optimal brilliance.",
    "colors": [
      "White gold and colorless diamonds",
      "creating a timeless and elegant look."
    ],
    "occasions": [
      "Perfect for everyday wear",
      "engagements",
      "anniversaries",
      "cocktail parties",
      "and special celebrations. Can be worn with both traditional and modern attire."
    ],
    "description": "This diamond cluster ring offers incredible sparkle and brilliance at an accessible price point. The timeless floral design adds a touch of elegance, making it a versatile piece for any occasion. The quality craftsmanship ensures durability and lasting beauty.",
    "tags": [
      "Diamond Ring",
      "Cluster Ring",
      "Engagement Ring",
      "Floral Ring",
      "White Gold Ring",
      "Fine Jewelry",
      "VS Clarity Diamonds",
      "Round Cut Diamonds",
      "Gift for Her",
      "Anniversary Gift",
      "Wedding Ring"
    ],
    "original_id": "jewellery_IMG-20241219-WA0009_1588",
    "collection": "jewellery",
    "imagePath": "/products/rings/rings-044/image.jpg",
    "thumbnailPath": "/products/rings/rings-044/thumbnail.jpg"
  },
  {
    "id": "rings-045",
    "title": "Solitaire Band Ring with Accents",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "Platinum band",
      "Round Brilliant Cut Diamond",
      "Enhanced Colour Accent Stones"
    ],
    "features": "Modern band design with a central solitaire setting. The diamond is set securely with a low-profile bezel-like setting, giving a sleek and contemporary feel. The band features straight, clean lines with accent stones along side the diamond",
    "colors": [
      "Platinum (Silver)",
      "White (Diamond)",
      "Green/Teal (Accent Stone)"
    ],
    "occasions": [
      "Engagement",
      "Anniversary",
      "Daily wear",
      "Special occasion",
      "Party Wear"
    ],
    "description": "A modern twist on a classic solitaire ring. The platinum band offers durability and timeless elegance, while the accent stones add a pop of unique colour. The secure setting ensures the diamond remains protected. This ring is a symbol of lasting love and modern sophistication.",
    "tags": [
      "Ring",
      "Platinum",
      "Diamond",
      "Solitaire",
      "Engagement Ring",
      "Modern Jewelry",
      "Anniversary",
      "Teal",
      "Green"
    ],
    "original_id": "jewellery_IMG-20241219-WA0017_1596",
    "collection": "jewellery",
    "imagePath": "/products/rings/rings-045/image.jpg",
    "thumbnailPath": "/products/rings/rings-045/thumbnail.jpg"
  },
  {
    "id": "rings-046",
    "title": "Eternity Band - Platinum 'Shubha Sanketham'",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "Platinum",
      "meticulously crafted with a high polish finish. Features a central cluster of brilliant-cut diamonds",
      "totaling approximately 0.5 carats. Diamonds are graded for VS clarity and G color for maximum brilliance."
    ],
    "features": "This modern band design, symbolizes the promise of 'Shubha Sanketham' (auspicious beginnings), features a flush setting of diamonds within a platinum bezel. The sleek, minimalist style provides a contemporary contrast, making it versatile for everyday wear. The band itself is crafted with a strong, clean design for lasting durability.",
    "colors": [
      "Platinum silver and brilliant white diamonds",
      "creating a timeless and sophisticated color palette."
    ],
    "occasions": [
      "Perfect as a wedding band",
      "engagement ring",
      "anniversary gift",
      "or a token of everlasting commitment. Suitable for modern celebrations and everyday wear."
    ],
    "description": "Crafted from premium platinum and meticulously set with high-quality diamonds, this ring embodies modern elegance. Its sleek design ensures comfort and longevity, making it a cherished symbol of love and commitment. The 'Shubha Sanketham' symbolism adds a layer of auspiciousness and meaningfulness, making it a unique treasure.",
    "tags": [
      "Platinum Ring",
      "Diamond Band",
      "Eternity Ring",
      "Shubha Sanketham",
      "Wedding Band",
      "Engagement Ring",
      "Hyderabad Jewelry",
      "Modern Jewelry",
      "Diamond Jewelry",
      "Commitment Ring",
      "anniversary"
    ],
    "original_id": "jewellery_IMG-20241219-WA0018_1597",
    "collection": "jewellery",
    "imagePath": "/products/rings/rings-046/image.jpg",
    "thumbnailPath": "/products/rings/rings-046/thumbnail.jpg"
  },
  {
    "id": "rings-047",
    "title": "Avant-Garde Diamond Ring - A Modern Twist on Tradition",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "18K Gold",
      "VS Clarity Diamond"
    ],
    "features": "Unique, asymmetrical design with a V-shaped band accentuating the central diamond. Delicate engravings on the white gold sections add a touch of vintage charm. The elevated setting showcases the diamond's brilliance. This modern design evokes the spirit of Telugu artistry with its unconventional form.",
    "colors": [
      "White Gold",
      "Yellow Gold",
      "White Diamond"
    ],
    "occasions": [
      "Engagement",
      "Anniversary",
      "Contemporary Wedding",
      "Cocktail Parties",
      "Gift for a Loved One"
    ],
    "description": "This statement ring is a harmonious blend of modern design and subtle traditional influence. The high-quality diamond ensures lasting sparkle and value. Its distinctive style is sure to turn heads and become a cherished family heirloom.",
    "tags": [
      "Diamond Ring",
      "Gold Ring",
      "Engagement Ring",
      "Cocktail Ring",
      "Modern Jewelry",
      "Designer Jewelry",
      "Telugu Jewelry"
    ],
    "original_id": "jewellery_IMG-20241219-WA0020_1599",
    "collection": "jewellery",
    "imagePath": "/products/rings/rings-047/image.jpg",
    "thumbnailPath": "/products/rings/rings-047/thumbnail.jpg"
  },
  {
    "id": "rings-049",
    "title": "Navratan Chakra Ring - Timeless Elegance and Auspicious Energy",
    "category": "rings",
    "original_type": "Ring",
    "materials": [
      "22K Gold (916 Gold) setting",
      "meticulously crafted with a Hyderabadi Polish for a lasting luster. Features nine carefully selected gemstones representing the Navaratnas: Ruby (Manikyam)",
      "Pearl (Mutyam)",
      "Red Coral (Erra Pagadam)",
      "Emerald (Pachcha)",
      "Yellow Sapphire (Kanaka Pushyaragam)",
      "Diamond (Vajram)",
      "Blue Sapphire (Neelam)",
      "Hessonite (Gomedhikam)",
      "and Cat's Eye (Vaiduryam). Each gemstone is carefully selected for its color",
      "clarity",
      "and auspicious properties."
    ],
    "features": "This exquisite ring showcases the traditional Navratna design, a circular arrangement symbolizing cosmic balance and protection. The gemstones are set in a cluster style, surrounded by pave-set cubic zirconia (CZ) for enhanced brilliance. The intricate detailing and smooth finish exemplify the superior craftsmanship synonymous with Hyderabad's jewelry heritage. The ring's design ensures comfort and durability, making it suitable for daily wear or special occasions.",
    "colors": [
      "A vibrant symphony of colors including rich reds (Ruby and Coral)",
      "luminous whites (Pearl and CZ)",
      "deep blues (Sapphire)",
      "lush greens (Emerald)",
      "sunny yellows (Sapphire)",
      "and earth-toned browns (Hessonite). The gold setting adds warmth and richness",
      "enhancing the gemstone's individual beauty."
    ],
    "occasions": [
      "Ideal for auspicious occasions such as weddings (Vivah)",
      "engagement ceremonies (Nischitartham)",
      "housewarmings (Gruhapravesham)",
      "festivals (Sankranti",
      "Diwali)",
      "and traditional celebrations. Its versatile design also makes it a perfect statement piece for parties",
      "anniversaries",
      "or any event where you want to radiate elegance and sophistication."
    ],
    "description": "Embrace the power and beauty of the Navratnas with this exquisitely crafted ring. Each gemstone is believed to bring positive energies and balance to the wearer's life, according to Vedic astrology. The Hyderabadi Polish ensures lasting shine and durability. A timeless heirloom that can be treasured for generations. Experience the perfect blend of tradition and modern style.",
    "tags": [
      "Navratan",
      "Ring",
      "Anguleeyakam",
      "22K Gold",
      "Hyderabadi Jewelry",
      "Gemstone Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Traditional Jewelry",
      "Auspicious Jewelry",
      "Wedding Jewelry",
      "Festival Jewelry",
      "Cluster Ring",
      "CZ",
      "Cubic Zirconia",
      "Manikyam",
      "Mutyam",
      "Erra Pagadam",
      "Pachcha",
      "Kanaka Pushyaragam",
      "Vajram",
      "Neelam",
      "Gomedhikam",
      "Vaiduryam"
    ],
    "original_id": "sjpl_PHOTO-2023-05-16-12-22-52_1701",
    "collection": "sjpl",
    "imagePath": "/products/rings/rings-049/image.jpg",
    "thumbnailPath": "/products/rings/rings-049/thumbnail.jpg"
  },
  {
    "id": "rings-050",
    "title": "Divine Diamond Vaddanam with Emerald Accent and Pearl Drops - Kamarband",
    "category": "rings",
    "original_type": "Belt",
    "materials": [
      "22K Gold base with Hyderabadi Polish",
      "brilliant-cut Diamonds (VS Clarity)",
      "natural Emerald gemstone",
      "South Sea Pearls."
    ],
    "features": "Intricately crafted diamond patterns, interspersed with traditional motifs. Features a central emerald accent stone. Delicate pearl drops adorn the lower edge, creating a graceful sway. The design draws inspiration from traditional South Indian artistry, showcasing meticulous detailing and a regal aesthetic. Exudes opulence and sophistication.",
    "colors": [
      "White (Diamonds)",
      "Green (Emerald)",
      "Creamy White (Pearls)",
      "Yellow (Gold)."
    ],
    "occasions": [
      "Perfect for weddings (Muhurtham)",
      "bridal wear",
      "festive occasions",
      "traditional dances (Kuchipudi",
      "Bharatanatyam)",
      "and grand celebrations. Makes a statement at black-tie events",
      "cocktail parties or for formal wear."
    ],
    "description": "This Vaddanam is a masterpiece of traditional South Indian jewelry design, crafted by skilled artisans using only the finest materials. The diamonds sparkle brilliantly, while the emerald adds a touch of elegance. The gold base is expertly polished to a radiant shine. This piece is not just beautiful, it is also a valuable investment that will be treasured for generations to come. A timeless piece blending tradition and sophistication",
    "tags": [
      "Vaddanam",
      "Kamarband",
      "Diamond Belt",
      "Emerald Jewelry",
      "South Indian Jewelry",
      "Temple Jewelry",
      "Hyderabadi Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Pearl Jewelry",
      "Traditional Jewelry",
      "Indian Jewelry",
      "waist belt",
      "kamar patta"
    ],
    "original_id": "sjpl_PHOTO-2024-05-21-18-57-20_2163",
    "collection": "sjpl",
    "imagePath": "/products/rings/rings-050/image.jpg",
    "thumbnailPath": "/products/rings/rings-050/thumbnail.jpg"
  },
  {
    "id": "rings-051",
    "title": "Exquisite Diamond Vaddanam (Belt) with Emerald and Pearl Accents",
    "category": "rings",
    "original_type": "Waist Belt",
    "materials": [
      "High-quality Gold setting (purity not specified)",
      "meticulously studded with brilliant-cut Diamonds (approx. 14.30 carats). Features a central Pear-shaped Ruby (approx. 4.70 carats)",
      "accented by lustrous Emeralds (approx. 9.23 carats) and dangling South Sea Pearls (approx. 23.95 carats) for added elegance."
    ],
    "features": "This Vaddanam showcases intricate floral and paisley motifs, intricately set with sparkling diamonds. The design includes a central large Emerald stone that is a unique design element to this Vadannem. Dangling South Sea Pearls add a touch of classic grace. The craftsmanship reflects traditional South Indian jewelry making with its elaborate patterns and emphasis on gemstone brilliance.",
    "colors": [
      "Predominantly white (diamonds) and gold",
      "complemented by the vibrant green of the Emerald and the rich red of the Ruby. The soft luster of the pearls adds a delicate contrast."
    ],
    "occasions": [
      "Perfect for weddings (Vivahaalu)",
      "traditional ceremonies (like Seemantham or Half-Saree Function)",
      "and grand celebrations. Its modern elegance also makes it suitable for high-end fashion events and parties."
    ],
    "description": "This Vaddanam is a statement piece that seamlessly blends traditional South Indian aesthetics with modern elegance. The combination of diamonds, rubies, emeralds and pearls makes it an heirloom-worthy treasure. Its exquisite craftsmanship and timeless design ensure it will be cherished for generations.",
    "tags": [
      "Vaddanam",
      "Kamarbandh",
      "Diamond Belt",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Ruby",
      "Emerald",
      "Pearl",
      "Telugu Jewelry",
      "Gold Belt",
      "waist chain",
      "kempu",
      "pachi",
      "navratna",
      "antique finish",
      "Hyderabadi Jewelry"
    ],
    "original_id": "sjpl_PHOTO-2024-05-22-11-18-04 2_2175",
    "collection": "sjpl",
    "imagePath": "/products/rings/rings-051/image.jpg",
    "thumbnailPath": "/products/rings/rings-051/thumbnail.jpg"
  },
  {
    "id": "rings-053",
    "title": "Peacock Motif Vanki Armlet - Traditional Andhra Baju Bandh",
    "category": "rings",
    "original_type": "Armlet/Baju Bandh",
    "materials": [
      "22K Yellow Gold",
      "Brilliant Cut Diamonds",
      "Ruby",
      "Emerald. Features a Hyderabadi Polish for enhanced luster and durability."
    ],
    "features": "Intricately designed armlet showcasing a peacock motif at the center. Embellished with brilliant-cut diamonds in a delicate floral pattern on the sides. The center features a traditional peacock design with inlaid ruby and emerald gemstones. Handcrafted with exquisite detail and a meticulous attention to symmetry, reflecting the artistry of South Indian craftsmanship. The traditional ‘vanki’ design is elevated with a touch of modern elegance through the diamond accents.",
    "colors": [
      "Yellow Gold",
      "White (Diamonds)",
      "Red (Ruby)",
      "Green (Emerald)"
    ],
    "occasions": [
      "Perfect for weddings",
      "engagements",
      "bridal wear",
      "or any festive occasion. A stunning addition to a Bharatnatyam or Kuchipudi performance ensemble. Ideal for Muhurtham",
      "Seemantham",
      "or any traditional Telugu function."
    ],
    "description": "This Vanki armlet is more than just jewelry; it's a piece of art. The peacock motif symbolizes beauty, prosperity, and grace, making it an auspicious adornment for special occasions. The combination of traditional design and sparkling diamonds creates a timeless appeal. Handcrafted by skilled artisans, it showcases the rich heritage of South Indian jewelry making. The Hyderabadi polish ensures long-lasting shine and durability, making it an heirloom piece to be cherished for generations. The adjustable design offers a comfortable and secure fit.",
    "tags": [
      "Vanki",
      "Baju Bandh",
      "Armlet",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Traditional Jewelry",
      "Peacock Jewelry",
      "Gold Jewelry",
      "Diamond Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Muhurtham",
      "Seemantham",
      "Hyderabadi Polish",
      "Temple Jewelry",
      "Andhra Jewelry",
      "వంకీ",
      "బాజు బంద్",
      "దక్షిణ భారత ఆభరణాలు",
      "పెళ్లి ఆభరణాలు"
    ],
    "original_id": "tanmanya_diamonds_open-close_IMG-20241114-WA0004_2866",
    "collection": "tanmanya",
    "imagePath": "/products/rings/rings-053/image.jpg",
    "thumbnailPath": "/products/rings/rings-053/thumbnail.jpg"
  }
]