[
  {
    "id": "waistbands-001",
    "title": "Lakshmi Vaddanam: Divine Gold Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold",
      "intricate filigree work. Features the signature Hyderabadi polish for lasting brilliance and a rich",
      "antique-inspired glow."
    ],
    "features": "This exquisite Vaddanam showcases traditional South Indian artistry. The centerpiece features a meticulously detailed Lakshmi motif, symbolizing prosperity and good fortune. The delicate filigree work forms a continuous pattern of hearts and floral designs, further enhanced by intricate pendant drops. The belt is designed in a flexible, multi-strand style for comfortable wear.",
    "colors": [
      "Lustrous yellow gold",
      "capturing the essence of traditional Telugu jewelry."
    ],
    "occasions": [
      "Perfect for weddings (Pendli)",
      "Seemantham (baby shower)",
      "bridal wear",
      "and other auspicious occasions. Adds a touch of regal elegance to traditional sarees and lehengas."
    ],
    "description": "This Vaddanam is more than just jewelry; it's a heirloom piece that embodies tradition and elegance. The Lakshmi motif carries immense cultural significance, making it an ideal gift for a bride or a young woman celebrating her milestones. The high-purity gold ensures lasting value and brilliance, making it a worthy investment. The flexible design ensures comfortable wear throughout the day.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Gold Jewelry",
      "Lakshmi",
      "Telugu Jewelry",
      "South Indian Jewelry",
      "Hyderabadi Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Indian Jewelry",
      "Traditional Jewelry",
      "22K Gold",
      "Temple Jewelry",
      "Ottiyanam",
      "Kamarbandh"
    ],
    "original_id": "choker_diamonds_open-close_WhatsApp Image 2024-09-04 at 22.01.06_7f769ec1_0065",
    "collection": "choker",
    "imagePath": "/products/waistbands/waistbands-001/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-001/thumbnail.jpg",
    "cardtitle": "Gold Waistband"
  },
  {
    "id": "waistbands-002",
    "title": "Mayura Vaddanam: Exquisite Peacock Design Gold Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Yellow Gold",
      "meticulously handcrafted using traditional Telugu goldsmithing techniques. The piece features an exquisite Hyderabadi polish",
      "enhancing the gold's natural luster and depth."
    ],
    "features": "This Vaddanam features intricate filigree work and a prominent peacock (Mayura) motif, symbolizing grace, beauty, and royalty. The piece showcases traditional nakshi work, depicting floral and paisley patterns with exceptional detail. The adjustable design ensures a comfortable and secure fit. The bottom edge is adorned with small golden droplet-shaped danglers which contribute to the Vaddanam's regal appearance.",
    "colors": [
      "Lustrous Yellow Gold",
      "reflecting the rich heritage of South Indian jewelry."
    ],
    "occasions": [
      "Perfect for weddings (Vivaham)",
      "bridal wear",
      "traditional ceremonies (Pelli)",
      "Seemantham",
      "and special occasions where a touch of timeless elegance is desired. This piece also complements modern ethnic wear for upscale events."
    ],
    "description": "This Vaddanam is a masterpiece of South Indian craftsmanship, embodying cultural heritage and timeless beauty. The intricate details and superior gold quality make it a valuable heirloom piece, passed down through generations. Its design resonates with traditional symbolism, making it auspicious for significant life events.",
    "tags": [
      "Vaddanam",
      "Oddanam",
      "Waist Belt",
      "Gold Jewelry",
      "22K Gold",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Mayura",
      "Peacock Design",
      "Filigree",
      "Nakshi Work",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Pelli",
      "Seemantham",
      "Vivaham"
    ],
    "original_id": "choker_diamonds_open-close_WhatsApp Image 2024-09-04 at 22.05.59_80b731fb_0066",
    "collection": "choker",
    "imagePath": "/products/waistbands/waistbands-002/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-002/thumbnail.jpg",
    "cardtitle": "Gold Waistband"
  },
  {
    "id": "waistbands-003",
    "title": "The 'Vajra Tejas' Diamond Vaddanam Centerpiece",
    "category": "waistbands",
    "original_type": "Vaddanam Centerpiece",
    "materials": [
      "18K Yellow Gold with VS Clarity Diamonds. Precisely set with brilliant-cut diamonds. Hyderabadi Polish for enduring luster."
    ],
    "features": "Intricate filigree design forming a classic 'V' shape. Micro-pavé setting maximizes diamond brilliance. Captures the essence of South Indian design with its floral motifs, modernized for contemporary tastes. Designed to be the focal point of a traditional Vaddanam/Oddiyanam (hip belt).",
    "colors": [
      "Primarily gold and brilliant white from the diamonds."
    ],
    "occasions": [
      "Ideal for weddings (vivaha)",
      "receptions",
      "and grand celebrations. Suitable as a statement piece for any formal occasion where an elegant touch is desired. Complements both traditional South Indian attire (pattu sarees",
      "lehengas) and contemporary gowns."
    ],
    "description": "Exquisite diamond brilliance enhances any outfit. Lightweight and comfortable to wear. The blend of traditional design with modern setting techniques makes it a timeless piece. A stunning heirloom that embodies both luxury and cultural significance. Durable and crafted to last for generations.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Hip Belt",
      "Diamond Jewelry",
      "South Indian Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Hyderabad Jewelry",
      "Telugu Jewelry",
      "Indian Jewelry",
      "Fine Jewelry",
      "Diamond Vaddanam",
      "Traditional Jewelry",
      "Ethnic Jewelry",
      "Engagement"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-17 2_1016",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-003/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-003/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-004",
    "title": "Exquisite Diamond Floral Vaddanam - A Modern Take on Tradition",
    "category": "waistbands",
    "original_type": "Belt/Waist Ornament",
    "materials": [
      "18K Rose Gold",
      "Hand-selected Round Brilliant Cut Diamonds (VS Clarity",
      "G Color)",
      "Hyderabadi Polish."
    ],
    "features": "This Vaddanam features a delicate floral motif intricately crafted with pavé-set diamonds, inspired by traditional South Indian designs. The rose gold base enhances the sparkle of the diamonds. The design is modern yet rooted in traditional South Indian artistry. The flexible links allow for comfortable wear.",
    "colors": [
      "Rose Gold",
      "Sparkling White Diamonds."
    ],
    "occasions": [
      "Weddings (Vadhuvu Alankarana)",
      "Receptions",
      "Engagement Ceremonies",
      "Festive Occasions (Dasara",
      "Diwali)",
      "Contemporary Indian Parties."
    ],
    "description": "A blend of contemporary design with traditional South Indian influences. The high-quality diamonds and rose gold create a luxurious and eye-catching piece. The floral motif is both elegant and timeless. Perfect for adding a touch of sparkle to your special day. Made with expert craftsmanship and Hyderabadi polish for a lasting shine.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Belt",
      "Rose Gold Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Floral Design",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Indian Jewelry",
      "ఒడ్డాణం",
      "Kamarbandh",
      "Diamond Vaddanam",
      "Latest Vaddanam Designs"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-44 2_1049",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-004/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-004/thumbnail.jpg",
    "cardtitle": "Diamond Floral Waistband"
  },
  {
    "id": "waistbands-005",
    "title": "Diamond Butterfly Vaddanam - A Modern Take on Traditional Elegance",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "18K Rose Gold with Round Brilliant Cut Diamonds. The Gold is finished with a smooth",
      "radiant polish. Features high-clarity",
      "VVS diamonds."
    ],
    "features": "A contemporary butterfly design, meticulously handcrafted, adorned with pavé-set diamonds, which is an alternative take on the traditional Vaddanam. Its form, which echoes organic symmetry, makes it appropriate to pair with both traditional clothing and modern dresses.",
    "colors": [
      "Rose gold and diamond white."
    ],
    "occasions": [
      "Ideal for wedding receptions",
      "sangeet ceremonies",
      "and other formal events. Also perfect for adding a touch of elegance to cocktail parties and upscale gatherings."
    ],
    "description": "This Vaddanam is a harmonious blend of contemporary design and traditional craftsmanship, using top-quality diamonds and Rose gold. Its unique butterfly design adds a modern flair to any outfit. Its durability ensures that it is an investment piece that will be treasured for generations.",
    "tags": [
      "Vaddanam",
      "Oddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Rose Gold",
      "Butterfly Design",
      "Wedding Jewelry",
      "Reception Jewelry",
      "Party Wear",
      "Contemporary Jewelry",
      "Diamond",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Hyderabadi Jewelry"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-04-26-11-54-48 2_1060",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-005/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-005/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-006",
    "title": "The \"Indrajaal\" Diamond Vaddanam with Emerald Centrepiece",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted in 22K Gold with Hyderabadi Polish. Embellished with meticulously handset",
      "brilliant-cut diamonds of VS clarity and GH color. Features a central",
      "oval-cut Zambian Emerald of exceptional color saturation and clarity. The dangling accents are South Sea Pearls."
    ],
    "features": "This Vaddanam showcases intricate filigree and floral motifs meticulously set with diamonds. The central emerald is surrounded by an elaborate diamond halo, enhancing its brilliance. The design subtly incorporates elements of traditional Nakshi work, lending a touch of antique charm while retaining a modern aesthetic. The pearl drops add a touch of grace and movement.",
    "colors": [
      "The piece features a color palette of radiant gold",
      "dazzling white from the diamonds",
      "and a vibrant",
      "deep green from the emerald. The subtle cream color of the South Sea pearls provides a soft contrast."
    ],
    "occasions": [
      "Perfect for grand occasions like weddings (Vivahaalu)",
      "bridal wear",
      "Seemantham (baby shower)",
      "and other festive celebrations. Its modern design also makes it a stunning statement piece for high-end events and parties."
    ],
    "description": "A true masterpiece of craftsmanship, this Vaddanam embodies timeless elegance and modern sophistication. The use of high-quality materials like 22K gold, VS clarity diamonds, and a Zambian emerald ensures its lasting value. Its unique design blends traditional artistry with contemporary appeal, making it a cherished heirloom for generations. The Hyderabadi polish gives the gold a distinct luster.",
    "tags": [
      "Vaddanam",
      "Addiyanalu",
      "Waist Belt",
      "Diamond Belt",
      "Emerald Jewelry",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Hyderabadi Jewelry",
      "Nakshi Work",
      "Temple Jewelry",
      "Indian Jewelry",
      "22K Gold",
      "Zambian Emerald",
      "South Sea Pearls",
      "Fine Jewelry",
      "Vivahaalu",
      "Seemantham",
      "filigree"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-20 2_1286",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-006/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-006/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-007",
    "title": "Exquisite Diamond Vaddanam with Tanzanite & Emerald Accents - A Timeless Treasure",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted in 22K Gold with Hyderabadi Polish",
      "studded with brilliant-cut Diamonds (VS clarity",
      "G-H color)",
      "captivating Tanzanite cabochons",
      "and vibrant Emerald gemstones. Features intricate detailing with gold beads."
    ],
    "features": "This Vaddanam showcases a traditional South Indian design, re-imagined with modern sensibilities. It features a repeating floral motif, each centerpiece adorned with a striking Tanzanite, accented with clusters of Emeralds, and surrounded by meticulously pavé-set Diamonds. The design includes delicate diamond-studded 'drop' embellishments and incorporates traditional peacock (mayura) detailing within the central pieces. The secure clasp is seamlessly integrated into the overall design.",
    "colors": [
      "The piece exhibits a rich palette of golden yellow (gold)",
      "dazzling white (diamonds)",
      "deep blue-purple (tanzanite)",
      "and lush green (emeralds). The contrast creates a visually stunning and regal effect."
    ],
    "occasions": [
      "Perfect for grand occasions such as weddings (Vivaham/పెళ్లి)",
      "receptions",
      "Seemantham (శీమంతం)",
      "or any celebratory event where you wish to make a statement. Also suitable for upscale cultural events or classical dance performances."
    ],
    "description": "This Vaddanam is a masterpiece of craftsmanship, combining traditional design elements with modern stone setting techniques. The use of high-quality Diamonds, Tanzanite, and Emeralds ensures brilliance and enduring value. Its cultural significance as an auspicious adornment makes it a treasured heirloom piece to be passed down through generations. Owning this Vaddanam isn't just about acquiring jewelry; it's about embracing South Indian heritage and artistry.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Oddanam",
      "Diamond Jewelry",
      "Tanzanite",
      "Emerald",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Hyderabadi Jewelry",
      "Temple Jewelry",
      "Traditional Jewelry",
      "Vivaham",
      "Pelli",
      "Seemantham",
      "ఒడ్డాణం",
      "పెళ్లి నగలు",
      "వడ్డాణం",
      "వడ్డానం డిజైన్స్",
      "వడ్డాణం ధర",
      "వడ్డానం నమూనాలు",
      "ವಡ್ಡಾಣ"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-20 3_1287",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-007/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-007/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-008",
    "title": "The Emerald Empress Vaddanam: Diamond and Pearl Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "18K Gold base",
      "intricately set with brilliant-cut diamonds and adorned with a central emerald. Features premium quality South Sea pearls. Hyderabadi Polish enhances the brilliance of the gold and diamonds."
    ],
    "features": "A stunning Vaddanam featuring traditional South Indian design elements. Delicate filigree work and meticulously crafted diamond settings create an intricate floral and peacock motif. The centerpiece features a vibrant emerald. Pearl drops add a touch of elegance and movement. Crafted with traditional nakshi techniques, adding a regal touch to the modern design.",
    "colors": [
      "Predominantly white (diamonds)",
      "accented by the vibrant green of the emerald and the creamy white of the pearls. The Hyderabadi polish provides a subtle golden sheen to the setting."
    ],
    "occasions": [
      "Perfect for weddings",
      "bridal wear",
      "Seemantham",
      "Half-Saree functions",
      "and other grand celebrations. Its exquisite design makes it a statement piece for any special occasion."
    ],
    "description": "This Vaddanam is a harmonious blend of tradition and contemporary style. The use of high-quality diamonds and pearls, coupled with traditional craftsmanship, makes it a valuable investment. Its exquisite design and cultural significance make it a cherished heirloom for generations. Features a striking emerald centerpiece, symbolizing prosperity and good fortune.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "Pearl Jewelry",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Seemantham",
      "Half-Saree",
      "Hyderabad Jewelry",
      "Nakshi Work",
      "Filigree",
      "Indian Jewelry",
      "OTTIYAM"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-20_1288",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-008/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-008/thumbnail.jpg",
    "cardtitle": "Emerald Diamond Waistband"
  },
  {
    "id": "waistbands-009",
    "title": "The Emerald Bloom Vaddanam: A Modern Nakshi Artistry Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Base metal with high-quality gold plating",
      "embellished with CZ Diamonds and Emerald Green Simulated Stones. Finished with Hyderabadi Polish. Simulated Pearls dangle with grace."
    ],
    "features": "Features a floral motif design, each element meticulously studded with sparkling CZ diamonds. Emerald green stones add a pop of colour. The delicate pearl drops enhance the traditional look. The piece showcases a modern take on Nakshi art, blending traditional South Indian design with a contemporary aesthetic.",
    "colors": [
      "Dominant colors include shimmering white (CZ Diamonds)",
      "rich Emerald Green",
      "and soft pearl white. The gold plating adds a touch of warmth and elegance."
    ],
    "occasions": [
      "Perfect for weddings",
      "receptions",
      "Seemantham ceremonies",
      "half-saree functions",
      "and other special occasions where you want to make a statement."
    ],
    "description": "This vaddanam is a perfect fusion of traditional South Indian artistry and contemporary design. The high-quality CZ diamonds provide a brilliant sparkle, while the emerald green stones add a touch of opulence. The Hyderabadi polish ensures a long-lasting shine. This is a versatile piece that can be paired with both traditional sarees and modern outfits.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "ఒడ్డాణం",
      "South Indian Jewelry",
      "Indian Jewelry",
      "Wedding Jewelry",
      "Reception Jewelry",
      "CZ Diamond Jewelry",
      "Emerald Jewelry",
      "Traditional Jewelry",
      "Hyderabadi Jewelry",
      "Pearl Jewelry",
      "Seemantham",
      "Half Saree Ceremony",
      "Floral Design",
      "Nakshi Art"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-21 2_1289",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-009/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-009/thumbnail.jpg",
    "cardtitle": "Emerald Modern Waistband"
  },
  {
    "id": "waistbands-010",
    "title": "Emerald Splendor Vaddanam: A Touch of Royal Elegance",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold (సువర్ణ)",
      "Brilliant Cut Diamonds (వజ్రాలు)",
      "Oval Cut Emerald (పచ్చ)"
    ],
    "features": "Floral Motif Design, featuring an emerald center stone surrounded by brilliant-cut diamonds, complemented by diamond-studded floral patterns connected with a textured gold mesh belt. Classic design elements with a modern adjustable mesh-style band for comfort and versatility. ",
    "colors": [
      "Luminous Gold",
      "Sparkling White (Diamonds)",
      "Deep Green (Emerald)"
    ],
    "occasions": [
      "Weddings (వివాహాలు)",
      "Seemantham (సీమంతం)",
      "Half-Saree Function (సగం చీర ఫంక్షన్)",
      "Festive Celebrations (పండుగ వేడుకలు)",
      "Upscale Events"
    ],
    "description": "A stunning blend of traditional craftsmanship and modern design. The eye-catching emerald and diamond floral design make it a statement piece. The soft gold mesh band makes the piece very comfortable, and easier to wear. A perfect family heirloom to be passed down. A true treasure to adorn.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Emerald",
      "Diamonds",
      "22K Gold",
      "Traditional Jewelry",
      "South Indian Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "ఒడ్డాణం",
      "వజ్రాలు",
      "సువర్ణ",
      "పచ్చ"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-21 3_1290",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-010/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-010/thumbnail.jpg",
    "cardtitle": "Emerald Royal Waistband"
  },
  {
    "id": "waistbands-011",
    "title": "Diamond and Emerald Vaddanam: The \"Haritha Lakshmi\"",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold base",
      "set with brilliant-cut diamonds (VS clarity",
      "G-H color). Features high-quality Zambian Emeralds",
      "cabochon cut",
      "complemented by carved emerald drops. Hyderabadi Polish for a lasting sheen."
    ],
    "features": "Intricate floral and paisley motifs handcrafted in a closed setting. Central Emerald is surrounded by a cluster of diamonds. The cascading emerald drops provide a graceful sway. The band features a geometric, chevron pattern, ensuring flexibility and comfort. Incorporates traditional Telugu design elements with a modern setting style.",
    "colors": [
      "Predominantly a sparkling white (diamonds) and vibrant green (emeralds) with a warm yellow gold undertone. This classic combination symbolizes prosperity and growth."
    ],
    "occasions": [
      "Perfect for weddings",
      "Seemantham ceremonies",
      "upscale parties and celebrations. A statement piece for a bride's Voni function or a grand reception. Suitable for both traditional South Indian attire and elegant contemporary outfits."
    ],
    "description": "This Vaddanam is a testament to Hyderabadi craftsmanship and reflects the rich cultural heritage of South India. The use of high-quality diamonds and vibrant Zambian emeralds makes it a valuable investment. Its unique design blends tradition with a modern aesthetic, making it a timeless piece that can be passed down through generations. The emeralds symbolize prosperity and good health, adding auspiciousness to any occasion.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Seemantham",
      "Emeralds",
      "Diamonds",
      "22K Gold",
      "Traditional Jewelry",
      "Indian Jewelry",
      "ஒட்டியாணம்",
      "ఒడ్డాణం",
      "Kamarpatta"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-21_1291",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-011/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-011/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-012",
    "title": "The 'Indrani' Diamond Vaddanam with Emerald Drops",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "18K Yellow Gold with Hyderabadi Polish. Features baguette cut diamonds (VVS Clarity",
      "E-F Color) and natural Zambian emeralds. The emeralds are cabochon cut."
    ],
    "features": "A stunning Vaddanam featuring a central diamond-encrusted motif inspired by traditional Andhra artistry. The repeating pattern of baguette diamonds creates a modern, streamlined look. Delicate emerald drops embellish the bottom edge, adding a touch of traditional elegance. The focal point showcases a geometric design with emerald accents.",
    "colors": [
      "Predominantly white (diamonds)",
      "with accents of vibrant green (emeralds) and warm yellow gold."
    ],
    "occasions": [
      "Perfect for grand occasions such as weddings (Vivaha)",
      "receptions",
      "seemantham (baby shower)",
      "and high-profile social gatherings. Also suitable for a modern fusion look at festive events."
    ],
    "description": "This 'Indrani' Vaddanam perfectly marries tradition with modern design sensibilities. The exceptional quality of diamonds and emeralds, combined with meticulous craftsmanship, makes it a timeless heirloom piece. This stunning accessory exudes opulence and cultural significance, making the wearer the epitome of South Indian grace and elegance.",
    "tags": [
      "Vaddanam",
      "Odyanam",
      "Diamond Waist Belt",
      "Emerald",
      "South Indian Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Andhra Jewelry",
      "Vivaha",
      "Seemantham",
      "Kamarbandh",
      "belly chain"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-21-18-57-22_1292",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-012/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-012/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-013",
    "title": "Exquisite Diamond Vaddanam with Emerald and Ruby Accent",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "High-purity Gold (estimated 22K)",
      "Brilliant Cut Diamonds (VS clarity)",
      "Emerald (4.38 Carats)",
      "Ruby (7.48 Carats)",
      "Natural Pearls (61.10 Carats). Features a lustrous",
      "Hyderabadi Polish for enhanced brilliance."
    ],
    "features": "Intricately crafted with a stunning floral design, this Vaddanam showcases exquisite diamond detailing. The central emerald is surrounded by a halo of diamonds, creating a focal point of regal elegance. The design is inspired by traditional South Indian motifs, with delicate floral patterns and pearl drops along the bottom edge that add a touch of classic charm.",
    "colors": [
      "Gold",
      "White (diamonds)",
      "Green (emerald)",
      "Red (ruby)",
      "Cream (pearls). This combination embodies the traditional South Indian color palette for auspicious occasions."
    ],
    "occasions": [
      "Perfect for weddings (muhurtham)",
      "engagements",
      "Bharatanatyam performances",
      "and other grand celebrations. A statement piece for Seemantham or Voni function (half-saree ceremony). Also suitable for formal gatherings where you want to make a lasting impression."
    ],
    "description": "This Vaddanam is a true heirloom piece, showcasing unparalleled craftsmanship and timeless design. The combination of diamonds, emerald, ruby, and pearls represents prosperity and good fortune, making it a meaningful investment. The Hyderabadi polish ensures a long-lasting shine, while the classic design transcends fleeting trends. It's a symbol of cultural heritage and exquisite taste.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald",
      "Ruby",
      "Pearls",
      "South Indian Jewelry",
      "Temple Jewelry",
      "Bridal Jewelry",
      "Muhurtham",
      "Seemantham",
      "Voni function",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Indian Jewelry",
      "Bridal Accessory",
      "22K Gold",
      "Floral Design",
      "Fine Jewelry"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02 2_1293",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-013/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-013/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-014",
    "title": "The Emerald and Diamond Vaddanam: \"Ananta Lakshmi\"",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold",
      "Finest Quality Diamonds (24.23 carats)",
      "Natural Emeralds (24.90 carats) and South Sea Pearls (42.33 carats). Features Hyderabadi polish for a lasting luster."
    ],
    "features": "Intricately handcrafted Vaddanam featuring a traditional South Indian design. The central motif is adorned with a large oval cut emerald, surrounded by a halo of shimmering diamonds in a pave setting. Pear-shaped emerald drops enhance the elegance, and delicate diamond-studded floral patterns link the main design to the pearl tassel border. The secure and adjustable clasp ensures a comfortable fit. The diamonds are set with high precision, maximizing their brilliance. The piece weighs 188.33 grams.",
    "colors": [
      "Gold",
      "Emerald Green",
      "White (Diamonds)",
      "and Cream (Pearls)"
    ],
    "occasions": [
      "Perfect for weddings (Vivaha)",
      "bridal wear",
      "grand receptions",
      "traditional festivals like Ugadi and Sankranti",
      "and special occasions such as Seemantham or half-saree functions (Langa Voni Function). Can also add a touch of regal elegance to modern formal events."
    ],
    "description": "This \"Ananta Lakshmi\" Vaddanam is a true masterpiece of South Indian craftsmanship. Its timeless design combines the auspiciousness of emeralds and the brilliance of diamonds, enhanced by the gentle beauty of South Sea Pearls. The use of 22K gold ensures lasting value and durability, making it a cherished heirloom to be passed down through generations. The intricate design and meticulous craftsmanship make this piece a unique and unforgettable statement of style and tradition.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Kamarbandh",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Bridal Jewelry",
      "Emerald",
      "Diamonds",
      "Pearls",
      "22K Gold",
      "Hyderabadi Polish",
      "Temple Jewelry",
      "Ugadi",
      "Sankranti",
      "Vivaha",
      "Seemantham",
      "Langa Voni",
      "Muhurtham",
      "Kasu Mala",
      "Nakshi Work"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02 3_1294",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-014/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-014/thumbnail.jpg",
    "cardtitle": "Emerald Diamond Waistband"
  },
  {
    "id": "waistbands-015",
    "title": "Elegant Diamond Vaddanam with Peacock Motif and South Sea Pearls",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "High-purity Gold base",
      "meticulously set with brilliant-cut Diamonds. Features vibrant Rubies (4.11ct) and Emeralds (7.02ct)",
      "accentuated by lustrous South Sea Pearls (68.88ct). This Vaddanam showcases a Hyderabadi polish for a lasting shine."
    ],
    "features": "This exquisitely crafted Vaddanam features a central peacock (Mayura) motif, a symbol of beauty and prosperity. The delicate diamond-studded patterns are inspired by traditional South Indian designs. The design is further enhanced by Emerald and Ruby embellishments. Lustrous South Sea pearls are elegantly suspended, adding a touch of sophistication. Fine detailing throughout the piece demonstrates exceptional artistry and craftsmanship.",
    "colors": [
      "Predominantly gold with dazzling white diamonds",
      "complemented by the deep green of the Emeralds and the rich red of the Rubies. The South Sea pearls exhibit a creamy white color with subtle iridescence",
      "creating a captivating contrast."
    ],
    "occasions": [
      "Perfect for traditional South Indian weddings",
      "Seemantham ceremonies (baby showers)",
      "and half-saree functions (Langa Voni). This Vaddanam can also elevate your look for grand celebrations and special occasions",
      "adding a touch of regal elegance."
    ],
    "description": "This Vaddanam is more than just a piece of jewelry; it's an heirloom. The combination of diamonds, emeralds, rubies, and South Sea pearls makes it a valuable and timeless investment. The design beautifully blends traditional South Indian aesthetics with modern sensibilities. The intricate craftsmanship ensures its durability and makes it a treasured possession for generations to come.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Waist Belt",
      "Diamond Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Temple Jewelry",
      "Peacock Motif",
      "Mayura",
      "Ruby",
      "Emerald",
      "South Sea Pearls",
      "Hyderabadi Polish",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Seemantham",
      "Langa Voni",
      "Traditional Jewelry",
      "Indian Jewelry",
      "Guttapusalu",
      "Kasulaperu"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02 4_1295",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-015/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-015/thumbnail.jpg",
    "cardtitle": "Elegant Diamond Waistband"
  },
  {
    "id": "waistbands-016",
    "title": "Diamond Vaddanam with Ruby and Emerald Accents - A Regal Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "High-purity Gold (exact karat specified upon inquiry) meticulously set with brilliant-cut Diamonds (13.70 carats total diamond weight). Features vibrant Rubies (1.90 carats total)",
      "lush Emeralds (7.07 carats total)",
      "and finely carved Pink Tourmalines (40.55 carats total). Features a Hyderabadi Polish",
      "enhancing the gold's luster."
    ],
    "features": "This contemporary Vaddanam showcases a delicate floral motif intricately crafted with diamond pave settings. Larger Emeralds are strategically placed to draw the eye, while the Pink Tourmaline drops add a touch of playful femininity. The design seamlessly blends traditional South Indian aesthetics with modern sensibilities. Features multiple rows of delicate diamond and gold detailing, along with a secure clasp for a perfect fit.",
    "colors": [
      "Primarily a shimmering white from the diamonds and a warm golden hue from the high-purity gold. Accented by the rich red of the Rubies",
      "the deep green of the Emeralds",
      "and soft pink of the Tourmalines."
    ],
    "occasions": [
      "Ideal for wedding receptions",
      "Sangeet ceremonies",
      "Seemantham (pregnancy ceremony)",
      "half-saree functions",
      "and other grand celebrations where a statement piece is desired. Suitable for both traditional and modern attire."
    ],
    "description": "A captivating blend of tradition and modern elegance, this Diamond Vaddanam is a statement piece that exudes opulence. The meticulous craftsmanship, combined with the brilliance of diamonds and the vibrancy of precious gemstones, makes it a treasured heirloom. Its unique design and superior quality promise to elevate any ensemble. Owning this piece signifies an appreciation for South Indian heritage and sophisticated style.",
    "tags": [
      "Vaddanam",
      "Oddaanam",
      "Waist Belt",
      "Diamond Belt",
      "Ruby",
      "Emerald",
      "Pink Tourmaline",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Hyderabadi Jewelry",
      "Indian Jewelry",
      "Antique Finish",
      "Nakshi Work",
      "Temple Jewelry",
      "ఒడ్డాణం",
      "Kasulaperu",
      "Kempu Jewelry"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-02_1296",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-016/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-016/thumbnail.jpg",
    "cardtitle": "Diamond Ruby Waistband"
  },
  {
    "id": "waistbands-017",
    "title": "Diamond and Emerald Vaddanam - The Regal Lakshmi Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "18K Gold",
      "Brilliant Cut Diamonds (16.60 carats total)",
      "Emeralds (18.05 carats total)",
      "South Sea Pearls (31.10 carats total). Hyderabadi Polish."
    ],
    "features": "This magnificent Vaddanam showcases an intricate floral and paisley design, meticulously crafted with brilliant-cut diamonds. Features 8 square-cut Emeralds, adding a touch of regal elegance. Delicate South Sea Pearls dangle from the lower edge, creating a mesmerizing sway. Traditional filigree work (Jali) provides depth and texture. The central motif is a stylized floral piece. The Vaddanam is designed with a flexible framework for comfortable wear.",
    "colors": [
      "Predominantly white (diamonds)",
      "with striking green accents (emeralds) and lustrous cream (pearls). The gold provides a subtle warm undertone."
    ],
    "occasions": [
      "Ideal for weddings (Vivaha)",
      "receptions",
      "Seemantham (baby shower)",
      "and other grand celebrations. A perfect heirloom piece to be passed down through generations."
    ],
    "description": "Crafted with meticulous attention to detail by our skilled artisans, this Vaddanam exudes timeless elegance and luxury. The combination of diamonds, emeralds, and South Sea pearls represents prosperity and good fortune, making it a cherished investment. The Hyderabadi Polish ensures lasting brilliance and durability. Represents enduring Indian tradition and heritage.",
    "tags": [
      "Vaddanam",
      "Kamarband",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "South Sea Pearls",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "South Indian Jewelry",
      "Andhra Jewelry",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Nakshi work",
      "Seemantham",
      "Vivaha",
      "కమ్మర్‌బంద్",
      "వడ్డాణం"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-03 3_1298",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-017/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-017/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-018",
    "title": "The Indrani Diamond Vaddanam: A Timeless Waist Belt of Unparalleled Elegance",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted in lustrous 22K Gold",
      "embellished with meticulously set brilliant-cut diamonds. Showcasing two Emeralds totaling 6.01 carats and two Rubies totalling 4.52 carats",
      "each hand-selected for their exceptional color and clarity. Features Hyderabadi Polish for enduring brilliance."
    ],
    "features": "This Vaddanam showcases intricate floral motifs meticulously studded with diamonds, evoking a sense of timeless beauty. The design features a central Emerald motif with a cascade of smaller diamond and Emerald clusters, creating a captivating visual symphony. Each gemstone is carefully set to maximize its brilliance and fire.",
    "colors": [
      "Predominantly gold and white (diamond) with vibrant emerald green and ruby red accents",
      "creating a classic and auspicious South Indian color palette."
    ],
    "occasions": [
      "Perfect for grand occasions such as weddings (Vivaah)",
      "Seemantham (baby shower)",
      "half-saree functions (Voni Function)",
      "and festive celebrations like Sankranthi and Diwali. Also ideal for making a statement at high-end parties and cultural events."
    ],
    "description": "A masterpiece of traditional craftsmanship, the Indrani Diamond Vaddanam is an heirloom piece meant to be cherished for generations. The exquisite combination of diamonds and precious gemstones symbolizes prosperity, health, and marital bliss. The timeless design ensures it remains a stylish and valuable investment.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald",
      "Ruby",
      "22K Gold",
      "Hyderabadi Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Kamarband",
      "OTTIYANAM",
      "Mekala Bandham"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-03_1299",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-018/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-018/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-019",
    "title": "The Emerald Glory Vaddanam: A Timeless Bridal Statement",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted in high-purity gold",
      "intricately embellished with 14.30 carats of sparkling diamonds. Features a striking 4.70 carat ruby",
      "complemented by 9.23 carats of vibrant emeralds and adorned with 23.95 carats of lustrous South Sea pearls. Hyderabadi Polish for a lasting shine."
    ],
    "features": "This exquisite Vaddanam showcases a stunning floral and paisley design, masterfully crafted by our skilled artisans. The central motif features a large, teardrop-shaped emerald, surrounded by a halo of dazzling diamonds. Delicate pearl drops enhance its elegance and movement. Each element is meticulously set to ensure both beauty and durability.",
    "colors": [
      "Predominantly white (diamonds) and gold",
      "with vibrant green from the emeralds",
      "a touch of red from the ruby",
      "and the soft creamy luster of the pearls."
    ],
    "occasions": [
      "Perfect for weddings (Vivahaalu/పెళ్లి)",
      "traditional dance performances (Kuchipudi/కూచిపూడి",
      "Bharatanatyam/భరతనాట్యం)",
      "Seemantham (సీమంతం)",
      "and other auspicious occasions. Also a stunning piece for a grand reception or gala."
    ],
    "description": "This Vaddanam is more than just jewelry; it's a work of art, representing the pinnacle of South Indian craftsmanship. Its classic design and high-quality materials ensure it will be a treasured heirloom for generations. The use of traditional motifs combined with contemporary design principles creates a piece that is both timeless and modern. The intricate detailing and quality of the gemstones elevate this piece to a true investment.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "South Indian Jewelry",
      "Diamond Jewelry",
      "Emerald",
      "Ruby",
      "Pearls",
      "Hyderabadi Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Telugu Jewelry",
      "ఒడ్డాణం",
      "పెళ్లి",
      "Vivahaalu",
      "Seemantham",
      "Traditional Jewelry"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-04 2_1300",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-019/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-019/thumbnail.jpg",
    "cardtitle": "Emerald Bridal Waistband"
  },
  {
    "id": "waistbands-020",
    "title": "Exquisite Diamond and Gemstone Vaddanam (Waist Belt) - A Timeless Treasure",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted in high-purity Gold",
      "meticulously studded with brilliant-cut Diamonds. Features a central Emerald (4.66 carats total weight)",
      "accentuated by Ruby accents (0.84 carats total weight)",
      "Pink Beads (3.82 Carats total weight) and complemented by Blue Moonstone (26.32 carats total weight) drops. Finished with a durable and lustrous Hyderabadi Polish."
    ],
    "features": "This Vaddanam showcases a classic South Indian design with intricately arranged diamond 'mango' motifs (Paisley). The central piece features a captivating floral design with the emerald as the focal point, bordered by rubies and diamonds. Delicate Blue Moonstone drops add a touch of elegance and movement. The setting is designed for maximum brilliance and security, ensuring lasting beauty.",
    "colors": [
      "Predominantly white (diamonds)",
      "with accents of vibrant green (emerald)",
      "subtle pink (rubies)",
      "and deep blue (Moonstones)",
      "creating a captivating and traditional color palette."
    ],
    "occasions": [
      "Perfect for weddings (Vivaha)",
      "Seemantham",
      "Bharatanatyam performances",
      "traditional ceremonies",
      "and festive celebrations. A statement piece to elevate any special occasion outfit."
    ],
    "description": "A true heirloom piece, this Vaddanam combines traditional craftsmanship with modern elegance. The brilliant diamonds and vibrant gemstones create a captivating sparkle that will turn heads. The sturdy construction ensures durability, making it a treasured possession for generations to come. Owning this piece is not just about owning jewelry; it's about owning a piece of South Indian heritage.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald",
      "Ruby",
      "Blue Moonstone",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Wedding Jewelry",
      "Hyderabadi Jewelry",
      "Muhurtham",
      "Seemantham",
      "Bharatanatyam",
      "Paisely",
      "Mango Design",
      "Antique Finish",
      "Gold Jewelry",
      "Temple Jewellery"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-22-11-18-04_1301",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-020/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-020/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-021",
    "title": "Diamond Emerald Peacock Vaddanam - A Royal Waist Belt (Odyanam)",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold",
      "Brilliant Cut Diamonds (21.50 Carats)",
      "Emerald (7.80 Carats)",
      "Rubies (10.91 Carats)",
      "South Sea Pearls (91.70 Carats)",
      "Hyderabadi Polish"
    ],
    "features": "Intricately designed vaddanam featuring a central peacock motif. The peacock is embellished with ruby eyes, surrounded by dazzling brilliant-cut diamonds. A central teardrop shaped emerald is also set on the piece. The intricate filigree design is complemented by a delicate row of South Sea pearl drops, adding a touch of regal elegance. The piece boasts traditional South Indian craftsmanship, with each diamond meticulously set for maximum brilliance.",
    "colors": [
      "Gold",
      "White (Diamonds)",
      "Green (Emerald)",
      "Red (Rubies)",
      "Cream (Pearls)"
    ],
    "occasions": [
      "Ideal for weddings (Vivaha Mahotsavam)",
      "Seemantham (Baby Shower)",
      "Half-Saree Function (Langa Voni Function)",
      "and other grand celebrations. A statement piece for any special occasion where you want to exude timeless elegance."
    ],
    "description": "This exquisite vaddanam is a true heirloom piece, blending traditional South Indian design with modern elegance. The central peacock motif symbolizes beauty, prosperity, and good fortune. The combination of brilliant-cut diamonds, vibrant emeralds, and lustrous South Sea pearls creates a stunning visual impact. Handcrafted by skilled artisans in Hyderabad, this piece showcases exceptional quality and timeless appeal. A perfect investment in your jewelry collection, destined to be cherished for generations.",
    "tags": [
      "Vaddanam",
      "Odyanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "South Sea Pearls",
      "Peacock Design",
      "Indian Jewelry",
      "Traditional Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Hyderabadi Jewelry",
      "Gold Jewelry",
      "Temple Jewelry",
      "Nakshi Work",
      "Vivaha Mahotsavam",
      "Seemantham",
      "Langa Voni Function",
      "22K Gold"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-24-13-54-20 3_1316",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-021/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-021/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-022",
    "title": "The Emerald and Diamond Peacock Vaddanam - Kamarband",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold",
      "21.84 carats of brilliant-cut Diamonds (1116 stones)",
      "6.82 carats of Emeralds (6 stones)",
      "9.89 Carats of Rubies (6 stones). Features the renowned Hyderabadi Polish for a lasting shine."
    ],
    "features": "Intricately designed Vaddanam featuring a central series of peacock motifs, a symbol of beauty and grace. Each peacock is adorned with sparkling diamonds and set within a circular frame. The waist belt is further embellished with round-cut emeralds strategically placed amidst the diamond setting, adding vibrant green accents. A delicate row of gold beads hangs along the lower edge, enhancing its traditional appeal.",
    "colors": [
      "Predominantly gold and white (diamonds) with vibrant green emerald accents. The Hyderabadi Polish gives the gold a rich",
      "warm tone."
    ],
    "occasions": [
      "Perfect for weddings (Vivaham)",
      "receptions",
      "bridal showers",
      "Seemantham (pregnancy celebration)",
      "and other grand celebrations. A statement piece that can also be worn to modern upscale events to showcase cultural heritage."
    ],
    "description": "This Vaddanam is a true masterpiece of South Indian craftsmanship, blending traditional design with contemporary elegance. The use of high-quality diamonds, radiant emeralds, and pure gold creates a timeless piece of jewelry. The peacock motif symbolizes prosperity and good fortune, making it an auspicious choice for brides and special occasions. Its durable construction ensures it will be a cherished heirloom for generations to come. The emeralds are beautifully selected to provide striking contrast.",
    "tags": [
      "Vaddanam",
      "Kamarband",
      "Waist Belt",
      "South Indian Jewelry",
      "Hyderabadi Jewelry",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "Gold Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Traditional Jewelry",
      "Peacock Motif",
      "Kattu Vaddanam",
      "కట్టు వడ్డాణం",
      "Seemantham Jewelry",
      "Vivaham Jewelry"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-24-13-54-27 3_1319",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-022/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-022/thumbnail.jpg",
    "cardtitle": "Emerald Diamond Waistband"
  },
  {
    "id": "waistbands-023",
    "title": "Exquisite Diamond and Emerald Peacock Vaddanam - CoBelt00001",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "159.400 grams of high-purity Gold",
      "16.18 carats of brilliant-cut Diamonds (2295 stones)",
      "4.59 carats of Round Rubies (24 stones)",
      "5.11 carats of Square Emeralds (2 stones). Crafted with meticulous Hyderabadi polish."
    ],
    "features": "This Vaddanam showcases a captivating peacock (Mayura) design, intricately crafted with diamond-studded feathers and ruby eyes. Features alternating floral motifs and two prominent Emeralds for the center and the lower pendant. The flexible design ensures a comfortable fit.",
    "colors": [
      "Primarily gold and sparkling white from the diamonds",
      "accentuated by the vibrant red of the rubies and the rich green of the emeralds. A classic and auspicious color palette for South Indian weddings."
    ],
    "occasions": [
      "Perfect for traditional South Indian weddings (Muhurtham)",
      "Seemantham ceremonies",
      "Half-Saree functions",
      "or any grand festive occasion. Also suitable for upscale modern events when a touch of heritage is desired."
    ],
    "description": "This Vaddanam represents timeless South Indian elegance. The Mayura design symbolizes beauty and prosperity, making it an auspicious addition to any bridal trousseau. The combination of diamonds, rubies, and emeralds ensures unmatched sparkle and enduring value. Handcrafted with precision by skilled artisans from Hyderabad.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "Ruby Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Mayura",
      "Peacock Design",
      "Muhurtham",
      "Seemantham",
      "Half Saree",
      "Antique Jewelry",
      "Traditional Jewelry",
      "Kasulaperu",
      "Addigai"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-24-14-02-26 2_1322",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-023/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-023/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-024",
    "title": "Devasena's Delight: Diamond & Gemstone Elephant Vaddanam",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold (approx. 14.86 grams)",
      "Polki Diamonds (approx. 13.74 carats)",
      "Natural Rubies (approx. 4.90 carats - 13 stones)",
      "Natural Emeralds (approx. 4.82 carats - 7 stones). Features Hyderabadi Polish for a lasting sheen."
    ],
    "features": "This stunning Vaddanam showcases exquisite craftsmanship with intricate floral motifs and elephant (Gaja) designs, symbolizing prosperity and royalty. The central hexagonal motif is adorned with a large emerald, surrounded by meticulously set polki diamonds. The design incorporates traditional South Indian elements while maintaining a contemporary elegance, ideal for the modern bride. The flexible design allows for comfortable wear.",
    "colors": [
      "Primarily gold with a dazzling white from the polki diamonds. Accents of deep red from the rubies and vibrant green from the emeralds create a rich",
      "auspicious color palette."
    ],
    "occasions": [
      "Perfect for weddings (vivaha)",
      "Seemantham ceremonies",
      "Bharatanatyam performances",
      "or any grand celebration where a statement piece is desired. Adds a touch of regality to bridal attire or traditional sarees."
    ],
    "description": "A true heirloom piece, this Vaddanam combines traditional South Indian artistry with the brilliance of polki diamonds, rubies, and emeralds. The elephant motifs symbolize strength and good fortune, making it a meaningful gift for a bride. The piece is crafted with high-quality materials and exceptional attention to detail, ensuring its beauty and durability for generations to come.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Kamarband",
      "Gold Jewelry",
      "Polki Diamonds",
      "Rubies",
      "Emeralds",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Gaja",
      "Elephant Motif",
      "Traditional Jewelry",
      "Hyderabadi Jewelry",
      "Vivaha",
      "Seemantham",
      "Kuncham",
      "Oddiyanam"
    ],
    "original_id": "diamond_jewellery_PHOTO-2024-05-24-14-02-26 5_1323",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-024/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-024/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-025",
    "title": "Exquisite Gold Lace Vaddanam: The 'Kamarbandu' of Royalty",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Yellow Gold",
      "meticulously crafted with a radiant Hyderabadi Polish. The design incorporates intricate wirework."
    ],
    "features": "This Vaddanam showcases delicate floral motifs rendered in exceptional detail. The design features three central medallions connected by meticulously crafted lace gold patterns. The lace style of goldwork is a hallmark of traditional artistry. The waist belt secures with a sturdy, traditional clasp, seamlessly integrated into the design.",
    "colors": [
      "Luminous Yellow Gold"
    ],
    "occasions": [
      "Perfect for grand occasions such as weddings (Muhurtham)",
      "engagement ceremonies (Nischitartham)",
      "and traditional festivals. Also an exquisite piece for half-saree function and Bharatanatyam performances."
    ],
    "description": "A symbol of heritage and timeless beauty. This Vaddanam represents the pinnacle of South Indian craftsmanship, offering both cultural significance and enduring value. The lightweight design ensures comfortable wear, while the durable gold ensures it will be cherished for generations. Each floral motif is a testament to our artisans' skill.",
    "tags": [
      "Vaddanam",
      "Kamarbandu",
      "Waist Belt",
      "Gold Jewelry",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Wedding Jewelry",
      "Muhurtham",
      "Odiyanam",
      "ஒட்டியாணம்"
    ],
    "original_id": "diamond_jewellery_WhatsApp Image 2024-09-04 at 22.01.05_931aee68_1425",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-025/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-025/thumbnail.jpg",
    "cardtitle": "Gold Royalty Waistband"
  },
  {
    "id": "waistbands-026",
    "title": "Mayura Nakshi Vaddanam: Peacock Motif Gold Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Yellow Gold",
      "Handcrafted with Hyderabadi Polish for a radiant luster. The gold is meticulously crafted to ensure durability and longevity."
    ],
    "features": "This exquisite Vaddanam showcases intricate Nakshi work, a hallmark of South Indian temple jewelry. The central design features majestic peacocks (Mayura), symbolizing beauty and grace. Delicate filigree detailing and intricate floral motifs are interspersed throughout the belt. The design includes adjustable links for a comfortable and secure fit. Each dangling detail is carefully crafted to add movement and shimmer.",
    "colors": [
      "Lustrous yellow gold throughout the entire piece"
    ],
    "occasions": [
      "Perfect for weddings (Vivaaham)",
      "bridal wear",
      "Seemantham (baby shower)",
      "half-saree functions (Langa Voni Function)",
      "and other grand celebrations. Also suitable for formal gatherings where you want to make a statement."
    ],
    "description": "This Vaddanam is a timeless heirloom piece, combining traditional craftsmanship with exquisite design. The intricate Nakshi work and peacock motifs represent a rich cultural heritage. The high-quality gold ensures lasting value and brilliance. It's a perfect blend of tradition and elegance, making it a coveted addition to any jewelry collection. The craftsmanship and detailed work are sure to grab attention.",
    "tags": [
      "Vaddanam",
      "Kamarband",
      "Waist Belt",
      "Gold Jewelry",
      "Nakshi",
      "South Indian Jewelry",
      "Temple Jewelry",
      "Bridal Jewelry",
      "Vivaaham",
      "Seemantham",
      "Langa Voni",
      "Mayura",
      "Peacock",
      "Hyderabad Jewelry",
      "Traditional Jewelry",
      "Indian Wedding",
      "Jewellery",
      "22K Gold"
    ],
    "original_id": "diamond_jewellery_WhatsApp Image 2024-09-04 at 22.05.59_80b731fb_1427",
    "collection": "diamond",
    "imagePath": "/products/waistbands/waistbands-026/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-026/thumbnail.jpg",
    "cardtitle": "Gold Waistband"
  },
  {
    "id": "waistbands-027",
    "title": "Diamond Vaddanam with Emerald Centerpiece and Pearl Drops - The 'Lakshmi Kamarband'",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold (approximate)",
      "brilliant-cut Diamonds (VS clarity",
      "G-H color)",
      "Oval-Cut Emerald",
      "South Sea Pearls. Hyderabadi Polish for enhanced luster and durability."
    ],
    "features": "Intricate filigree diamond work in a floral pattern. The central piece features a striking oval-cut emerald, adding a regal touch. Delicate South Sea pearl drops adorn the lower edge, enhancing its feminine appeal. Designed with flexible links for a comfortable fit. Handcrafted by skilled artisans from Hyderabad, reflecting generations of expertise.",
    "colors": [
      "Gold",
      "White (Diamonds)",
      "Emerald Green",
      "Creamy White (Pearls)"
    ],
    "occasions": [
      "Ideal for weddings (especially Telugu Kalyanam)",
      "Seemantham (baby shower)",
      "and other auspicious occasions. A statement piece for the modern bride who appreciates traditional elegance with a contemporary twist. Perfect for half-saree functions or grand celebrations."
    ],
    "description": "A masterpiece of Hyderabadi craftsmanship, this Vaddanam combines the timeless beauty of diamonds and pearls with a pop of vibrant emerald green. Its flexible design ensures a comfortable and secure fit. The Hyderabadi polish guarantees lasting brilliance and protection against tarnish. Owning this piece means possessing a treasure with both cultural and heirloom value.",
    "tags": [
      "Vaddanam",
      "Oddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald",
      "Pearls",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Kamarband",
      "22K Gold",
      "Traditional Jewelry",
      "Indian Jewelry",
      "Nakshi Work",
      "Fine Jewelry",
      "Bridal",
      "Seemantham",
      "Kalyanam",
      "ఒడ్డాణం",
      "బంగారు నగల"
    ],
    "original_id": "sjpl_PHOTO-2024-05-21-18-57-20 2_2161",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-027/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-027/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-028",
    "title": "Divine Diamond and Gemstone Vaddanam - Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold",
      "Brilliant Cut Diamonds (VS Clarity)",
      "Faceted Emeralds",
      "and Amethyst. Finished with a traditional Hyderabadi polish to enhance the gold's luster."
    ],
    "features": "This Vaddanam features a series of ornate motifs, each meticulously crafted with intricate diamond detailing. Each panel includes a unique peacock design. The central Amethyst gems are surrounded by smaller emeralds, creating a regal touch. Dangling pearl-like gold beads add movement and allure. Features the traditional design elements with a modern flair, perfect for the contemporary bride.",
    "colors": [
      "Primarily gold and diamond white",
      "with accents of vibrant green (Emeralds) and regal purple (Amethyst)."
    ],
    "occasions": [
      "Ideal for weddings (Vivaha)",
      "receptions",
      "Bharatanatyam performances",
      "and other festive occasions like Seemantham or Half-Saree function. A statement piece for any grand celebration."
    ],
    "description": "This Vaddanam is more than just a piece of jewelry; it's a symbol of cultural heritage and refined craftsmanship. The brilliant cut diamonds sparkle with unmatched fire, while the emeralds and amethyst add a touch of royalty. Its enduring design ensures it will be treasured for generations. It is a true investment, a timeless heirloom, and a statement of impeccable taste. The piece features high-quality gemstones, ensuring lasting brilliance and value.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald",
      "Amethyst",
      "22K Gold",
      "Hyderabadi Jewelry",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Bridal Jewelry",
      "Muhurtham Jewelry",
      "Seemantham",
      "Half-Saree",
      "Peacock Design",
      "Kamarband"
    ],
    "original_id": "sjpl_PHOTO-2024-05-21-18-57-20 3_2162",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-028/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-028/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-029",
    "title": "Emerald & Polki Diamond Vaddanam - The 'Indrani' Collection",
    "category": "waistbands",
    "original_type": "Belt",
    "materials": [
      "Base Metal: Alloy with Gold Plated",
      "Stones: Polki Diamonds",
      "Emeralds",
      "Pearls"
    ],
    "features": "The 'Indrani' Vaddanam showcases a stunning array of Polki diamonds, meticulously set to form delicate floral and geometric patterns. The design features radiant Emeralds inlaid in the center of a circular frame. Intricate handcrafted details with high-quality craftsmanship. The pearls are dangling at the bottom.",
    "colors": [
      "Emerald Green",
      "White Polki Diamonds",
      "and Cream Pearls"
    ],
    "occasions": [
      "Perfect for weddings (Vivaham)",
      "engagements (Nischitartham)",
      "bridal showers",
      "pre-wedding functions (like Mehendi or Sangeet)",
      "Seemantham",
      "half-saree functions (Voni Function)",
      "Diwali",
      "and other special occasions. Also suitable for upscale evening events."
    ],
    "description": "This vaddanam is not only a beautiful piece of jewelry, but also a timeless heirloom to be passed down through generations. The emerald and Polki combination symbolizes prosperity and good luck, making it an auspicious choice for brides. High-quality Polki diamonds and expert craftsmanship ensure lasting beauty and value.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Polki Diamond",
      "Emerald",
      "Traditional Jewellery",
      "South Indian Jewellery",
      "Hyderabadi Jewellery",
      "Bridal Jewellery",
      "Wedding Jewellery",
      "ஒட்டியாணம்",
      "कमरबंध",
      "ഒട്ടിയാണം",
      "South Indian Wedding",
      "Ethnic Jewellery",
      "Gift for Bride",
      "Indian Bridal Belt",
      "Kamarbandh"
    ],
    "original_id": "sjpl_PHOTO-2024-05-21-18-57-21 2_2164",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-029/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-029/thumbnail.jpg",
    "cardtitle": "Emerald Polki Waistband"
  },
  {
    "id": "waistbands-030",
    "title": "Exquisite Emerald and Diamond Vaddanam - Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold",
      "Brilliant Cut Diamonds (VVS Clarity)",
      "Oval Cut Emerald. Features Hyderabadi Polish for a lasting luster."
    ],
    "features": "This stunning Vaddanam features a floral design intricately crafted with brilliant-cut diamonds. The centerpiece is an oval-cut emerald, surrounded by a halo of diamonds to maximize its brilliance. The lower edge is detailed with diamond-studded, heart-shaped hangings for a delicate touch. The belt itself is made of a gold mesh, creating a very flexible and comfortable fit. The piece showcases a contemporary design with traditional Indian sensibilities.",
    "colors": [
      "Gold",
      "White (Diamonds)",
      "Green (Emerald)"
    ],
    "occasions": [
      "Perfect for weddings (Vivaha)",
      "receptions",
      "Seemantham ceremonies",
      "or grand festive occasions. Can also be styled with contemporary outfits for a touch of traditional elegance."
    ],
    "description": "This Vaddanam represents the perfect blend of traditional craftsmanship and modern design. The high-quality diamonds and vibrant emerald make it a show-stopping piece. The gold mesh belt guarantees a comfortable and secure fit. The vibrant green emerald is a symbol of abundance and longevity, making it an auspicious addition to any bride's trousseau.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Waist Belt",
      "Diamond Belt",
      "Emerald Belt",
      "Wedding Jewelry",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Hyderabadi Jewelry",
      "Traditional Jewelry",
      "Vivaha",
      "Seemantham",
      "Floral Design",
      "Gold Mesh",
      "Emerald"
    ],
    "original_id": "sjpl_PHOTO-2024-05-21-18-57-21 3_2165",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-030/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-030/thumbnail.jpg",
    "cardtitle": "Emerald Diamond Waistband"
  },
  {
    "id": "waistbands-031",
    "title": "The Emerald Empress Vaddanam - Diamond and Emerald Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Base metal is 22K Gold. Adorned with meticulously set Polki Diamonds (Uncut Diamonds) and vibrant Zambian Emeralds. Features a Hyderabadi Polish for a lasting shine."
    ],
    "features": "This stunning Vaddanam boasts a geometric pattern across the band, completely studded with Polki diamonds. The central design is a complex floral arrangement featuring an oval-cut Emerald as its focal point, surrounded by diamond-studded motifs. Further embellishment comes in the form of carved emerald beads suspended from the lower edge and circular peacock design on each side. The setting style enhances the natural sparkle of the diamonds, reflecting light from every angle. Traditional Telugu design elements make it a classic heirloom piece.",
    "colors": [
      "Predominantly White (Diamonds)",
      "Gold",
      "and Emerald Green."
    ],
    "occasions": [
      "Perfect for bridal wear",
      "especially for the Muhurtham ceremony. Suitable for grand occasions like weddings",
      "receptions",
      "Seemantham (pregnancy celebration)",
      "and other traditional functions. Can also be styled with modern ethnic wear for a fusion look."
    ],
    "description": "Exquisite craftsmanship with a traditional design that never goes out of style. The use of genuine Polki Diamonds and Zambian Emeralds adds significant value. The Emerald Empress Vaddanam is more than just jewelry; it's an investment and a symbol of elegance and tradition. The Hyderabadi polish ensures durability and lasting luster. The emerald beads promote health and prosperity.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Polki Diamonds",
      "Emeralds",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Traditional Jewelry",
      "Ethnic Jewelry",
      "Hyderabadi Jewelry",
      "ఒడ్డాణం",
      "Polki",
      "Emerald"
    ],
    "original_id": "sjpl_PHOTO-2024-05-21-18-57-21_2166",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-031/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-031/thumbnail.jpg",
    "cardtitle": "Emerald Waistband"
  },
  {
    "id": "waistbands-032",
    "title": "Diamond & Emerald Vaddanam: The 'Ratna Kanchi' Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "18K Yellow Gold base",
      "meticulously set with brilliant-cut Diamonds (VS Clarity",
      "G-H Color). Adorned with round",
      "faceted Zambian Emeralds. Featuring our signature Hyderabadi Polish for lasting luster."
    ],
    "features": "This exquisite Vaddanam showcases a geometric diamond pattern, interspersed with emerald detailing. The central pendant features a floral motif, surrounded by a cascading diamond arrangement, with dangling emerald drops. The design blends modern aesthetics with traditional South Indian influences, providing a versatile statement piece.",
    "colors": [
      "Primarily shimmering white (diamonds) and lush green (emeralds) against a warm yellow gold backdrop. The color palette symbolizes prosperity and new beginnings in South Indian culture."
    ],
    "occasions": [
      "Ideal for weddings (Vivahaalu)",
      "receptions",
      "pre-wedding events (like Pellikuthuru)",
      "and significant festive occasions like Diwali and Ugadi. Can also be worn for upscale parties and cultural events",
      "adding a touch of timeless elegance."
    ],
    "description": "A harmonious blend of traditional South Indian design and modern sophistication. The high-quality diamonds and emeralds ensure enduring value. The exquisite craftsmanship and Hyderabadi polish make this Vaddanam a true heirloom piece. This piece is not just jewelry; it's a statement of heritage and refined taste.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Bridal Jewelry",
      "Hyderabadi Jewelry",
      "Telugu Jewelry",
      "Wedding Jewelry",
      "Indian Jewelry",
      "Fine Jewelry",
      "ஒட்டியாணம்",
      "ఒడ్డాణం",
      "Kamarband"
    ],
    "original_id": "sjpl_PHOTO-2024-05-21-18-57-22_2167",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-032/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-032/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-034",
    "title": "Diamond & Emerald Vaddanam - A Regal Waist Belt of Timeless Beauty",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "18K Gold base (188.330 grams)",
      "Adorned with 24.23 carats of brilliant-cut diamonds (4077 stones) with exceptional fire and clarity",
      "24.90 carats of captivating emeralds (7 stones) with vibrant green hues",
      "20.32 carats of fine Rubies (7 stones)",
      "and 42.33 carats of Freshwater Pearls (20 pieces). Features a high-quality Hyderabadi Polish for enhanced luster."
    ],
    "features": "This exquisite Vaddanam features a traditional South Indian design with intricate filigree work and floral motifs. The central emerald is surrounded by a halo of diamonds. Elegant rows of diamond-studded floral patterns connect to the belt and suspend lustrous freshwater pearls. Traditional 'kundan' setting ensures the gemstones are securely and beautifully showcased. The design incorporates elements of 'nakshi' work to enhance the antique feel, blending tradition with contemporary appeal.",
    "colors": [
      "Predominantly gold with a sparkling white from the diamonds. A striking contrast is provided by the deep green of the emeralds",
      "hints of red from the rubies",
      "and the soft white of the pearls."
    ],
    "occasions": [
      "Perfect for weddings (Vivaaham)",
      "Seemantham (baby shower)",
      "Half-Saree functions (Langa Voni Function)",
      "and other grand celebrations. Makes a statement piece for formal galas and high-profile events",
      "embodying South Indian elegance."
    ],
    "description": "This Vaddanam is a masterpiece of craftsmanship, seamlessly blending traditional South Indian aesthetics with modern diamond-setting techniques. The high-quality diamonds and emeralds ensure lasting brilliance and value. It's not just jewelry; it's an heirloom piece representing cultural heritage and timeless elegance. Its durable construction ensures it can be cherished for generations.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald Jewelry",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Hyderabadi Jewelry",
      "Nakshi Work",
      "Kundan Setting",
      "Vivaaham",
      "Seemantham",
      "Langa Voni",
      "OTTIYANA",
      "kamarband",
      "Antique Jewelry",
      "Traditional Jewelry",
      "Indian Jewelry"
    ],
    "original_id": "sjpl_PHOTO-2024-05-22-11-18-02 3_2169",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-034/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-034/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-035",
    "title": "Diamond and Gemstone Vaddanam - The 'Indra' Collection",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted with 13.70 carats of dazzling diamonds",
      "set in high-purity gold. Features a central arrangement of captivating emeralds totaling 7.07 carats and a delicate line of pink carved gemstones totaling 40.55 carats with a single ruby of 1.90 carats. Boasts a radiant Hyderabadi Polish."
    ],
    "features": "This stunning Vaddanam features a detailed, floral-inspired design meticulously crafted with a brilliant pave setting to maximize diamond sparkle. The central focal point incorporates a classic flower motif with emeralds, reminiscent of traditional temple jewelry (గుడి ఆభరణాలు). The cascading pink carvings add a touch of modern elegance. Features a secure and adjustable clasp for comfortable wear.",
    "colors": [
      "Primarily shimmering white (diamonds)",
      "with vibrant green (emeralds) and delicate pink (carved gemstones) accents",
      "all set against the warm glow of gold."
    ],
    "occasions": [
      "Perfect for grand occasions such as weddings (పెళ్లి)",
      "receptions",
      "Seemantham (శీమంతం)",
      "and special cultural events. Also suitable for adding a touch of regal elegance to modern Indian attire for upscale parties or celebrations."
    ],
    "description": "A true heirloom piece, this Vaddanam represents a harmonious blend of traditional South Indian artistry and contemporary design. The exquisite craftsmanship and high-quality materials ensure both lasting beauty and value. A statement piece that embodies prosperity, beauty, and cultural heritage.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Indian Jewelry",
      "Diamond Jewelry",
      "Emeralds",
      "Ruby",
      "Pink Carvings",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "South Indian Jewelry",
      "Temple Jewelry",
      "గుడి ఆభరణాలు",
      "ఒడ్డాణం",
      "పెళ్లి",
      "Hyderabadi Jewelry"
    ],
    "original_id": "sjpl_PHOTO-2024-05-22-11-18-02_2171",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-035/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-035/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-036",
    "title": "Emerald & Diamond Vaddanam - A Timeless Expression of Bridal Elegance",
    "category": "waistbands",
    "original_type": "Belt",
    "materials": [
      "Crafted in high-purity gold with a Hyderabadi Polish. Adorned with sparkling Diamonds (17.90 carats",
      "3797 pieces)",
      "two brilliant-cut Rubies (4.70 carats)",
      "and eighteen vibrant Emeralds (15.82 carats). Features fifteen lustrous South Sea Pearls (55.75 carats)."
    ],
    "features": "This exquisitely crafted Vaddanam features a traditional belt design, meticulously embellished with floral and paisley motifs using pavé-set diamonds. Square-cut emeralds are interspersed throughout, adding a touch of regal charm. The delicate pearl drops lend a graceful, swaying movement. The craftsmanship reflects the legacy of Hyderabadi jewelry making, blending antique aesthetics with modern sparkle.",
    "colors": [
      "Radiant gold provides a warm backdrop for the dazzling diamonds",
      "vibrant emerald green",
      "deep ruby red",
      "and the soft",
      "creamy white of the South Sea pearls."
    ],
    "occasions": [
      "Perfect for bridal wear",
      "including Muhurtham (ముహూర్తం)",
      "Seemantham (సీమంతం)",
      "and other grand celebrations. Its versatility also makes it suitable for upscale contemporary events and formal gatherings."
    ],
    "description": "A heirloom-quality piece, this Vaddanam represents a significant investment in timeless beauty and cultural heritage. The combination of diamonds, emeralds, and pearls symbolizes prosperity, fertility, and good fortune. The exquisite craftsmanship ensures durability, making it a cherished possession for generations to come. The Hyderabadi Polish enhances the gold's luster, creating a captivating radiance.",
    "tags": [
      "Vaddanam",
      "Oddaanam",
      "Kamarband",
      "Diamond Belt",
      "Emerald",
      "Ruby",
      "South Sea Pearls",
      "Hyderabadi Jewelry",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Temple Jewelry",
      "Antique Finish",
      "Muhurtham",
      "Seemantham",
      "ఒడ్డాణం",
      "వడ్డాణం",
      "నడుము పట్టీ"
    ],
    "original_id": "sjpl_PHOTO-2024-05-22-11-18-03 2_2172",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-036/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-036/thumbnail.jpg",
    "cardtitle": "Emerald Diamond Waistband"
  },
  {
    "id": "waistbands-037",
    "title": "Diamond Vaddanam with Emerald Accents: A Regal Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted in 22K Gold and encrusted with brilliant-cut Diamonds and two pear-shaped Rubies totaling 4.52 carats. Features two emeralds totaling 6.01 carats",
      "enhancing the design. Finished with a smooth Hyderabadi polish for a lasting luster."
    ],
    "features": "This stunning Vaddanam showcases a traditional design with intricate floral and paisley motifs. The diamonds are meticulously pave-set to maximize brilliance. Emeralds add a regal touch to the design. It features a secure and adjustable clasp for comfortable wear. The design is reminiscent of classic temple jewelry, lending it an heirloom quality.",
    "colors": [
      "Predominantly white (diamonds) with vibrant green (emeralds) and the warm yellow of 22K gold. A timeless color palette that exudes sophistication."
    ],
    "occasions": [
      "Perfect for weddings (vivahaalu)",
      "bridal wear",
      "special occasions like Seemantham (baby shower)",
      "or half-saree functions (langa voni). Also suitable for grand receptions and cultural events where a statement piece is desired."
    ],
    "description": "This Vaddanam is a true testament to South Indian artistry. Its exquisite craftsmanship, combined with the brilliance of diamonds and the allure of emeralds, makes it a valuable heirloom piece. The classic design ensures it will remain a timeless treasure for generations. It's an investment in both beauty and cultural heritage, offering both security and traditional elegance.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Diamond Jewellery",
      "Emerald Jewelry",
      "22K Gold",
      "South Indian Jewelry",
      "Temple Jewelry",
      "Bridal Jewelry",
      "Hyderabadi Jewelry",
      "Wedding Jewelry",
      "Ottiyanam",
      "ఒడ్డాణం",
      "Seemantham",
      "Muhurtham",
      "Langa Voni",
      "Vivaahaalu",
      "Traditional Jewelry"
    ],
    "original_id": "sjpl_PHOTO-2024-05-22-11-18-03_2174",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-037/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-037/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-038",
    "title": "Diamond Floral Vaddanam - A Timeless Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "18K Yellow Gold base meticulously set with brilliant-cut Diamonds. Features genuine Ruby accent (0.84 carats)",
      "Emerald accents (4.66 carats)",
      "Pink Beads(3.82 carats) and Blue beads(26.32 carats). Hyderabadi Polish for lasting shine and durability."
    ],
    "features": "Intricate floral design with a central paisley motif. The entire Vaddanam is studded with diamonds. Features cascading drop earrings with Blue and Emerald beads, offering movement and a touch of vibrant color. Masterfully crafted in a delicate filigree style.",
    "colors": [
      "Predominantly white (diamonds) and gold (yellow gold)",
      "with vibrant accents of emerald green",
      "ruby pink",
      "and sapphire blue. A classic and auspicious color palette."
    ],
    "occasions": [
      "Perfect for weddings (Vivaaham)",
      "bridal wear",
      "Seemantham ceremonies",
      "or any grand celebration where a statement piece is desired. Adds a regal touch to traditional attire such as sarees and lehengas."
    ],
    "description": "This Diamond Vaddanam is a masterpiece of craftsmanship, blending traditional South Indian design with modern elegance. Its exquisite detailing and the use of genuine gemstones make it a cherished heirloom piece. A symbol of prosperity and beauty, it's a must-have for any discerning jewelry collector.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Telugu Jewelry",
      "Floral Design",
      "Emerald",
      "Ruby",
      "Diamonds",
      "Gold",
      "Hyderabadi Jewelry",
      "Seemantham",
      "Vivaaham",
      "Traditional Jewelry"
    ],
    "original_id": "sjpl_PHOTO-2024-05-22-11-18-04_2176",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-038/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-038/thumbnail.jpg",
    "cardtitle": "Diamond Floral Waistband"
  },
  {
    "id": "waistbands-039",
    "title": "The Emerald Peacock Vaddanam - A Regal Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold (916 Hallmark)",
      "Natural Diamonds (21.50 carats",
      "SI Clarity)",
      "Burmese Rubies (10.91 carats)",
      "Zambian Emerald (7.80 carats)",
      "South Sea Pearls (91.70 carats). Hyderabadi Polish for lasting shine."
    ],
    "features": "This stunning Vaddanam features intricate filigree work in a peacock motif, a symbol of beauty and royalty in South Indian culture. The central pendant showcases a vibrant Zambian Emerald. Small Burmese Rubies are set as the peacock's eyes and Diamonds are Pavé set. Dangles of genuine South Sea pearls add graceful movement. The piece reflects a classic Temple Jewelry design with a modern touch.",
    "colors": [
      "Primarily Gold with flashes of Emerald Green",
      "Ruby Red",
      "Diamond White",
      "and lustrous Pearl White."
    ],
    "occasions": [
      "Perfect for weddings",
      "Seemantham",
      "half-saree functions (Voni Function)",
      "and grand celebrations. This piece will become a family heirloom",
      "showcasing timeless elegance."
    ],
    "description": "This Vaddanam is a testament to exquisite craftsmanship and traditional South Indian design. The use of high-quality materials, including 22K gold, natural diamonds, Burmese rubies, Zambian emeralds, and South Sea pearls, ensures its enduring value. The intricate peacock design, a symbol of grace and prosperity, adds a unique cultural touch. Its weight and substantial feel signify luxury and quality.",
    "tags": [
      "Vaddanam",
      "Oddiyanam",
      "Waist Belt",
      "Indian Jewelry",
      "South Indian Jewelry",
      "Temple Jewelry",
      "Peacock Design",
      "Emerald",
      "Ruby",
      "Diamond",
      "Pearl",
      "22K Gold",
      "Hyderabadi Jewelry",
      "Seemantham",
      "Wedding Jewelry",
      "Bridal Jewelry",
      "Voni Function",
      "Filigree",
      "Nakshi Work",
      "Kasu Mala",
      "Jewellery",
      "Indian Fashion",
      "traditional"
    ],
    "original_id": "sjpl_PHOTO-2024-05-24-13-54-20 3_2191",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-039/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-039/thumbnail.jpg",
    "cardtitle": "Emerald Waistband"
  },
  {
    "id": "waistbands-040",
    "title": "Diamond & Emerald Vaddanam - The 'Indrani' Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Base metal in yellow gold finish. Features 1116 brilliant-cut diamonds (21.84 carats). Adorned with 6 oval-cut natural emeralds (6.82 carats) and 6 natural rubies (9.89 carats)."
    ],
    "features": "This exquisite Vaddanam showcases a traditional South Indian design with intricate floral and peacock motifs set within circular frames. The diamonds are pavé-set to maximize sparkle, creating a dazzling effect. The design incorporates traditional elements, and the entire piece is finished with delicate gold bead drops (gundu poppu design) for added elegance. The central motif features a stylized peacock, a symbol of grace and beauty.",
    "colors": [
      "Predominantly white (diamonds) and yellow (gold finish)",
      "with vibrant green (emeralds) and red (rubies) accents."
    ],
    "occasions": [
      "Perfect for weddings (Vivaha Mahotsavam)",
      "bridal wear",
      "Seemantham (baby shower)",
      "half-saree function (Voni Function)",
      "and other grand celebrations. Also suitable for upscale social events where a statement piece is desired."
    ],
    "description": "This Vaddanam is a masterpiece of craftsmanship, blending traditional South Indian aesthetics with contemporary diamond setting techniques. The high-quality diamonds and vibrant emeralds and rubies create a luxurious and eye-catching piece. The design, with its peacock motif and traditional elements, embodies the rich cultural heritage of Andhra Pradesh and Telangana. It's not just a piece of jewelry; it's an heirloom, to be cherished for generations.",
    "tags": [
      "Vaddanam",
      "Oddanam",
      "Waist Belt",
      "Diamond Belt",
      "Emeralds",
      "Rubies",
      "South Indian Jewelry",
      "Telugu Jewelry",
      "Traditional Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Hyderabadi Jewelry",
      "Indian Jewelry",
      "peacock",
      "Gundu Poppu",
      "Vivaha Mahotsavam",
      "Seemantham",
      "Voni Function"
    ],
    "original_id": "sjpl_PHOTO-2024-05-24-13-54-27 3_2194",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-040/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-040/thumbnail.jpg",
    "cardtitle": "Diamond Emerald Waistband"
  },
  {
    "id": "waistbands-041",
    "title": "The \"Mayura Bandham\" Diamond Vaddanam: A Timeless Masterpiece",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "Crafted with 159.400 grams of high-purity gold. Adorned with 16.18 carats (2295 pieces) of brilliant-cut diamonds",
      "4.59 carats of rubies (24 pieces)",
      "and 5.11 carats of Emeralds (2 pieces). Features a meticulous Hyderabadi polish",
      "ensuring a radiant and enduring shine."
    ],
    "features": "This Vaddanam showcases a stunning peacock (Mayura) design, a symbol of grace and beauty in South Indian culture. Intricately designed peacocks are set among floral motifs, all meticulously encrusted with diamonds. The center features a square-cut emerald, complemented by a pear-shaped emerald drop. The piece employs a pave setting for maximum diamond brilliance and features an antique finish to enhance the traditional aesthetic.",
    "colors": [
      "The color palette features the warm glow of gold",
      "the sparkling brilliance of white diamonds",
      "the rich green of emeralds",
      "and the fiery red of rubies – a traditionally auspicious combination."
    ],
    "occasions": [
      "Perfect for weddings (especially the muhurtham)",
      "Seemantham (baby shower)",
      "half-saree functions (Langa Voni ceremony)",
      "and other grand celebrations. Its timeless elegance also makes it a treasured heirloom piece for any special occasion."
    ],
    "description": "This Vaddanam is more than just jewelry; it's an investment in a piece of South Indian heritage. The combination of high-quality materials, expert craftsmanship, and traditional design makes it a truly exceptional piece. The peacock motif symbolizes beauty, prosperity, and good luck, making it a meaningful and auspicious addition to any jewelry collection. The durable construction and timeless design ensure it can be treasured for generations.",
    "tags": [
      "Vaddanam",
      "Oddaanam",
      "Waist Belt",
      "Diamond Jewelry",
      "Emerald",
      "Ruby",
      "Gold Jewelry",
      "South Indian Jewelry",
      "Temple Jewelry",
      "Hyderabadi Jewelry",
      "Indian Wedding Jewelry",
      "Traditional Jewelry",
      "Mayura",
      "Peacock",
      "ఒడ్డాణం",
      "బంగారు నగలు",
      "వజ్రాల నగలు"
    ],
    "original_id": "sjpl_PHOTO-2024-05-24-14-02-26 2_2197",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-041/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-041/thumbnail.jpg",
    "cardtitle": "Diamond Waistband"
  },
  {
    "id": "waistbands-042",
    "title": "Exquisite Gaja Lakshmi Vaddanam - A Regal Statement Piece",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold (916 Hallmark) with Hyderabadi Polish. Adorned with meticulously set Polki Diamonds of VVS clarity",
      "complemented by vibrant Burmese Rubies (4.90 carats) and Zambian Emeralds (4.82 carats)."
    ],
    "features": "Features the revered Gaja Lakshmi motif, symbolizing prosperity and abundance. Intricate floral and paisley designs crafted with exceptional attention to detail. The central emerald draws the eye, framed by a halo of shimmering diamonds. Features elephant designs, symbolizing royalty and grace.",
    "colors": [
      "Primarily gold with accents of deep red from the rubies and rich green from the emeralds",
      "creating a traditional and auspicious color palette."
    ],
    "occasions": [
      "Perfect for bridal wear",
      "Seemantham (baby shower)",
      "half-saree functions",
      "traditional Telugu weddings",
      "and other significant celebrations. Can also be worn as a statement piece for high-end cultural events."
    ],
    "description": "A testament to Hyderabad's rich jewelry heritage, this Vaddanam is a timeless heirloom. The combination of traditional motifs, exquisite craftsmanship, and high-quality gemstones makes it a truly valuable investment. It seamlessly blends tradition with modern elegance, making it a showstopper at any event.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Gaja Lakshmi",
      "Polki Diamonds",
      "Rubies",
      "Emeralds",
      "Temple Jewellery",
      "South Indian Jewellery",
      "Telugu Jewellery",
      "Bridal Jewellery",
      "Hyderabadi Jewellery",
      "Seemantham",
      "Wedding Jewellery",
      "Traditional Jewellery",
      "kamarpatta",
      "odiyanam",
      "indian wedding",
      "belly chain"
    ],
    "original_id": "sjpl_PHOTO-2024-05-24-14-02-26 5_2198",
    "collection": "sjpl",
    "imagePath": "/products/waistbands/waistbands-042/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-042/thumbnail.jpg",
    "cardtitle": "Exquisite Gaja Lakshmi"
  },
  {
    "id": "waistbands-043",
    "title": "Swarna Pushpa Vaddanam: Golden Floral Waist Belt",
    "category": "waistbands",
    "original_type": "Waist Belt",
    "materials": [
      "22K Gold (916 Gold)",
      "meticulously handcrafted with Hyderabadi Polish for a rich luster. The floral motifs are designed with embedded gold beads."
    ],
    "features": "This exquisite Vaddanam features intricate floral filigree work, a hallmark of traditional South Indian jewelry. Three large floral motifs act as centerpieces, each meticulously detailed. The design incorporates small gold danglers adding a subtle, playful element. Traditional flower designs like malli moggu are woven into the band.",
    "colors": [
      "Luminous yellow gold"
    ],
    "occasions": [
      "Perfect for weddings (Vivaha Mahotsavam)",
      "traditional dance performances (Kuchipudi",
      "Bharatanatyam)",
      "bridal wear",
      "Seemantham",
      "and other auspicious ceremonies where traditional attire is celebrated. Also suited for festive occasions like Sankranti and Ugadi."
    ],
    "description": "A timeless piece showcasing the rich heritage of South Indian craftsmanship. This Vaddanam is not just jewelry; it's an heirloom piece that can be passed down through generations. The detailed filigree work and radiant gold create a regal look, ensuring you stand out at any event. Made with high-quality 22K gold for lasting value and durability.",
    "tags": [
      "Vaddanam",
      "Waist Belt",
      "Gold Jewelry",
      "South Indian Jewelry",
      "Traditional Jewelry",
      "Bridal Jewelry",
      "Wedding Jewelry",
      "Indian Jewelry",
      "Filigree",
      "Nakshi Work",
      "Telugu Jewelry",
      "Hyderabadi Jewelry",
      "22K Gold",
      "Vivaha",
      "Seemantham",
      "Flower Design",
      "Swarna",
      "Malle Moggu",
      "Kamarband"
    ],
    "original_id": "vaddanam_diamonds_open-close_WhatsApp Image 2024-09-04 at 22.01.05_931aee68_2906",
    "collection": "vaddanam",
    "imagePath": "/products/waistbands/waistbands-043/image.jpg",
    "thumbnailPath": "/products/waistbands/waistbands-043/thumbnail.jpg",
    "cardtitle": "Golden Floral Waistband"
  }
]