{
  "id": "bangles-130",
  "title": "Radiant Rajkumari Kada: Ruby & Diamond Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold",
    "Natural Ruby (square cut)",
    "Natural Diamonds (single cut",
    "SI clarity). Features Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite kada boasts an openwork design with intricate detailing. The central piece showcases a vibrant, square-cut ruby held securely in a bezel setting. Surrounding the ruby are delicate diamond accents that accentuate the overall design. The bangle features a flexible hinge mechanism for ease of wear and a comfortable fit. Its design blends traditional South Indian artistry with a modern openwork style.",
  "colors": [
    "Predominantly yellow gold with the bold red of the ruby and the sparkling white of the diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "festivals (like Diwali",
    "Ugadi",
    "Sankranthi)",
    "anniversaries",
    "or as a statement piece for a special occasion. This would also be a stunning accessory for a formal event or a modern Indian ensemble."
  ],
  "description": "This kada is a true heirloom piece that seamlessly blends tradition and modernity. The high purity gold ensures lasting value, while the intricate design and vibrant gemstones make it a statement accessory. The Hyderabadi polish enhances the gold's natural luster, ensuring it remains captivating for generations. The classic design makes it a versatile investment that transcends fleeting trends.",
  "tags": [
    "Bangle",
    "Kada",
    "Ruby",
    "Diamond",
    "22K Gold",
    "Vanki",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Rajkumari",
    "Indian Bangle",
    "Gemstone Bangle",
    "Bridal Jewelry",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0296_0493",
  "collection": "diamond"
}