{
  "id": "necklaces-461",
  "title": "Emerald and Diamond Floral Pendant Haaram - Adorable Vaddanam Style",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (approximately 49.860 g)",
    "brilliant-cut Diamonds (approximately 4.26 carats)",
    "Oval-cut Emeralds (approximately 5.72 carats total weight)",
    "Round-cut Rubies (approximately 8.61 carats total weight) South Sea Pearl (approximately 7.60 carats). Hyderabadi Polish."
  ],
  "features": "This exquisite haaram features a delicate floral design with interwoven diamond-studded heart shapes. Centered on the necklace are two oval shaped emeralds and two round cut rubies in the floral design. The pendant showcases a larger pear-shaped Emerald encompassed in a diamond and floral design, finishing with a dangling South Sea pearl at the bottom. The openwork design allows light to play beautifully with the gemstones, enhancing their brilliance.",
  "colors": [
    "Primarily Gold and White (Diamonds)",
    "vibrant Green (Emeralds)",
    "red (Rubies) and creamy white pearl"
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "engagements",
    "or any special occasion where you desire a touch of contemporary elegance and traditional charm. Suitable for modern brides or as a statement piece for celebratory events."
  ],
  "description": "A seamless blend of tradition and modernity. The floral design with a South Sea pearl is a classic symbol of beauty, prosperity, and new beginnings. The impeccable Hyderabadi craftsmanship guarantees lasting value and brilliance. The unique design makes it a valuable addition to any fine jewelry collection and a perfect heirloom piece.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Pearl",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Vivaha",
    "Engagement",
    "Floral Design",
    "Fine Jewelry",
    "Telugu Jewelry",
    "Tradition",
    "Contemporary",
    "Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-52-1_0924",
  "collection": "diamond"
}