{
  "id": "bangles-109",
  "title": "Vasundhara Kundan Kangan Set: Mint Green & Diamond Radiance",
  "category": "bangles",
  "original_type": "Bangles",
  "materials": [
    "22K Gold (916 Gold Purity)",
    "High-Quality Kundan Stones",
    "Polki Diamonds (Uncut Diamonds)",
    "Mint Green Enamel. Features a signature Hyderabadi Polish for lasting brilliance."
  ],
  "features": "These exquisite Kangans showcase the timeless beauty of Kundan craftsmanship. Each bangle features meticulously set Polki diamonds nestled within a frame of lustrous 22K gold and delicate mint green enamel. The square-shaped Kundan stones are arranged in a symmetrical pattern, creating a regal and sophisticated look. The gold framework exhibits fine detailing, indicative of traditional South Indian jewelry-making techniques. The bangle has been crafted with a secure hinged clasp for easy wear and a comfortable fit.",
  "colors": [
    "Predominantly Gold",
    "Mint Green",
    "and White (from the Polki diamonds). This color palette is perfect for adding a touch of understated elegance to any outfit."
  ],
  "occasions": [
    "Ideal for weddings (Vivaham)",
    "receptions",
    "festivals (like Diwali",
    "Sankranthi)",
    "and other special occasions. Perfect for brides (Vadhuvu) seeking traditional yet stylish jewelry. Also suitable for evening wear",
    "cultural events",
    "or to add a touch of opulence to everyday outfits."
  ],
  "description": "This Kangan set is a perfect blend of traditional craftsmanship and modern aesthetics. The use of high-quality Kundan stones and Polki diamonds ensures lasting brilliance and value. The mint green enamel adds a unique touch, setting it apart from typical Kundan jewelry. The secure clasp and comfortable fit make it ideal for all-day wear. Its durable construction ensures it will be a treasured heirloom for generations to come. The inherent value of the gold and gemstones makes this a sound investment piece.",
  "tags": [
    "Kundan Bangles",
    "Polki Diamonds",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Kangan",
    "Chudiyan",
    "22K Gold",
    "Indian Wedding Jewelry",
    "Ethnic Jewelry",
    "Traditional Jewelry",
    "Vadhuvu Jewelry",
    "Vivaham",
    "Seemantham",
    "Mint Green",
    "Kundan",
    "Gold Bangles",
    "Diamond Bangles",
    "Indian Bangles",
    "Ethnic Bangles"
  ],
  "original_id": "diamond_jewellery_aba7b83e-79ad-4a0f-99dc-b1b626d5d6c1_0179",
  "collection": "diamond"
}