{
  "id": "necklaces-1489",
  "title": "Emerald and Diamond Grand Haaram - Manoharini Collection",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold",
    "meticulously set with brilliant-cut Diamonds (VS clarity",
    "G-H color) and vibrant Zambian Emeralds (AA quality). Features Hyderabadi Polish for a lasting luster and premium finish."
  ],
  "features": "This exquisite Haaram features a cascading floral design, inspired by traditional South Indian motifs. The intricate diamond settings highlight the central Zambian Emeralds. The pendant showcases a modern heart-shaped design, surrounded by diamonds and complemented with traditional gold bead dangles. This piece seamlessly blends modern design with traditional South Indian artistry, reflecting both heritage and contemporary elegance.",
  "colors": [
    "Primarily white (diamonds)",
    "complemented by the rich green of the Zambian Emeralds and the warm yellow of the 18K gold."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (Vivaha Mahotsavam)",
    "receptions",
    "Seemantham ceremonies",
    "and upscale cultural events. Also suitable for milestone birthdays and anniversaries where a statement piece is desired."
  ],
  "description": "This Grand Haaram is more than just jewelry; it is an heirloom. The superior craftsmanship, high-quality diamonds and emeralds, and the unique blend of traditional and modern designs make it a treasured investment. The Hyderabadi Polish ensures lasting brilliance and durability. Its timeless elegance makes it perfect for passing down through generations.",
  "tags": [
    "Haaram",
    "Necklace",
    "Diamond Jewelry",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Muhurtham Jewelry",
    "Hyderabadi Jewelry",
    "Gold Necklace",
    "Zambian Emerald",
    "Grand Necklace",
    "Traditional Jewelry",
    "Bridal Jewelry",
    "Seemantham",
    "Vivaha Mahotsavam",
    "Contemporary Jewelry",
    "Telugu Jewelry",
    "Andhra Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-46-46 3_2107",
  "collection": "sjpl"
}