{
  "id": "bangles-091",
  "title": "Elegant Ruby & Diamond Kada - A Timeless Treasure",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold with Hyderabadi Polish. Features a central Oval-cut Ruby of approximately 1.5 carats with excellent color saturation. Adorned with brilliant-cut diamonds (VS clarity",
    "G-H color)",
    "estimated at 0.75 carats total weight."
  ],
  "features": "This exquisite Kada features an intricate filigree design meticulously handcrafted by our skilled artisans. The central ruby is set in a bezel setting surrounded by a halo of diamonds. The openwork design showcases delicate floral motifs and geometric patterns. The 'Hyderabadi Polish' gives the gold a rich, antique finish.",
  "colors": [
    "Primary: Gold (warm yellow). Gemstones: Deep Red Ruby",
    "White Diamonds."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements",
    "festivals (like Diwali",
    "Sankranti)",
    "or any special occasion where you want to make a statement. Also a beautiful gift for anniversaries or birthdays."
  ],
  "description": "This Kada is a blend of traditional craftsmanship and contemporary design. The vibrant ruby symbolizes passion and prosperity, while the sparkling diamonds add a touch of elegance and sophistication. The Hyderabadi polish enhances the antique look and ensures that this piece will be treasured for generations. Its robust design ensures durability without compromising on aesthetic appeal. The openwork design makes it surprisingly lightweight and comfortable to wear.",
  "tags": [
    "Kada",
    "bangle",
    "ruby",
    "diamond",
    "gold",
    "22K gold",
    "Hyderabadi jewelry",
    "Indian jewelry",
    "South Indian jewelry",
    "antique jewelry",
    "vivaha",
    "diwali",
    "sankranti",
    "traditional jewelry",
    "filigree",
    "gemstones"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0359_0019",
  "collection": "bracelets"
}