{
  "id": "necklaces-176",
  "title": "The 'Mayura Harini' Polki Diamond and Emerald Haaram: A Regal Statement",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds",
    "Natural Emerald",
    "Hyderabadi Polish. The Emerald is a stunning square-cut",
    "showcasing a rich",
    "saturated green hue. Diamonds are carefully selected for their brilliance",
    "albeit uncut",
    "adding to the antique charm."
  ],
  "features": "This majestic haaram features a captivating central pendant showcasing a large, square-cut natural Emerald. The pendant is embellished with two gracefully designed peacock motifs (Mayura), crafted from Polki diamonds. The neckpiece is a delicate but ornate chain of polkis set in gold, creating a seamless transition to the showstopping pendant. The overall design speaks of a traditional South Indian aesthetic, elevated with modern elegance.",
  "colors": [
    "Predominantly gold with the bright green of the Emerald and the shimmering white of Polki Diamonds. The Hyderabadi polish lends a warm",
    "antique gold tone."
  ],
  "occasions": [
    "Perfect for grand occasions like weddings (vivaha)",
    "receptions",
    "or traditional South Indian ceremonies like Seemantham",
    "Voni function (Half-Saree ceremony). It can also be styled with contemporary outfits for a touch of regal elegance."
  ],
  "description": "This haaram is a masterpiece of craftsmanship, blending traditional South Indian design with a touch of modern sophistication. The use of uncut Polki diamonds lends a unique, antique charm, while the large, high-quality emerald ensures it will be a cherished heirloom for generations. Its traditional symbolism and regal design make it a valuable investment piece. The peacock is auspicious.",
  "tags": [
    "Haaram",
    "Necklace",
    "Polki Diamond",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Temple Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Seemantham",
    "Vivaha",
    "Voni",
    "Mayura",
    "Peacock",
    "Antique Jewelry",
    "Heritage Jewelry",
    "Statement Necklace"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0016_0425",
  "collection": "diamond"
}