{
  "id": "necklaces-702",
  "title": "Emerald Cascade Necklace: A Timeless Haaram for Every Celebration",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Fine Quality Emeralds (Oval Cut)",
    "Sparkling Cubic Zirconia",
    "meticulously hand-set. Features a Hyderabadi Polish for a lasting luster and antique appeal."
  ],
  "features": "This elegant Haaram features a unique cascade design with alternating emeralds and CZ stones along the chain. The pendant showcases a central pear-shaped emerald surrounded by intricate CZ detailing and delicate gold beaded drops. The design blends traditional South Indian aesthetics with a modern sensibility. Features an intricate leaf-like design between the gemstones and cascading CZ stones.",
  "colors": [
    "Dominantly gold with vibrant green emerald accents and the dazzling brilliance of white CZ stones. This is a classic and auspicious color combination."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "receptions",
    "festive occasions like Diwali and Sankranthi",
    "or formal events. Also suitable for modern parties",
    "engagement functions",
    "or any celebration where you want to exude sophistication and grace."
  ],
  "description": "This Haaram is a stunning statement piece that expertly blends tradition and modernity. The high-quality emeralds and meticulous craftsmanship ensure both beauty and durability. The Hyderabadi polish enhances the gold's natural luster and ensures a lasting heirloom quality. Its versatile design makes it perfect for both traditional and contemporary wear.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "CZ",
    "Diamond",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Hyderabadi Jewelry",
    "Temple Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Engagement",
    "Vivaha",
    "Function Jewellery",
    "emerald necklace",
    "diamond necklace",
    "gold necklace"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-55_1208",
  "collection": "diamond"
}