{
  "id": "necklaces-158",
  "title": "Rajasi Ruby Bead Haaram with Polki Diamond Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Polki Diamonds (Uncut Diamonds)",
    "Oval Cabochon Emerald",
    "Ruby Beads",
    "Freshwater Pearls. Hyderabadi Polish."
  ],
  "features": "This exquisite Haaram features five strands of vibrant ruby beads held together by intricately crafted gold elephant motifs adorned with Polki diamonds and small emerald beads. The pendant is a masterpiece of Polki diamond setting, arranged in a floral design around a striking oval cabochon emerald. The pendant base features two gold peacocks facing each other. Ruby and pearl drops add a touch of whimsy. The piece showcases a traditional closed setting typical of antique Polki jewelry.",
  "colors": [
    "Predominantly ruby red",
    "emerald green",
    "pearl white",
    "and antique gold."
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu - వివాహాలు)",
    "engagement ceremonies ( நிச்சயதார்த்தம்)",
    "Seemantham (శీమంతం)",
    "and other grand celebrations. Also suitable for high-end social events and milestone celebrations."
  ],
  "description": "This Haaram is a testament to timeless South Indian craftsmanship. The Polki diamonds, with their unique uncut charm, create a regal look. The ruby beads symbolize prosperity and passion, while the emerald signifies good health and fortune. The entire piece represents a harmonious blend of tradition, luxury, and auspicious symbolism. It is a valuable addition to any heirloom collection.",
  "tags": [
    "Haaram",
    "Kanthahara",
    "Polki Diamond",
    "Ruby Beads",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Antique Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Jewelry",
    "Fine Jewelry",
    "Ethnic Jewelry",
    "Heirloom Jewelry",
    "వివాహాలు",
    "కంఠహారము"
  ],
  "original_id": "diamond_jewellery_DPPD8-664_0391",
  "collection": "diamond"
}