{
  "id": "necklaces-713",
  "title": "Enchanting Emerald & Diamond Nakshi Haaram - Bridal Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish. Features Zambian Emeralds (faceted pear and round cut",
    "VS clarity)",
    "and brilliant-cut Cubic Zirconia (CZ) meticulously set in a pavé style. The gold exhibits a fine meshwork."
  ],
  "features": "This modern Haaram showcases a delicate balance of traditional and contemporary design. The main pendant features a cascading floral motif studded with CZ and anchored by a central pear-shaped Emerald. Round emerald beads delicately adorn the neckline adding color and dimension. The pendant dangles incorporate gold beads, a modern adaptation of traditional *guttapusalu* elements. The Nakshi-inspired work frames the stone adding a touch of traditional craftsmanship to a modern design.",
  "colors": [
    "Dominantly gold with vibrant green Emerald accents and sparkling clear CZ stones. A sophisticated and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for weddings (Vivaaham)",
    "engagements (Nischitartham)",
    "Receptions",
    "Seemantham (baby shower)",
    "and other festive occasions. Its modern design also allows for styling at upscale parties and formal gatherings."
  ],
  "description": "This Haaram is a stunning fusion of traditional South Indian artistry and modern design sensibilities. The use of high-quality Zambian Emeralds and glittering CZ stones provides a luxurious look without the premium price point of natural diamonds. The intricate Nakshi work and meticulous detailing showcase the exceptional craftsmanship synonymous with Hyderabad's jewelry heritage. A versatile piece designed for both traditional and contemporary events. Its bold design makes this *కంఠాభరణం*  a statement piece that will be cherished for years to come.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Zambian Emerald",
    "CZ",
    "Cubic Zirconia",
    "Gold",
    "22K Gold",
    "Hyderabad Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Bridal Jewelry",
    "Wedding Necklace",
    "Statement Necklace",
    "Contemporary Jewelry",
    "Nakshi",
    "కంఠాభరణం",
    "Vivaaham",
    "Seemantham",
    "Engagement"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-59_1219",
  "collection": "diamond"
}