{
  "id": "necklaces-363",
  "title": "Emerald & Diamond Navratna Neckpiece - A Timeless Classic",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold",
    "featuring brilliant-cut Diamonds (VVS Clarity",
    "E-F Color) and Heart-Shaped Emeralds. This piece is adorned with our signature Hyderabadi Polish",
    "ensuring a lasting luster and radiant glow."
  ],
  "features": "This exquisite necklace features delicate floral and paisley motifs, meticulously studded with diamonds. The pendant elements consist of 10 heart-shaped emeralds throughout the choker. The design is a modern take on traditional South Indian patterns, combining contemporary elegance with timeless appeal.",
  "colors": [
    "The necklace showcases a rich gold hue complemented by the dazzling brilliance of white diamonds and the vibrant green of the emeralds",
    "creating a harmonious and eye-catching color palette."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings",
    "receptions",
    "anniversaries",
    "or any event where you want to make a statement. Its versatile design also makes it suitable for modern parties and formal gatherings."
  ],
  "description": "This neckpiece is a testament to exceptional craftsmanship, blending traditional South Indian artistry with modern design sensibilities. The combination of high-quality diamonds and vibrant emeralds creates a mesmerizing effect, making it a truly unique and valuable addition to your jewelry collection. Invest in a piece that exudes elegance and sophistication, a true reflection of your impeccable taste.",
  "tags": [
    "Necklace",
    "Choker",
    "Diamond Necklace",
    "Emerald",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Party Wear",
    "Fine Jewelry",
    "Navratna",
    "Telugu Jewelry",
    "Diamonds",
    "Emeralds",
    "Special Occasion",
    "Traditional Jewelry",
    "Statement Piece"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0477_0659",
  "collection": "diamond"
}