{
  "id": "necklaces-233",
  "title": "Lakshmi Kasula Haaram with Kempu Stone Pendant",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "Natural Corals (ప్రవాళం)",
    "Kempu Stones",
    "Cubic Zirconia (CZ)",
    "Green Onyx Accent. Features a radiant Hyderabadi Polish for unparalleled luster."
  ],
  "features": "This Kasula Haaram showcases a meticulously crafted pendant featuring a traditional floral motif design encrusted with brilliant CZ stones and a central kempu stone. The necklace is adorned with graduated rows of CZ stones interspersed with vibrant coral beads (ప్రవాళం పూసలు). Delicate gold ball drops (గుండ్ల పేరు) add a touch of traditional elegance. The intricate craftsmanship is a testament to the skilled artisans of Hyderabad.",
  "colors": [
    "Gold",
    "Coral Red",
    "Ruby Red (Kempu)",
    "Green (Onyx)",
    "Diamond White (CZ)"
  ],
  "occasions": [
    "Ideal for weddings (వివాహాలు)",
    "engagements (నిశ్చితార్థం)",
    "festive occasions like Sankranthi (సంక్రాంతి)",
    "Diwali (దీపావళి)",
    "or any special celebration. This statement piece will enhance your presence at any grand event."
  ],
  "description": "This exquisite Kasula Haaram blends traditional South Indian design with contemporary elegance. The use of natural corals and Kempu stones adds a touch of authenticity and cultural significance. The Hyderabadi polish ensures lasting brilliance, making it a valuable investment. It symbolizes prosperity and auspicious beginnings, perfect for heirloom status.",
  "tags": [
    "Kasula Haaram",
    "Necklace",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Kempu Stone",
    "Coral",
    "Hyderabadi Jewelry",
    "Indian Wedding Jewelry",
    "వివాహం",
    "కాసుల పేరు",
    "ప్రవాళం",
    "బంగారు నెక్లెస్",
    "jewellery",
    "bridal jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0313_0510",
  "collection": "diamond"
}