{
  "id": "necklaces-194",
  "title": "Polki Diamond Raani Haaram - The Royal Heirloom",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold",
    "Uncut Polki Diamonds (VVS Clarity",
    "Rose Cut)",
    "Hyderabadi Polish"
  ],
  "features": "A magnificent two-layered Raani Haaram featuring intricately set, organically shaped Polki diamonds. Each diamond is carefully chosen and hand-set in a closed setting (kundan style) to maximize brilliance. The pear-shaped pendant drops add a touch of elegance and movement. The gold is finished with a traditional Hyderabadi polish, giving it a warm, antique luster. The piece reflects the traditional Golconda diamond jewelry heritage.",
  "colors": [
    "Warm Yellow Gold",
    "Sparkling White Polki Diamonds"
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings (Muhurtham)",
    "receptions",
    "and significant cultural celebrations like Seemantham or a Half-Saree Function. Also suitable as a statement piece for high-end modern events."
  ],
  "description": "This Raani Haaram is a testament to timeless elegance and superior craftsmanship. The use of uncut Polki diamonds, a hallmark of South Indian royalty, lends a unique and opulent touch. The Hyderabadi polish enhances the gold's richness and creates a vintage feel. As an heirloom piece, it can be passed down through generations, carrying with it the legacy of your family. Each Polki diamond has its own unique characteristics. Owning a piece of such quality elevates personal style and status and showcases a deep appreciation for traditional craftsmanship.",
  "tags": [
    "Raani Haaram",
    "Polki Diamond Necklace",
    "Uncut Diamonds",
    "Kundan Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Traditional Necklace",
    "Hyderabadi Jewelry",
    "Wedding Necklace",
    "Heirloom Jewelry",
    "Kanthahaaram",
    "కంఠహారం",
    "Golconda Diamonds",
    "Antique Finish",
    "Indian Bridal Jewelry"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0041_0449",
  "collection": "diamond"
}