{
  "id": "necklaces-278",
  "title": "The Lakshmi Kantha Haaram: A Symphony of Diamonds, Rubies, and Emeralds",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 22K Gold with Hyderabadi Polish. Features brilliant-cut Diamonds (VVS clarity",
    "G color)",
    "Pigeon Blood Rubies (oval cut)",
    "and a Zambian Emerald (pear cut). The piece exemplifies superior gold craftsmanship."
  ],
  "features": "This Haaram features a delicate arrangement of diamond-studded floral motifs, accentuated by vibrant Rubies and Emeralds. The central pendant showcases a stunning Zambian Emerald, adding a touch of regal elegance. The side elements features small danglers to complete the look. Features a contemporary design that honors South Indian jewellery traditions.",
  "colors": [
    "Primarily gold with dazzling white diamonds",
    "complemented by rich red rubies and a deep green emerald. A classic South Indian color palette with a modern twist."
  ],
  "occasions": [
    "Perfect for weddings",
    "receptions",
    "and other special occasions. Ideal for the modern bride who appreciates tradition",
    "or for festive celebrations like Ugadi and Sankranthi."
  ],
  "description": "This Lakshmi Kantha Haaram seamlessly blends traditional South Indian aesthetics with modern design sensibilities. The piece is a testament to superior craftsmanship, using only the finest materials. The contrasting gemstone colors create a visually stunning and culturally relevant piece. It's a timeless investment that you can wear with pride and pass down through generations. The traditional colors bring prosperity and health.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Ruby",
    "Emerald",
    "South Indian Jewellery",
    "Temple Jewellery",
    "Hyderabadi Polish",
    "22K Gold",
    "Wedding Jewellery",
    "कंठाभरणम्",
    "Traditional Jewellery",
    "Modern Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0361_0558",
  "collection": "diamond"
}