{
  "id": "necklaces-193",
  "title": "Polki Diamond & Emerald Jadau Haaram - A Timeless Legacy",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Yellow Gold (సువర్ణం)",
    "Uncut Polki Diamonds",
    "Zambian Emerald. Crafted with traditional Jadau setting techniques unique to Hyderabadi craftsmanship. Gold features a radiant",
    "hand-burnished finish."
  ],
  "features": "This exquisite Haaram showcases a double-stranded design adorned with meticulously set Polki diamonds in a Jadau style. The necklace features square diamond pendants suspended elegantly, leading to a central floral pendant showcasing a vibrant Zambian Emerald. The uncut diamonds are bezel-set, enhancing their natural brilliance. This piece embodies the grandeur of traditional South Indian jewelry design.",
  "colors": [
    "Primarily gold with a vibrant green center from the Emerald",
    "contrasted by the bright white shimmer of the Polki diamonds."
  ],
  "occasions": [
    "Ideal for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "Seemantham (సీమంతం)",
    "or any grand celebratory occasion where a touch of heritage and elegance is desired. Perfect for brides seeking a traditional yet opulent look or to elevate any modern event."
  ],
  "description": "This Jadau Polki Haaram represents a legacy of South Indian craftsmanship. Each Polki diamond is unique, telling its own story. The Zambian Emerald adds a pop of color and symbolizes prosperity and good fortune. The Jadau setting ensures that the diamonds are secure and the piece is comfortable to wear. A true heirloom piece to be passed down through generations.",
  "tags": [
    "Haaram",
    "Polki Diamonds",
    "Jadau Jewelry",
    "Emerald",
    "South Indian Jewelry",
    "Bridal Necklace",
    "Wedding Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Kanthabharanam",
    "పెళ్లి నెక్లెస్",
    "సీమంతం నెక్లెస్",
    "నిశ్చితార్థం నెక్లెస్",
    "కంఠాభరణం"
  ],
  "original_id": "diamond_jewellery_IMG-20240905-WA0039_0447",
  "collection": "diamond"
}