{
  "id": "necklaces-1132",
  "title": "Antique Polki Diamond Guttapusalu Haaram - Timeless Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 purity)",
    "Uncut Polki Diamonds (Rose Cut)",
    "featuring Guttapusalu inspired pearl embellishments. Expertly crafted with Hyderabadi Polish for a lasting luster."
  ],
  "features": "This exquisite haaram showcases a traditional design with Polki diamonds set in a closed setting, highlighting the natural beauty of the uncut diamonds. The guttapusalu inspired design incorporates pearl drops, reminiscent of traditional Telugu jewelry. Features intricate Nakshi work detailing around each diamond setting. The center pendant is a captivating teardrop shape, adding a touch of regal charm.",
  "colors": [
    "Primarily golden hue from the 22K gold",
    "complemented by the sparkling white of the Polki diamonds and the soft luster of pearls. Offers a vintage",
    "antique aesthetic."
  ],
  "occasions": [
    "Perfect for traditional Telugu weddings (Pendli)",
    "Seemantham ceremonies",
    "half-saree functions (Voni function)",
    "and grand festive occasions like Diwali and Dussehra. Also suitable for upscale social gatherings and cultural events."
  ],
  "description": "A timeless heirloom piece that blends traditional South Indian design with the inherent beauty of Polki diamonds. The Hyderabadi Polish ensures a long-lasting shine and durability. Symbolizes prosperity and good fortune. The guttapusalu inspired design adds a touch of classical grace, making it a valuable addition to any jewelry collection.",
  "tags": [
    "Haaram",
    "Polki Diamond",
    "Guttapusalu",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Antique Jewelry",
    "Wedding Jewelry",
    "Bridal Necklace",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Pendli",
    "Seemantham",
    "Voni Function",
    "Traditional Necklace",
    "uncut diamonds"
  ],
  "original_id": "radhe_diam_IMG-20240905-WA0030_2546",
  "collection": "radhe"
}