{
  "id": "necklaces-1474",
  "title": "Vaishnavi Emerald & Diamond Nakshi Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish. Features meticulously selected Zambian Emeralds with exceptional clarity and vibrant green hue",
    "complemented by brilliant-cut",
    "VS clarity Diamonds. Hallmark certification ensures gold purity and quality."
  ],
  "features": "This exquisite Haaram showcases a fusion of traditional Nakshi work and modern design sensibilities. The centerpiece pendant features a stunning emerald surrounded by intricate diamond-studded filigree. Delicate gold 'guttapusalu' (pearl-like beads) dangle gracefully, adding a touch of classic South Indian charm. The necklace is designed for comfort and elegance, with a flexible gold chain.",
  "colors": [
    "Predominantly gold with vibrant emerald green accents and sparkling white diamonds. The warm gold tone enhances the richness of the emeralds and the brilliance of the diamonds",
    "a classic and timeless color palette."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (vivaham)",
    "receptions",
    "engagements",
    "and milestone celebrations like seemantham or a half-saree function (langa voni function). Its versatile design also makes it suitable for upscale social gatherings and formal events."
  ],
  "description": "This Haaram is more than just jewelry; it's an heirloom piece representing the rich cultural heritage of South India. The combination of traditional Nakshi craftsmanship, ethically sourced Zambian Emeralds, and high-quality diamonds makes it a valuable investment. The Hyderabadi polish ensures a lasting luster and enhances the overall appeal. Its blend of traditional and contemporary design allows it to be cherished for generations to come. The flexible design ensures comfort and ease of wear.",
  "tags": [
    "Haaram",
    "Necklace",
    "Emerald",
    "Diamond",
    "Gold",
    "22K Gold",
    "Nakshi",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Zambian Emerald",
    "guttapusalu",
    "Vivaham",
    "kanthabharanam",
    "కంఠాభరణం",
    "పెళ్లి నగలు",
    "Wedding Jewelry",
    "Heirloom Jewelry",
    "Fine Jewelry"
  ],
  "original_id": "sjpl_PHOTO-2024-05-18-12-40-58_2092",
  "collection": "sjpl"
}