{
  "id": "necklaces-803",
  "title": "Enchanting Floral Zircon Haaram with Pink Sapphires and Pearls",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Base metal coated with Gold finish. Embellished with high-quality Zircon stones",
    "Pink Sapphire stones and South Sea Pearls. Hyderabadi Polish for enhanced shine and durability."
  ],
  "features": "Intricate floral design with layered petals encrusted with sparkling Zircons. Delicate Pink Sapphire accents add a touch of romantic color. Lustrous South Sea Pearls are strategically placed to enhance the necklace's elegance and movement. Features a central floral pendant with a suspended pearl. Modern design inspired by traditional floral motifs.",
  "colors": [
    "Predominantly Gold and White",
    "with soft Pink accents from the Sapphires and creamy white Pearls. The interplay of colors creates a visually stunning effect."
  ],
  "occasions": [
    "Perfect for modern receptions",
    "sangeeth ceremonies",
    "cocktail parties",
    "and high-end social gatherings. A sophisticated choice for women who appreciate contemporary jewelry with a hint of tradition. Can also be worn as bridal jewelry for a modern bride."
  ],
  "description": "Combines the timeless beauty of floral design with the brilliance of high-quality Zircons and the elegance of South Sea Pearls. The Hyderabadi Polish ensures lasting shine and durability. Its contemporary design makes it a versatile piece that can be paired with both traditional and modern attire. A true statement piece that will elevate any outfit.",
  "tags": [
    "Necklace",
    "Haaram",
    "Zircon",
    "Pink Sapphire",
    "Pearls",
    "Floral",
    "Hyderabad Jewelry",
    "Contemporary Jewelry",
    "Statement Necklace",
    "Party Wear",
    "Reception Jewelry",
    "Bridal Jewelry",
    "South Indian Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-49 3_1396",
  "collection": "diamond"
}