{
  "id": "necklaces-595",
  "title": "Elegant Lakshmi Kasu Mangalsutra - A Timeless Token of Love",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18K Rose Gold",
    "featuring high-quality Black Onyx beads. The Lakshmi Kasu pendants are adorned with dazzling Cubic Zirconia (CZ) stones."
  ],
  "features": "This exquisite mangalsutra showcases a delicate strand of black onyx beads interspersed with 18k rose gold accents. The centerpiece is a series of meticulously crafted Lakshmi Kasu pendants, each showcasing a finely detailed depiction of the Goddess Lakshmi, set with shimmering Cubic Zirconia stones. The piece boasts a modern take on traditional kasu mala designs.",
  "colors": [
    "Primarily black and rose gold",
    "with the brilliance of clear Cubic Zirconia stones adding a touch of sparkle. The rose gold provides a warm",
    "contemporary contrast to the classic black beads."
  ],
  "occasions": [
    "Perfect for daily wear or special occasions",
    "from traditional Telugu weddings (Pendli) and festivals like Diwali or Ugadi",
    "to modern events and anniversaries. A cherished gift for brides (vadhu) and married women (sumangali)."
  ],
  "description": "This mangalsutra seamlessly blends tradition with contemporary design. The Lakshmi Kasu pendants bring auspicious blessings, while the rose gold and CZ stones offer a modern touch. Lightweight and comfortable for everyday wear, this piece is a durable and meaningful symbol of love and commitment. The intricate details showcase exceptional craftsmanship, making it a treasured addition to any jewelry collection.",
  "tags": [
    "Mangalsutra",
    "Telugu Jewelry",
    "South Indian Jewelry",
    "Kasu Mala",
    "Lakshmi",
    "Rose Gold",
    "Black Onyx",
    "Cubic Zirconia",
    "Traditional Jewelry",
    "Aadunika Bharanala",
    "Pendli",
    "Sumangali",
    "Gift for Bride",
    "Diwali",
    "Ugadi"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-04-26-13-41-21 2_1082",
  "collection": "diamond"
}