{
  "id": "earrings-515",
  "title": "Emerald Kundan Chandbali Jhumka - A Timeless Treasure",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold with Hyderabadi Polish",
    "Emerald Cabochon (approx. 5 carats each)",
    "Polki Diamonds (untreated diamonds)",
    "and brilliant cut diamonds accents. Sourced from the finest mines",
    "each gemstone has been meticulously selected for its exceptional quality and vibrancy."
  ],
  "features": "These elegant Kundan Chandbali Jhumkas showcase the exquisite craftsmanship of Hyderabad's artisans. The centerpiece is a vibrant Emerald Cabochon, surrounded by intricate Polki diamond setting and a halo of brilliant cut diamonds, all meticulously set in 22K gold. The earrings are designed in a chandbali shape with dangling Polki Diamond drops, adding a traditional touch. The open setting allows light to illuminate the gems, enhancing their brilliance. The design blends traditional Mughal and Telugu influences.",
  "colors": [
    "Emerald Green",
    "Golden Yellow (Gold)",
    "and Sparkling White (Diamonds)"
  ],
  "occasions": [
    "Perfect for weddings (పెళ్లి)",
    "engagements (నిశ్చితార్థం)",
    "festivals (పండుగలు)",
    "traditional South Indian ceremonies like Seemantham",
    "and even adding a touch of elegance to modern cocktail parties or formal events."
  ],
  "description": "This piece is a true heirloom. The use of high-quality 22K gold ensures lasting value and durability. The vibrant Emerald Cabochon and Polki diamond work represent prosperity and good fortune, making it a meaningful gift for a loved one or a cherished addition to your own collection. The Hyderabadi craftsmanship guarantees a unique and exquisite piece of jewelry that will be admired for generations.",
  "tags": [
    "Kundan Jhumka",
    "Chandbali",
    "Emerald",
    "Polki Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Hyderabadi Jewelry",
    "Traditional Earrings",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "చెవి దిద్దులు",
    "కుందన్ జుంకా",
    "పచ్చ",
    "పాలికి వజ్రాలు",
    "పెళ్లి నగలు",
    "నిశ్చితార్థం నగలు"
  ],
  "original_id": "ear_rings_DPER8-974_2658",
  "collection": "ear"
}