{
  "id": "earrings-676",
  "title": "Enchanting 'Pooja' Diamond Jhumka Earrings with South Sea Pearl",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "18K Rose Gold",
    "South Sea Pearls (Moti)",
    "Round Brilliant Cut Diamonds",
    "Marquise Cut Sapphires (Pink",
    "Yellow and Grey)",
    "Round Brilliant Cut Blue Stone. Hyderabadi Polish for lasting luster."
  ],
  "features": "These exquisite earrings feature a graceful floral design, meticulously handcrafted with prong-set diamonds and colored sapphires. The design cascades down from a floral motif at the top to a cluster of pearls, creating a sense of movement and brilliance. The openwork design showcases the intricate setting of each gemstone, enhancing its natural beauty. Features a modern aesthetic that still draws inspiration from traditional south indian floral motifs.",
  "colors": [
    "Rose Gold",
    "White Diamonds",
    "Pink Sapphires",
    "Yellow Sapphires",
    "Grey Sapphires",
    "Blue and White South Sea Pearls."
  ],
  "occasions": [
    "Perfect for special occasions",
    "wedding receptions",
    "sangeet ceremonies",
    "and cocktail parties. These earrings are also suitable for modern celebrations and cultural gatherings."
  ],
  "description": "These stunning Jhumka earrings are a unique blend of traditional elegance and contemporary style. The dazzling combination of rose gold, diamonds, and colored sapphires creates a truly eye-catching piece. The South Sea Pearl adds a touch of classic luxury. Exquisitely crafted by our skilled artisans, this piece will become a cherished heirloom.",
  "tags": [
    "Earrings",
    "Jhumka",
    "చెవి దిద్దులు",
    "Diamond Earrings",
    "South Sea Pearls",
    "Moti",
    "Rose Gold",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Modern Jewelry",
    "Wedding Jewelry",
    "Cocktail Jewelry",
    "Fancy Sapphires",
    "Floral Design"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-16-34-44_2264",
  "collection": "sjpl"
}