{
  "id": "necklaces-1059",
  "title": "Vaishnavi Polki and Emerald Guttapusalu Choker Set",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold",
    "Uncut Polki Diamonds (approx. 3.5 carats",
    "GH Clarity)",
    "Natural Zambian Emeralds (oval cabochon cut",
    "AAA Grade)",
    "Cultured Freshwater Pearls. Features signature Hyderabadi Polish for enhanced luster."
  ],
  "features": "This exquisite choker set showcases the timeless Guttapusalu design, a cherished South Indian tradition. The choker features five strands of lustrous pearls, interspersed with Emerald and Polki Diamond encrusted floral motifs. The central pendant and matching earrings boast intricate Polki settings bordered by vibrant green emeralds and cascading pearl 'gutta' (clusters) for a regal touch. Handmade with Nakshi work detailing on the gold settings.",
  "colors": [
    "Gold",
    "Emerald Green",
    "White (Pearls)",
    "Clear (Polki Diamonds)"
  ],
  "occasions": [
    "Ideal for weddings (Vivahaalu)",
    "Seemantham",
    "half-saree function (Langa Voni Function)",
    "anniversaries",
    "and other grand celebrations where you wish to make a statement with traditional elegance. Can also be styled for high-end cultural events or contemporary gatherings."
  ],
  "description": "A rare blend of heritage and craftsmanship, this Guttapusalu Choker Set is a true investment piece. The uncut Polki diamonds exude a timeless charm, while the Zambian emeralds add a vibrant pop of color. The Hyderabadi polish ensures lasting shine and durability. This set holds significant cultural value and is a cherished heirloom to be passed down through generations. The adjustable length allows for comfortable wear and versatility.",
  "tags": [
    "Guttapusalu",
    "Haram",
    "Choker",
    "Polki Diamond",
    "Emerald",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Hyderabadi Jewelry",
    "Pearl Necklace",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Traditional Jewelry",
    "Ethnic Jewelry",
    "Indian Jewelry",
    "Nakshi Work",
    "Vivahaalu",
    "Seemantham",
    "Langa Voni",
    "Uncut Diamonds",
    "22K Gold",
    "Jewellery",
    "Ornaments",
    "Accessories",
    "Heirloom"
  ],
  "original_id": "radhe_diam_DPNK8-1450_2472",
  "collection": "radhe"
}