{
  "id": "bangles-141",
  "title": "Emerald Blossom Vanki Bangle - Signature Collection",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "Faceted Emerald (approx. 1ct)",
    "High-Quality CZ Diamonds (American Diamonds)."
  ],
  "features": "Intricately handcrafted openwork filigree design inspired by nature, featuring floral motifs and delicate vine patterns. Central focal point is a vibrant emerald cabochon surrounded by a halo of sparkling CZ diamonds. The Vanki design is a traditional South Indian bangle style known for its unique curved shape, symbolizing prosperity and good fortune. Exceptional attention to detail in the setting and finishing.",
  "colors": [
    "Warm golden hue of the 22K gold",
    "vibrant green of the emerald",
    "and brilliant white sparkle of the CZ diamonds. A classic and timeless color combination."
  ],
  "occasions": [
    "Perfect for weddings (vivaham)",
    "engagements",
    "festivals (like Ugadi",
    "Diwali",
    "Sankranti)",
    "anniversaries",
    "and special celebrations. Can also be worn as a statement piece for upscale social gatherings and formal events."
  ],
  "description": "A unique blend of traditional South Indian design and modern elegance. The Vanki style is a cherished heirloom piece, and this design incorporates contemporary styling for a timeless appeal. The high-quality craftsmanship ensures durability and lasting beauty. The vibrant emerald and sparkling CZ diamonds create a captivating sparkle. This is a statement piece that reflects both cultural heritage and refined taste. The Hyderabadi polish adds a touch of regal opulence.",
  "tags": [
    "Vanki",
    "Bangle",
    "Kada",
    "Emerald",
    "CZ Diamond",
    "Gold Jewelry",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Filigree",
    "Floral Design",
    "Statement Jewelry",
    "వంకీ",
    "కడా",
    "పచ్చ",
    "బంగారు ఆభరణాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0409_0606",
  "collection": "diamond"
}