{
  "id": "bangles-128",
  "title": "Rajasi Bangle: Ruby and Diamond Floral Vaanki",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Yellow Gold with Hyderabadi Polish. Features a square-cut Ruby of approximately 2 carats and brilliant-cut Diamonds totaling approximately 1.5 carats. Diamonds are of VS clarity and G-H color."
  ],
  "features": "This meticulously crafted vaanki features an intricate, floral-inspired openwork design. The central focus is a vibrant square-cut ruby, framed by a halo of sparkling diamonds in a pave setting. The gold framework exhibits delicate filigree details, showcasing exceptional craftsmanship unique to Hyderabadi jewelry. The openwork allows light to enhance the brilliance of the gemstones.",
  "colors": [
    "The primary color scheme is a rich",
    "warm yellow gold contrasted by the deep",
    "passionate red of the ruby and the dazzling white of the diamonds. This creates a captivating visual balance",
    "reminiscent of traditional South Indian jewelry color palettes."
  ],
  "occasions": [
    "Perfect for special occasions such as weddings (pellillu)",
    "engagements",
    "anniversary celebrations",
    "or significant cultural events. Also suitable as a striking statement piece for upscale parties and gatherings."
  ],
  "description": "A stunning fusion of tradition and modern elegance. This vaanki is handcrafted by skilled artisans in Hyderabad, known for their exceptional jewelry-making techniques. The high-quality ruby symbolizes love and passion, while the diamonds signify purity and commitment. This piece is not just jewelry, but a valuable heirloom to be cherished for generations. The Hyderabadi polish ensures a lasting luster and a rich, luxurious feel.",
  "tags": [
    "Bangle",
    "Vaanki",
    "Ruby",
    "Diamond",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Traditional Jewelry",
    "Wedding Jewelry",
    "Engagement Jewelry",
    "Pelli",
    "Jewellery",
    "Bridal",
    "Fine Jewellery"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0286_0483",
  "collection": "diamond"
}