{
  "id": "necklaces-1572",
  "title": "Regal Tanzanite and Diamond Haaram - A Timeless Treasure",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "Crafted in 18KT White Gold",
    "this haaram features meticulously set diamonds with a total weight of 10.50 carats",
    "accompanied by two stunning",
    "cushion-cut Tanzanite gemstones totaling 42.82 carats. The diamonds exhibit exceptional brilliance and clarity."
  ],
  "features": "This contemporary take on the traditional Haaram features a cascading design with multiple tiers of dazzling diamonds. Two large, captivating Tanzanite stones serve as the focal points, creating a mesmerizing contrast of color and sparkle. The intricate diamond setting enhances the overall brilliance and creates a luxurious, statement piece.",
  "colors": [
    "The necklace showcases a striking color palette of icy white from the diamonds and deep blue-purple hues from the Tanzanite gemstones. This sophisticated combination exudes elegance and sophistication."
  ],
  "occasions": [
    "Perfect for grand occasions such as weddings",
    "receptions",
    "and high-profile events. This Haaram is also a stunning choice for milestone celebrations and special anniversaries. Make a bold statement and radiate regal charm at any formal gathering."
  ],
  "description": "This Tanzanite and Diamond Haaram is a true investment piece, combining timeless elegance with modern design. The exceptional quality of the diamonds and the rarity of the Tanzanite gemstones make this necklace a unique and valuable addition to any jewelry collection. Its versatility allows it to be worn with both traditional and contemporary attire.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Tanzanite Jewelry",
    "18KT Gold",
    "White Gold",
    "Statement Necklace",
    "Bridal Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Hyderabad Jewelry",
    "Wedding Necklace",
    "Modern Haaram",
    "Diamond Jewellery",
    "Tanzanite Haaram"
  ],
  "original_id": "sjpl_PHOTO-2024-06-01-18-01-42-1_2277",
  "collection": "sjpl"
}