{
  "id": "necklaces-341",
  "title": "Apsara Kundan Haaram Set with Jhumka Earrings",
  "category": "necklaces",
  "original_type": "Necklace & Earrings Set",
  "materials": [
    "22K Gold Plating",
    "High-Quality Kundan Stones (Mirrored Polki Equivalent)",
    "Ruby Simulants",
    "Emerald Simulants",
    "Cultured Pearls. Features a lustrous Hyderabadi Polish."
  ],
  "features": "Exquisitely handcrafted Kundan Haaram featuring an intricate floral design with layered motifs. The pendant showcases a central emerald stimulant surrounded by a halo of Kundan stones. Dangles of ruby stimulants and pearls add a touch of traditional charm. Complementary temple style Jhumka earrings echo the necklace's design, featuring a ruby stimulant accent and a pearl drop. Intricate filigree work enhances the antique finish.",
  "colors": [
    "Primarily gold with white Kundan accents. Emerald green and ruby red offer a vibrant contrast",
    "complemented by the soft luster of pearls."
  ],
  "occasions": [
    "Perfect for weddings (Vivaha)",
    "engagements (Nischitartham)",
    "festive occasions like Diwali (Deepavali) and Sankranthi (Makara Sankranti)",
    "and grand celebrations. Also suitable for upscale parties and events where a statement piece is desired."
  ],
  "description": "This Apsara Kundan Haaram set embodies the opulence and artistry of traditional South Indian jewelry. The high-quality Kundan stones offer the brilliance of Polki diamonds at an accessible price point. The Hyderabadi Polish ensures a lasting shine and a luxurious feel. A timeless design that blends seamlessly with both traditional and contemporary attire, making it a treasured heirloom.",
  "tags": [
    "Kundan Haaram",
    "Temple Jewelry",
    "Jhumka Earrings",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "Pearl Necklace",
    "Ruby",
    "Emerald",
    "Traditional Jewelry",
    "Vivaha",
    "Nischitartham",
    "Deepavali",
    "Makara Sankranti",
    "Kundan Set",
    "Gold Plated",
    "Ethnic Jewelry",
    "Party Wear"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0455_0637",
  "collection": "diamond"
}