{
  "id": "necklaces-474",
  "title": "Emerald & Ruby Grandeur: Royal Nakshi Haaram",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "22K Gold",
    "fine quality Rubies (3.64ct) and Emeralds (3.52ct) with dazzling white stones. Meticulously crafted with the renowned Hyderabadi Polish for a lasting brilliance. Locket has Ruby (2.48ct) and Emerald (1.56ct)."
  ],
  "features": "This exquisite Haaram showcases intricate Nakshi work, featuring delicate floral and geometric patterns that exude timeless elegance. The elaborate pendant is a masterpiece, adorned with teardrop Emeralds and surrounded by brilliant white stones. A cascading arrangement of smaller pendants enhances the overall grandeur.",
  "colors": [
    "Rich gold with the vibrant contrast of deep green Emeralds and radiant red Rubies",
    "complemented by the shimmering white stones."
  ],
  "occasions": [
    "Perfect for weddings (Vivahaalu",
    "వివాహాలు)",
    "engagements (Nischitartham",
    "నిశ్చితార్థం)",
    "grand celebrations (Pedda Pandugalu",
    "పెద్ద పండుగలు)",
    "and milestone events like Seemantham (సీమంతం) or Half-Saree functions (Langa Voni Function",
    "లంగా ఓణీ వేడుక). Also ideal for adding a touch of traditional opulence to modern formal wear."
  ],
  "description": "This Haaram is a testament to our rich South Indian heritage and exceptional craftsmanship. The use of high-quality Rubies and Emeralds ensures enduring value and timeless appeal. The Nakshi work adds a unique touch of artistry, making this piece a treasured heirloom to be passed down through generations. Experience the allure of royalty with this breathtaking necklace.",
  "tags": [
    "Haaram",
    "Kandaharam",
    "Nakshi",
    "Ruby",
    "Emerald",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Hyderabadi Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Vivahaalu",
    "Nischitartham",
    "Seemantham",
    "Langa Voni Function",
    "22K Gold",
    "Temple Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2023-11-21-15-58-56_0937",
  "collection": "diamond"
}