{
  "id": "necklaces-020",
  "title": "Chandrika Floral Diamond Bridal Set - Contemporary Vaddanam Design",
  "category": "necklaces",
  "original_type": "Necklace and Earrings Set",
  "materials": [
    "18K Rose and White Gold. Features meticulously set Cubic Zirconia (CZ) stones. Hyderabadi polish applied for lasting luster and exceptional shine."
  ],
  "features": "A contemporary take on the traditional Vaddanam design. The necklace boasts an intricate floral motif at the center, flanked by symmetrical rows of detailed pendants. The design incorporates a blend of straight lines and curves, showcasing impeccable craftsmanship. The Jhumka earrings mirror the floral design of the necklace, creating a harmonious and balanced look. Features an elongated teardrop pendant design on the necklace.",
  "colors": [
    "Rose Gold and White Gold with clear sparkling Cubic Zirconia (CZ) stones."
  ],
  "occasions": [
    "Perfect for bridal wear (Pelli)",
    "engagement ceremonies",
    "grand receptions",
    "and other special occasions where you want to make a statement. Also suitable for modern celebrations and parties."
  ],
  "description": "This Chandrika Floral Diamond Bridal Set offers a unique blend of traditional South Indian design and modern aesthetics. The meticulous craftsmanship and high-quality CZ stones create a luxurious look without compromising on affordability. The Hyderabadi polish ensures lasting shine and durability, making it a valuable addition to your jewelry collection. Its lightweight design ensures comfortable wear throughout long events.",
  "tags": [
    "Bridal Jewelry",
    "Haaram",
    "Vaddanam",
    "Necklace Set",
    "Earrings",
    "Jhumka",
    "South Indian Jewelry",
    "Temple Jewelry",
    "Wedding Jewelry",
    "Pelli",
    "Hyderabadi Jewelry",
    "Cubic Zirconia",
    "CZ Jewelry",
    "Rose Gold",
    "White Gold",
    "Floral Design",
    "Engagement",
    "Reception",
    "Contemporary Jewelry"
  ],
  "original_id": "choker_diamonds_open-close_IMG-20241125-WA0026_0055",
  "collection": "choker"
}