{
  "id": "necklaces-297",
  "title": "Manoharam Moggu Haaram Set - Exquisite Emerald & Diamond Necklace with Jhumka Earrings",
  "category": "necklaces",
  "original_type": "Necklace Set",
  "materials": [
    "22K Gold (సువర్ణము) with Hyderabadi Polish for enduring luster. Features meticulously selected Emeralds (పచ్చలు) of exceptional green hue and brilliant-cut Diamonds (వజ్రాలు) of VS clarity. The Jhumka earring is finished with a South Sea Pearl."
  ],
  "features": "A stunning Moggu Haaram, meticulously handcrafted using traditional Nakshi work techniques. The floral motifs are embellished with Emeralds and Diamonds, arranged in a cascading design. The intricate setting maximizes the brilliance of each gemstone. Matching Jhumka earrings complement the Haaram, featuring a delicate bell shape.",
  "colors": [
    "Classic combination of Gold (బంగారు) with vibrant Green Emeralds and sparkling White Diamonds",
    "accented by the subtle red of the rubies on the floral design. The South Sea pearl earring gives off a soft white color."
  ],
  "occasions": [
    "Perfect for weddings (వివాహము)",
    "engagements (నిశ్చితార్థం)",
    "and other auspicious occasions (శుభకార్యాలు). Ideal for Muhurtham",
    "Seemantham",
    "Half-Saree Function (Langa Voni Function)",
    "or any event where you want to showcase timeless elegance."
  ],
  "description": "This Moggu Haaram set is a testament to South Indian heritage and craftsmanship. The combination of Emeralds and Diamonds signifies prosperity and longevity. The Hyderabadi Polish ensures lasting shine. A timeless investment piece that can be passed down through generations (తరతరాలుగా వచ్చే ఆస్తి).",
  "tags": [
    "Haaram",
    "Moggu Haaram",
    "Necklace Set",
    "Jhumka Earrings",
    "Emeralds",
    "Diamonds",
    "22K Gold",
    "South Indian Jewelry",
    "Traditional Jewelry",
    "Indian Wedding",
    "Hyderabadi Jewelry",
    "Nakshi Work",
    "Bridal Jewelry",
    "కంఠాభరణం",
    "చెవిపోగులు",
    "పచ్చలు",
    "వజ్రాలు",
    "బంగారు",
    "వివాహము",
    "శుభకార్యాలు"
  ],
  "original_id": "diamond_jewellery_IMG-20241113-WA0386_0583",
  "collection": "diamond"
}