{
  "id": "necklaces-1223",
  "title": "Emerald Radiance Diamond Haaram: A Modern Take on Timeless Telugu Elegance",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Gold (835 Hallmark)",
    "Brilliant Cut Diamonds (VS Clarity",
    "G-H Color)",
    "Natural Emeralds (Estimated 5.7 ct total weight). Features a high-luster Hyderabadi Polish."
  ],
  "features": "This exquisite Haaram seamlessly blends traditional design with modern aesthetics. The necklace showcases a geometric diamond pattern, reminiscent of 'Lakshmi Kasu Mala' motifs, leading to a central floral pendant adorned with emeralds. Fine filigree detailing and delicate gold bead dangles (gundla) add a touch of South Indian charm. The pendant design incorporates intricate openwork showcasing traditional craftsmanship.",
  "colors": [
    "Predominantly gold and sparkling white diamonds",
    "with vibrant green emerald accents. The contrast creates a captivating visual appeal."
  ],
  "occasions": [
    "Perfect for weddings (vivaham/పెళ్ళి)",
    "receptions",
    "sangeet ceremonies",
    "and high-end social gatherings. A statement piece ideal for muhurtham or an upscale cocktail event."
  ],
  "description": "A unique fusion of classic and contemporary design, this Haaram represents the pinnacle of Hyderabadi craftsmanship. The brilliant diamonds and rich emeralds create a luxurious and eye-catching piece. Its enduring value and striking beauty make it a treasured heirloom. Handcrafted by skilled artisans.",
  "tags": [
    "Haaram",
    "Diamond Necklace",
    "Emerald Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Wedding Necklace",
    "Bridal Jewelry",
    "Hyderabadi Jewelry",
    "कंठाभरणं",
    "హారం",
    "పెళ్లి నగలు",
    "Diamond Haaram",
    "Gundla Mala",
    "Geometric Diamond",
    "Statement Necklace",
    "Emerald Pendant",
    "Indian Wedding Jewelry",
    "Nakshi Design inspired"
  ],
  "original_id": "sjpl_PHOTO-2023-11-21-15-58-54 2_1797",
  "collection": "sjpl"
}