{
  "id": "earrings-474",
  "title": "Celestial Drops: Rose Quartz and Tanzanite Kundan Jhumkas",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "22K Gold (916 Gold)",
    "Natural Rose Quartz (untreated",
    "translucent)",
    "Pear-shaped Tanzanite (VVS clarity",
    "vivid blue-violet hue)",
    "High-quality Kundan stones (clear",
    "excellent luster). Features the exquisite Hyderabadi polish for a lasting sheen."
  ],
  "features": "These elegant Jhumkas feature a traditional Kundan setting around both the rose quartz and tanzanite stones. The upper portion showcases a beautifully cut square rose quartz encased within a floral-inspired Kundan frame. The lower pendant features a striking pear-shaped Tanzanite, also meticulously set with Kundan, reminiscent of delicate 'jali' work found in Mughal architecture, a signature of Hyderabadi craftsmanship. This creates an airy, captivating design.",
  "colors": [
    "Primarily gold with delicate pink from the rose quartz",
    "and a captivating blue-violet from the tanzanite. The clear Kundan stones add a sparkling contrast."
  ],
  "occasions": [
    "Perfect for modern celebrations",
    "cocktail parties",
    "engagements",
    "or as a sophisticated addition to traditional Indian attire for events like sangeet",
    "Diwali",
    "or weddings. Also suitable for a half-saree function (Langa Voni Utsavam)."
  ],
  "description": "These Jhumkas seamlessly blend traditional Kundan craftsmanship with a contemporary design aesthetic. The use of rare tanzanite and untreated rose quartz provides a unique and valuable touch. The Hyderabadi polish ensures long-lasting luster. These earrings offer a distinctive statement of elegance and sophistication, reflecting the rich cultural heritage of Hyderabad.",
  "tags": [
    "Jhumka",
    "Earrings",
    "Kundan",
    "Rose Quartz",
    "Tanzanite",
    "22K Gold",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Contemporary Jewelry",
    "Indian Earrings",
    "Telugu Jewelry",
    "చెవి దిద్దులు",
    "కుందన్ జుమ్కా",
    "Hyderabad Polish",
    "Gemstone Earrings"
  ],
  "original_id": "ear_rings_DPER8-1350_2595",
  "collection": "ear"
}