{
  "id": "earrings-335",
  "title": "Blossom Drop Jhumka - A Modern Take on Traditional Elegance",
  "category": "earrings",
  "original_type": "Earrings",
  "materials": [
    "Finely crafted with 22K Gold plating",
    "shimmering Cubic Zirconia (CZ) stones",
    "Blue Manya Cabochon",
    "and Blue Carve gemstones. Features a high-luster Hyderabadi polish for a lasting shine. The frame is constructed from hypoallergenic alloy."
  ],
  "features": "These jhumkas beautifully blend contemporary design with classic floral motifs. A graceful crescent, embellished with shimmering CZs, arches above a vibrant floral burst of pink stones, culminating in a serene blue cabochon drop. The delicate leaf accents add a touch of nature's elegance. The design is intended to have the color pink in the middle, and blue on top and bottom, a modern twist from traditional designs.",
  "colors": [
    "The color palette features a rich gold setting",
    "dazzling white Cubic Zirconia",
    "soft pink gemstone petals",
    "and serene blue cabochons",
    "creating a harmonious and eye-catching contrast."
  ],
  "occasions": [
    "Perfect for a variety of celebrations",
    "from traditional Telugu occasions like Seemantham (శ్రీమంతం) and half-saree functions to modern parties and festive gatherings. Equally suited for adding a touch of glamour to everyday wear."
  ],
  "description": "These Blossom Drop Jhumkas are a testament to exquisite craftsmanship and modern design sensibility. The combination of vibrant colors, high-quality materials, and meticulous detailing makes them a standout piece. Lightweight and comfortable to wear, they offer a perfect blend of style and tradition, enhancing your look with a touch of modern elegance. It is a unique statement piece.",
  "tags": [
    "Jhumka",
    "Earrings",
    "చెవి దుద్దులు",
    "Gold Plated",
    "Cubic Zirconia",
    "CZ",
    "Blue Cabochon",
    "Pink Gemstone",
    "Floral Design",
    "Hyderabadi Jewelry",
    "Indian Jewelry",
    "South Indian Jewelry",
    "Telugu Jewelry",
    "Modern Jhumka",
    "Statement Earrings",
    "Festive Jewelry",
    "Party Wear",
    "Fashion Jewelry",
    "Womens Jewelry"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-06-01-16-34-40 3_1375",
  "collection": "diamond"
}