{
  "id": "necklaces-687",
  "title": "Rajitha Ruby Cascade Necklace - A Timeless Statement",
  "category": "necklaces",
  "original_type": "Necklace",
  "materials": [
    "18K Rose Gold with Diamond Accents; Central Ruby of exceptional clarity; Teardrop Rubies with prong setting. Hyderabadi Polish for a lasting lustre."
  ],
  "features": "This modern take on the classic Haaram features a delicate chain of interlocking teardrop links interspersed with dazzling diamonds. The pendant showcases an exquisite central ruby, framed by a detailed filigree design and further embellished with sparkling diamonds. Three gracefully dangling teardrop rubies complete this stunning piece, adding movement and allure. The pendant's floral-inspired design incorporates subtle nakshi elements, blending tradition with contemporary aesthetics.",
  "colors": [
    "Rose Gold",
    "Deep Red Ruby",
    "and Sparkling White Diamonds. A regal color combination symbolizing love",
    "passion",
    "and purity."
  ],
  "occasions": [
    "Perfect for special occasions like engagements",
    "anniversaries",
    "cocktail parties",
    "and upscale gatherings. Its elegant design also makes it suitable for a modern bride during her reception or sangeet."
  ],
  "description": "This Rajitha Ruby Cascade Necklace seamlessly blends traditional South Indian artistry with contemporary design. The exquisite rubies are of the highest quality, radiating a captivating glow. The durable 18K rose gold and meticulous craftsmanship ensure that this piece will be treasured for generations. Its unique design makes it a standout statement piece, perfect for the modern woman who appreciates timeless elegance.",
  "tags": [
    "Necklace",
    "Haaram",
    "Ruby",
    "Diamond",
    "Rose Gold",
    "Hyderabadi Jewelry",
    "Contemporary",
    "South Indian Jewelry",
    "Indian Jewelry",
    "Bridal Jewelry",
    "Party Wear",
    "Fine Jewelry",
    "Rajitha",
    "Filigree",
    "Teardrop",
    "Telugu",
    "Jewellery"
  ],
  "original_id": "diamond_jewellery_PHOTO-2024-05-18-12-40-49_1193",
  "collection": "diamond"
}