{
  "id": "bangles-082",
  "title": "Emerald Splendor: Kundan Inspired Bangle",
  "category": "bangles",
  "original_type": "Bangle",
  "materials": [
    "22K Gold (916 Gold) with Hyderabadi Polish",
    "featuring a central Emerald of exceptional clarity and brilliance. Accented with high-quality Cubic Zirconia (CZ) stones."
  ],
  "features": "This exquisite bangle blends traditional Kundan craftsmanship with a modern aesthetic. The openwork design showcases intricate filigree work reminiscent of traditional South Indian jewelry. The central emerald is meticulously set within a framework of sparkling CZ stones. The bangle's design draws inspiration from both Hyderabad's royal heritage and classic South Indian motifs.",
  "colors": [
    "The warm yellow of the 22K gold complements the vibrant green of the emerald and the dazzling white of the CZ stones",
    "creating a rich and luxurious color palette."
  ],
  "occasions": [
    "Perfect for weddings",
    "engagement parties",
    "receptions",
    "or any special occasion where you want to make a statement. Also suitable for modern events and adding a touch of elegance to your everyday attire."
  ],
  "description": "This bangle is a masterpiece of craftsmanship, blending traditional techniques with a contemporary design. The high-quality materials and meticulous detailing ensure lasting beauty and value. The emerald, a symbol of prosperity and good fortune, adds a touch of auspiciousness to this already stunning piece. Its lightweight design makes it comfortable to wear for extended periods.",
  "tags": [
    "Bangle",
    "Kangan",
    "Emerald",
    "Paccha",
    "Kundan",
    "Gold",
    "22K",
    "CZ",
    "Cubic Zirconia",
    "Hyderabadi Jewelry",
    "South Indian Jewelry",
    "Wedding Jewelry",
    "Engagement",
    "Statement Jewelry",
    "Telugu Jewelry",
    "Traditiona"
  ],
  "original_id": "bracelets_diamond_open-close_IMG-20241113-WA0277_0010",
  "collection": "bracelets"
}